{
"document":{
"type":"PLAIN_TEXT",
"language": "EN",
"content":"energetic environment, start up vibeone of the first 'internet' companies because of its BBN historyno sure how it has changed over the years; company was being considered for an acquisition when I left Cisco is a good place to work.  I recommend it for employees looking for a big company.  There are many roles with growth opportunities .     The headquarters are San Jose. Intense, at times rewarding, sometimes challenging. Many opportunities to learn, to personally grow. Sometimes too much politics. A lot depends on your manager Typical day to day work is interesting, fast paced and uses the newest technologies. Trainings are available for most very frequently and in the hot areas of career development. Management should listen and take input from the engineers more in making technological decisions. Too many technological decisions are made from the top echelon, leading to lower team moral and low employee empowerment. Workplace culture is great with great co-workers and team building activities. The hardest part of the job is getting a grasp for the long term vision for the business and technology from the executives and architects. I enjoy working with my team and making impacts in the broader teams to drive efficiency in delivering features and services. great work life balance, great benefits.Worked with some of the best managers.Scope for growth is more.Has a very good day for parents with young children LR every quarter or six months. Absolutely no job security. Employees are really good. Good benefits, and work life balance. Almost everybody at Cisco has been affected by LR Cisco does have a mission, and sometimes that over-rides quality and personnel, However, they are successful.  Cisco can be very political and elimination of great people can be eliminated based on overall direction view point. Its a good place to have your career, you can make it what you want  Technology is evolving at faster paces.  Cisco is doing a good job to stay relevant Great working environment with a lot of autonomy and tools. Great online employee tools and good working relationships with managers. Whole divisions are sold off and a political mad scramble ensues. Still liked it though. Forward thinking company, generous to employees, nice office, open collaboration configuration, play room, employee services are great, opportunity to work on interesting projects. Great Work was reflected with your paycheck. The job was super easy. I worked straight through my break to maximize my earning potential. I was able to earn enough in 2 weeks to pay ALL of my bills including my car note. Love the job and the culture at Cisco.  Ability to collaborate with anyone and everyone and learn and grow in your role.  There are always opportunities to grow within the company.  Work-life balance is really an important part of working there.  Work is challenging and demanding but all the tools to succeed are available for you including in-house education and training as well as tuition benefits for school advancement. Overall great place to work. Culture is good people are pleasant and management doesn't bother you. I think they acquired to much so a 'restructure' was needed but a poor review of my position leaves my former team in some hardship. Wish management coordinated things better and we weren't all brought to a large area and told we didn't have jobs. Cisco offers great career opportunities in the technology field. For the most part I enjoyed working at Cisco. It's a huge company and a lot of layers to work through. I worked there for just over 2 years as a contractor and I loved it. The pay was great and the team treated me like I was one of their own even though I was a contractor. The atmosphere is fast-paced and can be crazy, but the overall company culture is relaxed and completely about the employees. They value everyone - from bottom to top, contractor or employee. Overall, the two summers I spent interning here were very useful (although the first more than the second). I learned how to work in a team and the process of delivering a product in IT. Everyone there is very nice although some people don't buy into the culture of the company. Cisco tries to be a cutting edge company even but its roots lie in the building blocks of modern tech companies. Very diverse culturally which allows for people to be themselves.  There is a lot of moving parts that make up the whole so it is fast paced in keeping up with all the many training, professional groups, and activities.  The hardest part of the job is that it is very intense in that as an Engineer you will not know everything.  Customers figure out a way to creatively turn up circuits and use equipment so you have to be comfortable with probing and asking questions. I loved working at Cisco. My job was great and my managers were awesome. During my internship they required me to get my CCNP certification to secure my future employment, and I realized it wasn't the job for me and that I wanted stay within business management and human resources. Good place if you want to start your career. Management is not that great. Funding is usually challenge. Constant pressure on job security. Promotions are tough. There are many of great people developed amazing tools which is helping to grow business in a fast phase . add something new learn even  in small thing in day that helps to grow personally As an industry leader Cisco is always looking ahead to 'catch the next wave'.  Consequently, there can be a lot of change and associated stress.  However, I loved my 20+ years with Cisco.  I got to do a lot of different things and loved the 'empowered' work culture. Cisco really takes care of their people! energetic environment, start up vibeone of the first 'internet' companies because of its BBN historyno sure how it has changed over the years; company was being considered for an acquisition when I left Learned a lot about the workplace an environment. Helped me understand the need to meet the deadlines. But received a lot of assistance from the manager and colleagues which helped me to learn a lot. Good place if you want to start your career. Management is not that great. Funding is usually challenge. Constant pressure on job security. Promotions are tough Cisco always has projects that allow engineers to learn new skills. The problem is that teams work on silos without that much cooperation and sometimes the learning is not shared. * Typical day at works depends on your position.  Some areas are heavily watched and others are given autonomy to deliver on their goals. * Management is often due to people who are good at a job and promoted, however, people skills are needed, and the process to promote a 'people leader,' does not align. Most managers are overloaded with tasks and do not have the adequate time to manage people. *Culture varies from business unit to business unit. *Hardest part of program management, was lack of senior level management support, and the program belongs in the security business unit. *Hardest part about sales was the amount of travel, and lack of work life balance (self-induced). Reach your quota and goals, but don't sacrifice your health or well-being to do so. Cisco places an emphasis on doing the right thing. I go into more detail on my linked in blog!https://www.linkedin.com/pulse/ciscos-secret-sauce-eliza-rowe/ Was able to balance work and personal time as I was a remote worker.  Had co worker globally which required me to adjust my time to schedule meetings. Excellent work conditions,  excellent for career development.  Fliexible work condition, flex time, and provides many employee services and work-life balance. Work-life balance, nice people, paid to give back to the community. Great benefits for healthcare, clean and new gym. Overall I enjoyed my time at Cisco. I think Cisco's best days are behind it; you can't miss as many massive market transitions as they did and not be adversely impacted.The 800lb gorilla in the networking space missed visualization and The Cloud - VMware, AWS, Azure and GCP would never have even stood a chance if Cisco Execs had listened to their customers instead of trying to dictate to them! With a good manager, one can go far at Cisco.  Without a good manager, one may languish in their current position and be overlooked for possible opportunities. Was acceptable to job movement.  May different training and growth opportunities. ONce you were ' profiled' you were only considered for certain types of work. It was a good Job to gain good experience. Unfortunately the contract position with no benefits, employment uncertainty and Long shifts with my situation and a new baby at home this was not a great fit for my situation. Depending on what department you work as a contract consultant, the culture can be upbeat and wonderful vs. just another working pool.  Some have superb leadership while others have lackluster leadership.  Cisco is inconsistent and for contractors, they pay VERY POORLY.  Lowest rates always. They have been offering the same rate for the same job for about eight years and always claim they don't have the budget for more.  Not ethical, nor competitive. Good company to work for, work/life balance is difficult.  Email constantly comes in, everyone needs a slice of what you do.  Seems like we need 3 times as many people.  Travel can be a lot at times.  Can be very stressful. A typical day at work is attending meetings, managing open end projects and keeping everyone in the loop of what's coming. Having the ability to think on your own is a plus.  Being able to work independently yet with a team of individuals who enjoy doing what they do is a plus. the most enjoyable part of the job was helping customers resolve issues, the hardest part of the job was the open work space, several different departments within the area that could get loud. Every team is different but in my team we provide autonomy in terms of projects you want to work on and skills you want to develop without micromanaging. Cisco has nailed the work life balance like no other company I've worked at thus far. The diverse workforce at Cisco is amazing.  An improvement in more permanent hires and less management services/contractors would be a major plus for the company.  The anthropic initiatives are impressive. People and culture were the best.  Work/Life balance was non-existent.  Seemed to work 24/7 until you can get your duties in order and have a back up plan in place. Cisco is undergoing a significant change and transformation.   Current leadership is changing too much and the staff is scared and no one is truly trying to make changes because no one wants to stand out.   People that take risks are not rewarded, and in fact, if the risk is a failure they are fired. A typical day starts from home, checking email and making some calls.  then heading into work, do my job, go to lunch at the cafeteria, continue my work, ,mostly meetings, I was an Exec at Cisco.  Leaders do not lead by example:  they say what leadership is about but do not practice what they preach. energetic environment, start up vibeone of the first 'internet' companies because of its BBN historyno sure how it has changed over the years; company was being considered for an acquisition when I left TAC was always a challenge and they worked so well together it was truly a pleasure to come to work each day! I really enjoyed working with so many talented engineers and learning so much from each of them. I really wish they had not shut down the Houston TAC and moved it to India. I was an employee at Cisco for over 10 years. Throughout that time, I had many opportunities for growth - including travel, training, mentorship, etc. I also had a wonderful group of managers who were always eager to help me with my development and position me for the next promotion. Fun culture, devoted management. Easy place to work.... Never had a bad day at the office. Loved my co-workers, my peers and my superiors. Easily the best place to work! A typical days work is as follows:1. 15minutes to 30 minutes of meetings2. 4-5 hours of modeling work3. about 30 minutes to 1 hours discussing forecasts Excellent work environment. All kinds of fun activities. Soccer Field, Volleyball, Basketball, Gym, Ping Pong Tables, just to name few. The cafeteria is awesome! Excellent food. When I started Cisco most managers were once engineers, which provided a respect between management and employees. As time went on, there were fewer management jobs for engineers and location requirements made it difficult to move around in the company for someone with roots in your community. Newer management had come from a non-technical background, which started an increasing divide between management and employees.If you accept Cisco as it is today, not as it was 10 years ago. As long as you don't remain nostalgic and are ok with the typical corporate atmosphere, then Cisco is a good place to get a start in some technologies. FYI, some of Cisco has remote jobs, which was very helpful in work-life balance. Cisco is top-notch in every category. They take care of their employees and have great perks. Remote working policy is great. There are brilliant people in every organization. The company is very well run and there are loads of opportunities to learn and advance your career. Compensation was good, but you never new if you would survive the next layoff. Good benefits, good bonus and stock grants, but subject to your managers politics. Cisco was my first company I work for in USA and it has introduced me to US job ethics properly. I had really good managers that helped me to establish a good work habits. I think Cisco Systems was a casual schedule and work environment. I'd manage software installations and design environment setup for engineers. I learned JSON and prototyping dashboards for monitoring LSF and server VM's. The culture was pretty laid back. We had lots of meetings online so that the job itself was not interrupted. The hardest part of work was trying to engage others about my projects. The most enjoyable was the laid back atmosphere and the nice people at Cisco! Key objectives include developing enterprise architecture to support business and processes by providing fundamental technology and process structure for an IT strategy. Truly Executed Cisco Advance Services Life Cycle approach to Design, implement, Test and Optimize the Next Generation Data center. Lots of on job learning opportunities. Gives you lot of resources to train yourself on new skills.The management keeps changing every 6 months so you have to adopt to new managers way of working. Enjoyed the company,only discrepancy was the lack of career growth and management skills. The review is mandatory but i also did not have any cons until communication with management is regards to operation concerns. I had a good time there. I have really enjoyed the work culture and overall quality of team and work.  Worked on excitimg domain and learned new technologies. I was grateful for the job. The work was relatively easy and colleagues shared information easily. I didn't like being laid off as soon as I returned from sick leave. Cisco reminded me of a typical office job that you would see in any tv show or movie. High fenced cubicles and over-lit flourescent lights and people never talking to each other. Although I learned how to interact and learn basic business principles, this job didn't fit the culture I was looking for. Cisco is too big if you are looking to make a difference.   Perfect company for working remotely and work-life balance.   Frequent re-organizations, poor management Cisco  is the best place to work indeed!  It has a great workplace culture,and family environment.  Most of all, lots of great, smart and friendly people to work with.  Good Bonus $$$ too ... Thank you Cisco. Worked on a contract only to be laid off 5 months later.Many restrictions on the technology.Was not able to get an opportunity for growth or get hired on permanently. Great place to work, great professionals work there. The atmosphere and the management was great to work at. Great opportunities to expand and grow! Cisco hired me based on my background and has helped me expand that knowledge to make me more well rounded. The people in this company are top notch! I have nothing but good words for this company. energetic environment, start up vibeone of the first 'internet' companies because of its BBN historyno sure how it has changed over the years; company was being considered for an acquisition when I left Cisco is a good place to work at. Like any company in a Sales environment, it is fast paced. The culture is good but one will need to know how to navigate a 70k+ employee company. Good pay, a lot of giving back opportunities. Fun and healthy environment. Cisco has a great culture - we encourage our employees to be active in their communities and to volunteer, we have a strong team environment, and we are encouraged to innovate and take risks. We have great collaboration tools that allow many employees to work remotely and we do encourage work/life balance. I love my team, my peers and the future of Cisco as a leader in technology. Good work life balance and nice friendly environment with colleagues.Weak management with no vision which can easily put employees expendable every year when business unit isn't profitable They understood people needed a few minutes to relax during a long work day. The atmosphere was family oriented and since my family wanted to leave North Carolina and back to Florida I had no choice. I enjoyed  working for Cisco but was downsized due to acquisition from previous Employer.  Overall I feel that Cisco is an excellent Company to work, very stable Co. Worked for Cisco twice and was laid off twice. Don't think I will work for this company again. Management can make a huge difference in your team and how things work. High expectations and high reward; brand name carries great respect in all industries and allows access to key customer contacts for meetings.  Cisco has a broad range of excellent products and services. Worked for the company for almost 8 years, great experience; great people to work with, and more important: great leadership. Company embraces diversity, and has an open way of doing business. Really like to work with the team however it's hard to become a regular employee since the waiting period to be converted from contract to Cisco employee is so long.  The manager is nice, helpful whenever need help and he could speak up for the team as needed. Great company to work. Absolutely enjoyed working here.Very focused organization with some great vision.I appreciate the fact that the employees work in multiple time zonesand help Cisco to grow. If I wasn't a red badge employee (contractor) I would give Cisco 5 out of 5 stars. Their contracting partner undervalues/underpays their employees, Cisco doesn't. I love the challenges and the Cisco employees. As well as their products and customers. Cisco is a great place to work and provide opportunities to learn and advance.  Management and people are great to work with.  Benefits are very good. Greate place to work and gain experience, however the ever frequent layoff was very demoralizing.Worked as part of the CI team, developing end to system automation. Most development was done in python. It is a great and wonderful culture. An amazing work environment. There are exciting challenges presented and also opportunities for learning and growing. Great focus on execution. With the leadership change, the strategy is more clear now. However, too many org changes and too frequent disrupts career advancements of high performing employees. Lot of time wasted in re-aligning to new leaders, new strategies etc., Your job is always on the line, miss your quota for 1 quarter and you could be on the chopping block.You need to forecast your number almost every day.There is a good reason most people only last about 3 years, because the Cisco machine chews you up and spits you out. typical day is tracking the tasks for the project.  attending meetings with stakeholders answering emailsVery flexible work environment.Working with 5 ww sites can be challenging due to the time difference, especially when scheduling meetings.Over all most groups are great to work with and are very helpful. I loved Cisco and the people that I worked with and for.  Everybody is treated as a contributor.  Very upbeat working environment and they strives to make their employees happy. Cisco is too big and going through a massive transformation.  We'll see if they can do it.  There will be a some massive growing pains and I expect many layoffs will be coming to assist with the transformation. Because Cisco is such a large company spread out across the world, they were very open to remote work which really helps in balancing work with life. No traffic to go through. You can quickly do laundry during lunch, etc. energetic environment, start up vibeone of the first 'internet' companies because of its BBN historyno sure how it has changed over the years; company was being considered for an acquisition when I left Even being the same company, your experience may be very different depending on the organization you work for. In general good work/life balance but lately there have been too many reorgs and unfortunately are happening too often. Cisco is a great place to work. Typically the work atmosphere is congenial and pleasant. Some of the 'collaborative' work space layouts can be loud and distracting, but there are quiet spaces available, and many people have the option of working from home. A fun workplace. Lot of opportunity to learn many different technologies. With snacks everyday.  But no chance of converting to a full-time employee. When 18 months comes, I have to go. For the most part, the hardest part of the job has nothing to do with your performance.  It comes down to the bottom line of their finances which is most likely far removed from your every day. Cisco definitely provides valuable experience.  The only major downside is that it is quite political -- and your success depends largely on department. To land a consulting job at Cisco means a very good chance at eventually being hired full-time.  For folks who desire this, it is certainly an easy way to be earning well, learning about whether Cisco is the right place, and finding the best match within the company. Cisco is an industry leader - and it shows.  Culture is respectful, supportive and competitive.  Managers are mostly supportive, yet in many cases, due to many layers of management, difficult to make change and move with Agility.  Upper management changes too frequently and therefore makes it difficult to see improvement and positive results before the next change .  These comments relate to HR/  and not related to technical roles. Great company to work for. The communication between upper management and employees is great. Everyone at Cisco lends a helping hand. I have never worked for a more professional well rounded company than Cisco. Nice to Work in the company. My team is especially good but it depends on which team you are working. People around me are very good in what they do and are happy to help always. Ramping up new cloud based operations for captive companies.The organization didn't have the tools nor cohesion to pull off this new division.Great people on the team but many different agendas made day to day operation tough. Typical day is coding, testing and chasing down whom to contact to get something going; but then big systems are expected to be that.Hardest part is to figure where/who to get something done. I enjoyed my time at Cisco and currently have a little regret at leaving.  It is difficult for a company the size of Cisco to shift from being a hardware provider to revamping the entire business to be a software driven company. Typical IT sales organization; no unique culture. Obviously, they have very good products, but I would not want to work there again. Good experience to build resume. Many opportunities to learn new products and technologies.Good environments to expand soft skills and leadership .You are also encouraged to work outside your comfort zone. Highly experienced and motivated workforce, creates an environment of learning from others and improving capabilities.Competitive salaries and benefitsChallenging work assignments which also creates a great learning opportunity and a competitive environmentThere is a good sense of empowermentIt can be challenging with a somewhat political management dynamic Not interested in completing, I am not clear why you need this information in order to apply for position on this site. This is annoying and unnecessary. I was always challenged with new technologies changing constantly which allowed for continuous training and learning opportunities.  Encouraged to strive for success and was monetarily rewarded each year.  The option to work from home was extremely beneficial for my work productivity. I enjoyed my experience at Cisco very much.  I was part of a restructuring plan, but should the opportunity arise I would love to be back a part of Cisco.  It was one of the best employers in my career. Cisco is a wonderful company to work for, but every employee is literally “on” 24/7. Everyone works hard, plays hard and HR provides many opportunities for self development, fun collaborative events. Would work there again if given the opportunity. Cool environment with a stable process in place for all the business requirements. Workplace Culture is user friendly.Typical 8 hours work with flexible timings with work to be done concept. Hardest part of the job is that there is a process to be adhered for every issue that is involved. Most Enjoyable part of the job is that there is more employee friendly options in terms of load of work. energetic environment, start up vibeone of the first 'internet' companies because of its BBN historyno sure how it has changed over the years; company was being considered for an acquisition when I left Working for Cisco was a great experience of my life where  day to day work progress was excitingly achievable as well learning about futuristic design and developments on networking would always bring something new to learn. Working for Cisco is a good inbetween for contract workers. There are always temp projects going on and short term goals for departments. I enjoyed by temp time there but would never work there full time. I used Cisco equipment in one of my past jobs but I did not work for the Company. I actually got the Certifications while studying and in order to get a job as Network Engineer, but it was very difficult to get one without experience even though possessing the knowledge. Thus I started moving away from Network and focus on software which I like a lot. If I'd have the opportunity to work on Cisco a Software developer I would do it happily. it was a good experience that opened up further opportunities for me and helped me in my trajectory and future growth. interesting work, big company, different Middle management changes during critical time impacted much on the original company culture. Plus the industry sunset situation, it may not be the best company to work for any more. Great Place to work.  .awesome team and great work culture . Learned a great deal of Business Process. The team followed Agile methodology and implemented lot of new system process Duo Security is an amazing culture to be a part of.  Management is very focused on ensuring that your work contributes to iteh companies success.  Everyone has a voice here which is very exciting and unique. Productive,  Workplace, Helps build technical expertise. Work environment is extremely competitive with night and weekend work. Work ethics is low, not much of recognition for work. Good life/work balanceIntense environmentNot enough opportunity for advancement or cross-department movesFlexible workplacesUnfortunately, not too many opportunities for retraining toward moving to new positions The technical people with whom I worked were top quality. They were knowledgeable, skilled, hard-working and passionate about their work. However, their leadership people were poorly trained and often failed to communicate with other group leaders so that the work of the technical staff was uncoordinated and morale fell far below what could be achieved. They accept this situation as normal and seemed unmotivated to improve it. Great company. great time and great support. The processes and producedures are very effective. You learned to use both waterfall/agile, in-house, and other systems. Chambers was honest and cared about employees. Everyone knew the mission, strategy and plan. Not true at Cisco any longer. Now it is all about internal politics. Cisco cares about their employees and provides a substantial amount of PTO and flexibility to foster a great work/life balance. Compensation is good for the industry and work is challenging enough to provide for ongoing skill-set development. Cisco is a good place to work.  Smart, nice people, lots of flexibility, good work/life balance.  Opportunity to move to different roles and learn new skills. Would highly recommend for someone early in their career as learning best of class processes and procedures. Difficult to have work/life balance. Excellent leadership. Cisco was an excellent company with a culture of teamwork to resolve issues and learn at the same time.I learned quite a bit more about Linux processes, networking elements, as well as intelligent devices. Cisco Systems in Richardson Texas has the greatest people to work with. They are absolutely helpful and intelligent. One of the best company's I have ever worked for. While I enjoyed by time at Cisco and found the work challenging. I was not impressed by the wholesale layoffs of entire departments when a new director would be hired. I understand that the new management would want their own people but I would also hope that they would review the skills and performance of existing employees before dismissing them. A day at work be fun and healthy. I would more about the job as the day go. We all would work as a team to get things done. Wasn't nothing to hard about the job. Best part of working with Cisco is its fantastic people.  The culture promotes innovation and initiative and most managers live by it.  Of course, as in any large company experiences vary, but for the majority, Cisco is a highlight of their careers. energetic environment, start up vibeone of the first 'internet' companies because of its BBN historyno sure how it has changed over the years; company was being considered for an acquisition when I left I had great experience with Cisco, it is a great company and the benefits are top notch (what you should expect from a top company). The ability to work remotely is in my opinion the best advantage tech companies can provide now days. I enjoyed working at Cisco, the culture, people, benefits.  The only problem was getting laid-off.Cisco has a great on-line learning tool, when it comes to any type of tutorials and skills in Microsoft or any type of software needed to improve in your position.Anything you need on policies and procedures is on-line. Cisco is the company where a lot of educated developers are working. For those who have Computer Science degree Cisco is a very good place to work. Upper management is very smart and educated. Cisco is an amazing company to work for. Its very easy to become productive very fast in Cisco, since all information related to your job is on wikis. The people I worked with were very professional and technically strong, and my communication with them was always fruitful. One of the best features about working in Cisco was, if you ever needed to get information on something, not readily available, the person training you would record the Webex session, so you could play it afterwards to get the details resolved. That was an awesome time saver. And Cisco uses state of the art tools to get work done. Flexible and able to work from home but managed sites globally so would work all day and night.  It was hard to balance work and personal life.  Manager micro managed and was one of 8 over the time there. The company helps you to plan your career and select the projects you are interested in. Managers are very supportive both for full time employees and contractors. Teams very collaborative. Deliverables were unclear.  Strategic planning was done by one consultancy; overview planning was done by a different consultancy, and deliverables were completed by staff and yet different consultants.  Coordination among all the working groups was loose-to-Poor. Cisco is a great place to work.  The work culture makes me to get the best out.  They also give you freedom to express ideas and implement them if beneficial to the company. This also makes a fun place to work. Cisco is undergoing transition and is downsizing so it is a constantly changing and re-organizing. This makes it difficult to main continuity when working on projects. In 7 years I had worked for Cisco, I never felt relaxed and safe. You need to constantly guard yourself because the management encouraged employees to compete with another. It's like dog eats dog. It's a hostile environment. Also, they favored contractors and kept reducing regular employees.  Cisco has huge man power in Asia where they can pay 5 people easily vs 1 American worker. It's no brainer.  Layoff is a norm. Been at Cisco a long time. The culture has always been the same in that bringing people together is more effective than tackling alone. I feel like they do a good job at making sure employees are respected but I wish they treated their contractors the same way. They seem to forget they help Cisco grow as well. While Cisco is likely too big to fail, it is under profound competitive pressures.Only time will tell whether Cisco's size is an asset or a liability. Great place to learn new things. They helped pay for new certifications and encouraged me to go to networking events to meet new people. I was allowed to have time to study on my own. Performed various network migration projects, including hardware equipmentupgrades, IOS upgrades, and new customized configuration implementation. Monitoredrouters and Wireless Access Point (WAP). Resolved issues with System Engineers &Project Implementation Managers for large and small enterprises and companies That's is a really sad story of the successful product that has been killed/ended by the huge and successful company as Cisco shortly after Cisco has acquired booming and profitable company and its product. Leadership culture at Cisco is about execution period full stop. The culture is driven by your direct manager and is not consistent across groups in the same division. Accountability among leadership is low and standards of excellence are inconsistent across teams, leading to a sense of arbitrariness. Cisco offers work flexibility which enhances work life balance for its employees.  Additionally, the collaboration environment at Cisco is great as well; employees seem to invite collaboration. Great company and great people.  Cisco cares about their employees and empowers them to do great things.  Cisco sometimes allows employees the opportunity to work remotely. Many hours working on many different projects, very demanding but also very rewarding. Day to day changes and you do have the possibility to work remotely on different projects. Work was interesting and fast paced.  Team work was above average.  Customer issues that required immediate attention took good portion of my time.  No issues with work or management energetic environment, start up vibeone of the first 'internet' companies because of its BBN historyno sure how it has changed over the years; company was being considered for an acquisition when I left There are people who can do the work and work harder than others. However, management fail to recognize those effort and reward the ones who don't work as hard. Too much politics and gossips. Good Company to work with and gives opportunities to build your career.My experience at Cisco helped understanding of requirements and making it a part of the system quality validation helped to deliver quality products Great company until things change in your area, and they inevitably do. Then you have no idea what's going to happen. Management level changes are often opaque at lower levels, and the true reasons changes were made and people let go never are revealed, or are glossed over. Cisco is a great company to work for.  They have great benefits and a strong portfolio.  It is an ever changing business though and job security is not always there.  On the plus side though having Cisco on your resume makes it easy to find a new job if needed.  The pay is good but not as high as other company's in the same field.  They did just redo how they do compensation though and I think this will now improve.  Overall management is good, of course there are a few that slip through the cracks but most of my experience has been great and I have positions in sales, support and services so I have seen managers across the board. Cool place to work but management is old school. They need some new blood and new methodologies to stay relevant. Although they keep saying we are a software company, a lot of people do not want to move away from hardware Nice place to work and learn. Have a chance to work on some cutting edge products. Lots to learn and have an opportunity to work on different domains. Working at Cisco is an experience unlike no other. It's always evolving. There are a lot of hours spent in meetings, but never a truly dull moment. Work-life balance varies from role to role, but the working flexibility can be both advantageous and also a constant source of stress (always checking, 24-hour workday). Had the opportunity to work for a great manager and enjoyed my time at Cisco.  Senior leadership lacking in providing direction and stewardship of the company as indicated by corporate results. Most teams at Cisco were very technicalMany problems were resolved in very professional mannerBeautiful campus and very good benefits and salary packagesManagement were sometimes very tough and high expectations and workloads big company. Struggling to remain relevant now due to mismanagement. undergone heavy leadership changes and the future of Cisco is unclear but the company was good to work for. well i have worked in cisco the last 5 years, mostly from home, although working from home is not always easy but cisco as a company is one of the best companies to work for. It provided the necessary assistance to excel and enhance your skills. The management was very cordial and helpful in what you do. The flexible work times helped me a lot and I enjoyed the stint immensely. Great People, but lots of politics. There is a lack of clarity in expressing the team mission and an assumptive attitude that people need little or no coaching when they start. Cisco had a great mentoring program and plenty on and off campus training.  Cisco rewarded teams for making product development goals and recognized individuals achievements. I have learned so much from my peers and test leads while working at Cisco. Cisco also provided trainings or classes on site. They were able to work around my schedule. Productivity was analysed for 5 hours a day which is quite good , had time for meeting and developing Multi culture environment Commute to work was the hardest part, but CISCO made it easy with their free buses. Solid company.  Undergoing a business model shift.  Culture is changing, and losing original positive pro-employee culture.  Good work life balance.  Competitive compensation. Good place to work with friendly colleagues and flexible work  hours and  work life  balance is  very well maintained. with . very minimal . job security as . the . billing . cycle is . generated only 3 months and very risky for contractors. Great company to work for, employees were treated well.  We all were proud to be associated with the company.  The work was interesting, never a dull moment My direct manager has ZERO people skills, emotional intelligence, and terrible at communication. She would go through the contract holder instead of communicating with me directly.  She demonstrates poor leadership.  I worked with several Project Managers and received great reviews.  I was given 48 hours notice that my contract wasn't being renewed. energetic environment, start up vibeone of the first 'internet' companies because of its BBN historyno sure how it has changed over the years; company was being considered for an acquisition when I left A very structured work with very clear instructions to follow. Good mentoring. Management conducts weekly staff meeting so that everyone in the team is one the same page. Also weekly one-on-one meeting to make sure that issues are communicated. Has a ping pong table. Friendly and helpful colleagues. Huge campus. Good benefits. It is a leader in Networking industry. So the workplace has a lot of sharp people. Cisco is a great company but its culture has been changing since I was a permanent employee to now (as a Contractor)Its always dependent on the Team and its management.I have been with good teams and good managers.I like Cisco ! The environment was great, easy coworkers, helpful and willing to grow and learn. The job required to have some initial base within the IT field but most was learned through going through the processes A great environment to learn and improve my skills.  Provided opportunity to work in teams and to network within cross functional groups.  Worked for a very supportive supervisor. Very competitive and high turn around.  I was working thru a staffing agency.The hiring manager left the company 10 days after i started. The new manager was not approachable.The technical staff was disengaged and the leadership was not collaborating with the stakeholders.However, we regularly sent out communications which were very helpful. Contractor with Cisco Equipment,  I did not work for Cisco directly.  I worked on their equipment while working for different retail companies.  They did not give us access to the software we needed to upgrade and configure their equipment Cisco is a good company to work for over all. There are many opportunities to move around the company and try different roles. You also have time to give back to the community and are encouraged to improve yourself. The first thing that always comes to mind with Cisco is customers.  Customer first.  IT solutions are not always perfect and when they are not it means make it right.  Cisco always did that.Also had the best manager of my career and my team was awesome.  We worked hard, had fun, and killed it. Cisco is a highly collaborative organization, which has strong plus of being collegial, supportive of family balance but also carries a negative of trying to deliver on too many priorities. It's a fun and productive environment if the team bonds well and has cohesion. There's alot of room for growth, but you'll need to be proactive to push for growth. Cisco is a good company to work for. It helps employees grow and learn. Overall good culture, good flexibility, good team and good environment. I would recommend anyone to work for the company Everyday is new learning Supportive Management Good BenefitsPlenty of resources to learn Hard part to be on phone almost all the time with Customer I was very impressed that a company the size of Cisco can have 7-9 levels of each functional organization all focused on how they contribute to the company goals. Very much a top down leadership approach. I was proud to work at Cisco during my time. Your experience depends on what group you are in. Some groups have good management. Some groups have average management. Some managers are demanding, they can you on personal cell phones at 10:00PM even if you are not on call. Not sure why most good software managers and technical leads do not hang around for more than a few years. I enjoyed most of my time and my co-workers at Cisco. Unfortunately it can be easy to lose track of how you are helping the company being a smaller cog. I had 4 managers in 5 years. The last one was more concerned with advancing his own career at the expense of stability. Cutting and slashing budgets wherever possible regardless of whether it caused problems. Once problems arose he would blame others, (see: Me). Somehow this worked and he is a Director while I am looking for work.Summary: Cisco-not bad, Management-Need Improvement. Comfortable company to work for. Not super demanding. Just a few reports that you have to pull together. A lot of hounding down information from controllers and business partners. Very balanced work life balance. The company is generally a great place to work, but the employee experience varies from team to team. If you have a good manager and secure team you will love your job. If your team is going through a restructuring, or if your manager feels insecure, you may need to watch your back. Every Day Meetings - That can collaborate various teams for a decision or Process to follow Learning : Various systems used for all different process yet a gloabal integration for all systems.Workplace Culture : International unity. Hardest Part :IT was difficult reaching the upper management being a Contractor Most Enjoyable : - The wide and beautiful Campus..  and its big buildings. Cisco has a very dynamic, fast-paced, and cross-functional corporate culture.  Empowerment is an added-value for all players to be creative and innovate to their individual thinking to share with peers, colleagues, and management team. energetic environment, start up vibeone of the first 'internet' companies because of its BBN historyno sure how it has changed over the years; company was being considered for an acquisition when I left Cisco is a great place to work, but in my particular team there is not much room for advancement beyond the Lead position that I am currently in. They offer health care, 401k, etc. Dynamic fast paced environment where I supported channel partners and later became a direct sales representative.  Focused on enterprise networking, security, and unified collaboration solutions. Demanding work environment, with many deadlines and high expectations of employees.  Job satisfaction often determined by your manager.  Employees often under pressure to produce; long hours. A typical day at work consisted of getting leads in the morning to prospect and have one meeting a day with my team.I learned to have more time managment at cisco and management was very helpful and fun to work with.It was a beautiful and upscale workplace with the flow of young energy with a taste of experienced workers that would be willing to help you with anything.The hardest part of my job was to land phone calls with meetings on a hopeful quota. The most enjoyable part of the job was when i didn't have management ever breathing down my neck for anything (whether i was doing my best or not) The coworkers where always fun and helpful to any assistance. The mission and vision from the upper leadership is clear and right. However, there is too much noise caused by middle management (politics). The morale of individual contributors are low due the psychological safety issues and poor advancement opportunities. great collaborative working environment.  Good team spiritability to learn new thingsA lot of opportunity to self-start and motivateSharing of ideas are welcome Productive and fun place. great place where I spent 10 years and still continuing .Would recommend anytime to anyone looking for a big IT company. Vey supportive of employees. Great company building great things. The company has pretty good work-life balance. Easy to become complacent though, but it depends on you and the team you are working on. I enjoy working for Cisco. Very bright people with excellent thought leadership. Great culture and resources available for employee development. Cisco is a very compartmentalized company with myriads of BU’s. It sometimes create overlaps in the functions of these different groups. A supportive place to work. Ability to work remotely in most cases. I was surrounded by people willing to go out of their way to help you, which made a huge difference. There is alot of work to be done, and given the remote nature of most people, the line between work and leisure could begin to blur. But personally this was well worth it. People make this a great place to work. Work flexibility is also a great perk. Experience varies based on projects you are involved and the different group. It's a good place to learn. Management is ok, depending on the group.Lot of politics. You need to know key people to move up. Sales people are good in general. Cisco is a great company to work for. The quality of your fellow employees and management will be top notch, and there is always room to learn and grow. When I arrived for my first day at Cisco the first thing I did was wait 4 hours for my manager to show up. He then gave me some documents to read which were *clearly* meant to be read by someone with significant previous knowledge of the Cisco architecture. After two days of slogging through what I can only assume my manager thought passed for onboarding, he pawned me off to somebody under him who gave me a solo project to work on that summer. Working alone on this project, I was very much forgotten by management. I met with my manager a total of 3 times over a 12-week internship, and I would often go days or weeks in a row without ever speaking with another employee. Cisco is a great and good place to work with. The people here are very good and very professional. Work culture is very good and I have been working in Cisco since 8 + years. Cisco is huge, but they remain a great company. Lots of opportunity to do innovative, challenging work. Additionally, they continue to acquire incredibly cool technology in the security space to broaden their leadership. Good working environment. Relatively low salary. Cutting back on good benefits over the years. Technology is getting out of date for engineers, not good in getting better job outside of company. I was with Cisco for almost 15 years as a FTE, then about 2 years as a Consultant. A lot of good learning opportunities, good work life balance, possibilities to work remotely when needed etc. The most frustrating part is that it's hard to make an impact due to the size and complexity of the company. Fun and exciting place to work. I was hired on as a contractor and spent my time contracting in different counties. I was able to see new faces every day and go somewhere new every week. Flexible work options and very competitive benefits package. Lots of wicked smart people working here, no wonder the company is so successful. Women in leadership positions is really refreshing. Work / life balance can be a struggle and periodic layoffs aren't fun, these are the trade offs. energetic environment, start up vibeone of the first 'internet' companies because of its BBN historyno sure how it has changed over the years; company was being considered for an acquisition when I left A lot of hierarchy in the company.  A lot of politics and no clarity on work description and responsibilities. But great company to work for.  The group needed to be managed properly. My time here was pleasant. Learnt a lot on the job. My daily tasks revolved around mobile application tests and OTT. I did a lot of backend tests and AWS related content management Cisco is a company where every one wants to work atleast one project because of the way they treat the employee and the benifits it offers.Good support for the one who willing to upgrade his work experience. Friendly atmosphere.Have employee's voicing opportunities which is good.But there're a lot of rooms to improve in work settings though it is a quiet place to work. Great place to work, great culture. Lot of old school/ legacy mindset though ... but changing to keep up with the competition.Leaders are often open to new ideas ... For the few months I worked at Cisco, I enjoyed my time there. The culture is great, the benefits are great, and the campus is really well taken care of. I think with any of these inside sales jobs at OEM's you run the risk of pulling your employees in too many directions. Sales is already a busy job and if you couple that with a complex industry ( channel business model ) the last thing you need is for management to create a bunch of programs to justify their existence that distract your employees from executing in their current role. Less is more. Create an environment and a streamlined approach to things where an employee can just come in and execute on 2 - 3 things everyday and move the needle. Not 8 - 10 things that they can only give themselves half way to. Great place to work and the culture is the best. Work schedule gets crazy depending on what Org you may work in.Ability to work at home and not have to be in the office every day which is very convenient. When you throw off $3M FCF every quarter, I guess it's hard to get too charged up about creating and executing top-class integrated strategy.  The temptation to accept good enough vs. innovate in the sales execution domain is apparently overwhelming.But overall a very good place to work if you want to get along, collegially do your job and be paid pretty well.  You won't be happy if you cannot suppress chafing over waste, or opportunity unperceived or ignored. Lots of lip service paid to work/life balance.  Don't believe it.  If you work there full time, depending on the position expect to work evenings/weekends. It used to be fun to work at Cisco, Work and Play in one word. Exciting oppertunities, and a grat place to work. I have had sevral different managers during the tenure of my work at Cisco. I used to work with different departments and take care fo their need in labs, and purchasing and shipping etc.. Cisco is one of the best company across the world, Good work culture and life balance. Always upto date with latest technologiesfun filed work and lots of events . You will cherish your memory after working here. Good place to learn and grow. Good work life balance. Easy to approach managers and friendly work environment. Best place to network and find new opportunities. -opportunity for growth is great-open and young working culture-Management is not experienced, the impact is very clear on day to day activities-Company is scaling up very fast, this leads to major holes. Hands on experience in hands on experience in refining global firewall, enterprise proxy and edge connectivity services to efficiently manage important control to diminish threat Working at Cisco provides a challenging environment while learning new things every day. The compensation is outstanding.Many things have changed over the years at Cisco. Poor management. Favors foreigners over Americans. No raises or advancement. The focus is more on politics than it is on the work at hand. Cisco was a great place to work until the culture crumbled around 2004. I worked for Cisco in NC for 2 years, and the team and the management help you explore technologies to help yourself and the team. The working environment is suitable to focus on what you want to do. No comments or reviews for Cisco as I worked as a student consultant on contract bases so do not have enough experience or information to provide a review. I enjoyed the flexible hours and autonomy at Cisco. I spent 18 years there and would go back in a heartbeat.  It is fun place to work and I felt like a part of the Cisco family there. energetic environment, start up vibeone of the first 'internet' companies because of its BBN historyno sure how it has changed over the years; company was being considered for an acquisition when I left Cisco is a very smart company that continues to grow its reach into the IT marketing in solving customers business challenges and producing positive customer outcomes.  I've always had the greatest admiration for top management at Cisco, and I feel proud to have worked there for almost 9-years over my two (2) tours. There is no better hardware & software company to work for, but because of Cisco's enormous portfolio, it is also like working for several competitors all at once.  During my 10 years there, the quota to commission ratio eroded tremendously for field sales people, and most of my team members did not make their quotas while a few did well.  Depending on your relationship with the regional manager, it is a phenomenal sales job if you are favored by the sales manager, and it is probably an average sales job in most cases if you are not. Stable company, good work culture, allows remote work. Bureaucratic at times and things can take longer than they should to get done. You may or may not get credit for your work, especially if you are at lower levels of the organization. Although there are the general 'big company' concerns, things move very quickly at Cisco and it's critical to have the right people inthe right roles or projects get stalled and frustration grows. Even leadership changes frequently so employees at Csico have to be  ready to shift course quite often. This company can be a great place to work.  But so much depends on the group.  Some groups did lots of fun stuff and have great perks.  Whereas other groups didn't do anything fun.  Your job function will also impact life here.  Some jobs you need to be in the office, others, you can work from home 95% of the time.  Opportunity for advancement is odd here.  You won't find many, if any, Mechanical Engineers who are in management positions.  But if you are in sales or marketing, the skies the limit. A lot is expected, and you have to be able to live through chaos. Lots of 'change to simulate progress'.Great people with a lot of passion, but also a lot of concern about their immediate or mid-term future. Everyone assumes that they will  probably be cut in the next change. Cisco provides quite a few amenities to help with employee morale.  The culture provides a solid framework for success at the personal and professional level.  Some matrix teams are dysfunctional and do not have the necessary checks and balances. Excellent opportunity to learn as much as you want in the equipment leasing environment. Great interface with sales, legal and tax departments along with partners and customers. Having always been a huge Cisco supporter, my excitement was immediately diminished by the leadership team I reported to and up through.  It was the most disheartening contract experience in my 18 years as a professional contractor Great place to work. Thanks the premium Cisco places on its employees' happiness, the networking giant has proven itself to be the gold standard for employers. I have always felt that a structured and driven work environment coupled with the willingness for personal success is the cornerstone for a equally successful business. In my 22 plus years as a collector I have found one thing to be true and that is, that without the Personal Training, Financial Structure and a well informed Management Staff, Collectors will fail. The saying 'That it takes team work to make the dream work' is as true today as it was when John Maxwell first said it. Very flexible work environment, workers are friendly although compensation is not great at all. The most fun part about the job is the culture, casual dressing and flexibility. I enjoy working here. I have nice coworkers, but my team is isolated enough that I can not speak for other groups. I really learn multiple concepts every cycle and it is like being in the fast lane on the IT highway. I can only comment on working in the sales deptartment at Cisco. It's all about the numbers, and the rest is icing.Customers complain that it is hard to do business with Cisco and Cisco turns a blind eye. It's Cisco's Way or the highway.The people you work with are top notch. Management is generally filled with people only interested in promotion, at the expense of their reports. Smart leadership, ability to address market transitions well, great benefits, nice culture. The company is reinventing its business models to continue to address the changing business environment. Its disruptive and smart. I had a team I did not personally enjoy. However, my friends were in very good teams so I know it was not a company culture, just a team specific culture. I would return. This company values employees who work hard and allows work life balance and fun as well. A small con is having IT helpdesk cenralized and not localized to each office location, so IT requests may take a long time to resolve, especially if approvals are needed. Everything depends on your Manager. If the manager is good your life is good if not then you know the story. I would say if you work and you have a good luck with you. Nobody can stop you from reaching the top. Cisco was the best company I have worked as a service provider and I enjoyed working to the company. Learning and applying your ideas on the design , freedom of speech, and taking risks and very Interesting labs to work on . easy to collaborate with co-workers and other teams at Cisco. group work was a breeze to assemble. rooms from private meetings to give full attention to calls as needed, or to meet in small groups in a busy workspace.on campus lunch selections allowed for working lunches with delicious food, and available  food trucks that give a good flavor to the middle of the week. energetic environment, start up vibeone of the first 'internet' companies because of its BBN historyno sure how it has changed over the years; company was being considered for an acquisition when I left Most of the positions need more than 8 hrs of work but there are flexible work hours which makes things little better Not much growth once you cross few years in the companyManagement layer is heavy as the company is growing old I thoroughly enjoyed my tenure (17) years at Cisco and Gained knowledge that will retain throughout my career. The Culture at Cisco was a Family atmosphere, I gained a lot of Life long  acquaintances. Clueless management, no career advancement opportunities, lack of vision and most importantly no opportunity to make a difference. This is a team of paper pushers ! If you want to retire in peace, this is your place ! If you want to feel no sense of empowerment, this is your place ! A typical work day consists of a brief team meeting, a few tasks to complete, sprinkled with a couple of interruptions to said tasks. Co-workers are generally very content and the years I've spent at Cisco have been fulfilling and educational (mentoring interns). Whenever I've asked for more responsibility, the request was granted each time. I was never given anything I couldn't handle, which made me feel that I was really contributing to my BUs success and Cisco as a whole. Cisco has always offered training, certifications and awards for those that complete training.I was able to take advantage of the Cisco Certified classes, and I'm very grateful for being able to do so.The managers I've interacted with and reported to were all excellent. I never encountered any issues with management at any location whether in the U.S, China, or India. My duties had me in contact with quite a few, and they were all very pleasant to work with. I honestly had a great time at Cisco, one of the best opportunities I've had in my professional work experience. I have the privilege of supporting healthcare for the Midwest.  Due to Cisco's market share, it was advantageous to gain access to business decision makers to think through and suggest solutions that would provide tremendous business value. In addition, we were able to leverage our own technology to enable a remote workforce to be highly productive. My years at Cisco were filled with great learning experiences. I changed roles several times and had the opportunity to learn a lot about services distrbution, global alliances and partner incentive programs. Cisco at times is fast paced. Product changes often, requires you to be updated with product which can be difficult. Fun environment, good people to be around. Hours can be long. I was hired on a project basis to help develop communications throughout the Cisco environment for a very forward thinking project.  However, the team had been working together for many years and this made understanding very difficult.  The solution was very technical and trying to understand it thoroughly in 2 months proved to be a difficult task.  In addition, when I finally began to understand and make a plan of action, they no longer felt like they needed the support.  Unfortunately, this did not allow me to do the work that I was hired to do. ProsCorporate commitment to work-life balance, well compensated, company name instantly enables you to get a meetingConsProduct portfolio seems to be a step behind smaller more agile companies. Migration to cloud is taking longer than anticipated.Advice to ManagementKeep pushing to be the best company to work for. You ask the sales team to shoot for the moon, in what way is the company shooting for the moon? Companies like Tesla, Amazon, Facebook, Google seem to innovate, Cisco feels hesitant to change the world and content to make the world more efficient. easy going and friendly workplace, great work -life balance, excellent perks and job satisfaction, great peers , good compensation , awesome culture, relaxed work environment A good place for a young recruit to get their start. Career advancement tends to be slow and there is a risk of being pigeon-holed into a particular area.Lately, there seems to be a lot of budget turmoil, especially on the marketing side of the house.Overall, a good place to work. The childcare facility is very clean and well up to date. A typical day starts with setting up the classroom and activities for the children. Throughout the week, we keep a daily data entry of the children's schedule such as; nap, food, and diaper changes. This is a very face-paced workplace and teachers are always expected to be on their toes. We must ensure that our children are absorbing all of the information as well as ensuring their safety and security which can be the most difficult part of the job. Otherwise, witnessing the children grow within our eyes are the most rewarding feeling working here. I truly love working with children. Cisco does a good job of allowing employees to work remotely using the various collaboration tools.  This allows employees the best way to balance life with work. Cisco is a great company to work for.  The ability to be a remote worker, have flexible hours and truly feel like your contribution makes a difference are some of the best attributes of Cisco as a company.  Benefits and compensations are at the top of the list and definitely incentivize one to give everything you have for a company that is a leader in technology. drafted by the NY Yankees when i was here. Cisco has been at the forefront of delivering the promise of the internet for almost 30 years. if you have an opportunity to work here, think long and hard, then take it. Cisco is a big company. This means that a lot will depend on which team you are on. Some teams have great flexibility, others mandate you to be in the office 5 days a week. The same is for managers. There are some truly great leaders and some horrible ones, and your success and job satisfaction will heavily depend on that. In general, people are great at the company with most willing to collaborate and support each other. Compensation is not on the level with competing companies and performance measurment process is absent as of today.  Benefits are good, with 4.5% 401K matching and good discount in ESPP program. The work life balance is extremely good. Cisco is one place where a contractor is treated equal to an employee. I obtained immense respect and recognition for my skills and hard work at Cisco. Cisco is Great! Inclusive company, great influences throughout this organization, understanding of the direction of each employee, and PTO opportunities #lovewhereyouwork Valuable work experience, opportunity to work directly with clients utilizing Cisco equipment and resources. I don’t have much more to explain in reference to Cisco good place to start.. tho cisco is still recovering from the 2000 dotcom crash.. its shows in it's kind of panic to drive new projects.So they are in drive hard fail early mode. energetic environment, start up vibeone of the first 'internet' companies because of its BBN historyno sure how it has changed over the years; company was being considered for an acquisition when I left After the DOT COM bubble, the company has been going on an aimless soul-search to no avail. Expect continuous struggle on all product lines. Stock is up recently but I will sell all my shares soon. Cisco is a great place to work.  Collaborative culture with cutting edge technology. Room for advancement with many career opportunities. Unfortunately there are yearly layoffs which many little job security. I just got bored too quick and nothing moves. Too much red tape and managers are just controlling the herd. You will be stopped at every wall you hit. People just hang on to survive. Was a learning experience for me that helped me balance school work while still maintaining a part time job. There was down time as the evening shift progressed which helps after a long shift. Not as impressed as I thought I would be overall.  Work/Life balance is good.  Constant re-organization of leadership.  A lot of turnover and moving in and out of teams. Loved working at Cisco, wish I could have stayed in my first position. Budget issues required reduction in Contract staff. Contractors are easy to hire and fire when budgets are missed. If you keep a contractor over three years you clearly you value them, you should hire them. Working on TAC, you will never get bored or have non-productive days. You always have something new to learn about the technology or product you support. Cisco is a very large company. Hence, it is easy to get overlooked. During my time there, advancement was limited by a good-ole boy system. My focus was on my team rather more than impressing my managers. Was let go because management said they lost budget.  Then the next few days saw the same job opening.  They maybe could not afford the rate, but if offered I would have consider lowering my rate, When I worked there, though it was the best place to work. People were mostly bright and talented. Managers were very supportive. The company supported innovation. Hours could be long, but enjoyable. Did not enjoy my work. Not much opportunities to learn. Manager expects you to learn on your own rather than putting you through training. I will think twice to work for this company in future. Cisco has a great culture in the office. The company has located on multiple continents and workstations. using cutting-edge technologies as an intern in Cisco gain the brilliant knowledge of architecture. I was a consultant at Cisco and not a full time employee. My duties were the day to day project management duties to develop the application for a new product being offered. Cisco wasn't a bad place to work.  There's no job security as they are always laying off and rehiring in different locations.  They do have a very good working environment. Going to work is similar to having fun @Cisco. It has very flexible work hours and times. You can work from home. Offers wide variety of training for employees. Advancement is about who you know not what you know.  It used to be that you got promoted based on your work.  Reviews are a joke.  It is based purely on whether you are seen and not what you do...at least in my space that is how it's done.  My management does not go to bat for us based on work done which is unfortunate. HR team is not the greatest when there is conflicts. Being a huge corporation there is a downfall to awareness of what is going on at this company meaning internal issues that need resolve seem to go without investigating and looking for ways to fix internal practices. Lots of ignoring of issues rather than fixing.Last note is that companies open door policy is not fully open door as stated and the way the business is to run is not followed as well. One of the USA's best companies to work for, however you'll really be worked.. often 17 hour days 7 days per week were required to handle the calls from the release of poorly tested products. •	Escalation of network troubleshooting issues to Data Centre Engineers based on ticketing system for classroom sessions•	Inspection & maintenance of Operating system, application software and system management tools & L2 support •	Network Monitoring software 'Solarwind' is used to monitor router, switches, and server side application activity Cisco is a good place to work. The company is a connect everything culture company: people, process, data and things to change our world.  There is innovate ideas everywhere within the Company.  Cisco technology powers entertainment, retail, healthcare, education and more to employees.  Cisco benefit every person to be the difference, at work and in employee communities. energetic environment, start up vibeone of the first 'internet' companies because of its BBN historyno sure how it has changed over the years; company was being considered for an acquisition when I left My typical day at Cisco data entry of modules. Receiving and shipping inventory modules. Correspond and complete request by email. Meet lobby vendors.  I learned to prioritize, time manage, and problem solve, effective communication. My manager is flexible, understanding, resourceful, attentive.  The workplace culture is diversify. I did not find any aspect of my job hard. I enjoyed the challenges in my job.  I enjoyed the friendliest and attentive employee's.  I learned a lot from my manager, as far as modules value, and workflow with Program Manager's and Engineer's.   . Global meetings with different teams all day and presentations and work still required to be finished and ready to present.  Collaboration with many levels of management and global teams. At times work can be very stressful and depending on management  you can have a work/life balance.  Hardest part will be the manager you end up with and their style of managing. Working in the right environment is key to each individual.  Enjoyed working with my last  manager and the life balance offered. Cisco is a great place to get some great work experiences. Cisco allows you to seek out what you want to pursue as your next career move. Unfortunately, you are so busy with current work, it is often hard to find the find for the next step in your career. Good place to workGood Place to gain more knowledgeGood Place to learn new thingsGood Friendly atmosphereGood Chance to proved our stufftotally i loved. The worse part of working at Cisco was being informed you no longer work there. No explanation other than you are on the list of we are cutting. The decisions are not all made on the basis of performance. Every day I get to work with intelligent, dedicated, hard working people.  Honesty and customer focus is highly valued at all levels.  Internally, we're more collaborative than competitive, saving energy for customer-focused product development, we save the competition for our actual competitors.  I never question the motivation of our people, teams, or organizations, and I never suspect that we'll end up in the news for the wrong reasons.  We do work hard (with fair compensation), so it may not be for everyone.  We are very big, so while we try to maintain an innovative and fast paced product development cycle, sometimes we do get in our own way. Company has a vision and game plan.  Processes are in place and followed.  Company has a comprehensive portfolio to be a market leader and knows what it is doing.. This is a great company if you have a family and are looking for a stable, secure environment full of very talented, seasoned individuals. Overall, a great company to work for. They are trying hard to get millennials, but already a great company. Not as 'hip' as other places, but still a great place to work. Good company to work. Well work life balance.You can work independently as well as in good teams. However offlate there are lot of layoffs happening leading to  job security issues Its a fun place to work and enjoy. Big company mentality, offers great benefits and generous PTO plan.Management does not have a vision and is pretty experimental when it comes to restructuring which is annoying since you never get time to learn one technology in depth. was fun to try it, hope they will say same about meCisco Systems, Inc. is an American multinational technology conglomerate headquartered in San Jose, California, Cisco was a good place to work.  I worked in group that was one of the biggest money makers and was very busy.  We all worked together to get product to market first. we were rewarded well. Tell me that work is slow, but will pick up, will not give shift hours until work/business picks up, resulting in people leaving. Poor communication from management, no feeling of job security, unaware of procedures and applications used for work until a task is due as was not advised of such. Disappointed. It is a great company to work with and to grow your career. The company has a lot of  career opportunity in different area. However, there are layoff regularly via organization change which is normal for high tech companies I participated in a CoOp program as part of the SysAdmin and DevOps teams, management was awesome and very encouraging. Even helped train for CCNA during my stay! Fun place to work. Fast paced, flexible hours. Learned a lot about servers and various operating systems.Enjoyed all of the engineer's I worked with.  Great place to work The culture is hive-like but often teams become disconnected.  I believe this is almost out of necessity.  It is a big machine with lots of moving parts.At the same time, it is a culture of inclusion and diversity.  A global entity that cares about people and the environment.  Working here has enabled me to overcome many personal challenges. I pulled myself out of a career slump, overcame financial repercussions of a bad marriage was able to work remotely so I could be a caregiver for my ailing and aging sister. Apart from Flexible working schedules, there is no room for career advancement, redundant hierarchies, multiple managers everyone competing for a promotion or raise - causes ppl to kick their subordinates and peers and kiss their bosses. 'Great place to work with good work life balance' (in 2227 reviews)'Work From Home for Interns also'Work/Life balance can be challenging - you have to be fully committed' (in 427 reviews)'A big company has a bureaucracy' (in 346 reviews) I have been working at Cisco for 10+ years.Cisco is a nice place to work and easy within your role. I would recommend Cisco to anyone seeking employment within a large and established enterprise company. energetic environment, start up vibeone of the first 'internet' companies because of its BBN historyno sure how it has changed over the years; company was being considered for an acquisition when I left Cisco has so many business groups within which makes it good to move around.  Cisco is always 'right-sizing' so need to beware.  Many locations and if you have access to the data center equipment or training, a great plus. Solid balance of teamwork and independent work with as much supervision as needed. Clients were visited almost daily, continuous conference calls, team planning, commit calls. Could work remotely and in any office across the country. Workplace culture is very dependent on the manager, however there was a new manager almost yearly for the last 5 years of my tenure there. There tends to be a culture of it being difficult to move across job functions. A lot of emphasis to hire from the outside rather than within. The most enjoyable part of the job was access to training, career development, forging relationships with customers and the fact there was always something to do for the customer or to further your professional education. The hardest portion of the position was always having to be available and the culture of never being able to disconnect. In addition, having a travel heavy position made the job much more demanding. Weak Management SupportNo VisionInternal Processes and management software were manual, unproductive and outdated Did not provide adequate management and tracking tools to perform PM job at the performance  level management demanded well as wasted valuable time My day in CISCO starts with standup call to update status of current work and any impediments we discuss , after this call I normally look at agile board and update remaining work hours  currently working story , writing JUNITS and necessary automation tests . everyday we have checklist to check failed jenkins automated tests and analyze why those tests failed , if necessary we need to fix code as it could be potential bug .  every afternoon we have meeting with technical architect and other senior members to discuss groomed user stories and their design . there would be so much learning curve in cisco , day to day activities we need to create new virtual machines and  connecting those nodes to communicate each other , setting up ssh , sftp and  DNS . BRDC and other QA management team contacts developers on their fixes and how to test it . this is where most of the developers will be engaged with different teams . hardest part of the job is sometimes it is hard to find issues as we are dealing with nodes and virtual machines , splunk can be used to find logs in different nodes , we can enable TRACE and find some clues to bugs and recreating problem is not that easy while dealing with docker VMs . Working for Cisco as a contract status worker was a good experience. Very good working environment for technology products and services.  I would like to work full time. The experience at Cisco is very dependent on the business team you work for and your leader. My team has been under 5 different leaders in 3 years and there is continued uncertainty. Productivity and morale suffer as a result. Cisco is a nice place to work and easy to fall complacent within your role.  I would recommend Cisco to anyone seeking employment within a large and established enterprise company. Working for Cisco I gave me work-home balance and flexibility.  My 10 year career at Cisco I was remotely and that gave me the opportunity to attend to my young family. Excellent flexible schedule and perks.  Work life balance can be a challenge, so a healthy relationship with your manager is key.  Compensation is competitive. Work here is fun, challenging, and always an opportunity to learn more. There is great synergy between different groups, and there are always situations where you get to increase your domain expertise if interested. I have grown tremendously here. Days at Cisco are getting very very fast and sometimes I have trouble working my work/life balance in there. From my understanding it is going to be getting busier and busier.l To  the best of my  knowledge..  Hard to get  in  Cisco ... Once you  get it,,  you sre constantly  on  toe and working   24x7 with  offshore team.  Lot's of plitics and less fruitful output.  Lacking  implementation partnership. Cisco has a better culture than other places I have worked. There are many opportunities to take your career in just about any direction related to Information Technology. They have great benefits and work conditions. Shark Tank, its all about money, people and conditions are deplorable. Takes forever to get in there ' system '.Training is none existant and managers are more concerned about their drycleaning than the people that work for them. Worked with great team of engineers.Management in general not bad.Cons, are to slow to get the 1.0 product releases.Constantly acquiring companies and integrating their products lets employees morale down. Friendly and comfortable working environments.  Flexible working hours and working from home options are the best feature in CISCO.The best Medical coverage among IT companies. My engineering teams were on point at all times.  Some individual members were majorly over leveraged.  My remote manager and communication style made some priorities hard to identify.  Identifying internal resources was often challenging Good working environment when I was there almost 20 years ago. It has changed and evolved a lot since then. Not sure what it is like now. But seems to be improving. Cisco is a big company. It has a lot of money and has become a place provided by aged technical people. Even if its work life balance is good and its work pressure is low, people in my group are always under pressure of lay off. And sometimes, management will not choose the best way to judge employees and to properly promote good employee and lay off bad guys. As a field employee I was not privileged to the culture within the office on a regular basis however the connection you establish with your peers was amazing. I really enjoyed the use of pervasive video both during the interview process but on a regular basis for everyday calls, it makes a big difference in the engagements and knowing your team. I really enjoyed the experience as a vertical architect where we were helping bring opportunity to business leaders outside of IT. It opened up my experiences and allowed much greater autonomy in my thinking process then I had in the past. energetic environment, start up vibeone of the first 'internet' companies because of its BBN historyno sure how it has changed over the years; company was being considered for an acquisition when I left Outstanding and most interesting place to work the typical is relaxed and laid,back while able to provided the best customer service. Management made you feel welcome like work was the best place to be. The manager and the team were great.  The company lays off religiously it's perm people, and the contractors, though treated very well and respectfully, get let go often due to constant, quarterly budgetary fluctuations.  No long term budgetary planning...live by the stock value, quarterly.  Typical telcomm company, but better than the rest...as far as telcomm goes. Great co-workers and even better management!This company goes above and beyond to make employee recognition known amongst the workplace,Also an excellect cafeteria. Cisco is labyrinthine with folks all over the world working in different time zones. It can be difficult to get the information that you need, especially on short notice. Good work life balance and decent compensation. middle management is little rusty and sometimes hinder development. Lot of that is changing and is gearing towards technology focus. The company is moving into the software business very rapidly. Too many changes too quickly. Internal politics are steamy. Many decent people but too many bad apples.The hardest part is to navigate the culture.The easiest part is that there are resources galore at your beck and command. I didn't get into the nitty gritty aspects of working there so I don't have much information. My mom works there and she let me know of some work that needed to be done, because they didn't have the time to hire someone. So I went in and helped out for a couple of months. It was a pretty laid back work environment. Great place to work at.  I conducted Fourier Transform Infrared Spectroscopy (FTIR) analysis on material fluxes for printed circuit boards (PCBs) and created a reference database of results for the Failure Analysis Department: used to sample residue found on failed equipment to determine if error was due to flaws in the production process of PCBs and material fluxes. You will make career here not just a jobGood benefits. Motivating recognition. Challenging work.Awesome work culture.Awesome work facilities and environment Cisco was an excellent place to work as a college intern and almost everyone I knew that participated went on to be full time employees.  There was a great work culture and they always promoted employee advancement. There are so many people involved in the change management function that there is overlap in project management, people playing similar roles as organizations scramble to take control of the direction of the change.  Lots of money wasted in contractors and consultants.Very political. I would recommend Cisco for anyone who wants a stable job and great benefits.  The pay is excellent if you get into the right group. But just like all companies, some groups are good and some are not.  I was blessed to get into a great group. Diverse Culture, large number of complicated platforms to support.  Learn on the fly mentality. Workplace / team building activities. Team lunches and outings are common. They say you should work 8-5 but you'll never be able to keep up with it. They need to hire more bodies. Siloed into a single technology identifying obscure bugs that will not help your career at all. Basically a glorified help desk position. Cannot wait to get out of this place. Cisco was a great place to work at, the management team there was great. If I had the chance to go back there, I would in a heartbeat. The culture there was amazing, good work life balance. Overall good worklife balancesdn , aws , pythonold style, not too encouragingdivided cultureable to convince peoplecolleagues are nice, environment is good to learn Middle management not following Companies missions in day to day decision making.  Relying too much on outsourcing for cost cutting even though the overall expense is much higher and quality and creativity suffers tremendasly Wonderful company to work for. I recommend that you learn as much as you can working for that company there's a lot of resources there that will help you evolve and transform to a better worker. Cisco was an acquiring company to my smaller company.  After 10 years and many failed opportunities to advance, I left Cisco and it has been a very good break. My health has improved. My family is happy to have more access to me, even though I never left home, except tp travel for client visits.  At one point I had (my team also) 6 different managers within 5 months.  Any momentum towards advancement was lost for years at a time. Upper/Sr. Management do nothing but stroke each other's egos and praise each other's lack of rocking the boat.  The only way to slay this dragon's demons is to cut the head off the beast and begin again with better leaders, from Grade 13/14 Directors/Sr. Directors and up... Gr 9xx VP/SVPs on up. Time for a revolution in order to save the world of Cisco. Restructuring every six to eight months zaps morale, leads employees to care more about jumping to the right management chain that isn’t going to be cut. energetic environment, start up vibeone of the first 'internet' companies because of its BBN historyno sure how it has changed over the years; company was being considered for an acquisition when I left On the whole Cisco was a challenging and great place to work. The downside(s) were the constant layoffs and limited ability to move around.  I would recommend Cisco as an employer. Cisco is a place where there are a lot of meetings. People collaborate with Cisco's technologies like Webex and telepresence. You are typically allowed to function remote as necessary. As a consultant, I was provided many opportunities to develop skills, provided training, and allowed to grow as an industry M&A expert with a great team. Long days.  Always on call (24/7) and politics often got in the way of progress. I had 3 bosses with one in San Jose another in Singapore and one in North Carolina Excellent place to work. Management always takes care of work/life balance. We believe in team work. There is a specific Cisco Culture which I like the most. Flexible work from home options...good pay.  Cisco strives to conduct business ethically, honestly, in accordance with the company's values and Code of Business Conduct Cisco is a good place to work. There is a good level of autonomy. Good work/life balance. Cisco work culture is known for its flexibility and openess. Provided opportunity for technical training from CCNA, CCDP, CCIE, CCArchitecture. It also provided leadership training than help shape the trajectory for y current career Never a shortage of challenges to tackled, Cisco is in the forefront of innovation in the information technology ecosystem.  I gained a wealth of experience in networking, managing teams, cross-functional collaboration, product release delivery.  I had the success of supporting tier-1 customers to meet their agenda on operating system releases on multiple Cisco router platforms.  Led multiple teams to deliver complete system test, development test, regression tests, and automated tests.  As a senior manager, my role is to support the team and ensure their work success, remove obstacles, reward for goals achieved.  Many 1on1 meetings to understand their aspirations and motivations. Spent a lot of time as an outbound calls employee. There were weekly customers calls required. The work environment was very good and competitive. I developed excellent customer service skills. Was great, then not so much, maybe getting better again now?Loved the job and company when I started, then the culture changes and it was time for me to move on. May be better now with new CEO, don't know. Cisco is a great place with great people. There is just too much turnover. There are too many changes in management and once that happens the employees and contractors are displaced. Working at Cisco for me was not a typical day. Great environment, collaborative culture and some of the brightest people in the industry!! I highly recommend taking a look at career opportunities with Cisco. I worked for Cisco for 17 years. I held many different positions. It is great company to work for..................................................... The overall work experience that i got from Cisco has been extremely enriching and helped me grow. I would definitely recommend Cisco to folks seeking a career in the hi-tech industry. Awesome company to work for with lots of career opportunitiesand growth, flexible with work schedules, competitive benefits and diverse group of people to work with. This is good company to work for but It is very stressful because it lays off employees very often. It has very good tools and good products. The company allow all empolyee to go out at least 4 hours for fun in every quarter Great place to learn a lot of new technology. Always acquiring new technology so something interesting to learn. Work Life balance is a challenge with the workload per employee. Great history and experience.  Doing the right things to remain vibrant and competitive in a changing, global market.  Good people, great products, strong future. Depends the team and the management. Most times the management is short sighted and targets show teams goals rather than the whole solution, which causes a lot of time being wasted in changing design and code. energetic environment, start up vibeone of the first 'internet' companies because of its BBN historyno sure how it has changed over the years; company was being considered for an acquisition when I left To focused on corporate image, not on strategic product development and services. Should be the leader in 5G but is not close to Qualcom. Lack's true workforce mobility. good school for engineer, good benefits for sstudying and personal improvement.job vs personal life balance is good.promotions are hard soe timesmanagement on lower levels often not good If you need decent benefits, I would not recommend being a contractor at Cisco. Frequent reorganizations, no chance of being converted to permanent, no stability, constantly moved before projects are complete. Chaos with huge contractor turnover. cisco rules the market.  big company.  a little too much 'process'.  too many meetings.  lots of good networking people.  buys lots of smaller companies -- doesn't always know why or what to do with them. Good environment, poor management. Very good extra-curricular activities to be in shape such as basketball and volleyball tournaments. Good platform to begin an IT career. The working area is setup for team building and also to improve yourself. It is mostly quiet and you are able to get your work complete. There are break rooms and game rooms to help with the stresses at work. High turnover among contractors was common and expected.  Pay was entry-level and advancement opportunities were limited at best.  Senior leadership was outstanding, mid-level management was   caught between client demands and constant turnover. CISCO is a nice company to work for.  Cisco is located in the heart of Silicon Valley and CISCO has been around for more than two decades. Cisco share also comparable with the index. i enjoyed my job right up until SPVSS was sold. Job security at Cisco is not (secure or obviously guaranteed.) I really liked my local management and his supervisor. This was a very well versed team that persuaded me to branch off into Software/Applictions comfortably. Cisco was by far the best corporate experience I've had - culturally.  However, there were lots of re-orgs, lots of politics and not the work/life balance that they talk about so much.  Having to be available 24/7 isn't my idea of W/L balance. Cisco is a great place for work/life balance but there is a cost to that flexibility - raises and promotions are very hard to come by and bit political the process is. The backbone of our day to day was Incident Management. Typical day involves troubleshooting and resolving various user based and device based incidents. Large exposure to new and emerging technologies related to Video Telecommunications. Exposure to every element in Video infrastructure, learning more than Telepresence itself, but its interactions and configurations on User Corporate networks to include firewall troubleshooting, exchange troubleshooting, switch/route troubleshooting. Management is focused on allowing the engineer to resolve the problem, with little hovering. Having faith in the ability of the engineer, allowing them to work at their own pace. Hardest part of the job was the initial learning curve, and volume of Customer tickets, having to juggle often times multiple active cases while answering phone calls from users. Most enjoyable part of the job would be the team and freedom allowed to us. Depends on the mgr- bad or good experienceGood work-life balance Learnt PM skills, job hired was not I found myself doing, more admin asst role compared to PM role. My time at Cisco was valuable, however I would have wished that Cisco offered a more open work environment. I rarely got to work with anyone, and I thrive working with likeminded people. The people working there were incredibly smart, and I loved learning what I could from them. Overall it was a positive experience. Large, structured, driven company. Endless WebEx meetings (Cisco bought the company). Some days seemed filled with 5, 6, 7 hour-long conference meetings with 6, 8, 10, 12 attendees. Buen lugar para trabajar, comprensivos, buen ambiente. If you want to do software development at Cisco (a hardware company) then think again. Their management has no clue how CI/CD and code quality works. Management is behind the times on new technologies and is really quite sad.On the positive side, they allow 100% remote. In that department, they are ahead of other companies who still think you have to be chained to a cubicle to get work done. I worked as RED badge contract with Cisco Advanced services group and during my 1 year contract and working on Cisco next generation products platform increased my technical skills and I loved to work during that time but for some reasons I was unlucky and my contract ended and not renewed and I applied several time on similar job role as consultant engineer Cisco Data Center but did not get chance again but overall my experienced was excellent working with Cisco :) Cisco management has no clue how to run a tight engineering company to maximize profit.  They get great margins because they got into the Network equipment arena early.  But they clearly know nothing about engineering except for silicon design. They purchased a great company and stripped it of it's best.  All sorts of benefits and support when they first purchased NDS, but then once they had all systems in place, they began to unload personnel. energetic environment, start up vibeone of the first 'internet' companies because of its BBN historyno sure how it has changed over the years; company was being considered for an acquisition when I left Nimble and very innovative company. The Leader in telecommunications equipment. Hard working people. Designing and validating the next gen router(s). The only thing I wish it would be better is better advancement opportunities, especially for consultants. Excellent company to work with, oppurtunity to improve technical skills, domain expertise and friendly work culture. more fun to work with in challenging environment. Stable job, less growth, takes long to get promoted. things move slowly, no recognition to skilled engineers. Lot of opportunity to learn and work on projects. Great work life balance.Work culture is good. Plenty of learning opportunities. Overall I'd say if you do get a chance you should explore working at Cisco. Cisco is a pretty good company to work for. its talent pool varies in age, gender, and culture. It definitely creates an environment that allows or fosters learning, and growth. But on career growth perspective, it gets very political. Day to day job pushes you beyond your boundaries, and helps you extend you limits. Sometimes there can be too many meetings, while other times, you have enough of time on you hands to pick up something new. It was fun and rewarding to work for Cisco. They encourage employees to take the initiative, and provide flexibility to work from multiple locations including from home, if practical for the nature of the work. Working there was fun.Had learnt a lot and its the best experience to upgrade yourself.Had a wonderful team and that was an amazing experience working with the Architects. While working in Cisco, I had the greatest experience of been able to develop the Collaboration business. My manager was a great mentor. Helping developing partners and presenting advance products that will transform the organizations positively for the future, was my greatest accomplishment. Cisco is an amazing company. For as big as they are they really work to give personal attention to their employees. Great benefits and a flexible work environments add to the value for working here.Only downside is there's a known fact that if you want to 'move up' you're probably going to have to leave your team or leave Cisco and return after external experience. Remaining in a single job function and team can get you stuck on a slow career trajectory. There were teams and projects at Cisco that were among the best I've ever been a part of, and other projects that were the most disorganized and poorly thought through.Most of that stemmed from who happened to be Project manager and my team manager.  The general trend I noticed while there was a general decline in quality from both project and team management. Uncomfortable degree of churn due to shifting priorities, often resulting from political stuff going on in California. Local, on-the-ground management was relatively powerless and the executives in San Jose were disconnected from day-to-day realities at remote sites. It's a common story. high stress environment. no teamwork. unrealistic expectations. workplace bullying is out of control.  as someone once said to me, 'this place requires you to sell your soul to meet their expectation' Cisco is a great organization and provides all the necessary tools to be successful.  The pay is average at best and internal raises don't happen very often.  The benefit package is top notch though.Climbing the ladder can be very difficult and a position needs to be open before anything happens. At Cisco, I had the opportunity to learn a lot and manage innovative projects. Culture is supportive of a work life balance and remote work. The only thing I did not like was that some departments would ignore contractors. Cisco was a best place to grow with.  I enjoyed every single day I worked there.  Ample opportunity to grow ones careers, to learn and to experiment.  Lots of leadership training is provided for top performers. This was a remote contract position and as a contractor, was expected to set up your own laptop, telecommunications, and applications with little to no support. Same thing for the actual work. Poorly documented and presented self-guided training with high demand on immediate productivity. While the group manager was delightful, she was largely absent from the day to day operations. The immediate supervisor was highly demanding, hyper-critical and largely unsupportive. It was expressed that it's a sink or swim approach to training. The work was extremely complex with little to no effective documentation. The only way I succeeded in this position was through the excellent and helpful other remote team members. Systems and procedures seemed to change from week to week, again with little documentation to follow. Not for the technically weak or the faint of heart. Great position, challenging, and very rewarding.   Great experience. No better place to learn Cisco Technology and how it works well in the technology sector.  Great way to bring in talent and to share efforts on very large projects. Outstanding ability to work remotely.  As a Global Company, remote abilities allows a leader to enable business needs WW, local time, vs asking others to adhere to US time zones. As a contracted, temporary employee, I enjoyed the opportunity to be associated with the company.I enjoyed the interaction and the opportunity to interview students from around the world! what can i say, a typical day at work is when everything is okay, and you  can learn something from the management.Workplace culture is good, the hardest part of the job is getting the clients happy. And the most enjoyable part is when everything is going good. energetic environment, start up vibeone of the first 'internet' companies because of its BBN historyno sure how it has changed over the years; company was being considered for an acquisition when I left Comprehensive  leadership changes from the CEO down has lead to a number of strategy changes, with no clear long term plan for success. Excitement and Morale among employees has been on the decline. Highly political culture with targeted reduction of age 50+ workers.  Claims to support remote workers but slowly and surely they are reverting back to an in-office culture.  May be ok to work here for a few years but a long career is out of the question. Definitely a company I would like to retire at.  Cisco give you the work life balance you need.  I would recommend given the opportunity to work there. I would work there again if I get the opportunity. I heard management and salary has improved. I enjoyed the fast pace environment. The name has changed from Scientific Atlanta to Cisco. Cisco is a fast moving company where success is to be earned every day. There are many opportunities to get involved and do well. There is no slacking off. Poor culture.  Not innovative and not attractive.  Not a very inclusive environment and employees compete against each other to get promoted.  Cisco has lost sight of what is important in order to grow. Was given many opportunities to lead several key initiatives.Cisco takes care of people!Many perks and discounts.Nice on-site health care, child care and gym. Work life balance is good .lot of very smart people.The hardest part of the job is that I had to work with a lot of cross functional team members, but I had to do a lot of investigation to find out who I need to speak with to get what I need. Great place for a permanent employee.  For a contract employee, it is very stressful and workers are not treated very well.  Contractors are not well respected here. Organization was not a cohesive one. Those that had been didn’t want to share information for cross training especially for contractors. They would hold onto everything they knew as if they were scared you were going to take their jobs. Great company with great values.  Strong belief in philanthropy and giving back to community, maintaining work-life balance and supportive not only within singular teams but company-wide. Not willing to give info, I do not believe this should be required in order to use this job board, my reasons for looking for a job are mine and mine alone A typical day at Cisco is fairly relaxed, yet busy. In addition to daily duties, there is always a quarterly opportunity to enroll in training courses for career advancement openings. While a great place to work, if you start out at the contract level, it will take quite some time to be converted from a contractor red badge to an actual Cisco blue badge employee.I worked for Cisco through 2 different contract agencies and dedicated 4 years there and still no permanent employment offer, despite positive reviews with management and applying for other open positions with the company.Although it's pretty tough to get your foot in the door with Cisco, they'll pay you very well when providing your services to benefit them. Great company to work for.  Amazing collaborative culture although it really depends on who your manager is.  Customer-facing positions are the most interesting. Cisco is laying off people continuously based on business decisions rather than individual performance.    This has destroyed the culture and teamwork as everyone is looking to protect themselves and protect their jobs.    Everyone has become a short timer as they don't know when they will be laid off It's a nice place to work. People are nice. However, the quarterly lay-offs create a bad environment. It would be nice to have conversion opportunity for contract employees, Must enjoy continual learning, and working alongside talented individuals working in a highly collaborative environment. A fantastic workplace if you find a good team of people and exciting products. At Cisco, management is keen on work/life balance, thus the working hours are flexible though, at times, it may require working eastern and international hours. This was a good location to work as Python Developer. I had a lot of free time for my projects. The environment is very good. Every one in Cisco are friendly. CISCO is undergoing major struggles to adapt to these times, whilst being at work, they changed direction and left 6000 employees out, even senior valuable technical personnel as in 'in depth knowledge' of technology.   Being the new kid on the block I tired to show my value, by developing (on my time) a platform that would have saved 240+ engineer's 3 to 4 hours a day in capturing data to perform the job they were hired to perform, saving close to 8 mill US dollars a year, but CISCO wasn't buying even though it was convenient.,  it is disappointing to see that one has shallow chance to move/advance career forward.     Has CISCO been a stable work-ground, I'd probably have better things to share, at the end of the day it is CISCO. energetic environment, start up vibeone of the first 'internet' companies because of its BBN historyno sure how it has changed over the years; company was being considered for an acquisition when I left I had been working for Cisco almost 20 years. Cisco is energetic company, I am always have projects to do during 20 years at Cisco. I constantly delicate my time of every day for Cisco, but I love all the challenges that I had in my job at Cisco. I have learned a lot from technical point of view, management style and challenges.The hardest part of the job is design a product to meet time to market with quality and cost, besides I have to deal with the line stop in production if there is any issue that occur in production line.  The most enjoyable part of the job is to deal with disaster in a fast pace and create a vision for the group. This Job is Productive and Fun to work with., Learned a lot and a lot of good work.Cisco is a great place to work, and provides wonderful career opportunities. Very fast pace when I was there. It was a great place to learn the business as there are a lot of smart people but no one was in the office. Everyone worked remote so it was hard to collaborate. Cisco is trying to change their business to generate more revenue from services. They acquire companies for that goal and lay off to keep same employee count. awful culture, awful people, high stress environment, they refuse to pay you overtime for hours worked and you're expected to be perfect with little/no training. NO learning curve whatsoever. Working for 20-years at Cisco is amazing experience. Provides start-up like environment for the pace of innovation and delivery and big company like environment to grow your self technically, professionally and as a person.. Abundant research content you can use,  top notch team around you, cutting edge tools and information..   Outstanding leadership and management.Great time working at Cisco. Good Place to work with good team, Learned new technologyies.working culture is good and supportive. Management will work closely with developer and understand our requirments. I had a great time interning at Cisco, but my interests changed recently. There are some good people at Cisco and it's definitely growing. Good luck!! Cisco has been a great enployer with fair compensation, solid benefits and challenging work. I have been able to work with and for some of the brightest people in my career. The environment is generally collaborative until budget & cost is involved. Recently, this has been the main focus of our organization.Cisco is very focused on developing early in career employees and continues to be a a solid resume builder. My experience with Cisco was my first as a contractor and my manager was abusive at first. My first day was cleaning out the cubicle I was assigned from the person that they just laid off. The manager pitted workers against each other and there was no opportunity to become permanent. Cisco is work-space everyone should wish to work at. I learned a lot from my manager and teammate. We used to have knowledge sharing session, Group discussion and idea sharing session along with some fun activity. Every Friday we are having team lunch where spend 45 minute with laugh,Joy and fun. Cisco has an excellent work culture. Very collaborative and supportive.  It is a fast paced environment with constant change and interesting challenges and opportunities.  It is a very competitive industry but Cisco still remains a great place to work. Good company to learn and earn, learn Networking, Distributed systems, good benefits, SW/HW layering, Routing Protocols, IOS-XR, IOS, Linux.Management is great. Good company - Fun environment - treats people well. Good professional growth and challenging environment. Great benefits and culture. A good place to work at. WellMy day starts at 6 am in and go work. almost everyday in the morning i have had a meeting to see activities with my co-workers and team leader  then the activities were assigned. during the day have come up others works and some times i needed move and do the Priority work. at the end of day I used to make a report and tell second shift for work pending I Enjoyed my work there because I did something that Loved Lots of opportunity to learn and work with amazing smart people all over the world!While I have been away for a while, I understand that the continual reorganizations and now culture of layoffs has reduced free sharing of ideas and disagreement as it may be too risky to present an opinion that challenges thinking of your immediate leadership...which is a shame.  Ideas, processes, solutions are best when they are the result of discussion and debate and when debate is stifled the best solutions are not always the ones pursued. Great people, fun culture.  Sales is competitive and can be stressful, weekly forecasts and aggressive quotas are the trade off for above average compensation Great Compensatiotion, Competitive work environment with lots of egos.  Lots of very talented people.  Lots of politics.   Strong focus on building great products, strong GTM and sales culture.  Positive but stressful culture. Cisco has a numbers, not employees and they love to cut those numbers to increase their bottom line. They care more about productivity than about the actual employees.  Our office had nearly fifty people when they bought us  and less than ten when I was laid off - everyone hated the culture. Pre-sales engineering for named accounts in service provider market space, including wireless WAN, VoIP, Telecom and Metropolitan Area Networks.Many varied opportunities to practice the 'business outcome' sales strategy. Many subject matter experts and technical overlays to assist in mixed technical environments. energetic environment, start up vibeone of the first 'internet' companies because of its BBN historyno sure how it has changed over the years; company was being considered for an acquisition when I left At Cisco, it is a great place to work and have a lot of training program. Employee can sharing your idea to team , your boss.Cisco has a great culture for all employees I loved working as a Co-op and found many opportunities to move onto the next role. It really is a family type atmosphere and they have an infinite well of information and training at your fingertips. Cisco fast pace and motivated and motivating workforce always brings out the best in everyone.  The people are smart and friendly and really care about succeeding. They hire only contractor and the ones that have been there for years have their nose stuck up their parts.  I liked the pay but its an empty office, only contractors show up Cisco hires a lot of great talent.  I enjoyed working with each and everyone of them and I enjoyed helping them to grow their careers at Cisco or elsewhere if they decided to leave.If I get an opportunity, I would return to Cisco. Being part of ENG in CISCO was a great experience. They had several fun events for their interns. The work was great. However, it is hard to say you will be called back for full time At first the work was very rewarding. Great travel to South America and domestic, but then all PMs worked from home and no travel. No more face to face with customers. Cisco also has the problem of trying to force the customer and partners to comply with their policy and software making a very difficult relationship often. Pay and benefits were really good but the stress of the constantly changing and failing processes erodes relationships within Cisco and with customers and partners. I hope they find their way some day The company moves at it's own pace, sometimes they drag their feet for months, sometimes it's hurry up and now wait for tomorrow.  Nothing is ever consistent, including leadership and even the programs they use from one group to another. Great opportunities to demonstrate your value.  Leadership excellence is important and instilled within management. Training programs provided at all levels and huge value add. Cisco has great benefits and volunteer give back programs.  Cisco has a great open door policy.  The leadership at Cisco is great. Advancement and changing roles is a bit challenging. Would recommend. This was a good learning experience. You get a feel of corporate work life, get assigned a mentor, and have several projects throughout the summer. I will be continuously working towards having a job like this.  I haven't officially worked for them I had an internship.   However the experience I enjoyed.   Currently I will be completing some certifications to bolster my chances of landing a job. Great work culture, working with sme of the most intelligent people in the industry and great opportunities for promotion vertically or horizontally (across BUs). I was an employee at Cisco for practically 3 years. I worked on several projects in their UC division. The people were good, and the job's were challenging, but the management was very difficult. I tried to get on as a direct several times, but was never offered a job. They pay well, but have a very narrow definition of what a productive engineer is. The company has been going down steadily since John Chambers gave up his office. Cisco is still a Titan in the IP industry, but if it doesn't change it's employee hiring criteria, and get some solid talent in their ranks they will continue to decline. I liked it, but it was just an internship.  Looking for further options.  They are on the table for long-term plans, but I don't know what else is out there. The people here at Cisco in Austin is really cool.  If you have a chance to work in Austin, this is a great environment to be in.  In general, the management are down to earth people who looks out for you and your career. I had started to work with Cisco  in the mid-1999's and it was the best job i ever had. I left due to immigration in the early 2000's  and my Visa ran out. It wasn't so much that Cisco could get any more time. The INS locked us out and Cisco tried to keep me there but they could not.Too bad as I was the initial product manager for collaboration. This is now called Web Ex! Cisco is a top notched company to work for, with a world-class CEO at the helm. I feel blessed to have had the opportunity to work for them for 10 years. Great benefits and pay and the best talent in the industry. I worked with a very professional group of people and it was the only company I have ever worked for, where there was no politics or drama. We were a remote business unit in Irvine, however the executive management team decided this business unit was no longer needed in their new business model. This was the hardest part about the job, 50 of us never saw it coming. It was a great ride however. Great place to work! Great people to work with. I would love to work here full time.  I had a good experience and learned a lot along the way. I would recommend Cisco to anyone as a great company to work for. My first years at Cisco were great. The last few weren't nearly as fun. Leadership changes (i.e. Chambers' exit) and bringing in HP, EMC managers changed culture to the negative. energetic environment, start up vibeone of the first 'internet' companies because of its BBN historyno sure how it has changed over the years; company was being considered for an acquisition when I left Great place to work, flexibility, the people are great and the location was convenient. There was a lot of training and communication with the higher executives This is a team that cares about employee happiness.  They work hard to find optimal solutions for employee retention.  Project timelines were flexible to ensure success The technology and people at Cisco are great to work with.  There is no limit to what you can learn and do provided you can find the time.  Often you have too many items on your plate and unfortunately only have the time to focus on the most critical. Always challenging work balanced with some fun.  Able to successfully deliver global complex solutions integrating Cisco products with best in class vendor products. WARNING - Cisco is not the company it once was.  Once Chambers left upper management has decided that engineering has no purpose other than improving the bottom line through 'limited restructuring', but the only thing limited is the severance and the warning given.I saw older great engineers let go and horribly inefficient younger engineers kept every quarter. The layoff process is completely invisible and no one is safe unless you spend a significant amount of your time 'networking'.Management spends hundreds of millions on products and then buys competing products rather admit mistakes. By far the most unproductive time in my career. Cisco is very easy on the 9-5 schedule. As long as the work is completed, you can work from anywhere in the world. It is very diverse and contractor to Employee differentiation is at minimal. Collaborative workplace with nice people and relaxed work environment. Organized, process oriented. Medium paced. Co workers were really nice and cared about team. It depends which team you work in Life was quite good at Cisco, Work from home, respect, and growth. Encourages employees to learn new technology, pays for the certification and you get bonus and acclaim once you do certification. Cisco is one of the best placed to start a career and learn technology around some of the smartest engineers in the industry. the hardest part of the job is the continuous changes in the direction of the company. Cisco is dependent on contractors to accomplish their goals, but do not feel any responsibility for their career, even for long-term contractors. I've had 8 managers in five years which guaranteed that they left us alone to do great work. If you're a contractor, don't expect recognition or reward. You won't get it. Great place to work except for the frequent lay offs.  As soon as your group is not the latest greatest thing in IOT you get laid off.  This happens every year some years more than once. *Love Cisco flexibility to work from home* Hardest part of the job is successful Agile Execution due to global company so meetings can be early morning to late evening I learned so much working with Cisco, and the name is a power house to open doors once you are looking elsewhere. The culture of learning is powerful here, and people really didn't mind you asking questions at anytime. I worked at Cisco Collaboration for a little over a year and I loved every minute of it. The work/life balance was unlike any other company I've been at. Actually, I returned to Cisco for their culture. My manager and team were amazing and I got nothing but support from them on the programs I wanted to launch. I recommend Cisco to anyone looking for a great place to work. I, unfortunately, left because I was a contractor and I'm very ambitious. na not m uch to say, Fortunately I was able to to my job and stay afloat..alot of people therealot of culturealot of up's alot of downsCisco is a big place, easy to find your way Worst workplace to work at with most of the managers and directors do not have a strategy to proceed with projects and try to hire as many consultants from their preferred vendors so that they get some cut from the vendors The first manager I had at Cisco was amazing. Amazing culture, fast-paced and I had a great team. The second time around not so much. The first time gave me the opportunity to learn and collaborate heavily, while the second time was the opposite. A great place to evolve your career and secure excellent compensation. highly collaborative people with amazing industry experience and opportunity to learn from the best. Becoming more silo'd and bureaucratic as time moves on. Many folks resting and vesting and not moving which leads to stagnation unfortunately. Cisco is a very large company so I cannot speak for every division of Cisco, but the collaboration division I worked in was a fun, fast-paced, exciting place to work with a lot of upward mobility and plenty of new challenges to keep you on your toes. The Cisco Sales Associate Program is a great place to learn and grow as a young professional. The Associate Systems Engineer role is deep and technical. energetic environment, start up vibeone of the first 'internet' companies because of its BBN historyno sure how it has changed over the years; company was being considered for an acquisition when I left Its a large company with many sub cultures within it. Some organizations and cultures within the company are start up like and fast paced while others move at a glacial pace. Due to its low growth advancement is slow for many thus there can be high levels of frustration. worked with some of the smart people, challenging project. worked on a project which helped Cisco $1M in maintenance costs. learned a lot as Product Manager. great work culture. Cisco was a great place to work for the 10 years I worked there. They engaged a lot with the local communities, gave a flexible work schedule and encouraged creativity and innovation. Enjoyed working at Cisco Systems, Management was very friendly, Learned full transaction model. Great work culture. great working with multiple teams sharing knowledge base. It was a great place to build my career until it unexpectedly ended with a restructuring lay off. I was very disappointed that after 20+ years Cisco had no loyalty to  my years of hard work and dedication. Worked at Scientfic Atlanta prior to being bought by Cisco. Engineering group was a fantastic place with extremally smart employees and great managment. People are nice to each other, compensation is very good in Dallas area, working hour can be long, but flexible.The only problem with Cisco is: it just can't stop doing layoffs. Enjoyed the flexibility of the work involved at the company; a typical day at work included going into the office and communicating with my team members on daily objectives, and freely working towards those objectives with the resources provided. The most enjoyable part of the job involved being able to work with experienced individuals and learn from shared experiences. It was nice working at cisco with some new technologies to learn and meeting new people with full of energy and skills.Project was challenging and intresting to work on with well qualified team members.Dealing with different amount of data through out the project make it tuff but achiveable Overall I enjoyed my time as a Cisco Contract worker.  My first team leader was flexible with time, plus or minus 30 minutes per week.  The team and work were both new, so we were free to make decisions and changes.  The environment was friendly and diverse with opportunities to participate in corporate activities.   As a contractor, it was a good place to work. if you are looking for chalenge and professional growth, this is the place to be.People are always available to support and there is a lot of  material at your disposal for studying and getting better. Cisco allows you to work from home and has great conferencing tools available when working with teams located in other cities. You have an opportunity to work on challenging and interesting projects. In the 2000s was a great place to work in the midst of Internet boom. Management changed fast, but initiative was rewarded. Cannot say howo it is today. Cisco invests in its people.  From technical to professional training, it is mutually beneficial for both parties.  Cisco is a valuable brand and having worked there was exciting. Good place to work with  very smart , bright and collaborative people.   Great work culture and good benefits.   Focus on global, diverse work environment .  Innovative mindsets. Provides good opportunities to learn, to grow and to go for certifications. Overall a good company to start your career at. Salary is on the lower-end Great tech, most people are outstanding  & share knowledge.Your experience will depend on your manager.  Lots of work, you will be putting in long days & weekends as well. A workday at Cisco included multi meeting with cross functional teams. A manufacturing and process engineer was a unique position in Cisco culture. Product development schedule are both aggressive and challenging. The hardest pert of the job was meeting schedules. However the work was interesting and always state of the art. Technical Solutions support is very important at Cisco and engineers have many opportunities to advance and learn.  Individual contributors are given all the training tools and encouraged to take advantage of them. Cisco is a good company as technology jobs go..I had a good career as an engineer..when I moved to a non-technical job, as a  service lead, and approached the 50 year old mark, I, like others, were targeted for age..The hardest part of my job was a poor manager, who gave no advice or 1-1's what soever..The most enjoyable part of the job, was collaboration with mutliple groups on a daily basis..handling escalted issues to resolution...if management and age targeting were not an issue, I would still be staying... energetic environment, start up vibeone of the first 'internet' companies because of its BBN historyno sure how it has changed over the years; company was being considered for an acquisition when I left Great company to work for.  I really thought that the training was great and the sales conferences were very useful.  I also liked the importance of the partner relationships. Worked there for 5 years with all other areas of the job itself were fine besides the advancement section. No wiggle room to move up and seemed to be more cuts than anything else. Great work place and have a fun ride.Rather than a typical 8-5, results matter in this company.  Its left to the individual on how far they would like to pushCompensation is based on the amount of work and risk, one is required to take.Overall the best company to work. Great place to work.  Unsure about the future, layoffs happened yearly.  Salary was a bit under par for the position.  Worked for Scientific Atlanta / Cisco for nearly 18 years. Due to the size of Cisco there are always new opportunities to explore, your role can be quite diverse and vary but this is up to you to create and drive. Flexible working is great, however it can become difficult to switch off from work. Overall great experience working at Cisco for 18 + years.  Good for people starting out in their careers and build a long term career with opportunities in many new technologies Cisco is a great place to work.  A lot of camaraderie in the workforce and everyone puts a tremendous effort into customer success.  Workdays can be long and stressful, but the total package makes it worthwhile. Enjoyed working for this company. Great culture and great people. You work hard, but it is worth it.  It was great working for a company and will love to be able to work for them in the future. I'm a part time teleprompter operator for Cisco TV. They are all very nice there. They pay very well and treat us very well. Although I just started I feel like they have a lot to offer. Only reason I'm looking elsewhere is that there is not enough work to keep me coming in. Organizationally very challenging given I was both remote and Cisco was going through many changes at the time. I wish the environment was better at the time as I believe it would have worked out. This was a great company to work for. In my position I was empowered to go where I needed to with all the resources I required to get critical projects back on track and improve customer relations. With that unfettered authority I was able to quickly resolve issues across the north east and increase sales. 15 years at Cisco ... I saw it all.  From it very earliest years to it's full maturity.The culture is open and geared towards allowing freedom of creativity and promotes/rewards tenacity, persistence and commitment to winning. I got a remote position and love it. I am uneasy about job security since Cisco tends to do layoffs annually but overall am happy I decided to work for them. My team mates are a bit competitive though and reluctant to collaborate. Over all a great experience. I was in the CALO lab as an intern on 2nd shift. Rough starting out as I had been told we would have a month’s training. I got 1 day of real training by someone who had only been there 3 weeks. I ended up being retrained later on. They expect you to hit the ground running. Those with stronger IT backgrounds did fine. I was switching careers and needed more time orienting coming in.  If I had been paired with someone who know what they were doing for a solid 3 days then I think my transition would have been much better. Did better once I was moved to 2nd shift, where more advanced workers were able to correct some of the training gaps I had. Over all experience was good. Just trouble starting out. Managers should not be advertising a month’s training when they are not giving that. Overall, Cisco is a great place to work. The benefits and compensation are better than average, however; the change in leadership over the past few years has caused a serious change in culture. Good working environment, but tedious at times when I and my team have tour groups to take care of or to lead. I have gain extensive experience in working with this company as an ETL/SSRS Developer. I usually enjoy when ever I satisfied my clients especially when they are on site. Cisco is a stress free environment with a great group of team members to collaborate and/or bounce ideas off. Work ing on a daily includes meeting with the team and reviewing tasks to be addressed that day. Its a great place to work. Good work culture. A very collaborative environment. Provides adequate opportunities to rotate within the company. Will recommend to work here. Cisco Systems, Inc. is an American multinational technology conglomerate headquartered in San Jose, California, in the center of Silicon Valley, that develops, manufactures and sells networking hardware, telecommunications equipment and other high-technology services and products Typical day consists of getting caught up with issues or aftermath of previous day's work. Continue with current tasks at hand before mid-day team meeting to get brief on everyone's statuses and updates. Continue with work after lunch until you choose to leave. Open come-and-go work-life however it is expected that you complete the assigned tasks in a timely manner.Hardest part of the job would be trying to meet unrealistic deadlines that other teams and higher-ups are waiting for. The most enjoyable part is the teamwork and open collaboration. energetic environment, start up vibeone of the first 'internet' companies because of its BBN historyno sure how it has changed over the years; company was being considered for an acquisition when I left Good work environment.  Helpful staff.  Lots of opportunity to upgrade your skill level.  Worked on 3 separate contracts which all helped my career advance. I would set up training labs and cable and configure all devices.I learned switching.Management was good.work place was good.there was no hard part to the job.Most enjoyable part of the job was the training and learning new equipment. A typical working day for a remote engineer is normally coordinated by Cisco Web-ex / Jabber Chat to review upcoming task and duties.Schedules for specific functionalities are sent via email and a follow up on jabber chat. It's a friendly environment that supports growth and talents. Proud to work for Cisco, they are a great company that tries to make a positive impact in the world. If you love the technology field, definitely strive to work here. Ended up with a weak team resulting in a short tenure. The company is awesome and well run with a few exceptions. Cisco is on th cutting edge of everything, cool place indeed Good working environment, some times too much work. Good working environment. Learning experience is good. Healthy environment to work. management is good and supportive... Cisco was a dynamic place to work in the 90's and early 2000s.  It became a very political place prior to my departure.  I valued the relationships that I had fostered with the sales teams, engineers and executives I was a consultant. Not a full time employee of Cisco. It was a great learning experience in Cisco. Completely home grown software development using latest and greatest technologies. Great place to to work as anew hire and gain experience. Flexible work hours, but availability needs to be throughout  the day.Learnt how to be a team leader. Too many hours not enough pay, The supervisors there are only looking out for their own best interest and are willing to fire any employee just to make an example to the rest of the staff. Great place to work, excellent benefits, improved my skills in SQL and SaaS. Introduced to several new applications and I used the Tuition Reimbursement to further my education. It is an international company, so there are many meetings with international groups from India , Serbia, Ireland.I was part of the team that made VoIP what it is today. Team collaboration, diversity, customer satisfaction are what makes Cisco an amazing company. Those cultural characteristics are very important to me. My key strength is collaborating with coworkers in time of stress to accomplish the project or group of projects and coping well with stressful situations. I worked with many people on the CAP (Critical Accounts Team) that needed answers and specific setups quickly. Technology development and learning is a continual process. I expect to keep studying areas that are linked to Communication Voice solutions. Cloud technology and artificial intelligence are areas that have or will touch many technologies, including VoIP communications. It is a great company. Lots of opportunities for training and developing new skills. Gets a variety of experience in multiple technologies and customers. It wasn't stressful at all working at Cisco. However, it often felt like you need to find your own work. This short time I worked at Cisco I spent a lot of time doing charity work. I was part of a team with 112 people but only 9 of them were Cisco employee rest were all contractors. It is Cisco, great technology, Great co-workersThere are management issues, a lot of re-orgs.  Poor benefits and Salary is low compared to industry. Excellent work place and culture. Cisco provides a challenging environment and offers a wide range of opportunities to grow. Cisco will provide a technical growth in any areas that you are willing to learn. Great place to get your feet wet when first entering into the job market. I left because of how slow the management was to enact ideas as well as the constant reshuffling of leadership. the employees are great at Cisco, its like a 2nd family.  Doesnt matter what team you are on they are always open and willing to talk, even the reps that are remote. Excellent overall. Great work/life balance, great pay, great management and culture. Beautiful campus, beautiful buildings. Solid SOPs/KPIs for logistics operations Cisco is good. Learned a lot about soft skills and client facing skills. Dedication and commitment is what I learned from my Cisco Management. They need perfectionists. energetic environment, start up vibeone of the first 'internet' companies because of its BBN historyno sure how it has changed over the years; company was being considered for an acquisition when I left BEST JOB EVER.  I have never worked with so many high level professionals before.  Each and every member of the team was the cream of the crop in their own way. this is a good place to be I'v been here for about 5 years since i was a fresh grad and now i work in another technology that was completely new to me but its all good I've learned a lot at CiscoI will recommend to work at cisco it is a good place to work and the benefits are goodyou need to dedicate time and have passion for what you dothe job is good Good work - life balance. Big company. Employees can explore different opportunities inside the company if they are saturated in one area. as you move up in the ladder, politics will rule. •	Used Spring IOC (Inversion of Control)/DI (Dependency Injection) to wire the object dependencies across the application.•	Involved in Analysis, Design, Development, Integration and Testing of application modules and followed AGILE/SCRUM methodology. Participated in Estimation size of Backlog Items, Daily Scrum and Translation of backlog items into engineering design and logical units of work (tasks). It's quite an interesting place to work with an amazing culture. Indeed work and play is cherished and as a matter of fact results in productivity.The environment is very cozy and the staff are friendly. Get to learn new technology like switches , teleconferencing and new technologiesWorkplace was very friendly. Employees wiling to share new ideas , technologies and help Cisco is an enjoyable place to work: where employees work hard but know how to have fun. The pace is fast, the people are quality and the atmosphere is real intelligence. Highly recommended. I liked my experience at Cisco because I learned a lot by working with a lot of very smart people. It is a very competitive place, so it is not good for someone who seeks work life balance. I was well compensated, but along with it the compensation, I felt obligated t go more than was asked in order to remain relevant within the eyes of management. The hardest part of the job is that I had to work with a lot of cross functional team members, but I had to do a lot of investigation to find out who I need to speak with to get what I need. The company is very disparate, instructions tend to be very vague, and those who can come up with ways to solve things on his own the fastest wins. I was constantly faced with balancing areas that are overly prescriptive with areas that were overly vague, yet management expect very specific outcome, and you don't necessary know what they are up front. Annual restructure disrupts business and lowers morale. Poor leadership. People are put into leadership roles based on their performance, not their ability to lead. I love this company! I was able to work from home 100% of the time. The workload is demanding however, doable! I found myself working harder and being more detailed and more productive since I was able to work from home, I gave more of myself to the company :) Really enjoyed the work culture, quality of people and products. But company is going through transition and stability could be an issue.Overall, a great company to work for. Lots of politics.  Not recommended. The people at Cisco were very confused.  They pulled quotas out of the air. Very unprofessional. Hard to believe they were still in Business. Great place to gain experience and great team players.  I was employed at Cisco for 21 years and gained a lot of knowledge and experience.  Great benefits and a team player environment, I highly recommend working there. •	Working as Sr. Billing Analyst for Oracle BRM product.•	Responsible for designing new solutions that streamlines charge calculation period based on different combinations of input parameters defined by the partners. I worked as Oracle EBS supply chain functional consultant in very complex Cisco's supply chin IT group. I got the opportunity to work in most complex suppply chain IT business group. If you have a problem with biweekly commit calls and dealing with forecast accuracy and cadences , then CIsco is not the place for you , but it's a great company to gain a lot of knowledge and experience to further your career Learned valuable scripting and testing knowledge and working in industry standard code and projects. Learned a lot about working with a team and work on other employees code. Great environment and teams to work with, enjoyable and professional coworkers. The work which I had done here is related to my masters coursework. I learned about new networking concepts and I also got more knowledge on Python and C Programming. In the labs there was various amounts of networking tasks to do which included racking devices, configuring device and cabling them too. Also we worked with other engineers to complete projects/cases each day. energetic environment, start up vibeone of the first 'internet' companies because of its BBN historyno sure how it has changed over the years; company was being considered for an acquisition when I left We were required to meet our business sales goals quarterly. We were required to reach out to current and new clients for new business daily and document within their software. Business meeting two times a week with Regional Managers to discuss goals and whether we met or exceeded those goals. If you are interested in a telecommute friendly work option, Cisco provides a good flexible workspace. Meeting heavy culture. A typical day of work would start with global meetings with different stakeholders groups located in different time zones. Great place to work for.  I was brought in to be a consultant to their implementation of the IEX Scheduling Software and work with an outside vendor.  Created processes from scratch to implement to the associates. Cisco is an above average to great employer. In my time there, I met some of the smartest people I've ever know and learned much from them. Certainly one of, if not the, best places I've ever worked. As a developer I really enjoyed working for Cisco even if most of the times I had to work long hours and under small stress.  It's a vendor company in a very competitive area. They need to be head of their competitors and get the maximum customer satisfaction. That's why there is a constant pressure on engineers but this is what makes a Cisco engineers the good ones if they work on latest technologies for few years. Benefits were good and I loved their PTO I had plenty.  I had even askd to work remotely for longtime because of family needs and they were OK. So management and the culture was like as long as you do your job with high quality, they will take care of you. That's why I spent 17 years there. Working at Cisco was a great learning experience! Excellent work life balance, new career opportunities, excellent leadership opportunities, nice pay and collaborative environment. it was an amazing experience , worked on myriad of  cutting-edge technologies , Across the customer care space , that includes upgrade , implementation Cisco has been a very conventional company which is trying ot reinvent with new structure in cloud era. There has been a few changes in office space and culture. Great culture, environment, and the best coworkers that I worked with. Everyone was smart, nice, and helpful. Good work/life balance. I really enjoyed working here. Cisco is a great place to work.  It is filled with a high level of talent and also creative and team oriented workforce.  It is a great place to not only apply your knowledge but also learn. I wasn't a permanent employee so I only worked there 8 months.  I was laid off from my contract. Great group of people to work with however. Everyone very smart and good to work with. Good company, with good benefits. Stressful job when you are far from the quote, collaborative environment where you can get as much help as you want. I enjoyed working at Cisco very much. There were highs and lows of workload but whenever there was less to do myself there were always people willing to teach me something else Average work day consists of collaborating with fellow coworkers to progressively work on projects assigned to us by the Supervisor in charge at the time. Can't say enough about the wonderful people on my team. Great leadership, kind and helpful co-workers, able to work from home, great team building events. OK place to work.  Was fun and vibrant, now constant layoffs create a scared culture.  Poor executive communication.  Porr opportunity for advancement.  Good compensation and  work life balance. Cisco was  a good place to work at if you were hired by Cisco and not one of the firms they contracted with to hire people. Employees hired by Cisco enjoyed many benefits that the contractors did, but the other contractors I worked with had an opportunity to shadow others who worked with the company in different capacities and potentially join those teams. An experienced senior level IT consultant with significant design, support, administration and implementation experience of network projects.  Over 10 years of IT experience with full life cycle ICT project experience.  Thrives in a customer focused, multi-site environment. Always meets client demands and develops good long-term customer relationships. Cisco is a great company to work for, specially few groups have cutting edge technology project. Its great to learn and expand as it provides great horizon and invest on its employee to grow and collaborate. Very good. I would recommend anyone who is starting their career in IT industry to start with Cisco. You will learn the product and customer support relationship in depth. energetic environment, start up vibeone of the first 'internet' companies because of its BBN historyno sure how it has changed over the years; company was being considered for an acquisition when I left More Generals than Soldiers.Red Tap.Super Inefficient.Great Benefits.Low Salary.Company needs to re-establish its brand and its business. Don't companies which you can't handle. This is a great company to work with excellent career growth and amazing work life balance. Fast paced yet rewarding with great opportunities for a Project Manager. Highly recommend working here! collaborative and innovative atmosphere.  I love working there and hope to be able to get back on with a department there again.  The work life balance is awesome. Territory based service sales, if you achieved your quota you were rewarded accordingly. Fun environment, Great management support.Team Lead positions opened up for those who wanted it, I chose to create a new Operations role which is what I am doing today at different company. Its a good place to start and learn .  But to grow or to learn new skills its better to go beyond the Cisco. It has excellent infrastructure, but its very hard to advance in  career A great place to intern. Pay was generous (with sign-on bonus), and the environment was great. I was encouraged to learn, even about things not directly related to my internship. Upper management seemed good and made an effort to be transparent/communicate with everyone. Vendors would often visit (usually at least once a week) to discuss future projects/solutions, and they would usually bring breakfast or lunch.Best of all, I had a GREAT mentor who really helped me to learn a lot. I worked with the best of the best Engineers, Marketing and Sales departments, project managers, Senior Management, and participation in Acquisitions and Mergers.  This was very rewarding in a personal way.  The salary followed the success I provided.Trust of Management at every level.  Managers had high expectations but also prioritized very well and supported me in my recommendations and my expertise in my assigned areas.Cisco created a new position rank with better salary explicit for myself and one co-worker.  We were the first two Engineering employees that drove the need for this higher level position and that displayed Cisco's ability to recognize and reward talent. If you enjoy a fast-paced, VUCA environment where you can take ownership  and responsibility for the success of a project, then Cisco is a good choice for you.  If you are a person that is more comfortable with predictable processes and structure, then it would not be a good fit. Extremely competitive workplace, long hours, never really 'off the clock'. Very stressful, management issued unreasonable goals and expected them to be achieved. Cisco is a great place to work.  It has is a fast paced collaborative environment that is very inclusive.  I enjoy the flexibility I have in terms of workplace (home or office).  Very well managed. I worked in a corporate role; Company is built on its technology, which enables an amazing global workforce.  The flip side is it is a 24x7 job - work follows the sun, but also depends on leaders to show up to maintain global presence and alignment. This job is very flexible with you. The work has a decent pace. You can be busy everyday. It will test your ability of learning things on your own but also in a team. Great coworkers, good culture. Great life work balance. Lack growth vision from the upper management. Bad investment on companies which wasted alot of money. was working on a project for Cisco Systems. The most enjoyable part of the job was that I got to interact with a lot of different departments throughout Cisco and work on a very unique project Flexible hours and able to accomplish and learn at the same time.Working at this company gave me an opportunity to stretch myself and learn more, increased my overall level of knowledge about the processes in the area of business I was involved in. I was a contract programmer for Cisco. I found Cisco to be a wonderful company to work for. Its tools and team spirit have spoiled me. My contract went well, and I can give references from all the people I worked with. Funding for our project was cut, so I and another contractor were let go. Working for Cisco once was a proud moment. Now every 6 months Cisco has layoffs. Employees at Cisco always feel that there is a sword hanging over their head and it may fall on them at any time. Lots of politics, lots of the right hand not doing what the left is doing.  All of the decisions and priorities are made so high up the hierarchy that the managers and individual contributors have no say in what they should / could / do. On a typical day of work at Cisco you will face challenges that will help you to grow professionally. Environment is highly collaborative and face faced. Enjoying my time at Cisco as a contract worker, however seeking a full time opportunity with a equally dynamic employer to grow into and creature tenure. I was a contractor so wasn't fully integrated into everyday life there, but from what I saw it was great.There is not much more to say really. blah blah filler words. you guys are so pushy with your minimums, I can't click 'next' until I meet them. sheesh. energetic environment, start up vibeone of the first 'internet' companies because of its BBN historyno sure how it has changed over the years; company was being considered for an acquisition when I left Cisco is a very large company and it can be difficult to get to face to face meetings on time. The culture there is very forgiving regarding this issue. Work life balance was very good. I found Cisco to have an older, more traditional and serious workforce than I had experienced in previous Silicon Valley jobs.  However, they were skilled and dedicated, and I enjoyed the work and the team interactions. Since my contract position was very focussed within a small team, I was not able to clearly evaluate the broader interactions that I might have experienced as an employee. I would certainly take another contract there if offered. Enjoyed working there. Good management. Good working conditions. Good team work. But, difficult to get converted to full-time. I heard these days it is getting difficult to extend the contract also. This is a great place to work. Lots of opportunities to learn and advance. People are supportive and it is fun to come to work every day. Benefits are also great. -Plentiful resources are provided to further education-Workload and stress can very widely-Encourages cooperation and knowledge sharing-No PTO is give even on holidays. I enjoyed working at Cisco.  I felt challenged and the work environment was balanced and flexible.  I was able to come in at 6am and leave by 3pm to avoid traffic. I learned so much in this environment and had a great time doing it. I still have friends in the industry who like me have grown and moved on to higher positions and responsibilities with other like companies. Work hard, but very good work environment, well respected. collaborative. I learned how to manage multiple projects and lead a team. Unfortunately the area I worked in required the employees to move to North Carolina and I was unable to make the move. The team I worked with at Cisco was very cooperative.I have learnt a lot at CiscoThe work culture is good.The environment was good.The overall experience was good. The company had easy to understand top down goals and objectives that every employee could align to so everyone's work actually helped the company meet its overall goals objectives. Cisco is a global technology based company; fast paced and friendly. On the Sales side of Cisco the culture is great. Management allows you to work independently and check in when needed. You can always get help from your peers and the company is very much about putting their customers first. In my role as an administrator, I am very loyal to my work. I  have learned so much about the importance of sustainability. It is a very project oriented atmosphere, so contractors aren't likely to convert and will stay. Cisco is an excellent company to maintain work life balance. I worked most of the time from home and being a single mom it helped to raise my kids.The managers were very supportive and made sure our team had visibility to the executive leadershipThe hardest part of the job was to jump into a call at odd hours as somecross-functional teams were in India or far east. A typical day consist in coming early in the morning, then I dial in to the morning conference call. During that call we go through the daily requirement, then off to work for the rest of the day with a lunch break. I do use the Gym by the end of the day. It's a big company with many talented, bright professionals throughout.  The company is going through transformation to drive recurring revenue and to have a portfolio that is tuned for current customer needs and expectations.  Over the past several years, interest in CX and UX has increased. Investment still lags other companies and is not uniform; some areas are turning the corner faster than others. If you are a contractor Cisco doesn't seem to care for youSeems to be divided between blue employees and red employeesHorrible on-boarding process I enjoy collecting money for Cisco WebEx. I especially enjoy when customers get angry with me and want to fuss about what they owe. I enjoying helping those customers who want to understand how their payments were applied and how to reconcile their account. Over a number of years, I have experienced working in various organizations at Cisco: - Global Marketing and Events - Technical Support (customer support applications) - Cisco collaborative communities - Entrepreneur program - Investment portfolio company developmentThe culture is one of trusting the people to get their work done, whether working on site or telecommuting.  As a consultant, I really enjoyed the flexibility, collaboration, and sharing my skills and knowledge in the various Management Consultant roles I have played: Event Manager, Project Manager, Program Manager, Operations Manager, Chief of Staff.The most enjoyable part of working at Cisco was the variety of work.  One can keep busy, take on new responsibilities and not be bored. Very hands off, but just didnt seem to ever check in with their employees very often at all.  They did respond to calls and or emails, but I just think they were a bit too hands off.I signed on and specifically ask if this contract would be a garanteed 40 hour week, and I was assured that it was.  However, my hours dropped down to around 15 hours per week, and after three months of asking for additional work, didn't receive any even on other projects where my skill set could have been used.  They then were like why are you leaving us, and if you had told us you needed more hours, we could have helped with that.  But with the far out hands off management style, and my even asking for additional hours, nothing happened until I turned in my notice for a new job. Mature company with good benefits. Company can be good for people with families and who seek stability, though the constant rounds of layoffs can be depressing at times. Can be intense or more laid back, depending on the team.  There is room to grow in both knowledge and career; however, I do wish there were a little bit more upward mobility in career. energetic environment, start up vibeone of the first 'internet' companies because of its BBN historyno sure how it has changed over the years; company was being considered for an acquisition when I left Personally I've had 6 different supervisors in my 3 years of being with the company. Look form a more stable leadership which i can build a relationship with. Cisco Systems can be a great place to work if you have patience to deal with limited upward mobility and constant change of managers.  The pay raises are few and far between, but the benefits are top notch.  There are numerous opportunities at Cisco, so you have the opportunity to branch out, but the hard part is getting your name known to those who would be responsible for hiring you.  Overall, I would give it an average overall rating with the potential to be much more. A fantastic company with a great introduction to advanced technology. Great management team at all level.  Friendly work culture.  The most enjoyable part of my job was exposure to trend in technology. I have been working at Cisco Systems as contracter since last 6 months Best Freaking Place to Work, Grow and Play!I have been with Cisco for 6 months  and I am truly excited each day because I have an opportunity to think about my current role, my opportunity to grow and most important my value to the community and believe it or not earth.In my role, i have learned so much about the importance of Sustainability During my experience at Cisco, it was a professional environment and the ability to work with various geographical locations using the on line Webex was a great tool that I used before going to building location and also in evening working with India in evening hours from home and weekends. I found Cisco to be an exciting environment which allowed me to expand my skill set while working with state-of-the-art solutions. Everyone was a team player & did what was needed to deliver an exceptional customer experience. I enjoyed evangelizing and demonstrating Cisco solutions to a wide cross section of customers from around the globe. During my time as an Analyst I was able to get support from all teams & Management. Lots of benefits were offered, working from home is a plus especially if you have a new family.Daily tasks were always manageable, even at quarter, monthly & year-end close. These would be the most busiest times but our teams were always on target & accurate when requests were made.Excellent place to work!!! As is typical, Cisco employs people with no experience in a field to manage the work in it.  A finance director is always going to fail at Communications and should not manage the function.  Example:  If employee had a question, employee had to schedule a meeting with manager...who sat 10 feet away from employee.  Finance director afraid to show she knew little about what she was managing.  Cisco as a company is awesome. no comment for this particular job, other than that the fact that important information during the hiring process was excluded and the fact that upper management is selfish when it comes to employers personals or job entitlement. Cisco is re-adapting to the changing times. Hardware is no longer as profitable so it's switching to software. The right people are being promoted to create a good environment to work in. Good benefits, Advanced Technologies, Collaborative, Career progression, Fun place to work, sports, child care, free sodas, lots of perks, Excellent compensation, training When I started with Cisco in 1997 it was a great place to work and learn. Management cared about their employees and if you performed you were rewarded. Over the years those trends started to fade away and Cisco. Cisco became more interested in numbers rather than individual productivity and development.When they restructured they were not interested in maintaining the long term talent just making numbers. Was a fun and inspiring experience for an internship.  The application process was easy.  The interview was very relaxed.  The only downside was that there weren't more out of state interns in the group. work place culture was awesome from bosses way on down to the guys you rub elbows with on a daily basis you could not ask for anything else from a job like CISCO. Ever since I began working at the residential networks department at my university, all I could think about was working at Cisco full-time after I graduated. It's the company everyone mentions when talking about the Internet or computer networks. I gradually shifted my interests from software engineering to network engineering while I took computer networks courses and interned at Cisco.In 2016, my days began before 8am and ended around 4. In 2017, I started at 9am and ended at 5. Both roles (Network Engineer, IT in 2016 and Customer Support in 2017) gave me good insights into what a Network Engineer could do (i.e., everything). Both of my managers were supportive and pushed me to do better.I enjoyed the freedom to work on anything, as long as it helped the team and allowed me to grow my technical knowledge. Spent more time figuring out process than managing projects. Bounced between 3 different managers and many different types of projects with no training. Cisco is a fast-paced company that follows no technology religion.Every day at work can be used to learn something new, and often this aspect can be overwhelming.The workplace culture pushes junior engineers to learn, taking classes or boot camps related to the job field, but also promoting people to build up their own study curricula (Ex: paid college classes to learn Java)Management was always careful on balancing supervision and freedom to choose the best approach to the solution.The hardest part of the job was to address unplanned issues, especially customer found defects that required a lot of extra effort and time.Most enjoyable part of the job was being able to propose your own solution and being surrounded by a team of people who really care to get the job done. The place to work at if you are looking for career in IT and. Cisco employees know that they we are changing how the world works and it starts with us! Cisco offers a lot of facilities and benefits to employees for entertainment, well-being and networking. However, there is not much in terms of challenging work assignments and career progression is slow cutting edge technology good work life balance ability to work remote as needed.  Management allows creative ideas.  Fast paced work environment, challenging projects. energetic environment, start up vibeone of the first 'internet' companies because of its BBN historyno sure how it has changed over the years; company was being considered for an acquisition when I left The best company I have ever worked with. The management knows exactly what they are doing. The CEOs are excellent. The people like to share their knowledge. Great stock in the 90's!Promoted 3 times in 7 years. Cisco is a good company to work. we have friendly environment in the project and they have good management and employee benfits.I have learned many things in cisco mainly developing my skills and adopting new technologies and working with different teams helped me in developing my communication skills, Cisco System is a great company to work for. They pay well and provide excellent benefits. The management is well trained and the culture is inclusive, fun and yet challenging. This job although not extremely challenging was probably the best position I've had.  I learned a bit and worked with the best group of people since I left the military. start at 9am, ends at 7 pm.  Not good for health.management lost directionWorkplace culture is good, fun place. you may play table tennis with team mates, and balance your life, if you have free time.But you don't.Stressed up work schedule.Lot of PMs to manage few engineers. Most managers are old timers unable to get technically Cisco is a great marketing company, whose hardware technology has improved over the last few years.  They are not a software company and an expensive option for services.   Successful employees are forced to look out for the themselves, which often causes conflicts with other employees, partners and customers. The things I'd learned, and the skills I'd acquired while working for the comapny were invaluable. The solid foundations served me very well down the road. Available on request- After 16 years at Cisco I have a wealth of experience I can share with prospective employers that goes far beyond what I can fill into a box here on the Indeed website Great work life balance, value add to teams and good opportunities within company. Wonderful environment to be in.Very good benefits, wonderful people to work with. Owner/President is firm, but fair.  Gives management to tools to do the job and constantly doing things for the employees.  Pay and benefits are great and people are good. Makes you work like a donkey without regard for recognition/reward/responsibility. Very political place, racist, had colleagues trying to convert me to Christianity. Management is only interested in cya. Prostotal compensation package and benefitshands-on experience with products while delivering servicesface-to-face customer interactions and relationshipsrelationships with managers, directors, and higher levels of leadership hierarchyinnovation actively pursued and appreciateddepartmental alignment and support, inter-team relationshipsConsinconsistent contracts compared to customer expectationshigh expectations of service delivery with significant churn of tools and techniquesinformation glutdifficulty tracking higher level leaders compared to day-to-day operationsincreasing inequality between leadership levels and individual contributorsworkload scheduling difficulties and poor alignment with available resource schedule Cisco is the best company I have ever worked for.  Cisco is family focused and provides excellent work/life balance. The company has hired and produced excellent management to create a great environment. Cisco's culture is the best there is, in here you will work with people from all around the world which allows to expand your own knowledge. Advancement is slow but the benefits are between the best there are in the world. There is a good balance between persona life and work. The people are nice to work with but the environment is not very stimulating. The culture should embrace change. Its very apparent that the left hand has no idea what the left hand is doing... WAY to top heavy!!! Mgnt located outside of SJ and typically out of state.... I was extremely busy at Cisco when on contract there.  I found it to be very cut throat.  My manager could not function without someone else doing her job for her.  It was very strange. Just when people were counting out the company, it has surprised everyone by becoming more profitable.  Let us not forget that this has happened because they have laid off many people over the past six years. expectations for influence on others outside the organization are unreasonable.  compensation is great, benefits are great, and ability to work from home. CISCO does not enforce their own policies about family or personal issues. In my case I had a major back surgery and was threatened with being let go if I took too much time off to recover. Then my son had a major life threatening accident and was told 'I didn't need to take care of my son' regardless of being a single parent. energetic environment, start up vibeone of the first 'internet' companies because of its BBN historyno sure how it has changed over the years; company was being considered for an acquisition when I left Cisco typically only hires really smart, dedicated and talented people who work really hard and are good at what they do. It's a great environment from that perspective. Salaries are competitive, and benefits are really good.Level of bureaucracy is really low for a big company. It feels much more like an overgrown startup than a $50B/year Dow behemoth.Expectations are always high. Work/life balance is only valued when it doesn't interfere with your ability to get the job done--no matter what it takes.There is a current trend toward laying off the higher-paid, more senior US employees, and hiring younger talent, especially outside the US (lower wage areas). If that's you, and you're really smart and motivated and good at what you do, Cisco may be a good fit for you. I have been working at Cisco Systems full-time (Less than a year)ProsWork/life balance. Dedication to pay/parity. One company--multiple opportunities for different careers. Org. is very flat and collaborative.ConsIf you ever leave Cisco, you won't be able to go back to a traditional 8am to 5pm job again because Cisco spoiled you with their work/life balance. Work environment good for permanent employees with options to work from home and good benefits. Unfortunately, not much hope of getting hired on permanent. There was bad management in the end and lot of favoritismLots of night meetings because of india teamsLess co-ordination and transparencyGood pay and benefits Overall it was by far one of the best work experience I have had. The people there are very friendly and everyone wants you to succeed! I love it there and you will too! Great company to work for, very laid back culture and you get plenty of parking. I enjoy working here, everyone in the company are very friendly. I got helped from my co-workers from other team. Cisco is a massive machine with many opportunities for business, operational, engineering and technical sales.    You will learn a lot.   The culture is very fast paced and competitive. a wonderful place to work, the GPMO is excellent and the culture of change at Cisco is one that I can get behind!  Everyone behaves like real human beings there. Worked with UK team (via video and SJ teams (2/3 by video and the rest in person).  Morning meetings mainly b/c of UK aspect.  Various meetings throughout day including AGILE daily scrum, weekly bug prioritization and bi-weekly planning sessions.  Weekly customer troubleshooting.  Weekly report compilation.During my time at Cisco I learned much about how to avoid conflict in a team environment before it became a problem, how to cut down to the bare minimum in order to communicate status in quickly and easily digestible forms, and perhaps most valuable learning about other cultures and in some cases religions given the demographic makeup of the teams I was part of and interacted with (Cisco prides itself on diversity)Management was clear and fair and efficient, I very much enjoyed working for all my managers throughout my time at Cisco.The hardest part of my job was during the final push towards release date, as there were many ISO-9000 mandated gates we had to complete before release, but needed to be far enough along in development before we could start this activity.Easily the most enjoyable part of my job were the people I worked with, who were dutiful of their responsibilities, as well as being fantastic, funny and fun people to work with.  I thought I would hate the move to open floor office space, but in fact loved the social aspect of it. Joined Cisco after finishing masters. So great learning, many talented people around. It was a bit slow when it comes to doing something new but everyone was very thorough in what they do. Its a very well oiled machine that delivers on planned things year over year. When it comes to new things, there is always analysis-paralysis and too much scrutiny and quarterly benefits. Though, this culture is changing slowly. - Most enjoyable part of the job was the flexibility and balance of life. It let me work from home.- Typical day at work consisted of me signing onto webex, responding to escalations, working with team on projects, and handling individual work Great team work. Love to work at Cisco. Lots of potential to learn and grow. Great management. Flexible hours. people are friendly and help you a lot. Cisco is a great place to work for longevity and stability.  They continue to innovate and enter new markets, deepen relationships with existing customers. Very supportive of work-life balance. Suitable for a person who is looking for stability to focus on other aspects of life (example: family, traveling). Place to work in networking and communication - you do not get this often at other places. This company has products which powers the global internet. I have been working for Sellbytel since June 2017 and it's been the best experience I've ever had working as a contractor for Cisco. Management is very easy to work with on both the Cisco and Sellbytel side. Cisco's current culture does not represent the current tech culture of fast, progressive atmosphere. It is a comfortable environment, but difficult for professional advancement. With new executive management, I believe they will have continued changes over the next couple years to change the company culture more modern. - Excellent company to work for. - Excellent Open and collaborative Culture- Opportunity to grow- Learning and career development resources available. - Cisco's assets are it's people. Much collaboration internally to engage customers efficiently and accurately. Dedicated individuals willing to take that extra step. Good company to work for. Flex hours, a ton of training.Nice clean environment. Never said 'No' to resources.Invented methods so that the Engineer could produce faster outputs.Had processes in place, that helped Engineers work  more effectively. energetic environment, start up vibeone of the first 'internet' companies because of its BBN historyno sure how it has changed over the years; company was being considered for an acquisition when I left A typical day at Cisco was checking emails and cases for updates and research. Often, research and troubleshooting outside of work hours was required. This location no longer exists and so no review is necessary.  But I need to fill this space with something so I'm just typing whatever comes to mind. Cisco was a good company for keeping your training up to date and providing resources as needed. The managers were very busy and the company was always changing the structure around and re-aligining the reporting teams. Very unstable. Excellent work conditions. Professional atmosphere and environment.Culturally excellenceExcellent company to grow in position, Status and gain educational wizardry in the field whether it is in IT , technical or managerial Cisco is an OK place to work.  Benefits are pretty good and pay is average.  Some groups/BUs are better than others.  Seems every year they have a major layoff (usually at the end of summer).Keep in mind, the latest stats show the company is now 75% Asian/Indian.  Would be better if they cut back on the high numbers of contractors and foreign workers. The tech industry is hot or miss. One second you're raking in the money, then next a cheap knock off takes a big chunk out of your revenue and you're out the door. That in a nutshell is why I was let go. Cisco was slowly moving away from consumer electronics. Folks were being let go and eventually a year or so after I was let go, the division was sold and formally shut down. Part of the reason was that upper management was more concerned about their image and patting themselves on the back, versus addressing competition. Great  company to work for. Goo pay. Cutting edge tech. Overall no complaints. Good product pipeline.  Those are some a few of big list of reasons to work for Cisco The work was challenging, but provided an opportunity to meet and learn from people in many diverse roles. The pay was not enough for me to meet my expenses. i didnt really enjoy my job here however i didnt hate it.  it wasnt really all that great but it was busy enough to make the days go by.  really a lot of the same thing day to day. People are taking it easy. There needs to be change in work culture. Management style has to change. I see lot of politics at management level. Its management heavy. Cisco is an excellent company to work for with great products and a fast paced culture.  Typically your co-workers are also top-notch people who have earned their way into an industry leading company.  Downside is job security.  Cisco typically does a large layoff just after the end of their fiscal year and tend to drop both good people and bad.  I did not get caught in a layoff but this recurring house cleaning did enter into my decision to stay or leave. I would recommend all my friends to work at CISCO. It is a great place to work.I love the working environment and the help that was provided to the employees was wonderful I worked with a stellar team of smart, collaborative people and loved what I did. I was able to positively impact our business, and improve the customer experience and see measurable results. My manager was proactive and challenged us to perform at a top level – which we did on an ongoing basis. I worked cross functionally with content strategists, copywriters, UX designers, product managers, and development teams.I regularly worked from home and came in as needed for meetings and when it seemed appropriate. Our culture was fast=paced, and could be stressful due to resource limitations. I was able to mentor several less experienced team members and was the lead creative for all demand generation and lead acquisition campaigns. I worked directly wth numerous external agencies and vendors.I was cherry picked to move to a new, centralized design team and worked for that manager for less than 6 weeks. My role was eliminated as part of a restructuring. I work for a business unit that had been purchased as a start up. The culture in this business unit is probably not the same as the rest of Cisco. We are going through reorganization at the moment and a lot of people are losing jobs or being made in to contractors with a third-party. They say they value work-life balance, but management only wants workaholics that are willing to devote exorbitant unpaid time towards the job.  They don't give engineers sufficient time during a regular workday to complete all necessary tasks, so overtime is necessary to complete workload requirements.  The webmeeting product is a shitshow of old spaghetti code, and almost none of the topmost-level engineers can explain what it does or should do.  The people were great, but the majority of them were extremely unhappy with the job, we all just liked each other.  Sales pushed management to usher products to production well-before those products were ready to be sold, with most products still needing rigorous QA, or simply lacking the options noted by the sales people during the sale. Cisco has a reputation and a culture of hiring a lot of temps; there is no career advancement opportunity for them no matter how hard you work. I'm pretty bitter about my experience at Cisco. Work is very fast paste and interesting.  Cisco is under going a significant transition to subscription revenue based business models which provides for a complex change management environment. Cisco is a great place to work. The work culture is very professional and management is great. Work life balance and career growth are possible. The work hours are flexible. Overall great company. Good benefits and work life balance. Slow paced and lay off can be seen as negative. Facing challenges in transitioning to software services force. Cisco is a fast pace, highly collaborative work environment. There is always something going on to challenge you. The position is very team focused and I work with GREAT technical resources to help me when I am stuck. Management is also good and helpful.However, Cisco has been contracting field positions which makes it tough. A couple times a year, Cisco with reduce staff in strategic areas. I doesn't matter what you know or how great an employee you are, if your position is not seen as valuable you are laid-off.Contracting of positions also reduces opportunities for advancement and change energetic environment, start up vibeone of the first 'internet' companies because of its BBN historyno sure how it has changed over the years; company was being considered for an acquisition when I left As a back line Customer Support Engineer it was spent fixing and troubleshooting various customer networking issues. At the time there were alot of comforts such as free drinks, a rec room etc. I cannot say what has changed since. Amazing company culture. Schedule is flexible as long as you get your work done. Very demanding regardless of how many roles you are maintaining. I was working two additional roles while working in hq and my team was shocked to hear that I was being worked so much which didn't help the process. I was expected to train, document, and learn new role simultaneously with constant meetings (most which were unnecessary). It can burn you to a crisp. The better you do, the more they suck out of you. Roles can be promised, but not until they drain you with little to no appreciation. Be prepared. You'll notice people will start looking like zombies due to this strategy, and then you'll become one. Learn a lot of latest Cisco software & Cisco hardware when I was at Cisco.  Each QA Engineering is required to build their own test lab. Most enjoyable & hardest part of the job is to keep learning latest & greatest new technology. Good work/life balance but no career advancement.Lack of interesting work and More repetitive work.Good for people looking to settle down but not for job/careeradvancement. Cisco offers plenty of opportunity to pursue passions and develop out from white space.  The work-life balance is simply amazing - as long as objectives are being delivered, job security is reasonably expected. great placegood locationgood leadershipgreat morals and valuesso much diversityattracts team members like thesemanagement structure is awesome and full of methods proven The company as a whole form top to bottom is driven on sales. Not customer relationship building. There was no team building per say other than to badger the customers once a quarter to buy something. Mindset of the sales team was in and out, there was no customer relationship growth at all. The only thing sales was expected to do was bring in orders on a weekly timeframe. You were chastised if you missed on your weekly number. Not great quality management for a sales person who only has 8 accounts to work with. I did notice that most of the account managers only knew a little bit about each customer they had based on who was buying the products, not the other divisions within the account. No custom relationship building or customer trust for that matter. Allowed for a great learning experience about programming when I worked here for my high school internship. Highly recommended for anyone pursuing a career in CS Good luck! I don't wish to recall all the details but in brief:Lots of fun quirks, ping pong tables, gym, etc. However, my contracting company was terrible at management. I felt under-utilized, under-appreciated and sometimes flat-out manipulated. On the Cisco side, my supervisors who were well-connected to my contracting company seemed terribly closed-off to feedback. The general explanation I received for this was that they were distant to avoid legal complications. A good company, yet one must be ready to deal with the attributes of a big company.The product, strategies and staying power are remarkable, its new leadership outstanding, and its opportunities exist for those who know how to navigate. supportive management team. Good work life balance. Management supports working from home occasionally. Interesting projects and good collaboration between co workers. While its a great organization, its very challenging to succeed in an environment of rolling reduction in force or limited restructuring. However if you are effective, make good contacts you will find success. The engineering, technical focus and management is second to none. If you can get in, its a great company. The Cisco culture had video games, pool tables, ping pong tables. Employee appreciation events. It was a very positive work environment. However, very challenging and competitive. I loved my job at Cisco, yet when it came to trimming down the workforce as it required to streamline. Unfortunately the company i worked for was an acquisition and i was part of the 'Limited Restructuring'. Need to keep in touch with employee more for better understanding of job site situation for better service and support.  This would keep the client/services have more effective/productive. If you want an easy job where you can't get much done because of culture and politics, but no one will ask you about it - this is the place for you.The company is constantly doing layoffs, make sure you have an escape route and backup plan.  New hires are not safe from the annual culling, nor are needed positions. Strong use of Excel was requiredFast pacedenjoyed working with the team I was part ofWas able to support multiple organization in the time I was there Cisco is an amazing place to work, the culture is great, very relaxed. What we do is very demanding, however, the environment it is done in allows for a very relaxed atmosphere.  This type of environment drives work performance and is enjoyed by many. Employ friendly organisation. Work Life balance was decent. Job culture was good and management was employee friendly. In the role of a consultant, I can't comment about Job security/advancement much. some lay offs did happen during my work period. High technology Telecommunications company.  Fast paced with frequent acquisitions allowing for the opportunity to move into new markets and work in new areas. energetic environment, start up vibeone of the first 'internet' companies because of its BBN historyno sure how it has changed over the years; company was being considered for an acquisition when I left Cisco red to be a nice place to work until the company changed my manager that was not good to manage people.I was part of a layoff due to this manager didn't understand my style of work and start fight with me all the timeI hope Cisco would open eyes and invest in managers with right skills I worked for Cisco for a very short time in the early 00's but was laid off as part of a large scale workforce reduction.  I would have loved to stay, but we had entire teams laid off. Great place to work. Good work/life balance. Great opportunities. RTP campus is nice and they serve great food. Culture is awesome! A company worth working for. Cisco is a great place to work. It gives an opportunity to grow as an individual and as a group. Cisco also help their employees to learn new technologies, be proactive and help in shaping their future. Great place to work, very well balanced and most rewarding in job knowledge and new skills.The hardest part of the job was troubleshooting an outage which in turned proved to be rewarding and satisfying once completed. Good company too many layoffs, no security.  No advancement for support staff but great benefits and good people that work in the trenches.  Pays well The work was interesting, but upper management took a long time to make decisions, and were slow to respond to the market.In the end, it affected the project we were on, as hundreds of engineers were laid off, but the management and marketing team are still the same. Quick paced competitive environment with wide opportunities to learn new technologies, skills, and customer environments. The most enjoyable part of working for the company was the people and the knowledge and unique skills that they brought to the workplace. Was a vendor working there.not employee. Though I was not directly working for Cisco, I could see that the employees had good flexible time opportunities. Contracted for Cisco, good company, good management.  Lawrenceville, GA. campus was large with cafeteria, coffee shop and gym on-site, electric vehicle charging stations in parking decks. If you are curious about technology and connect with the right folks in your Org. you'll learn a lot. Great company and it's got global locations and programs to keep you educated. Good Benefits, career advancement is very good.  Ability to move within the company.   Total compensation is very good. Current issue is too many on-going layoffs and restructuring. Enjoyed my time there. Would recommend as a place to work. Fast-paced and demanding work schedule. Appreciated the flexibility to work from home when needed. I worked at Cisco in RTP for a few years. Over time it become obvious that my project peers were working other full-time jobs and shouldering me with an unfair amount of project burden. I made management aware of this issue but they were too busy to effectively look into the matter. It was a complicated issue; management typically doesn't have time to manage staff at Cisco and actually see whats going on. Many managers have too many employees, some like mine have the title of manager but are really too busy working a sales role. This puts them in the place of trusting mid-level employees.If your under a shady one theres not much you can do.It got very shady in my exit interview when no HR representative was present. In lieu of that I was given a web form to fill out. Best Job of my life so far. Would recommend. There is enough room for you to make mistakes and grow from experiences. Also, anyone will help you if you need it! Excellent place to work, learn and be challenged to succeed. The best part of the job is the people and the culture. The opportunity to see your work make a difference to the world is truly rewarding. Management works hard to find a fit and delivers, however, their small size became quite noticeable when working a project with representatives from larger services with greater resources. Cisco is great but there are some problems that come with a large company. Here you probably will not feel like you are adding much value because everything moves at such a slow pace. Most of the management is so busy with their own stuff that they don't manage at all. Besides those 2 things ... everything else (benefits, pto, ceo, free coffee, free lunches sometimes, company values, working from home, etc) is awesome, makes going to work pretty easy. Great place to work and learn.  Limited opportunities for advancement.  Lots of turnover and layoffs.  Good leaders and motivated employees.  Generally interesting projects. Cisco gives you the possibility to innovate, bring ideas, collaborate and disrupt. People is Cisco's best asset.The company is in constant change, bringing constant challenges you never get board. Work is fun but stresfull. energetic environment, start up vibeone of the first 'internet' companies because of its BBN historyno sure how it has changed over the years; company was being considered for an acquisition when I left I rather not give any impression about my time at Cisco. I have work for this company for over 2 years one as a contractor, and one more as an employee.That is all I would like to say. I was working at Cisco for a contractor, I was working with Cisco family/team. Not sure how much I can say that I didn't say previously. I have worked for Adecco before at the beginning of my stay at Cisco Cisco is a great place to work. I have worked in my different facets of the company, manufacturing finance, corporate finance, IT, Engineering, and Marketing. Engineers are the best to support It was fun working at Cisco, Gained huge knowledge and very nice people to help you along with your manager.Lot of good new technologies to learn along with tools Overall a great company but a lot has changed over the past 10 years. Also, the ongoing layoffs on a Q by Q basis makes it very stressful. No real job security! I really enjoyed my tenure at Cisco.  The culture is wonderful; the company has great values and social responsibility.  The culture is collaborative and most of your peers are willing to assist.  In many positions you can work remote. Everyday you learn something new, and you are constantly being challenge.  During my time at Cisco (as a contractor and as a full time employee), I reported to 5 different managers: I was very fortunate and 4 of them were great. Obviously, your work experience is directly influenced by who your manager is.  The company offers great benefits and even allows you to take paid time off to participate in community and charitable activities.  Yes, you work long hours, but that have become the norm in most job places.  However, Cisco work setting flexibility off-set the hours you have to work.The biggest problem is the lack of job security:  to adjust to the demands and market conditions and shifts, Cisco is having limited restructurings (layoff) more than once a year.However, if the right opportunity would be offered to me, I would not hesitate a second to accept it Opens and closes the store in the absence of store management, including all required systems start-ups, required cash handling, and ensuring the floor and stock room are ready for the business day. Responsible for opening back door of store for deliveries. Completes product returns, order voids, customer refunds, cash drops to the safe, and provides change as requested to cash registers. Models and delivers a distinctive and delightful customer experience. Customer Experience Engages customers and patients by greeting them and offering assistance with products and services. Resolves customer issues and answers questions to ensure a positive customer experience. Models and shares customer service best practices with all team members to deliver a distinctive and delightful customer experience, including interpersonal habits (e.g., greeting, eye contact, courtesy, etc.) and Walgreens service traits (e.g., offering help proactively, identifying needs, servicing until satisfied, etc.). Operations Responsible for holding store keys to open and close without management as necessary. Cisco was the first company I worked for out of college. It was a great place to work. I learned a ton and grew professionally. There were a lot of changes when the tech market crashed. Management is arrogant, incompetent and abusive.  Overloaded with work,and yet efforts go unnoticed unless you are 'part of the gang'  Treat Red Badge (contractors) extremely bad. Very competitive environment, which allows for opportunities to learn and grow. NEVER a dull moment. There is an opportunity to learn on a daily basis.The most enjoyable part of working for Cisco Systems is the diverse workforce. Opportunities to engage with resources from around the globe. At CISCO, I was working on real, impactful projects that were challenging, but within my ability. It was incredible to have such great mentors to lead me along the way. After finishing the project, I would give a presentation on what I had done to the whole team. The management at CISCO was great. There was a clear workflow and people were always willing to help each other. The hardest part of the job were the projects I was working on. I was working on things that I had never worked on before. The most enjoyable part of the job was also the projects. Though they were hard, it was such a satisfying feeling knowing that I was making an impact on the product. Most enjoyable part of the job is the people. Seasoned professionals who have years of industry experience doing enterprise IT. Cisco has the best salesforce in the world. Culture is good. Hope gym is free.  More fair treatment for free snack and food instead of treating for only particular group of people in the building.  It doesn't make others feel good working at Cisco. Not sure about future advancement. I believe outside of the organization I was in at Cisco I would have thoroughly enjoyed my time. Unfortunately, I was put into a position with little to no room for advancement if the company is doing well, it would be a good place to work but things have changed over the past few years.  several layoffs with no severance , and no more bonuses This company provides a calm, welcoming, employee centered environment.  Complimentary snacks and drinks are provided for employees, which I think is a nice touch. Cisco is a good company to work for. Best work / life balance that you can get in the company. The company allows you to choose on the projects that suits your skills. I was personally involved in all the critical projects ranging anywhere from 50mil to 250 million dollars. Due to the diverse business functions, i was able to get a flavor for information technology, business operations, chief of staff and eCommerce, and able to grow from systems analyst through leadership positions. Previously served as an Incident Response Consultant and provided analysis and conclusions based on analysis of the evidence; Analyzed network intrusions and advised on immediate, mid-term, and long-term remediation. Provided briefings and advised executive management on breach response and best practices. Routinely performed peer reviews of other consultant’s forensic reports. Provide focused e-discovery consulting, collection, andprocessing. Provide breach plan after-action analysis. Loved working at Cisco- company and culture are very unique and diverse.Love the flexibility and work from home option (if applicable to job)Love onsite perks like 3 cafeterias, grocery pick up, dry cleaning, food trucks, fresh food panty not to mention break from had free treats besides a variety of teas and coffee.Also offer a lot of discount with other company including car buying.Great company even the severance packages are amazing. Just very Cut Throat and no Job Security, You have to be ready to get laid off regardless of your performance. Lack of planning and need to explore many possibilities to keep employee instead of laying them off. energetic environment, start up vibeone of the first 'internet' companies because of its BBN historyno sure how it has changed over the years; company was being considered for an acquisition when I left It was a good company. It was like working for a government job. The culture was relaxing and there was alot of red tape. Management was okay and varied. Supporting engineers in lab environment, supplying them with the materials they need to improve device performance.Working with this team made me want to further my understanding of network hardware. Ceridian is an amazing company to work for, but unfortunately they do not have very good job security/advancement. My managers were all great, but compensation was also very low. I allowed me to learn as much as i could and carry on this knowledge to other endeavors. I was able to walk in with little to no experience and leave as a mid-level Networking Engineer Consultant. Fair pay and fair treatment of employees, diverse community, team cultures differ greatly across business units or sales teams, strong focus on early in career (EIC) employeesCisco does a good job enabling its employees to go where they want, and learn what they want. There are a lot of career resources that are supported by HR, but not widely known about across the company. Generally, because your career is what you make of it, it's a good idea to take advantage of all the training that is offered inside the company, or talk to management about tuition reimbursement if you plan to do a degree/take a certificate course outside the company excellent supportive environment, have daily scrum that we can interact with team members to discuss blockers and any planning.  excellent scrum master to ensure team commitment Great people to work with and leading edge technologies to learn.  Fast paced development environment but reasonable deliverable deadlines. I enjoyed every day I was there. Not really so much opportunity for interns. They are laying many people off in order to catch the train of changes in the market. As an intern we couldn't work from home and our benefit package was limited. Cisco is an ever changing environment which promotes growth and allows for constant self evaluation.  The culture and work life balance is by far one of the most enjoyable out there.  If you have to work, you should do it where you feel included/wanted. Jobs can vary a lot person to person, some people are stressed out and overloaded and others have more balance. In general, it's an older company. The management think they're doing more to get and keep early in career employees, but most early in career people I know leave by or within 2 years of starting at Cisco, and Cisco seems okay with that. a typical day in my work, give support to customers who call, with problems with their security alarm systems, give them the best service intruding someone to solve the problem without generating a ticket, help the customer to join their system of security cameras, as soon as possible For me, I work across geolocations; getting up early to host a scrum meeting with one India team.  I normally has two or three teams in India. At day time, I work with a) product manager to discuss feature related issues that engineers have during the design or implementation; b) work with other team leads in San Jose for design discussion/integration discussion...c) I may need to do prototyping for certain solution and give guidance to engineering teams in India.  I normally own the design if a feature is completely new add-in to the product because I want to control the quality of design.  I also do some implementation of the product if they are critical to the system or at least I provide prototypes.  At night, I have to work with the lead engineers in India to 1) resolve any new issue they may have, 2) give them suggestions on how to solve certain problems they encounter...  I normally have two demo meeting at night, one with the engineering team (for each two weeks Sprint), and one with product manager to get his acceptance of our implementation.  The fun part of my job is that I connect to different people every day which gives me the opportunity to sharpe my people skills, leadership skills, influence skills... The hardest part of my job is to adapt to the dynamic changes of marketing requirements or customers requirements during each release.  I have to make a right decision on whether or not I should say 'Yes' to product manager when a new requirement comes in the middle of implementation or convince product manager the other way...The most enjoyable part of my job  is I meet many friends.  They will be my life time friends in local and far away. This was formerly Scientific Atlanta, acquired by Cisco and a slow decline in the video industry led to it's sale to Technicolor.   No longer exists so certainly not worthy of pursuit. Sales oriented company, lack of true vision, no commitment to employees, bad culture, particularly in the failing business units left over from acquisitions. 1. Flexble timings2. Good place to enhance your technical skills3. Stable management4. Most enjoyable part is a home like work environment where you can play, use gym etc Overall good environment;Big organaztioncross funtional team culturegood learning opportunitiesbut not quite follow the marketgood benefit and employee care The people I've worked with at Cisco have been some of the finest and smartest engineers I've ever known. Most understand the value of good team work and will put in the extra effort to get a job done well. I have been fortunate to work on leading edge technology and with using some of the best tools and resources. Telecommuting is widely accepted as long as it doesn't hinder productivity or collaboration but many use it as advantage to gain extra hours from the day by skipping the commute. The downside is company reorganizations and layoffs. They are annual and no one or any group is exempt. Since the day I have joined Cisco while I was still in college, till my almost 9 years tenure, I have had the most fulfilling work experience. I have had the opportunity to work on different projects as I kept growing myself in the ladder. And a chance to interact and work with cross teams. I like a career that is challenging, that has people that build you up and help you grow. I have been fortunate to be with a company that allows that.  I like coming in everyday to work that allows me to interact with all sorts of individuals and challenges. I am not afraid of having the plans change in the day to meet a new goal. I also like a fun atmosphere so that it is enjoyable to come to work.  We have been fortunate to be on a flexible account that allows me to work for home when needed. Good Working environment Plenty to learnYou have to be in charge of multiple things e.g. Network design,client meet up some time meetings take up the whole day energetic environment, start up vibeone of the first 'internet' companies because of its BBN historyno sure how it has changed over the years; company was being considered for an acquisition when I left Work hours depend from one department to another. For the most part, I've had very flexible work hours and can work from wherever and whenever. I don't have a strict schedule which is definitely one of the reason why I've stayed at Cisco. Overall compensation package isn't bad. However, salary and stock options are onthe low end compared to other tech companies. Very friendly environment ,supportive colleagues , no time limit to start a day, I have learned some programming tricks while working in Cisco. Quarterly our management arrange fun fun day with lots of game and good quality of food, Allow to work from home . The most enjoyable part of this job is the job itself. I learned how to set up the new Cisco phones , I learned have to talk to people in a more acceptable way, I learned great customer service skills. My manager was really inexperienced and can best be related to a lieutenant in the military that just commissioned.  Power hungry and didn't respect the experts around him.  Due his shortfalls, and instead of correcting them the SMEs were asked to compensate.  This threw additional workload on the team decreasing productivity. Globally, Cisco is a great company, Very work/life balanced culture.  Some of the best people I've worked with, professionally.I learned a lot about corporate infrastructure within a very large company, and process / business flow (end to end).  Gained broader understanding of incident and case management, contract deal management flow, project flow.Management is engaging and helpful at mid and lower levels.  Job was only generally difficult during quarter-end and year-end peak times, when there was immense time pressure.Enjoyable on many levels - ability to help other companies, working independently while part of a team to collaborate with, cross-functional work with other teams, people, culture, work/life balance Remote management really made things difficult, but as a company they treated us employees with respect and trust. Working hours vary depending on project and location. Simply put moral is low with layoffs every quarter and layoffs spread over Sep, Oct, Nov 2017 this year.  People are becoming disillusioned of what used to be a great company.  10 quarters for declining revenue does not help.  The attractiveness is working from home and as an Engineer working for the largest Vendor in the world. I liked working at Cisco - management was supportive, however there is a lot of turnover there. Job security is low, which constantly brings down the moral. balanced work and life & Poor managementI most enjoy designing new product and beat the competition.  Also helping customer solve critical business impact issue quickly is most fun. As a contractor for Cisco, I enjoyed my time working for them. I love the culture and the work life balance that this company has to offer. Being able to work from home allowed me to be more productive by cutting down my commute time and diving straight into work. In addition, my managers and co-workers have all been very professional and provided guidance and assistance whenever needed. Best company to work for.  Culture was family oriented.  CEO was phenomenal.  Put himself in the trenches with the employees.  Always on the forefront of technology and truly innovative Great place to work and begin a professional career. There are many opportunities. Workplace culture is relaxed and inviting. Management often pushes career advancement internally. Cisco was a great place to work as it allowed a real work and life balance.  Allowed me as an Executive Assistant to work remotely 4 out of 5 days.  I was only the physical office one day a week! Would not necessarily recommend being contracted at Cisco. You are not offered decent compensation, benefits, time-off, etc. Culture is great, very laid back. There is not typically great job security being contracted as well. Cisco is a sales organization masquerading as a tech firm. It acquires technology and products through acquisition, re-brands them poorly, and then sells them through channel partners that already have switch and server deals. Technical people will be frustrated by constantly changing direction, reorganizations, and the regular reduction in force events that paralyze employees with fear for a week a few times per year. Cisco is a large company that operates like one.  It has a flexible culture, but runs largely on who you know.  A typical day would involve putting out fires (caused by someone else) and CYA.  The hardest part of the job was having to sit through meetings.  The most enjoyable part of the job was interacting with vendors. No clear people strategy. Lack of development and promotional opportunities. Poor Communication from all levels of management. Lack of a open door policy. Leadership is not approachable. Innovation week annually. Every year, Cisco has one week reserved for innovation. The engineers have opportunities to work on their own idea. If an idea is ranked on the top, it will be funded. Cisco overworks, mismanages and undervalues it's Employees even in Areas it deems important like security. Don't work here if you want to advance your career, be paid what you are worth or be treated with respect. It started off very good but then my manager left and it got very strange. I end up reporting to his manager who was very unfriendly, condescending, and disrespectful. I opted to leave. I would go back under better circumstances. Its a good company. energetic environment, start up vibeone of the first 'internet' companies because of its BBN historyno sure how it has changed over the years; company was being considered for an acquisition when I left Used to be a wonderful place to work until the annual layoffs changed the culture.  Lack of job security makes for uncertain futures.The people are great, but any company that has 30 billion in the bank and still finds ways to cut heads to appease stockholders has to be questioned. Very challenging but rewarding work. Very large company with many silos. Navigating them can be difficult. But the work is very interesting and the company is a premier brand. Customer success is a high priority. Have not opinion about opinion of this company...worked for Cisco Air Systems, not Cisco Routers,  Need 53 more characters to get out of this screen and finish up Project helped me to understand Cisco Advance Service selling model and the business needs. Good opportunity to learn next level of Cisco offerings. It was very heard to convince a manager if he/she is not clear about the project deliverable. This project given me good opportunity to work with Senior Leadership and visibility to grow my career. You go to Daily standup and give your status. Then you can carry on with the dev work and come back home once you have worked decently in a day. Perfect work-life balance. Easy Work from home option to avail as well. But to get a promotion is next to impossible. Great job security. Career advancement is on the lower side as you work in a slow-paced environment. The people you work with are good for the most part.  Your experience can vary dramatically depending where you are in a company with over 70k FTEs and tens of thousands of contractors.  Within my group, there have been hectic times and relaxed times.  Some groups seem to be pretty low-key while others are nonstop action.Overall, it's a nice place to be as long as your management and teammates are good to work with.  If they aren't, there are opportunities to move around within the company. Flexible hours, flexible work (home / office), some managers were good, others not as much.  A bit political at times.  Managers sometimes assigned people they don't know how to manage Great place to work with emphasis towards a balanced lifestyle. Success is rewarded and achievements are celebrated. Workflow is seasonal, however normally a Monday to Friday routine. During my tenure at Cisco, the company grew from a hungry competitor to a behemoth with its fingers in every pie. The official position became, 'If we can't be number 1 or 2 in a market, we will not be in that market.' Their reputation as 'The Borg' is well-deserved. Great place and great people and great products/services however the perpetual layoffs has resulted in a deterioration of morale which is black cloud that never goes away which is a shame. Constant reorganizations, change of strategy and change in mgt. results in disjointed teams realigning to hit the numbers as the primary goal. Constant limited restructuring does not lend to loyalty or commitment to team success. Its been a long time since I worked there.  I remember creating  PAK licenses for a software for existing customers so they do not have to pay for an existing product. Most groups are very flexible with the work hours. There are some nice amenities like Pool tables, Ping Pong, Fussball, Old School Video games, Fitness center, Snack Bar, Massage Chairs. Management is pretty good for the most part. You can get a bad apple every now and then, but they usually get weeded out eventually. Career advancement plateau's within 5 or so years unless you are brilliant, then you can get pushed (or pulled) up the chain, but it still takes a long time.They do a nice job of having team building and site events throughout the year which is nice. Treat contractors like replaceable parts and don't do anything to bring them into the company. Can't access advancement training programs, and change org without sound solution to transition teams and individuals. A typical day involves managing a case load for the Video On Demand application and the Comcast DVR products.  Often I am on customer facing bridges for critical outages that need immediate resolution to ensure the video on demand product is working for Service Provideer customers.  My backlog is 37 cases currently.  I escalate where necessary to the development team for enhancements and new defects that need to be created.  We are on a linux based platform that requires me to scrub the logs and identify issues with new session setups, existing VOD sessions and database problems.  I also provide hardware replacement support and troubleshoot hardware issues and create replacement orders where necessary for disks,, raid controllers and chassis'.The most enjoyable part of the job is resolving critical outages.  The hardest part is quickly identifying what the problem is and whether or not the issue is a CISCO problem or a third party vendor problem.The workplace culture is very competitive.I access all of the customer systems via VPN and need to trace the logs and gather logs for development. Cisco was full of political corporate climbers and backstabbers.  Couldn't hack the soul-less culture, so I left after 4 months.  I did like how they hired a lot of young interns and trained them for real jobs, with appropriate skills needed to advance.  That was the only thing i could recommend. Friday's most people work from home. I am in IT, so we have calls with folks in APJC and EMEA (early morning or at night PST). Managers are supportive, but career advancement and salary are not up to par with rest of industry. Overall a great company to work for.  The false starts for new business markets can be troublesome because the returns demanded by stockholders can prematurely impact success. I took the role because of my Sr. Director (she rocked!). The role and my immediate team (direct reports) were the best team I've ever worked with and they made coming to work fun and interesting. Shortly afterwards, we had a re-org and all of the other Directors I had were horrible and knew nothing about what my team did but instead made changes for the sake of making changes. I left because of the instability and lack of vision. In the very short 4 years I was at Cisco, I survived no less than 6 re-orgs and 6 new managers.  Complete lack of vision and stability at Cisco and some of the managers had no clue what our team did. So frustrating! energetic environment, start up vibeone of the first 'internet' companies because of its BBN historyno sure how it has changed over the years; company was being considered for an acquisition when I left I had a great experienced with the entire team. Manager was transparency and opened for communication. It was a flexible workplace that I enjoyed the most. good stuff here.  there is a lot of work to be done in this transformation and lots of smart people to get to the work done.  The biggest asset is the people! Supportive leads, easy job. Potential to learn a TON and progress to higher paying positions. Great stuff. The best stuff. Amazing place to work. Stupendous. It is great working here, but the commute is too long. People seem to be nice, but only on certain teams.Your bosses are everywhere so it can be stressfulManaging your work load is the key to happiness.The pay is just down right low, too lowEven though Cisco is closed on Holidays you may have to work.You can take a break when you need it. Everyone is highly encouraged to take time for family.  Family emergencies are not frowned upon, and everyone is very warm and caring.There is an overall larger family feel with in the groups one works in, very positive. I was a contractor for Cisco and they over worked us with no morale or proper leadership. They demanded more and more work, but never looked out for their people. I think it was just the team I was with. fast paced environment and always changing (processes, management, etc).  Offers great deal of flexibility in exchange for hard work and dedication.  Full time telecommute options and great benefits. Work remote, as long as you get your job done, then it is a great place to work.  Very relaxed atmosphere, they do a lot of re-organizations but I like that, makes roles more accountable and streamlines processes. Typical day is filled with webex meetings and fire drills.  People are nice but very stressed. Communication is disjointed and often people don't know what who is doing what. Cisco used to be a great hi tech company but had missed number of opportunities to transform , adopt to new market trends and capture new opportunities and business models. It is now going through perpetual downsizing exercises due to decreasing revenue and shrinking market 80% of Cisco's employees are contracted. Most recruiters pay pretty well although they dont offer much in the way of benefits. Apex Systems offers the worst salary of all. Nothing special to add except it's a great company to work for. There is a life balance culture. Teammates are really helpful and would roll their sleeves to jump in any critical project. Cisco has great pay & flexibility, but most groups work long stressful hours and there are lots of fire drills. Love working from home, but you put in way more than 8 hours a day - closer to 12-14, usually more at close of fiscal (summer). Annual layoff in late summer/early fall has now moved to quarterly or monthly, so employee moral is low always worrying if you'll have a job. The culture is very collaborative and friendly...great people, lots of fun, fun challenges and rewards. Management engagement and development varies by organization, but with so many organizational re-alignments every year, you never quite know who you'll be working for or for how long.  No formal performance evaluation system makes stack ranking for layoffs nearly impossible so it comes down to your perceived value in the org, your relationship with the leaders, and how much money you make. It would be much better if it were based on performance and contribution. good benefits, interesting work, able to work on very large networks with latest and great hardware and software.Was able to explore new technologies. Always pushing to stay on top of technical competitors. Collaborative environment.  Good work life balance.  Good vacation. Good medical. Nice, modern work environment. overall, good benefits.  Great work location in downtown Bellevue. Excellent exposure to corporate events over my 16+ year tenure which enabled me to expand my program management skills.Ability to work from home, liaising with teams around the globe. Great place to work, but beware of the continuous limited reductions in force.  I feel corporations owe it to employees to do all they can to keep them employed and if there is a need to reduce force, employees should be given a year of severance. Cisco is a fun place to work.  Their schedules are very flexible.  That give us the opportunity to be more productive.  Managers try to develop team members, so we can advance to the next level. Cisco has unlimited resources of learning from basic to advancement, the good thing about Cisco culture is has minimal supervision no pressure, but finish the job ahead on time with no micro managing. The enjoyable part of the job is have privilege to go home early and allowed to work from home as needed. Typical day at work was hands on and interactive,I learned more on how to work with network equipment outside of Cisco. Typical management/supervision. The hardest part about this Job was knowing that it was only temporary. The most enjoyable part of the job was learning new things. energetic environment, start up vibeone of the first 'internet' companies because of its BBN historyno sure how it has changed over the years; company was being considered for an acquisition when I left Able to pick up a couple new skills sets. Typical workday come in check emails, check projects, work on AI's, staging, next project in que. Management  changed often and multiple layoffs every year. The time worked at Cisco I learned alot in the administrative roll through other groups. My particular group had a certain culture dynamic that I personally didn't fit into, however the overall culture of the company is wonderful. People are very friendly and there are so many programs to learn and build from. A typical day at Cisco is comprised of catching up on internal and customer emails, taking whatever work is in your queue and doing what needs to be done to resolve the issues. This company focused and ensures balance is had between work and life.  It is a fantastic company to work for and the management and employees are terrific. Learned new things about Machine Learning and Data storage. Learned new tools for Front-end Development . Was a good time with entire  team and off shore one as well. Often times Cisco is quick to release products prior to them being enterprise ready and the support structure is not scaled to handle the workload. This causes issues internally and is confusing on who is accountable to address the customer issues. Failure to move people to the needed areas requires 'Limit Restructuring' each year. Low morale of those lucky enough to get to continue employment.  Must be young and a part of the right group to get career advancement. Cisco job is good for someone who would like to take the responsibility of learning by himself. Lot of lab resource there. Management is not actively interested to evaluate true performance. Management mostly worry about their own interests. The corporate benefits are great, but the work culture mostly depends on what group you are in.  Some are really encouraging of career growth and others love politics. Great job with great perks. Management, not the best..  I would have loved working here if the managers didn't change so much and so often.  Management has high expectations and offer little to no support. Awesome collaborative practicesOpportunity to learn and grow from one anotherThe more team oriented you are the more successful your projectsGlobal community reach flailing corporate strategy, constant restructuring, layoffs every other month, lots of stress...added to long hours and lack of fulfillment overall due to paranoia and infighting.lots of good people to work with, and plenty of big ideas...but really hard to execute in this environment. Cisco provides a work environment to think out of the box and be an entrepreneur while moving in a fast paced environment. The workplace culture is very supportive as a team environment to help everyone be successful. start early assist customer sites with live content streaming failureslevel of work intensity depends on severity of customer failureschallenging work makes for great learning As global corporation goes, the boxborough office is nice and welcoming. The size of the corporation doesn't allow for a fun work culture however so it can become somewhat monotonous as well. Standard benefits and supporting workplace though. Going above and beyond to help out to those who need help. Great company to work for, I enjoyed my time with Cisco and I feel that Cisco would be a great company to consider to work for in the silicon valley area. CISCO SYSTEMS INC. IS THE WORLDWIDE LEADER in networking for the Internet. The company was founded in 1984 by two computer scientists from Stanford University seeking an easier way to connect different types of computer systems.Cisco Systems shipped its first product in 1986 and is now a multi-national corporation, with over 35,000 employees in more than 115 countries. Today, Cisco solutions are the networking foundations for service providers, small to medium business and enterprise customers which includes corporations, government agencies, utilities and educational institutions. A great company with supportive staff.  Wide range of products and opportunities depending upon interest.  Good work / life balance and focus on employee well being. Cisco is a good company to work for. Your job becomes what you make of it - lots of initiative creates opportunity but if you wait for someone to tell you what to do you will fail. Overall is good company to work at. Professional level is top. You run into people with amazing careers and technical level. As any product-sale oriented company, sale numbers are everything. Your hard work doesn't matter, you got the numbers or you are out.But don't think your are doing all your career on it. Job Security Sucks. Cisco is executing layoffs every 6 months. You are going to have a job if, and only if, the perspective to next year sales is good. Sooner or later, this will not be the case. At this moment they will remember where the door is. This applies not only to sales position but technical ones. energetic environment, start up vibeone of the first 'internet' companies because of its BBN historyno sure how it has changed over the years; company was being considered for an acquisition when I left Cisco is an excellent company in an important business, with a large variety of talented people, producing top-notch equipment and services. Telecommuting is widespread, and much appreciated. CISCO allows for amazing growth, learning and encourages employee innovation.  Benefits are fantastic and the people are great to work with.They are creating a culture of uncertainty due to the fact they have had a constant org restructure impacting employees on a quarterly basis.  No one is safe. Great company to work for. The hours were great. The company was very diverse. I love working in Research Triangle Park. The workload was a lot but the time went by fast. Great company, I would recommend for anyone who's interested in the tech industry and loves a company who cares about its employees. Great benefits and company culture is top notch Great place to be. I have been with Cisco 4 times and I am truly excited each time I am back.  My opportunity continue to grow.  I have learned so much about SW development. Like many of the other reviews, I would agree that while working for Cisco there are many positives. They pay well, and take good care of their employees. Many employees work remotely, allowing them to have the flexibility to work from anywhere, and also to maintain a work-life balance. That being said, it is not an exaggeration that there is at least one limited restructuring a year if not more. With this method, they don’t actually cut the fat, they end up losing wonderful employees. I have seen loyal, hard-working knowledgeable folks get cut many, many times over the years. I have also worked with some folks over the years that really did not contribute well, and some how stayed through the LR’s. I don’t feel annual lay offs with no rhyme or reason are helping the company. You are essentially telling your current employees and future prospects that it doesn’t matter how hard you work, how much you contribute, or how skilled you are, you may randomly be chosen to be impacted in the next round. I would go in and do time sheets.  I learned how to open work orders close them, time cards.  Things always changed so I was learning something new everyday. High talented and passionate set of people to work with.Perks are less and they Could have more fun activities for interns.Good worklife balance and good work Just a great group of folks to work with in every division.  Smart, professional, courteous, team players.  Very supportive of each other and focused on the end goal. Flexibility to work in the office or from home, allowing personal control over work/life balance.  Work was always interesting and challenging.  Lots of opportunities to learn. Good company to work for.  I learned a lot and got to work with a lot of amazing people.  I learned multiple new technologies such as routing and switching, femtocell, Evolved Packet Core, and element management systems. Team oriented, always working toward solutions and encouraging managementTimes spent at meetings are productiveClear and concise job responsibilitesAlways something new to learn and growth opportunities Cisco is a great company to work with. Lot of opportunities to learn and grow.  I entered the company 17 years ago with average knowledge but after a long journey I feel like I have learned so much and ready for next adventure in my life. Hard Work but rewarding, But the company started to do reduction in force layoffs since 2013 to make quarter reports look good. Hard work but rewarding, Challenging work As a PM you had to be technical.Long hours, joke was working at Cisco was a lifestyle not a job. Its been wonderful to be a part of the company Great Work Culture, you are in charge of what you are doing and feel appreciatedFeels awesome to work with a talented teamYou get ample opportunity to enhance your skills as you work Good Working with Cisco, good work life balance,good technology and flexible work hours,working from home option is available and its really helps employee. I had the luck of getting put on a great time with a lot of young folks who were smart and social.  I was able to learn quickly and had a good time at work. I would say the best part of the job is the people you get to to work with, smart, driven, generous, focused on the customer. Worked on many projects and Cisco and with many great and talented individuals. Initially worked on a leading edge, crossing the chasm product but stayed too long until it became just another product Good place to work with fulfilling role. There is good work life balance. Employees are very committed. The management need to have clear vision to help with advancement of company The job was relocated out of state.  The whole Finance depart had to move.  Since my family is in the Bay Area, I cannot move for the job out of state.  Therefore, I had to leave Cisco. energetic environment, start up vibeone of the first 'internet' companies because of its BBN historyno sure how it has changed over the years; company was being considered for an acquisition when I left Great company, great culture, interesting and engaging work.  The people are great, and there is a culture of innovation and pursuit of excellence.There are some truly great people leaders, but there are just as many really poor ones who can't or won't walk the talk on employee engagement and employee performance management.  So many things are right with this company, but annual 'Limited Restructuring' lay-offs point to poor management and poor financial controls. Cisco revnue is going down and it lay off people multiple times every year. A lot of people at cisco is worried about their job.  Cisco needs to innovate and improve working environment I would prefer not to answer this in detail and would prefer to keep all the company and culture related information confidential. Its been a great place to spend few years of my career. Not structured, family business not room for advancement.  Never received a raise although meet criteria for advancement.  When I received a raise three months later benefits cost were raised.  Was only offered a raise when I was leaving the company. Good place to work with lots of benefits and flexible work hours; work from home, benefits are good; onsite medical, dental , gyms, day care are good for employees. Great company to work for!Management should take educational training on how to interact with their staff on multiple levels; to include how to be successful in the department. I've enjoyed a long time at Cisco, met tons of great people, and worked on many interested (and sometimes challenging) projects/products/services for Cisco, and for Cisco's customers/partners (within support). Peers are great.Benefits are great.Company is going through a transition to a Software driven culture, and sometimes it feels like one step forward, two steps back more often than not. Great Company. Good work life balance, good compensation benefits, management is good too and job culture is excellent. I would recommend Cisco to everyone. I love it! The ONLY reason is that I moved back to Dallas to get married.....which I never should have done. It was by far one of the best jobs I've ever had. What I like the most about Cisco is how it treats its employees. Every company needs to restructure workforce from time to time. In Cisco I admire how people to-be-terminated are treated. They are not escorted out just after the notification, but have a full month using company's resources to search for their new job.Skills levels of people are also very high. Cisco was an energetic and motivating company. The team really pulled together to achieve the goals effectively laid out for the entire team. Really had a great time working for this company. I have enjoyed playing different roles at cisco and built expertise in different domains. Learning is the best and enjoyable part of my job. Hardest part was the slow pace in career advancement. Fun place to work great benefits. Taking care of customers learned how to be a improve on my skill level. employee's where a willing to help with tasks. hardest days were when a lot of multi tasking was happening. Cisco is very laid back as long as you get the job done and deliver for customers.  My role was similar to a freelance position at first where I got to learn many different facets of business and mess around with coding and databases.The culture is amazing in RTP.  I was moved to a team in the headquarters in Silicon Valley and it became more of a 'business political' environment.  It can be stressful at times due to high demand for top-level executives. Working at Cisco can be some of your best/worst times in your career, so make sure you have good management who mentors and assesses your growth, otherwise, you will be better off somewhere else. I found Cisco to be a great environment for remote collaboration with teams word-wide.  Managers were fair and responsive.Great exposure to stretch assignments outside your role as an early in career professional; access to training, career development, and fun extra-curricular activities; fun and easy-going culture inclusive of everyone; great benefits and work-life balance Cisco reinvents itself regularly through directed initiatives, organizational changes and acquisitions.  Keeping up with the change is a constant challenge and as the saying goes 'if you don't like the way something is just wait and it will change again soon'.  The employees and management are among the brightest in the business and a pleasure to work with. If you're prepared to  put in some hours this is a great place to work, exposure to the latest and greatest technologies, empowered to make the right choice for the customer and the company, but this does come with long hours. Cisco is a good place to work.  The culture is open, and work-life balance is great.  The work is challenging, though there is not much opportunity for advancement.  Pay is decent as are the benefits.  RSU's don't really flow down the management chain to all employee levels.  Cisco has a history of consistently doing 'limited restructuring'.  Almost every year, there is some form of layoff, each time morale takes a hit.  Sometimes it appears management cannot get out of it's own way.  Recently, thousands of dollars were spent redesigning a portion of a floor in a building to be an open environment.  About 4 months later, a layoff was done which impacted many employees in that BU.  Sometimes, it just doesn't make sense. Employees at Cisco are very friendly. Work is relaxing and timing is flexible. Cisco supports remote working which is very cool. Cisco provides lot of perks at work. Cisco online study tools are great. Changes are constant in Cisco, there will be frequent re-organizations. energetic environment, start up vibeone of the first 'internet' companies because of its BBN historyno sure how it has changed over the years; company was being considered for an acquisition when I left Flexibility, relaxed, lots to learn, fast paced, Enjoyed working at Cisco, culture is fast paced, but enjoyable. Able to travel and work with various teams to provided excellence to customers. Worked remotely with fun and energetic people.  I never had a micro manager at Cisco.  Cisco was always on the forefront with new technology and also had a lot of their own great home grown technology to use in order to get my job done fast and efficiently. I am optimistic and team player and cisco culture is just opposite to it. It is poisonous and too negative though the company provide great employee benefits. Contract/Temporary employees are not valued and are used as cheap labor. This may be the same situation for major corporation now.It is hard to focus on being a good employee when you could loose your job with no notice. As a part of the Sales team, I had many daily tasks however my main focus was to manage the Regional Director's calendar. He traveled 95% of the time and he needed support on travel arrangements, meeting coordination, presentation materials, etc. Working as a contractor and regular full time employees are not open to new ideas for improvement.  Rigid structure with an us and them attitude toward contractors.  Employees are threatened by outsiders. A fast-paced environment and always having to multi-task. You will be challenged every day and also have to plan for the future task, but also be able to change priorities if required. Cisco is very fast paced with a lot to do.  Great people willing to help.  Loved the culture and pace but sometimes stressful. The role I had has been broken into several. My last role had many layers and it was very interesting. Initially, a lot of the management focus was on Opex and some of the tools we were forced to use to track Opex could have been better. It was a lot of fun to connect the dots starting from how the skus were set up, revenue recognition considerations, how supplier security or the lack of it (single supplier) could impact product shipment and revenue/gross margins, management and process considerations in taking a new product to market. Workplace culture depends on the team you are with and it can vary a lot. The most enjoyable part was the work itself. Cisco has a strong culture of supporting work /life balance and being flexible to employees' needs. It is generally not as cut-throat as many other Valley high tech companies. The downside is that advancement can be tough in such a large company and the compensation and stock value is very average. Excellent company to work for.  Very culturally diverse company that embraces it's culture.  Respects your time and also makes a very enjoyable work environment.  Everyone is so willing to help out.  I really had that my contract ended.  I would work for them longer if I could. Highly competitive, good benefits. Flexible work hours and options. Cutting edge technology. Work remotely. Day care for child when onsite. Enjoyable most of the time. Loved collaborating with many  teams.  You learned something new daily.  Resources are bountiful and work and life balance are great.  Dress is very casual much like the environment. a fast-paced environment and always having to multi-task in my role. You will be challenged every day and also have to plan for the future task but also be able to change priorities if required. Reviewed more for how information was perceived, rather than whether it actually addressed and improved upon a situation.  Management teams can tend to be petty and vindictive, spending more time talking about you than with you. I enjoyed working here.Management may need some helpI was here for 12 months and had 3 managerContractor positions easier to obtain that a full timeperm position. I worked as a remote / virtual worker for most of my career with Cisco.  It allows freedom of your schedule and promotes work/life balance.  I would recommend to a friend because of the great benefit package. Poor intern conversion rate or slow intern conversion rate.The best part is you work with the best in the networking industry and you get to learn a lot Work was challenging (Performance Testing), however, Cisco has a habit of using people and throwing them away.We were responsible for the programming of satellite security software for DirectTV, Sky, and several others. The most enjoyable part of the job was the ability to continually learn new technologies, and be challenged it. Generally speaking, the Cisco culture supports their employees and a strong workplace culture. energetic environment, start up vibeone of the first 'internet' companies because of its BBN historyno sure how it has changed over the years; company was being considered for an acquisition when I left The culture there is fast paced and you are expected to do you homework and do you part. If you enjoy having a job where you are rewarded for your hard work and your commitment to do the right thing for your customer this is the place for you! There are so many opportunities there, Cisco will give you all the training you want and access to boldness resources to enable you to be successful. It s hard work but man was it fun, I loved going to work. Working as a contractor at Cisco can get frustrating, as there's not guarantee you will be converted into a permanent position (if that's what you want). Cisco has a lot of contractors. Cisco focuses on trying to connect the universe. The work culture is great - as you can telecommute and thus enjoy better work-life balance. The management is also very focused on trying to adapt to a software driven world and this is having an impact on the work culture, particularly training for employees. Cisco is a top shelf company and a top shelf employer. The work environment is very open.  Leaders and many executives are directly accessible. Knowledge sharing is promoted aggressively. environment is haphazard at best. Was promised company trips, bonuses, etc, 2 years after I started all that went away. There is a lot of overhead with people that are in positions that your not really sure what they do. I work a lot of hours, but i get to work from home. I am working at 2 grade levels above where I am paid which seems to be typical. It's very hard to get a raise once you get into the company. Cisco provides exciting opportunities. They encourage life/work balance. The managers I have worked are pretty good and give me flexibility wrt commute so I am productive. They also provide opportunity to learn on the job, if I was missing any secondary skillset needed to accomplish the task. I have enjoyed all the assignments and miss working for Cisco. Great place to work! Mostly worked from home but had the option of going into the office when necessary. Amazing way to get things done, especially with the type of work being done. It was great working at Cisco,Unfortunately it was contract job . Sad to move out of Cisco . Great Managment Good Prodactive Hours Looking back to work for more time I was only with Cisco for 4 / 5 months, because of my network processor background. I was given a real assignment on day one, no training / orientation was provided. But I can work more than 8 hours a day and more than 40 hours a week; they paid for the extra efforts I have put in.But for the first time I have seen such a bad design in the product I worked on. Nothing in code can be reused, I have recommended a hardware resign at the end of the contract. Cisco is an awesome place to work at where you will get ample opportunities to learn and grow. The work-life balance is perfect in the organization. With an understanding management, you can focus on delivering the best. The technology, tools and the practices followed are top notch. Th work culture and the teams are friendlier than expected and compensation along with benefits is good. Being a new grad I didn't have much interaction with management politics so my experience at CISCO is much different. It is very relaxed, everyone is friendly. Being a big company there are a lot of new tasks and projects to take on. If you are an experienced job seeker Cisco is a great place to work. Culture was great;Work/life balance was great;Opportunities for moving around was great;Overall management was generally good;Strange re-structuring and re-orgs randomly was not so good; Not any place to move in the company.Was very tiring and long work days.Was a very hostile work environment.Not a lot of interactionNot so much of a leading role. A lot of us were laid off due to the company we were supporting severed ties with customer. Milestone was not really proactive in trying to help those laid off find other positions. I absolutely loved working at Cisco over the past 22 years.  We worked hard but we also had time to take off and play hard. The culture at Cisco is like that of a young company.  One of the best parts of the job was being able to work from home or remotely.  The leadership team was constantly changing so that impacted progress in key areas. The product  I am working on is using cutting edge technology to design and implement.  The design is very scalable and high performance, we are challenged to maximise the performance from available hardware. If you are a newbie, energetic, careless about the management reporting layers and wants to grow your career then this is the place for you.    Great benefits, good opportunity to learn existing and new technologies while the company is in the process of transferring itself to the digital age. Good solid place to work, progress fairly measured, decent communications internally, contract employees held away from company update meetings, some flexible work from home hours available to accommodate global team time zones. energetic environment, start up vibeone of the first 'internet' companies because of its BBN historyno sure how it has changed over the years; company was being considered for an acquisition when I left I had 2 phone interviews after which I got the offer. The first day is a long orientation after which you go to your respective BU. Work was interesting and I was given a good mentor. A lot of responsibility given to interns which is geat. Typical day at work is goodManagement is goodWorkplace culture is goodEnjoyable part of the job is goodGood opportunity to learn about Cisco WW business I was working for Cisco for a lot years where I found my second home. I learned all about communication installation with cable and optical. I enjoy my time with my co-workers and managers. Great place to work for a good work life balance but slow and difficult career advancementsTypical day at work is balanced and medium pacedManagement is understanding and employee friendly but not a good leadership for career advancementsHardest part is to make internal movesEnjoyable part is work culture Cisco is a World Leader in the IT world. My role with Cisco as with the Video (Cable TV) division. They had purchased Scientific Atlanta (Cable TV) just as I was hired.  I have never enjoyed a company as much as I did Cisco.  They offer benefits that most other companies can't come close to offering.  I had found my home with Cisco, but sad to say, I ran into health issues and now they have started to relocate the jobs from Lawrenceville, GA to Triangle Park in Raleigh, NC. Overall a good company, but the future of some BU's is in question ... and management seems to be keeping the 'plan' close to the vest, even after recent LR's.  In this regard, the silence is deafening, and is leading much of the top talent (assuming they survived the LR's) to explore other opportunities. Awesome place to work. Lots of high value clients with challenging requirementOnce can really learn the technology to the depth and become SMEVery well respected employees. Great company in transition to SW and Recurring revenue streams. Innovation is driven by acquisitions. New teams remains independent for long time and that makes the Marketing job extremely challenging A typical day at Cisco consisted of conducting Application analysis to improve automated graphic processes and services. I profiled and created marketing material for publication on Cisco's intranet marketing web. I was also responsible for training team members in preparing web-based graphics for internal 'push' feed.The most difficult part of the work was working over 60 hours a week. Good Salary, Benefits and Culture. Too Many Layoffs. Change is constant and that is a part of most companies but at Cisco change occurs too frequently in my opinion. You align yourself with a variety of objectives and then those objectives change before you can fully accomplish targeted goals. They frequently have what they term 'Limited Restructuring's', which are essentially Layoffs. They don't claim it as such as they indicate that they hire people in other fields that offset the number of people that get laid off. Working at Cisco was a life changing experience for me both personally and professionally but it wasn't perfect. So much of what they do is outsourced or automated that the majority of their internal personnel are either Sales or Managers who oversee the outsourced Vendors or Engineers. My manager was the best ever.  My team was the best ever.  Life circumstance unfortunately required that I move on        Worked on various technologies with very senior associates and learned a lot and grew. Didn't work directly with this company except from a placement perspective-  cannot review their management styles, CEO or any other perspective of their inter-workings as a company- While I only shadowed here for 3 weeks during high school, it was a friendly and helpful environment. The employees were very intelligent and were passionate about their jobs. Number driven culture with older workforce typically working from home. Experience here all depends on your individual team and management. Greatest asset to this company is their ability to have a footprint in literally every company in the world. Cisco was a great place to work.  Flexible schedules available.  A true professional environment.  The culture was positive and encouraging.  The personal development training was exactly what we needed as employees. If you find a good team, Cisco could be great. However that's hard to come by. Cisco IT is a mess, do not go their at all costs it will be a waste to your professional career. Great experience at Cisco, opportunities for advancement.  The only reason I left is because of the economy crashed and things got shaky because companies stopped buying because the banks weren't lending Very fun and challenging environment. the best place to learn, it is the very dynamic environment. Sometimes the competition among engineers is too much hassle but overall it is very friendly environment I loved working here. I appreciate how the co workers and managers were so nice and caring to me. Everyone was always so happy and always greeted me with a smile Excellent place to work at. Highly recommended to gain the experience of being part of the Cisco team and to grow being part of their teams anywhere in the world. energetic environment, start up vibeone of the first 'internet' companies because of its BBN historyno sure how it has changed over the years; company was being considered for an acquisition when I left Cisco was my career highlight.  Great place to learn and grow.  Management was very focused on the company and it's culture.  Huge amount of empowerment to make a difference and take challenges. Nice place to work if you are looking for workplace culture. The compensation is lower than the industry average. One con would be the micro management, other wise great place. Good paychecks. Engineering is king here, and good design practice is ignored so engineering can make their deadline.  Politics, politics, politics.  Toxic culture, managers lack people skills, senior architects having public tantrums in meetings, other teams dismantling your design to make it fit with what they already built, then want you to sign off on it. Team work was the order of the day but it was also a very competitive environment which put everyone on their toes. we had evaluations done regularly.staff were treated fairly i would work at Cisco again if given the chance. the opportunity of working among the best in technologies and the IT world is endless at Cisco. the opportunity to receive endless training at Cisco is priceless. Worked there a long time, learned a lot, got to experience lots of different roles but tough to advance from a career perspective as pretty political.  Cisco is trying it's best to make itself a SW company but thus far has not made the cut. It was a pleasant work environment, including:- balanced workplace culture- experienced management- ability to work on legacy systems and new technologies - half of the time was spent working with Sales team in establishing support value and making business proposals commercially viable- the other half was spent working with support teams and managing/improving customer experience- Rewarding part was balancing between customer service, budgets and securing future business- Difficult part of the job was procuring right resources and talent inline with business expectations I worked as an intern for a convention. Cisco took great care of us, trained us well, and paid very fairly. Because this was a temporary internship, there were no benefits, but our mentor had some good, competitive benefits. Overall exeperience is Ok at Cisco. I worked more than 6 years in the same team. New technologies implemented and got the opportunity to learn new technologies. Open space offices encouraging collaborative environment.  Friendly culture.  Great internal tools from HR to engineering development to people management. Cisco is constantly laying entire business units off without a goal of relocating those individuals to other organizations within the company.  If you're not in San Jose you will have limited growth possibilities.  Stay away unless you're in San Jose Great place and great people, couldn't be more happy with Cisco as a whole. I have great management and benefits and overall it's a simple job, not to say it doesn't have it quirks. Would recommend Cisco 5/5 to other people I have worked at Cisco on and off as contractor and FTE. The company has lost its mojo and tries to keep cutting costs. It has too many managerial layers. To get promotion, you must be liked by your boss and peers. Your promotion has nothing to do with working hard or producing results.Experience at Cisco is very valuable. However, the industry especially the new cloud native companies, do not value Cisco experience as much. So beware. As a traditional company, Cisco offers great health insurance and PTO policy. You can get nice work and life balance here. Culture is concerning to people. Transparent & professional job culture. Challenging work environment. Good leadership and team work. Learnt about IT resource management. flexible work hours as long as targets are met & good ROI Work Hard,  Play Hard and Have Fun!Cisco is great company to work for. lots of perks, Career Advancement. Fast Pace career. Lots of tools for self learning and growth. Cisco as a client I think I am very blessed that I got chance to work at it. Work culture is very nice. I really appreciate the way whole organization show interest in individuals' achievements. I loved the support from local and corporate management.  The best job I've ever had.  Environment was amazing.   They are good about seeing skills and promoting, regardless if you have a degree. Was placed in a team with a Manager that was new to team leadership lacking basic team building skills.  As well there are many layoffs with this company every so many years.  Other than that everything was amazing and would love to rejoin the company on a different team.  Excellent Environment! energetic environment, start up vibeone of the first 'internet' companies because of its BBN historyno sure how it has changed over the years; company was being considered for an acquisition when I left By my opinion, what I am thinking...overall is a good company, pays fairly good, not always super busy, have life work balance, but due that it is a big company not expanding too much more like start ups (just in few areas maybe)Started to have restructuring more and more often, letting thousands of people go easily due to budget cuts. I understand if something doesn't go well, no reason to spend or put more money into it... but because of this, makes it not very appealing for people with families or who want a permanent long term safe job. Not a safe work environment (job safe) any longer. And it is not up to the actual person, how well does it's job, it is up to the department, the broader group, and sales, how well that part of the company is doing. There is nothing bad to say about Cisco. This was a company that really took care of there people and paid them for there contributions. There is alot of room for advancment ! Great place to work!! Nice team and great work life balance. I liked the remote working option. Learning opportunity is great from the team members!!! This was the most stressful job I had ever had. No leadership and the boss is a nut job. Ob the flip side I got to designs clothes and learned al lot about how to survive in a high stress enviroment If you work at Cisco, you're going to learn something new every day.  You'll work with some of the brightest people around.  On the flip side, you're also going to be subject to the insecurity that is inherent in a company switching from hardware to software.  Cisco has applied agile to layoffs, and at times you won't see the benefit to the company. Very large company, provides great opportunity to get varied experiences.  Easy to continue and work in same function for many years. Make sure to plan your career and moves to get the  most relevant and progressive experience. forward looking company - good culture - provides great career opportunity - lot of benefits like ESPP, stock options , medical, dental vision. You get good support from your leaders It is a challenging place to work but can be rewarding. You can learn a lot there and will have to do so. It can be fun. They will ask for a lot at times. Very good experience working here, great environment with decent work culture. Most crucial part of the job is how everybody gets to learn things here and enjoy their work Worked with them for a year and a half, didn't have any major problems so far. I like the PTO and offered benefits. It seems better than most other recruiting companies. * Every day is a roller-coaster ride in operations* could enroll in a few leadership courses* new ideas are encouraged but not implemented* Management favors only their inner circle, rest are not nurtured for career growth - this promotes a very negative environment* bad or virtually no HR support - everything is outsourced and remote.* long work hours to work with remote teams after hours.* dull work environment with openspace concept - looks like a sweatshop and very demoralizing I am currently employed at Cisco and it's a nice place to work but there isn't much security and although it's fun I you never know when they are going to make the next big cut. First job out of college, learned a lot.  Amazing opportunity but the economy was in the toilet and I was laid off in 2008 when the market crashed.  I still have co-workers 11 years later thriving at Cisco and the company is truly remarkable.  If you can get in, and don't mind long hours, you'll be employeed by a top company and you will be compensated accordingly. Cisco, while going through a major transition from hardware to software and services, continues to be a great place to work.  It has become a large company that is not as nimble as it once was, but remains a great company.  I would go back to Cisco in a heartbeat if the right opportunity arose.  Loved working there. Cisco did an exemplary job of on-boarding a senior team to lead the introduction of products into specific vertical markets.  This enabled an effective collaboration of knowledge as specific projects were targeted. Cisco is the best place to work.  Great benefits, work life balance, great colleagues. I enjoyed every minute of working here. I realized I should have never left Cisco for a Parter role. It's a very fun plac eto work in. Everyone is very Friendly and helpful. I have learn alot with the diffrent technology we have. I really enjoy my job but would like to move on up and see if I can get a good oppurtunity somewhere else. Cisco is a very nice place to work. Management is very friendly and supportive. I got to learn many new things as past of my experience at Cisco. I would definitely recommend this company to a friend Exposure to many different projects. Flexibility with hours and vacation. Great people to work with, and great culture. Seemed like a good place to work full time as well. Typical day:  meetings with internal project teams and suppliersLearned about mid-range switching & routing, proprietary SRAM architectureManagement: very goodCulture: very good. Most enjoyable: learning, working with high-performing teams energetic environment, start up vibeone of the first 'internet' companies because of its BBN historyno sure how it has changed over the years; company was being considered for an acquisition when I left Almost constant 're-organization' and lay-offs definitely have taken it's toll on Cisco as a once great company to work for. No longer a place you can make a career at. The work doesn't lessen while the workforce is reduced. Cisco is in IT and total addressable market is shrinking.  They have not broken out from selling primarily products that are becoming commoditized.  As a result, management keeps trying new things, but mostly, continued downsizing and cronyism. Great place to work,  helpful staff.  Only problem, too much turn around due to budvets and project timeframes. The company has changed over tbe years, but is still one of the best places to work. Projects in Cisco are very well orchestrated with good coordinating among teams that dot the i's and cross the t's.All resources required to do the job and create good results are provided.However, they have a tendency to overreact to events and downsize and upsize on whims. I liked my experience at Cisco because I learned a lot by working with a lot of very smart people.  It is a very competitive place, so it is not good for someone who seeks work life balance.  I was well compensated, but along with it the compensation, I felt obligated t go more than was asked in order to remain relevant within the eyes of management.  The hardest part of the job is that I had to work with a lot of cross functional team members, but I had to do a lot of investigation to find out who I need to speak with to get what I need.  The company is very disparate, instructions tend to be very vague, and those who can come up with ways to solve things on his own the fastest wins.  I was constantly faced with balancing areas that are overly prescriptive with areas that were overly vague, yet management expect very specific outcome, and you don't necessary know what they are up front. Very diverse culture. The atmosphere is one that i enjoyed. The people are very friendly and willing to assist you with being successful. If i was offered another contract or permanent position with them i would take it with a guarantee. Good not great culture. New management is shaky. Unsure of companies new direction. Good options for remote workers. Stock dividend is a plus when purchasing ESPPs. There is a large cultural gap between the veterans and the new hires, but overall Cisco is working to close the gap. Cisco is a great place to start off your and learn new skills and value. good work life balance and  finance is good place to work and esplore data driven projects . Imporoved my data analysis skills and  also BI skills rewuired for Reporting On peut s'améliorer avec le temps si on est sérieux Networking focussed company, need to have strong networking fundamentals, productive and fun work place to be in, good work-life balance,good-colleags Productive workplace but no recognition and consultants are not treated professionally. Projects are good to work on and give great exposure to diverse team environment. But only full time employees are given recognition. Cisco has given me great flexibility.I am currently part of a managed service.there are many great opportunities within the company, but you must speak up or you will simply do the same thing over and over. For those who are looking for a place to wind down, spend time with your family and see little growth, this is the spot for you. Despite encouraging innovation and thinking differently, they reward those who play by the rules. Great people and a relaxing open culture will make it difficult to leave. Excellent company culture. People first. Great top down level of communication with quarterly, monthly and weekly meetings at the company, organizational and team levels to move everyone toward business goals. No Advancement, not a good culture. Layoffs. Wouldn't recommend. HW company, no vision, no strategy. Good compensation, however no stability, very short vacation. Nice culture, I enjoyed the chess and games room for lunches.  It's a global company, but it treats the employees very well. I was a contractor, but had fun. Access to an unlimited and vast amount of information. Potential for career growth is very positive, due to existing and future technologies constantly being introduced to. You can make your own hours CISCO was definitely a productive and fun workplace. I was very glad they had job training and flexible hours that worked around my college classes. Great colleagues. At my time at Cisco, I met with many people across various departments. Whenever I had a question, managers were more than open to setting up time to talk--and that went for the whole organization. Everyone was willing to share about their jobs or life experiences as well as answer any questions. "
                },
"encodingType":"UTF8"
}
