{
"document":{
"type":"PLAIN_TEXT",
"language": "EN",
"content":"Tj maxx was a fun place to work  but it as extremly ahrd harder than anyon thinks. People aren't very nice when it comes to their money.  had to take care of 3 at 5 different depaments. Clean pick up and organize the fitting room, do cashier at the same time. The pay wasn't very good nether my co workers are the best and the management needed some work Working for Dell via an Alorica call center hasn't been all that bad. There is plenty of proper incentive per month to really do the best you can in your position and plenty of opportunity to progress with a career with them. You are weighed heavily on metrics, and there is not a lot of back-up when a customer becomes unruly on the phone, you ultimately have to take the abuse. If you are able to make it the benefits are there for you to have and they are not bad. My coworkers are really what kept me going to the job day to day. Perfect job to get introduced into a IT role but there is no opportunity to get promoted with team. DellEMC has top notch training facilities and technologies which will help with Career development. Dell allows the freedom to work and 'run your business' with a high level of accountability and support.  This freedom and trust is a big motivator for man. great opportunity to expand sales experience, great management, culture is excellent for those who are driven to succeed.  I had wonderful sales and technical training. typical day at work go and take calls learn how to make customer satisfied good to work hard part was can get any over time there most enjoyable part was going to GYM at work The merge with Dell (formely EMC) ruined the company. They care more about the money than the people like how it used to be. They do lay offs often, and all the decent reasons to work for them, they’re slowly weeding away. Company is falling apart. They allow people who have ins with the company to get away with anything, by turning their heads. However, others will walk on egg shells. Certain managers are more lenient than others. Some buildings are worst to work in than others. Work and life balance presenceTrainings for employees to upgrade their learningsVery good management Paperless kind of officeUpdates in accounting systems been used Great place to work. Flexible hours, remote work, lots of networking opportunities, great benefits including medical but not limited to it. Great team with great leadership. Ever since the merger the company culture and attitude has completely changed.  No longer does the company care about its customers.  The company only cares about useless metrics that a broken system generates.  Making it worse is that instead of improving those systems they just micromanage even more, all the way to VP’s micromanaging the lowest level employees.  This leads to employees just making the numbers look good to keeep management off their backs because if the job was done properly with the customer in mind the metrics generated would look poor.  Benefits have been reduced.  We used to get $50,000 for grad school reimbursement.  Now it’s $5,250 per year.  Health benefits are worse and more expensive.  People quit or are fired and never replaced to save money but management complains about overtime.  I used to swear I would never leave EMC.  Now, I don’t know how they will be the leader that they are in 5 years with how quickly they are moving from caring about the customers who keep them in business. I did learn how to build and to teardown computers. The lean practices were just to much for example your needed tools such as a writing pen, box cutter and blades etc... when you go the replenish these you were hassle as to why, most people would just bring there own from home to avoid this. In my time at Dell, it's been a great place to learn and develop the career skills that have put me on a very positive vector over the last few years.  The flexible work arrangement I've had for the last 3 years has allowed me to not only progress in my career but to also be at home with my 4 young children that are almost all now in school.  The culture is strongly merit-oriented and a sincerely positive work environment. Dell is a great place to work. I enjoyed my time there. They value their employees and pay well. Their benefits are great as well. Overall, I've had a great experience there. I did support for a medical client they had.  Dell was the outsource vendor, and the medical customer let go of IT staff to bring on Dell.  Naturally, those leaving the medical business were not happy about that and it presented a lot of ugliness and politics. Dell used to be almost a family company.  It's now undergoing a lot of change.  A lot of the processes are broken.  Where folks used to take ownership of problems, there is a greater likelihood of someone referring an issue to another team.  There is a huge disconnect between how senior management thinks the company is doing and the rank-and-file feels the company is doing.  While the executive Team says the the company is have a great quarter, travel is restricted, and no one can have a team lunch. Really trusted in the mission on enabling human progression through digital transformation. I have learned more than just Dell missions I learned about the customers impacts and what solutions we could offer. Dell is a productive work environment and very bust always about what is next.  Dell will consider just about anything and even try an idea to see if it works, if it doesn't wont hesitate to move in another direction. I worked at Dell for 17 years.  It was a fun place to work, yet they are bitten by everything every other company was bit with, cheap support to save the costs of producing computers.   When I left Dell, they were still #1, since that departure they have steadily dropped in quality.   I was layedoff from Dell for the 'needs of the business'.   I think its a great company, but as you acquire tenure in the company you become a target for layoff.   That is not fair to the employee.   Other than that, I loved the place!    Its a very laid back environment, you constantly are updated on newest technological advancements, and procedures.   Majority of the managment is good. Project Manager in various capacities.  Dell is a great place to expand your horizons, continue your education and gain advancement in your career.  Dell provides excellent benefits. Dell is still in great turmoil from the EMC acquisition in many orgs.Dells decision to go public has driven cost reduction at the expense of many US based employees, with many of these positions being sent offshore to 'lower cost' regions. Tj maxx was a fun place to work  but it as extremly ahrd harder than anyon thinks. People aren't very nice when it comes to their money.  had to take care of 3 at 5 different depaments. Clean pick up and organize the fitting room, do cashier at the same time. The pay wasn't very good nether my co workers are the best and the management needed some work It pays the bills but it's a grindy, competative, political job in a call center that is far more stressful than it should be, but it pays you and that's that. Good opportunities to growthGreat teams to work with, and training available. Technology driven environment, constant changes but exciting environment. the people there are very kind and always give you the opportunity to grow and shine in their work environment. always gave support to all their employees The company was an absolutely great place to work.  Had the ability to make decisions concerning daily schedules, goals, targets,milestones.  Good support system to provide assistance onboarding. .....great place to work and learn, financialwise.....thumbs down        with more employee appreciation there might not be that much need for constant hiring events... not a lot of structure, very disorganized. management is very lacksadasal when making corporate decisions. Team structure is very diluted. Not a lot of incentive. Due to recent changes to the way we do business, there is limited structure and lack of definition of roles and responsibilities. In effect we duplicate some tasks and leave others not completed. Dell has an unstructured internship program. Evaluation criteria is loosely communicated and they pay more attention to their 1x1 meetings than to doing actual good work.On a more positive note, the work life balance is great and Austin is a very cool city. Working for dell we was good.  To bad thing they provided employee with low end laptops.   Had to change laptop multiple time due to disk failure and had to re-image laptop multiple times also. Good benefits however, never a raise in 5 years of service. Poor training strategies. Team leads assistance non-existant. No raises ever, not even to keep up with cost of living. Before Documentum sold itself to EMC they were a thriving company with a unique work culture with exceptional and talented staff. EMC due its size decided their way was the best way and because they lacked any software products just did not appreciated  the selling cycle, investment into product development. Because of their impatience and lack of investment they off shored all the development , they saved a lot of money for short term gains but ended up losing sight what made Documentum the premier product of its kind in the industry. Not sure why they thought Documentum would be good fit, only to sell it some years later. EMC was on growth phase they were just buying companies left an right. I suppose that is one way to grow. I never had issues work for them. It was in a down turn I chose to leave to be ahead of layoffs. If it were not for the slow time, I would still be with the organization. In the 2 years I was there I learned how to use SAP, engaged in different gatherings the company offered and meet a lot of beautiful people. There were times things became stressful but not often. Awesome group of professionals, team work like never seen before very independent and empowering team environment. Loved going to work every single day Loved it there until I got laid off - I'd still be there if that didn't happen.   I loved the work, and most of the people - didn't like the politivs - also I had a boss who told me I'd have a job as long as he had a job, he's still there - obviously I'm not Dell/EMC was a great place to work and continue my career in Project/Program Management in Logistics and Supply Chain.Due to Dell Technologies being worldwide, several teams are spread out and therefore some people are able to work remotely.  I was one of those and it worked out wonderfully and even allowed me to be more productive during the day with less distractions. Great place to work, flexible / remote work schedule and hours. Not bad work life balance.  Most mangers are helpful in developing their direct reports. At the time I worked at Dell, it was exciting to be a part of a dynamic company. However, shortly after I started working there, they began outsourcing the department I worked in and I left the company just before the whole of the department was outsourced. As an intern given good projects which help me to learn new technologies.Work is good. Good intern event helped us to network and meet people from different teams and higher authority. At Dell, there is always something new to pursue.  Dell is on the cutting edge of technical and social changes.  It's a great place to learn and grow in your career. Tj maxx was a fun place to work  but it as extremly ahrd harder than anyon thinks. People aren't very nice when it comes to their money.  had to take care of 3 at 5 different depaments. Clean pick up and organize the fitting room, do cashier at the same time. The pay wasn't very good nether my co workers are the best and the management needed some work Dell was a great opportunity but the way they handle issues between employees is unprofessional and not precise at all. Overall great company and would recommend them Loved the can-do, results driven, high ethics of the leadership and company.  The work was challenging, but rewarding.  There is a constant focus on doing better. Worked at Dell warehouse as a temp for 6 months. Hours great, Pay great. No weekends unless you signed up for weekend work. Will teach how to drive a tow motor. I was at EMC2 during thr merger with dell as a part time employee working on my degree as well. There was no room for advancement from the position I was in. Dell focuses on the small group to let other groups compete without discouraging growth. The management needed a little help to being more focused on individual growth within the group. Really wasn't much to this job. Very very strict on you being on time. Taught me the importance on being on time on your job. Not very flexible. Good lunch. Didn't get along with alot of my co-workers they were very rude and nasty. Didn't choose respectful and polite workers I worked there for almost 6 years, but should have looked elsewhere after 2 1/2 ~ 3 years. Good old boy system. Dell's meritocracy is a joke. Glad I left. overall it is a great company and they have great benefits, the supervisor was great but management was not so understandable with personal issues but I loved working for this company.  They were very employee friendly.  I had everything I needed to be successful in my role and to learn new things.  I would love to return Dell is a challenging and fast paced place to work. Very manual processes used instead of systems or automation. PC culture overall and that is to squeeze costs. excellent company to work for overall. As a Sales associate, computer specialist, customer service, tech support. Personal and business computers sales and tech support /customer service. As part of my job at Dell. I  was constantly taking online Microsoft courses such as The Microsoft Windows Expert courses.excellent work environment,  excellent learning opportunities. regarding today and tomorrow technology. Microsoft certificate is given regularly upon completion of various computer courses. Dell Services Federal Gov is a great place to work for recent college graduates. It allows you the opportunity to grow as well as become accustom to working in the real world. Silos by product line. Friendly work culture.Limited opportunity to job change for remote workers.Products are expensive compared to competition and lack innovation. The name of Dell's game is balance. I'm a workaholic and compulsive problem solver, so ot took me  a while to get used to the structure.I love the current role . I strive with my team to help enable all EMC storage SW and server products to be quoted ,ordered and priced  through the Dell Stack.Pivotal Cloud and balance teams make CICD and seamless deployments happen to suit business requirementsDell has been very futuristic in socializing PCF to all our devs and help build an organization aligned to IT Business's true north! Great place to work but your job is not secure. Lot of change and jobs are going overseas. That just my experience not necessary every department in company Far too much micromangement for me. I have tried to move into management three times and been ignored. I have heard similar stories from around the company. I am looking to go elsewhere. It was fun working on teams that could get products delivered on schedule but direction from business was vague and there was too much big company bureaucracy to deal with .  I was able to work on a wide variety of interesting projects with good people. A very fast pace job.   Build was my main job but would help out in other areas when needed . Over the years I had some great Managers .Most enjoyable part of the job was working around a lot of  good employees Employee oriented environment, good benefits, and room for growth. Only drawback is lack of hiring. Two year contract maximum for contractors. Call back after three months if needed. Just can talk about Dell EMC as it became the part of DELL .Flexible work schedule and work environment , great product , going through  restructuring recently and frequent change of management.Us Tj maxx was a fun place to work  but it as extremly ahrd harder than anyon thinks. People aren't very nice when it comes to their money.  had to take care of 3 at 5 different depaments. Clean pick up and organize the fitting room, do cashier at the same time. The pay wasn't very good nether my co workers are the best and the management needed some work I don't have much to say.   Everything was fine and good. Please adjust and resubmit.  Your Review doesn't quite meet our quality guidelines.   it was excellent I am a remote employee, so Dell doesn't pay much attention to the support we need.  It is there, but you will have to work for it more often than you would think.  I have learned much from my time here both personally and professionally, most of it through observation rather than a deliberate managed structure. Inconsistent leadership.  Sales and service delivery are not well aligned.Inconsistent reportingSlow to innovate and embrace changeCloud phobic Here because there is no local offices, it is hard for me to get any additional benefits than just working from home and medical insurance only for me, does not include my family sadly. Dell in an amazing place to work. A ton of advancement opportunities!! The benefits are great. They offer 3 weeks of vacation to start from day 1, 2 weeks of personal business allowance from day 1, health, vision, dental, 401k all from day 1 of full time employment. I hired into Dell and I enjoyed the work and the managers that I had when I hired in.  Things went a little sideways when NTTDATA bought our division and we lost many of our benefits. Dell is a great company to work for providing many opportunities for training and career advancement. They offered great medical benefits and incentives for community service events. Dell is an ok company to work for. As usual it depends on the team and it's leadership you are working with. The pay and benefits are on par with the IT industry. Good work/life balance, a lot of change undergone since Dell took over. EMC was very successful and workers enjoyed working there, Dell came in and some do not feel the same Dell was as incredibly interesting workplace which provided many chances for personal growth. Dell employees  are incredibly diverse and provide intriguing outlooks on life and form a complex community of incredible people. It was a short job, updating computers at the VA hospital's disaster areas. Have no real opinion on the job. Was a decent paying job for what it was for. There is no lack of possibilities to move your career forward.  Dell has a progressive D&I (diversity and inclusion) goal.  Though there is still a 'boys club' mentality, the tides are changing albeit very very slowly.  In sales, you'll see a handful of female leaders (Director or above), but not many women of color. Enjoyed working at Dell, they acquired EMC then sold off the software ECD to OpenText so moved to OT in Jan 2017.  Dell was a positive work experience with great benefits.   Reasonable salary, Lots of opportunity to rotate.  People are friendly and intelligent and there are opportunities for advancement since the company is so large.  I would recommend Dell. Great pay and benefits.  Plenty of opportunities for advancement.  Excellent work culture.  Social activities available to help the community.  Great leadership amongst management. It was a great please for a springboard for another position. Another unstable organization since work is based on contracts with other companies. But a great location for learning Dell argo was a great place to work everyone was nice friendly very easy work place the place was always clean i will definitely recommand Dell argo company to work for. My experience stemmed from the Dell Services portion of the company during the time they tried to turn customer facing operations into assembly line sweat shops... The mentality to build a mold and try and fit every relationship into that mold was a terrible idea. The most enjoyable part of my job was working with a great team of like minded individuals. Management was very indecisive. Employees were not compensated well and the company did not take care of its infrastructure team! My tenure at Dell EMC was a whirlwind of exciting opportunities with the ability to progress into upper management.  If you work hard enough, your efforts pay off.  No doubt, the work/life balance has been challenging; however, it was a personal choice in order to advance in my career.  One thing I learned with this company, is that you cannot stop the forward momentum.  If you like a challenge, this company offers that and more to those who want to excel. Tj maxx was a fun place to work  but it as extremly ahrd harder than anyon thinks. People aren't very nice when it comes to their money.  had to take care of 3 at 5 different depaments. Clean pick up and organize the fitting room, do cashier at the same time. The pay wasn't very good nether my co workers are the best and the management needed some work Didn't feel important, working onsite at customer location and not in company headquarters.Paid only enough to fit in contract budget.No room for upward movement. Working at Dell is a great experience. The culture is wonderful. The people are some of the best in their fields.  Job security has been great, better than with the US Government. I have only known working at a remote customer site. Dell was a good place to learn customer service. Management needed improvement. Environment was fast-paced with good training. However, benefits were not very competitive. Great 6 yrs with Dell. Work from home is great but makes you feel invisible .Not a lot of Growth in the TA team. You work very hard, to only get slap on the hands for working hard. They try, but can be better Able to work remote.Learned more about security.Working remote means less interactions.They do want you to get involved outside of work.they do give many learning opportunities. I very much enjoyed working for Dell.  I was able to work from home for the last two years due to illness and was given MUCH flexibility to go to all dr appts that I needed.  I loved the people I worked with, loved the location I worked in and loved the culture. Dell is a good place to work.  I worked here for almost 13 years and enhanced my professional skills and abilities.    I love how they help you grow in your roles and have lots of opportunity for growth. Enjoyed my time at Dell. The department I worked in could be quite stressful due to the nature of our positions but the supervisor was always available to help and do what was needed to help. typically work is very flexible, learned lot of technologies and framework, management is very supportive, work culture is okay, i don't see anything hardest par of the job Dell is a forward thinking company, consistently working to provide IT solutions that fit today's environment and moving the industry tomorrow's IT landscape. I am well versed with Dell desktops and laptops. I worked at Boeing (Space Shuttle division), Harris County (IT department), and major corporations using Dell desktops and laptops. As a result, I am familiar with Dell technology and setup. I typicall have teleconferences in the morning with team members in India, Europe, East Coast, and Mountain time zone.Answer emails usually after researching/confirming/validating an issue or data delivered.Query data sources (Teradata, SQLServer, Oracle, flatf files). Linux on Win10 handling of flst files. Work / Life balance was supported by leadership. Also, team building exercises.Internal movement supported by leadership to offer upward mobility when position opened. I have been working here since last 5 years. I can vouch that i have definitely grew from a career perspective. Managers also help you grow from a skill set perspective as well career perspective Typical day involves receiving inbound calls requesting diagnoses and resolution of issues related to Dell hardware &softwareGreat place to start your career, learn, and grow.Management at  my location was accommodating when compared to other jobs I've held. They always made the effort when able despite how busy they were.Culture at my location was improving, with video game events free of charge for employees on the weekends.The hardest part of the job was keeping up with the the potentially overwhelming amount of open service tickets you could accrue. The most enjoyable part were the awesome people you worked with up and down the company ranks. Decent company for just a job, but if they bought your company, they quickly get rid of you. I wish they focused more on career growth and less on laying people off to save money. We were a pilot company, so we learned as we went the first year. The job aids and system maneuvering were very confusing as well. Most fellow coworkers were supportive overall, but the expectations exceeded the compensation. I felt lost and overwhelmed the majority of the time.  Almost daily overtime was expected with no consideration for our home life activities. In my 2 most recent positions, one was high stress and log hours, but everyone was involved in meeting a common goal.  The other was more casual but found that not all workers and managers seemed to be focused on the same set of goals. Dell was an average place to work as a first job.  I worked in a remote location so the management most times seems dis-attached or separated from us.  The pay was okay for Mississippi but raises were few and far between. Good place to work, very tenured group of people.  Flexible work environment, work life balance.  Learned a lot about finance and how it impacts the workplace. Tj maxx was a fun place to work  but it as extremly ahrd harder than anyon thinks. People aren't very nice when it comes to their money.  had to take care of 3 at 5 different depaments. Clean pick up and organize the fitting room, do cashier at the same time. The pay wasn't very good nether my co workers are the best and the management needed some work Not enough direction from leadership after the merger happened. Very difficult to understand the direction the company is moving in and how resources are affected. It was difficult to find new opportunities in other areas of business. Felt restricted to a path...change tends to be tough to execute. Learned a great deal about technology trends.Had great benefits. If you had a good manager the job would be great. +  The company is going through massive restructuring following the acquisition of EMC and subsequent plans to go public (IPO'ing through the DVMT VMWare tracking stock)+  Your mileage will vary based on what group/office you land in If you are looking for somewhere to work with 40 hours and strict guidlines and stress then this is a great place to work. Your hours can be changed at the drop of a hat and they dont care about you as a person. Dell is a company that allows its employees and schedule that supports a life balance. It is also committed to support minorities and environmental causes It's a great company to work for with the risk of moving jobs since due to recent changes jobs gets moved to Bratislava.  You get to learn many new software for you to  pick it up and make your work much more efficient. Dell EMC has a unique call center feel while still learning and working with IT professionals. You are the professional for your product and you are the one that will fix the issue. It is either that or you will have to escalate. The problem with Dell EMC is you do have to spend many years 4+ to get an advancement to their next level. Otherwise take a different route to move up.The benefits are good and pay is good as well. The only problem I have is working with some IT professionals with other companies and realizing that these guys get paid double your wage and sometimes make really bad mistakes. Then blame you because the product isn't working the way it should because they broke it.The other side to this company that is hard and can be aggravating at  times is working with your own Dell EMC employees. The main reason is because they are all for the customer even if it is their own fault this happened. Some of the employees, not all I might add, think them the greatest thing on this planet which just leaves a sour taste working with them.Other than the 2 things I have mentioned. It is a great place to work. You learn a lot and the people you work with on your team are generally really helpful and want you to succeed. It was difficult to find new opportunities in other areas of business. Felt restricted to a path...change tends to be tough to execute. Learned a great deal about technology trends. From consumer to data center. Solving complex engineering problems with team mates.Most of the employees at Dell are very talented and collaborative.Work place culture is relaxed. Mostly good people.  Only lip service to work-life balance.  Despite going private a few years ago, there was never any change to the obsession with quarterly results.  RIF's are a constant bad habit. It's nice working with Dell. Working with Dell is not stressful and the tasks very are manageable. I'm just hoping that they would give more incentives. Though leadership gets short sighted with fire fighting. And current mission trumps proactive measures, it still has a great mission and works hard to deliver for its customers. Great opportunity to learn and grow into new  technologies. Management was supportive and encouraging. Good place to advance and ample opportunity to gain knowledge into the Information Technology field. Great place to work.  Would love to return one day.  Management is driven, but also stops and listens.  Opportunity for growth and continued learning. At Dell, everyone works well together and we try to make it a fun and productive place so everyone looks forward to coming to work.I had a great staff and a wonderful Manager.I enjoyed my job and i had the opportunity to work in several other areas and learn things that i always wanted to learn Good place to work. Staff are all knowledgeable and  helpful. Management are fair and balanced. A very flexible work schedule when you need to alter your day. This was my first real job out of college and it was nice being treated like an adult for the most part. They trust you to meet your goals and will give you a push if you lag behind. Enjoyed my time at (Dell) EMC/Documentum.   It was awesome to work for a market leader selling enterprise software solutions to F-500 accounts.   Virtual teamwork was highly leveraged and we were able to find and apply all kinds of talents to drive value to our customer's business. I worked in the pro-support department and had 2 managers, both were extremely professional. The company is a great place to grow, and advance if you want. There is a very high ceiling if you want to go for it. They encourage personal growth, have great work life balance and have options to help with certifications and tuition. I worked for DELL when they took over my Tech Support role. They touted themselves as 'DELL Managed Field Services'.As many may know, the DELL Client Field Services unit was bought by NTT Data of Japan in 2016.Based on my experience, management's complete lack of being in touch with their customer needs is at least partially to blame for the failure of their managed services.Although the pay was very in-line with industry standards, it was a bit distressing for the techs to know more than their managers about any given situation. Since the unit was sold, things improved quite a bit. Tj maxx was a fun place to work  but it as extremly ahrd harder than anyon thinks. People aren't very nice when it comes to their money.  had to take care of 3 at 5 different depaments. Clean pick up and organize the fitting room, do cashier at the same time. The pay wasn't very good nether my co workers are the best and the management needed some work Dell was a wonderful place to work.  After spending nine years at Dell, I can say that I grew developmentally as a person and professionally. I had the opportunity to cross over many marketing jobs including product marketing, advertising, and web production. DELL|EMC merged in September of 2015 forming the largest privately held IT company, their market position has grown across the business as the two organizations synergistically operated with each other. Dell was a great place to work and the people there were very nice, the only complaint that i had was that the management promised advancements to the contractors and it never happened.  We were contractors there for over a year and a half and with no benefits, no holiday pay, no paid time off.  Being a contractor that long with a family was not going to cut it. Great work environment. A lot of opportunities for learning technology. The job security was not strong once the company went private and closed down Nashville operations. I left after VCE was acquired by EMC Corp., before Dell Corp. acquired EMC.  I have little information about the climate and leadership at the Dell run company. Great company to work for. The Executive Leadership in the company were amazing. They were really in tuned with the employees. The over all culture made it a great place to work. Dell EMC was a great group of people to work with. We had a great working relationship and socialized easily outside of work as well. I would recommend this place to anyone interested. I enjoyed my time there and would go back if given the opportunity. The work/life balance in particular is great. The 401K is awesome. The medical benefits are just okay. Management sucks.  Most are not knowledgeable as required.  Replace upper management.  Overall pretty good company to work for.  Would work for them again if given opportunity. Great company. MSD is a great hands on CEO. Very collaborative environment where everyone has the ability to search out those who they want to learn. Highly recommend. good place to work. not too busy not to slow. good co workers. easy job for fast learners. sometimes can be a little too much work, but only at end of quarters. This is an inbound call center.  Sold and upgraded computers systems, security packages, networking options and Microsoft licensing to individuals as well as business owners. The people who succeed at Dell started there very young and really don't know any better.  Compared to other employers in the business, Dell treats people like interchangeable parts and values conformance with policy much more highly than individual contributions.  Pay is below average for the industry.  Commissions are always a struggle to calculate and verify.On the plus side, every customer talks to Dell.  There are sales to be made. Desktop support at a hospital.  Mostly nice people but a bit stressful.  Good boss and coworkers.  Got good performance reviews but few raises.  Seems like there is a trend of reduced benefits for the average employee. Dell has one of the more vibrant work culture, which requires employee to learn new technologies part of their overall organization strategy and its rewarding. I recommend this company/position for individuals who are enthusiastic and with great communication skills. Daily tasks included inbound and outbound calls/emails with clients and consistent collaboration in a team environment. Dell is in transition period after major acquisition. Roles and responsibilities have settled, but overall work direction is less focused. Cultural blend of Dell and EMC is still WIP. In my tenure at Dell, I was moved to a position I didn't want and tried to make the most of it until I was ultimately laid off two months shy of my five-year anniversary. ability to work from home as needed. advancement opportunity but layoffs a lot. relocating and travelling for your career. great benefits and fantastic pay and benefits. Very flexible hours I really enjoyed working for Dell under contract and even though there were plenty of opportunity for advancement within the company the contract I was currently under changed to another company as well as job opportunities within Dell. Tj maxx was a fun place to work  but it as extremly ahrd harder than anyon thinks. People aren't very nice when it comes to their money.  had to take care of 3 at 5 different depaments. Clean pick up and organize the fitting room, do cashier at the same time. The pay wasn't very good nether my co workers are the best and the management needed some work Great company, but sometimes poor management planning with company transitions when company changes happen. I enjoyed working with people across the globe. Great Place to Work.  I would suggest any young professional to get their feet wet at Dell.  Great training and culture.  Learn a lot from a winning team like Dell. It was a good experience and i'm sure things are done much differently now than they used to be and pay is different. Dell is a good company to work for . Dell is a company that is excellent at self promotion and marketing.  Maintaining a work-life balance can be challenging.  Continuous change, state of flux is the norm. Each group is diff, all the best.Make sure manager you are reporting to is influential.try to understand the team you are working for and Job description.Each group is different - folks in the team makes a great deal. mostly hire friends and not merit based promotions.  Lots of HR rules to keep salaries down and limit promotions.  Can't change jobs within 18 months of earning a new role, Regardless of experience you aren't allowed to promote 2 levels for a new job you've interviewed and gained, can't get a promotion within your current role regardless of experience, Dell is a huge company that employs people all across the world.  They do require employees behavior outside work to be above reproach.  They have quarterly recognition events. Awesome employer to work for. Great benefits and a culture of team work and telecommuting. Dell is truly an outstanding company to be apart of.  They strive on providing employees the tools they'll need to continuously grow professionally.  The benefits are good as well I always had the proper staff at the proper time in the proper location and we exceeded expectations by delivering on time and on budget.Teams were self monitoring and self correcting.  Upper management rarely needed to attend meetings. I invested 9 years with Dell and I enjoyed the stability and flexibilty it provided. When the option to work from home was a possibility, this allowed me to be present for my son more on a daily basis. I learned to multi-task in a high paced environment, collaborate cross-functionally, adapt to many job roles and responsibilities and develop skill sets across many job functions. I became proficient in Microsoft Word, Excel, amongt many other applications. They changed management too much.  The rules changed almost every other week so it was hard to stay consistent in processing claims correctly.  But once they finally got a new Supervision and a new trainer, it made it a little better with consistency in processing. The benefits were not that bad.  I really did enjoy the flex time because it allowed many of us to take care of business without using so much of our PTO or call in.  I think overall if the pay was a little higher and there weren't so many turnovers in management, it would have made the job a little bit better or the company a better company to work for. productive and fun work place, helpful and supporting people with experience challenging, engaging culture that strives to do better, very amazing people Dell-EMC offers a technologically sound development environment for products for many of the most important companies in the world.  They use cutting edge technology to develop products that suit enterprise needs.  They offer training to improve your skills.  It is a very visible job, with customers around the world to service on products that are very valuable to the market. Good place to work for, I did like the time I used to have lunches for free, and I did no like that everything was being monitored even the times going to the restroom. Dell is a LLC of more then 200 companies, there is not just one Dell, each department is their own LLC They also only hire for contract.  Which is why I will never go back there again. Overall a good place to work with many opportunities to control your own career. The people are great and always willing to help out.There are times where the tools and processes seem outdated and difficult to navigate through. standard operations. which are only good to stick around while you get started. this will help you understand what you need to grow in life, dont expect more. Flexible work environment is great.Management is okayCompensation could be betterWorkplace culture is very averageOver Dell is a okay place to work. A day at dell consists of coming in on time setting   up my station and putting a fresh battery in the rf scanner and preparing  my work station with parts that will be needed to scan into the system and to put the hardware together. Tj maxx was a fun place to work  but it as extremly ahrd harder than anyon thinks. People aren't very nice when it comes to their money.  had to take care of 3 at 5 different depaments. Clean pick up and organize the fitting room, do cashier at the same time. The pay wasn't very good nether my co workers are the best and the management needed some work Time Management is the most challenging part of the job. I enjoyed a good conversation with my customers as far as any kind of technical concerns or questions. Dell is a great place to start your career.  Dell provides has many different areas to gain experiences and opportunities to learn in different areas from the business to HR. This was the best company that I have ever worked for. Great pay I knew I was responsible for my pay since I was on commission and a base pay. Great environment and Michael Dell really takes care of his employees Some busy days but you learn a lot from the senior engineersManagement is always helpful when you need any helpThere is always fun events at the workplaceThe hardest part of the job is noneVery nice time to work with everybody is very helpful Great culture and work-life balance. The management team has a clear, visible strategy and works hard to communicate it to the rest of the company. The company provides a challenging environment but also provides the tools to succeed. Good work life balance Good benefitsGreat flexibility although it depends on the department your hired inI would recommend Dell corporate and their sister companies Dell was a great company to work for. Unfortunately for a newly single dad it wasn't very accommodating. Long hours with siloed departments often undermining productivity. Endless meetings during office hours led to working too much from home and a low quality of life. Great organization, large and great team.Enjoyed my time at dell. Great manager. The company cared for employees and their professional development.Managers were amazing I joined the company through the acquisition of EMC.  The financial systems and tools of these two gigantic companies are different from the architecture and logic perspectives.  We need a clear strategy / roadmap for the finance community to understand and envision. Great People to work with.  Very sharp an smart folks.  Management at times can be too focused on operational vs professional development.A typical day depends on what is currently going on.  At times there can be a lot of churn due to an unexpected turn of events.  If that is the case, very strategic messaging begins to take place.When things are good, it can be really good.  Plenty of time to get real work done.  Great work-life balance.  Treated like a professional. Pros: Competitive Salary. Great work life balance. Great place to work with wonderful Colleagues.Cons: Possibilities of growth mainly outside of Bay Area. Overall Dell was a great place to work, there were times when Account Executives were promoted to Managers and a few of  those managers were not cut out for the job are company was family oriented and respectful to other cultures benefits were excellent. Paid Vacations, I really enjoyed working for this company. thank you A typical day at work is to provide planning and analysis for the Americas Enterprise Sales organization.   The people are the most enjoyable part of the job. Unfortunately the group I was working for moved to India.  So we were laid off. I would of loved to stay or transfer but that was a time of turmoil for the company as a whole. EMC is great place to work.  The culture is sales first and they work on all the operational issue in the background, making customers the number one priority. Dell introduced me to the core of private industry (all facets). The company picnics, company holiday events, company team-builder 'off-site' events, etc. were wonderful morale building tools. Salary was competitive, benefits were great and human resource, finance and management personnel were high caliber and extremely professional. The workload was challenging, yet manageable, and very rewarding to me and my team. I would never have left the job I had except they were relocating the operation I supported to another state, and I was unable to leave Texas due to a critical family need. Great work life balance. Amazing mangers. Worked from home 3 days a week and 2 days in office. Very focused on keeping the balance between work and home. I loved that if I was needing to work extra in the evening I could just log on and work. I loved working for Dell.I had a great staff and a wonderful Manager.I enjoyed my job and i had the opportunity to work in several other areas and learn things that i always wanted to learnI loved working for Dell.I had a great staff and a wonderful Manager. Quite a good experience working with global team. Interaction with team members across global was a way to learn and increase your skills sets. Flexible working hours Tj maxx was a fun place to work  but it as extremly ahrd harder than anyon thinks. People aren't very nice when it comes to their money.  had to take care of 3 at 5 different depaments. Clean pick up and organize the fitting room, do cashier at the same time. The pay wasn't very good nether my co workers are the best and the management needed some work Handled inbound technical phone calls, troubleshoot for customers, ensure warrantyissues and any problems within billing or computer issues, issued new hardware ifnecessary and covered by warranty, walking customers through the operating system ortroubleshooting a problem on the machine Office was great.  EMC was bought by Dell and the whole team was being re-organized.  they couldn't guarantee a permanent position and I foung a permanent position elsewhere Dell is a great place to work at.  There is a lot of good opportunities for career growth.  The company does a good job of work/life balance.  I would recommend to a friend and old colleagues to work at Dell. After Dell acquired EMC, the Legacy EMC people were constantly being laid off and passed over for opportunities. Dell moves as many jobs as possible overseas and discourages management from hiring or advancing in high cost areas. Dell does not provide cost of living increases each year. Unless you are a top performer at the company, you will make less money year over year. Even being a top performer only gives you a cost of living bump. Management statements do not match the actions that are executed. Good place to start your career and also enhance it. Provides good platform to learn new technologies in market and ample opportunities to grow and get promoted Dell is a great place to work, assuming you are always ready to raise your own bar.  The ability to deal with ambiguity is considered a ticket to entry.  People either thrive or get very discouraged.  It's not for everyone, but if it matches your personality you will enjoy it.  Dell is flexible and allows work from home in many roles.  However, you will need to be face to face when you have opportunities to present to uppers.  Very important to manage your up chain.  All normal benefits plus some.  However their insurance deductible and cost continues to go up yearly.  Salary increases are not huge unless you are promoted. Dell is a nice place to begin your career and offers advancement, travel, and many other opportunities that will help you learn more about Microsoft Windows, PC hardware, and many other technologies involved in the PC architecture. Strong Portfolio of productsBest sales school in the IT industryExcellent benefitsPoor life balanceVery stressful Lengthy working hoursTough management Dell provides a great opportunity for advancement. This employer invest in the people and understand that their people are their most prized posession. They took the time to listen to their employees goals and helped them to achieve them. It's possible to have a good or a bad experience at Dell depending on the department, team, and manager you work for. I know this doesn't provide a lot of insight into this enterprise company, but take this advice with with a grain of salt and consider fully investigating the culture of the department and team you'll be working with as well as the personality traits of your manager.  You may want to keep in mind that managers and employees also change departments fairly often so if you work with a great team now it may not be the same 9 to 12 months from now. Dell offers a great work environment. People are very helpful. The 1x1 culture is great for networking. Flexibility in terms of career growth and the opportunity to explore other work areas to find where you fit best. Environment was constantly fast paced. Teams were good to work with and management was good. The facility was in order and there were many opportunities to advance. It'a good place to work in Dell, never had any problems. All are good managers and nice place to learn new technologies, so that will help for our career growth. My experience was horrible but I don't think it was indicative of a normal experience with Dell.  I was hired by EMC as part of a small batch of employees which were given a verbal agreement of salary following a 3 month training period.  EMC failed to honor the agreement claiming that they were not aware of any such program (keep in mind that there were 30 of us, all with the same understanding).  Once Dell took over we no longer had any recourse, needless to say, attrition was high. The management was often unable to implement processes or new policies, or really anything without making the transition rough for everyone that these changes affected. I believe that, for the most part, the management is trying to do the right thing by the Dell employees, but it can be very complicated to get everything right when there are so many moving parts in an organization - especially one that acquired a company (EMC) worth more than 2x what Dell itself is worth, and is tasked with the responsibility to integrate the two companies' teams, management, back-end processes, databases, CRM software, etc. The point is: I think they are trying, though the general confusion resulting from the way many things are done at the company can potentially make it more difficult for someone to perform their job duties to the best of their ability. A lot of overhead and work pressure. Work life balance is a joke, it is 24x7 sweatshop for IT with global teams. Too many emails and meetings, promote the like minded and those who belongs to 'the club'.Good compensation, time off policies. Some really good high management. This was one of the worst jobs I have ever had. Even though I was virtual they have terrible management and they don’t trust people to do the job.  The people that came from Cerner were wonderful. The one manager from Stanford was one of the worst managers I’ve had the chance to work for. Admittedly my opinion on Dell is biased from the standpoint that I worked for an 'off-shoot' of Dell in the Security Group, so I didn't really get a true firsthand feel for the 'Dell mainstream' culture, but from what I could see and hear from others, Dell is just another grind shop in the industry which doesn't leave employees feeling proud to have worked there. I worked for EMC before the DELL\EMC merger.  I enjoyed the job I had here while I was on co-op in high school.  I was managing a lab of computers and. enjoyable atmosphere, sometimes given the ability to work from home, gained a lot of knowledge and met a lot of interesting people but unfortunately management's poor decisions led to the company losing contracts and crashing. Tj maxx was a fun place to work  but it as extremly ahrd harder than anyon thinks. People aren't very nice when it comes to their money.  had to take care of 3 at 5 different depaments. Clean pick up and organize the fitting room, do cashier at the same time. The pay wasn't very good nether my co workers are the best and the management needed some work Enjoyed working 3rd shift for EMC. However it is now dell. Great experience testing storage devices. Good perks until 911 occured. Then company changed. Outdated work culture and lack of job advancement. Most tech companies in Austin have adapted open seating whereas Dell maintains its cubicles. In addition, you have to pay for your meals at the cafeteria as opposed to most companies such as Apple, Facebook and etc who have free food and free vending machines. Its been over 15 years since I worked there so I'm not sure why I'm required to review the place.  They had a lot of great amenities onsite used by employees Working closely with a great team of people, I had the best experience as an Intern. I learned more about eCommerce structure and website health in 6 months than I ever did in school. Worked as a contractor for 14 months. Work was ok. Did not like the non-casual dress code. I would not work there again.Thats just my opinion.Nothing else to write. Let me out of this page. You learn to use Sap since it's a must have in most warehouse jobs now a days.Management here is cool easy going Work place is relaxed The environment is  good people are willing to help out if needed Excellent platforms, leadership is getting better though managers kept much of the tools & methodologies to themselves - just dictated 'key punching' tasks. Awkward client relationships at times. Dell is very numbers driven and you have to hit the goal this drives a anything goes mentality so they cut a lot of corners to get to the goal. Also very low sending on IT so tools and IT operation is substandard for a larger corporation. Great company! need to learn quick, technology is on the move culture is driven by success.i move up thru ranks in my 21 years with my 2 AD degrees. Dell/Emc i have finance and electronics AD degree excellent opportunitiesEnjoyed field work, working at customer locations designing storage solutions and implementing with local staff.  We had access to excellent support and product developers. I would recommend as a good starting IT job to get your foot into the door of Technical Support. Very flexible in regards to scheduling. Ton's of knowledge to gain on Windows and Microsoft. Very structural place to work with employee development plans on a daily basis to meet goals and exceed metrics. The most enjoyable part of the job was that you had fun on a sells driven environment. Great place to work. Outstanding customer service. I only realized how good it was after I left the company and saw what passed for a customer service. Great people. I enjoyed working at Dell, I liked working in a cubical, I was always a top sales person so the managers were always very nice to me. I could talk on the phone for hours so it was a very easy job. Great Benefits and they give you alot of tools to learn. Lots of people work remote so the company culture isn't as apparent as average companies. Employees for the most part are happy but there are tight deadlines and often long work days. Working there was a challenge every day. I enjoyed having new things to do and finding creative solutions. There were lots of reward programs and there was support from all managers. Dell has been a nice balance of interesting/challenging work with plenty of flexibility to enjoy everything Austin has to offer. Diverse workplace with global teams and innovative product development keeps things interesting. A typical work day is a balance of responding to emails, meetings and performing your primary work role. Management where I worked is great and supportive and focused on the right areas to be successful.Work Life balance is excellent, allowing freedom to raise my family and be happy and healthy.The hardest part of the job would be to learn the technical jargon and processes. Dell is a great place to work. Management was a bit dis-bonded and distant however this lends itself for autonomy. The organization that I worked for (Dell Field Services) no longer exists Frequent reorganizations result in job changes and unexpected staff reductions.  You should network as much as possible to develop alternate opportunities when there are organizational changes underway. Tj maxx was a fun place to work  but it as extremly ahrd harder than anyon thinks. People aren't very nice when it comes to their money.  had to take care of 3 at 5 different depaments. Clean pick up and organize the fitting room, do cashier at the same time. The pay wasn't very good nether my co workers are the best and the management needed some work - Aprendizaje constante- Manejo de numeros, base de datos, entrenamiento a personal- Direccion enfocada al material humano de la empresa, con miras a resultados- Cultura laboral NorteAmericana- Cambio entre departamentos- Desarrolo de entrenamientos y manejo de base de datos Typical work day consists of troubleshooting health related tickets, and joining bridge calls if deemed necessary. I have learned many technical skills from working with such knowledgeable coworkers as well as with management. Dell/EMC has the most progressive sales vision in the industry which will pose the challenge of the ability to execute and support to joining super companies. Dell was a nice place to work. However they did have an issue including remote employees in decisions.  We didn't always feel like a part of the team. If you don't want a life outside of work or to be treated fairly at work, this is the job for you!  Overtime?  All you want, but you only get paid $4 an hour.   NOT $4 extra, ... just $4 dollars per hour. As my manager told me, it is not illegal because you make up for it in commissions.   LOL what a joke. It is salary so they can make you stay an extra 4 hours after your 8 hour shift is up every day of the week but never pay you the over time... but you miss a day, they doc every minute from your pay that you are gone. You log in and start up your computer, read your emails and listen to voicemails 15 minutes before your shift starts... unpaid.. The end of the day is the same way, 15 minutes clearing up odds and ends... emails and VMs unpaid. I found out on my day off that DELL had pulled out of Roseburg and shut down with no warning.  It took me a month to get only some of my things back sent to me since once closed we were not allowed inside the buildling. You are actually a contractor. Not an employee.Dell is now n.T.T.Data from what I understand.My time at dell was refreshing due to the fact I worked from home. This company was as excellence as a company can be. They offer great incentives to employees that show potential. I loved working for them and would go back if I could. I worked around some of the industry's greatest people while working at Dell Nashville. that said the pay was not remotely on par with the industry in the Nashville area. we had great benefits and i've never worked in a place that had so many meetings. Team building was a wonderful thing here. department and team managers were all awesome to work with. Disappointed that the entire Core support and eventually XPS teams were just abandoned by Dell and laid off but while there the people made the job worth coming to every day. Many of my co-workers and managers are still friends to this day. The people were great and the only drawback is that maybe there were too many of them.  They have a very large work force and I was used to working for startups and a smaller work force.  Also, did not have a lot of autonomy with the position.  Micromanaged. It has been over 5 years since I was there and Dell has gone through many changes including the purchase of EMC. I do not know how that has affected the culture. Very diverse company, family-oriented as well as great opportunity for warehouse experience. Dell Technologies is a computer-based server company that ships product around the world. The four years that I've been working for Dell I have learned to take Initiative for leadership. Understanding the concept of a team working together to accomplish a primary goal. The understanding of for flow or and other manufacturing companies the assembly line. Learning different programs on the computer, dealing with heavy equipment,  safety responsibilities! I can definitely say I've truly enjoyed the time that I've been there! Too big of a company, after 15 years you usually get laid off. Not a stable workplace, long hours.  Company big, I really don't want to fill all of this out to submit my application Fast Paced Work Environment that is Ever Changing.  Be ready to pivot at any moment as goals, initiatives are forever changing quarter to quarter.  Able to cope with high stress a must. If you are looking to advance in your career, then Dell is the place to do it. My only reservation is with the business decisions they make concerning the guys on the ground, but overall it is a great place to work. A typical day at work is attending a scrum meeting, for an hour and work with my team on the day to day tickets. Poor management and low team morale.Julian Working at Dell is a great experience but raises and promotions are very scarce! You have to move departments or companies to sniff anything above a 3% yearly increase. First focus is always cutting cost above anything else. Lots of people are forced out or leaving on their own and whoever is left takes on the load with no extra perks/compensation. EMC was a much better place to work. Dell has no idea how to sell. We sold on value and quality of the storage. Dell is all about selling quantity and the quality is second best. In the end they will work you until you leave. The managers don't really care anymore. They are getting paid BANK! so they don't do anything to help you succeed there. Dell has a entrepreneurial culture which can be great.  It can also be bad, very bad.  Instead of investing in tried and true tools, they use home-grown options, the creator leaves, and your stuck with a poorly band aided piece of software.  Dell needs to invest in enterprise tools that enable their employees to complete their day to day activities in an easier manner. On the up-side, the people are great!  People are hardworking and helpful. Work life balance is nice and that is a huge plus as this company. Data Analysis, Data Technology Architect ,big data and data management, project management, program management, project delivery, change and risk management and planning. Just like any large corporation that undertakes a merger (with EMC), changes are bound to happen and you need to be prepared to adapt and embrace/deal with such changes. Tj maxx was a fun place to work  but it as extremly ahrd harder than anyon thinks. People aren't very nice when it comes to their money.  had to take care of 3 at 5 different depaments. Clean pick up and organize the fitting room, do cashier at the same time. The pay wasn't very good nether my co workers are the best and the management needed some work Worked in the server lab running tests.  Very loud environment with all the server fans but that is expected with servers.  Good pay, good supervisors and engineers. Lots of downtime. Too many mandatory meetings for interns, most of which were not interesting or helpful. Management was okay but company policy surrounding hours was way too strict. Well paid, coworkers were able to advance within the company if they were qualified enough. A typical day at work is engaging and revolves around bringng ideas together and working as a team to create solutions.Learnt lots of things and everyday was different which reduced the autonomy of work per say.the work culture is very open and friendly.the hardest but best part of the job is being very flexible to ever changing business environments. Dell was one of the best companies to work with. Very productive, More opportunities to grow Tones of training available for engineers  Opportunity to work from remote The firm was reasonably good to work for but is really top heavy with sales people. if you were not booking time against a project, you were vulnerable. which is strange because as a consultant, you are not responsible for sales Not a bad place to work at but with the flattened title hierarchy it is almost impossible to get promoted.  if you were a manager previously you most likely got your title removed and are still expected to perform those same duties without the title or opportunity for further advancement.  Not many opportunities in engineering for women even if you are really good at what you do.  Still very male dominated unless you are in marketing/hr, etc... They tend to have women in highly visible positions but not in middle management and no site lines to get there. Overall, this is a good company to work for, with growth potential. However, the time that I spent there, I was working 70+ hrs a week in a micromanaging environment. Dell was a fun/challenging place to work with flexible work, hours, environment and remote work opportunities.  Lower group management was good, higher up management seemed out of touch. Many learning opportunities with the provision of instructor led training in certain instances.Good teamwork among team members when help is needed.Some individuals in leadership roles tend to micromanage which would interfere with productivity.Good workers often overlooked due to favoritism and nepotism.The culture would tend to be toxic due to too much 'drama' among employees.HR and management would not address issues properly, but would look at the individual as the problem. Their class they taught for phone support was excellent.  I had been doing phone support for 20 years before my stint with Dell, but they made it fun and relevant. It was a long drive for me and actually fairly boring work.  I worked a second shift and the way the calls came in - rarely got to talk to anyone at the complex because no one ever really got a break or lunch at the same time. Working at Dell was a fun experience. I was young and worked with other young professionals. The management was new so we all got to learn together. We went through many audits, so we all learned how to document process and grow as a team. I would recommend Dell to anyone looking for an opportunity for growth. Dell merger is one of the worst and Dell himself has bunch of jokers around him with no strategy and growth. They cook books by laying off talented people to show numbers. A typical big corporate company. In order to move up, you need the right connection. other than, It a good place to work. The Benefit are good. They also value work/life balance. Fun, competative, and collaborative workplace. I made many friends there at Dell/EMC. Actually when I worked there it was just EMC. It's a very technical environment. Wish I would not have left DellEMC, well EMC in particular. Treats their employees well. Great training opportunities. Great experience. Good life work balance. was a enjoyable place to work working 2nd shift we did a lot of overtime I was at the end of the line  a lot more relaxed but fast paced working  great place to work i worked in upstate ny travel every day they paid great was very tough in winter but loved what i did got paid every week the managemet was a bit tough We worked as a team and competed with the other teams for best production. Great people to work with and training was simple. I think the best part was the comradery. DellEMC is driven to adopt and grow into agile maturity in the business unit I work in currently.  DellEMC invested into agile tools like Jira and Confluence to ensure teams can incorporate agile principles. Management really, really, really, sucks. Especially the whole documentation chain of management. They care nothing about the writers.HR is the worst I have ever seen.Advice to ManagementWake up. Get a clue. Tj maxx was a fun place to work  but it as extremly ahrd harder than anyon thinks. People aren't very nice when it comes to their money.  had to take care of 3 at 5 different depaments. Clean pick up and organize the fitting room, do cashier at the same time. The pay wasn't very good nether my co workers are the best and the management needed some work I would highly recommend Dell as an employer of choice. Good starting salary and regular opportunities for pay advancement. Believe they could do more to enhance job stability. We would work on a line everyone would enjoy themselves at work. Michael dell would come in and also hold meetings with us. If I was still in austin texas I would work for that company again. I loved my job there Working at DELL makes you feel like you are part of a family.  They many positive things they do to encourage employees.  They pay for employees to further their Education with tuition reimbursement and vouchers to taker certification tests.  They have weekly meetings with manager to go over your stats and set a plan that may help to improve if needed in weak areas. This warehouse internship was a great job where you can learn many skills that can be used in future jobs.  EMC is also a very safety conscious business. Answering phones all day long... diverse cultures and exposure. Loved the interaction with the clients and they returned in favor.At the end, the metrics system they decided to use was being manipulated through untruthful employees. This made it difficult to stay and with my mother's health failing, I opt-ted to leave. People for the most part are/were excellent, work hard play hard. quite a few very smart folks made up very good teams. Dell management is another story. They are woefully understaffed with actual good managers Very good company to work for , it changed over the past 25 years but then growth requires change , management need to evolve with the company , when I was there this did not happen , typical day involved calls , meeting , quotes , forecasting , account management , I was the focal point of the virtual team holding together technical sales , external sales , admin and myself . Have my internship in EMC for 6 months. Very good teammates and participated in the poster session every month, I obtain a good opportunity to strengthen my interpersonal skills. Able to learn more platforms working with break fix servers. A good place for someone looking to start a career in IT. Highly competitive work environment. Nice people to work with. Good work/life balance. Dell is a GREAT organization. The workplace culture is progressive making day-to-day work enjoyable. The company is very innovative which supports employees who seek career growth opportunities. Everyday was different with the same attitude from my peers. How can we be better and how can we create something thats better. That is what was the driving force behind each project the amazing people working to create and execute them. Multiple meetingsWorking with multiple organization to ensure they receive material for NPISupport Sustaining effortsComputer updates to ensure BOM's, etc are updated correctly It was after the good times.  Management was young and in golden handcuffs.  The only talent left were those too conservative to chase the .com boom.  As a result, innovation was gone and I could not figure out how to disappear/have an accident on the way to work and still let my wife receive the life insurance. I enjoyed My days at work from the time i clocked in it was full of positive energy. everyone knew what had to be done and everyone helped each get those things done. EMC2 a subsidiary of Dell was a great working environment assisting internal clients issues. Collaborating with IT co workers in different departments to resolve issues (ie networking). My time with Dell was spent on a contract, where Dell was the holder of said contract, so I did not get the fell experience of working for Dell.  The experience I was was based off the contract, and not working with Dell. Dell offers many oppurtunites to those who go above and beyond the required skills and the teams are family-oriented who understand the day to day struggles with life. However in the workplace there are some flaws such as Communication barriers between teams, promises that are changed later down the line as well Non-Useful Meetings that took time out of your deadlines for projects. Most of the days are spent dealing with both internal and external customer issues/complaints, along with support-related issues and administrative tasks. •	Responsible for performing inspections and/or audits of purchased parts, materials, and equipment and quality control programs.•	Assist with maintaining Inventory Control by verifying Transaction, performing weekly cycle counts and performing physical Inventory. Perform Sub-assembly and Cab Audits. Identify and report inventory discrepancies. Material Handling.•	Performs various assembly functions under general supervision, self-judgment and interpretation. Assist in Sub Assembly, Drive Assembly and/or packaging, prepping and preparing product for shipment for internal and external customers.•	Meet all EMC quality standards in performing assigned tasks. Follow all processes and written assembly instructions, drawings, schematics and document and report any discrepancies between actual and documental process. Complete all production forms accurately. Michael Dell and senior executive leadership has done an amazing job transforming the company, but it is filled with poor director-level people managers that cares more about themselves than building the team. Employees tend to work in silos, and the work environment is stiff and old. There's a strong effort to provide better work/life balance by letting employees work remote, but in practice there's an unspoken pressure to be present in the office. Tj maxx was a fun place to work  but it as extremly ahrd harder than anyon thinks. People aren't very nice when it comes to their money.  had to take care of 3 at 5 different depaments. Clean pick up and organize the fitting room, do cashier at the same time. The pay wasn't very good nether my co workers are the best and the management needed some work Decision were made quickly on strategic issues.  Work life balance was great.  Mostly great people to work with. I once saw a Sr. VP lie to save his own rear end with the Vice Chairman of the company.Overall a good 'big company' experience. Job has was 7/24 commitment.  Work is very inconsistent some weeks 10 jobs some weeks 1 or 2.  Some jobs require 4 hr  response time while others can be scheduled for more convenient response. Dell provides a challenging and technologically advanced work environment.  They provide trends in culture, values and ethics. Dell's work culture and the underlying values of the culture are understood as drivers for performance. Dell's cultural audits and their measurements of change are critical indicators from a company’s workforce. Cultural surveys, assessments, and audits are standard tool barometers for change. Basic office setting, learned so much about the health connector. the workers and management their are really great able to get along with diverse group of people, the hardest part of the job was not able to communicate with family when emergency occur because their was no way they can get a hold of me unless I'm on my breaks or lunches. Dell has a good work/life balance. Work was challenging and collaborative. I never felt like I was being micromanaged. Overall, I had a good experience working there for 4 years. Great place to start a training career, I learned so much while working there. Made many work connections that helped further my career. Even when the company had a merger they kept me on as long as they could. Constant Layoffs all year roundZero chances of job advancement The most incompetent management you could possibly imagineZero reasons to go above and beyond There are lots of good people there.  Dell has flexible schedules, great benefits and a good work life balance.     Austin and Round Rock are great cities to live in. The Dell people are great to work with. The project lead spend time getting we new contractors up to speed with the code base, and helped us in other ways. The bad is the group in Dell only had funding for just one quarter (3 months), so we started getting good just in time to leave! This was not our fault of the manager's: just Dell corporate policy. They have a great, varied cafeteria on campus, and an on-site branch of my bank! Dell is a great company to work for.  They have a long history in the IT space and hire great people.  There is a vast environment to learn and many buildings on campus to explore. Focus placed on lowering resource cost to improve margin on existing book of business and improve view of company business unit for sale.  Work was migrated to off shore resources or resource brought on shore under work visa that would work at lower rates. Use to be highly innovative and open.  Changes caused a big culture shift following the EMC merger.  Can no longer recommend working here. Quite a few departures across the board as a result. Was fine until laid off. I know they were trying to save money but reducing head count but it is always difficult when yours is the had they are reducing. Working for Dell was extremely rewarding.  The friendships that were formed and the ability to rise through the ranks with good pay was there.  The platform and marketing made the job a little easier. Little room for upward mobility The ideal candidate will have some mechanical and construction experience, excellent communication skills and a high degree of mechanical aptitude. The successful applicant will be responsible for operating production. I've been with them from their small Documentum beginnings, so the growing pains were always hard but the people were really great in the 2000's. Cultures change, time moves on and creates more changes. Not a horrible company. Less of the old, good people still work there. I loved working at Dell EMC and would love to work back at this company. The culture was great, it was definitely diverse, and the family and work balancing was just the way I would expect it to be (loose). Everyone wants to see you grow and be successful. If you want to switch positions and try advancing yourself internally, you can do this without a problem after 18 months of being in your present position. Dell purchased EMC in 2016.  For the next several years the corporate strategy focuses on driving sales and revenue while assimilating the two companies.  Flexibility is key to success in this environment. I had a very good manager and director during my internship there. People are very nice and friendly. It is happy to work there because you can gain lots of support and guidance. Benefits are not that competitive. Work life balance is very good.  Good management layer. Does alot for the community.  Plenty of opportunity to advance.  Employees are very friendly.  Nice office space. Tj maxx was a fun place to work  but it as extremly ahrd harder than anyon thinks. People aren't very nice when it comes to their money.  had to take care of 3 at 5 different depaments. Clean pick up and organize the fitting room, do cashier at the same time. The pay wasn't very good nether my co workers are the best and the management needed some work Working at dell was rewarding and my growth curve there was phenomenal. We were creating new service offerings and providing sutlers with custom solutions. Strong numbers driven company on a daily basis. Leadership and management skills lacking to grow and develop new staff. Work hours were challenging at times. It has been awhile not sure what to say at all,  ItNever a dull momentGood teamwork environmentGood training and then learn by doing atmosphereGood work/life balanceChallenging tasks at timesHigh volume/fast paced I felt that my contribution to my position was positive, but it was always a challenge, because the corporate focus was not always clear. There is always an opportunity to learn. flexible work scheduleability to work remotelymanagement has their own agendagreat teams to work with - group cooperationlearned a lot of technology Because of the size of solutions, products and customers there is some adversity to changing direction even in a beneficial way.  That being said, overcoming those obstacles and delivering great solutions that meet customers needs feels even better. I was a Systems Administrator at Dell.  I maintained all kinds of servers with full life cycle - build, maintain, fix/repair and finally decommission them Too much stress after Dell/EMC merger. Dell hitting EMC hard.  Not worth the stress unless you are on a new project with great visablitySad experience. Getting a project approval seems to be take a long time. some developers are wasting their time to do the POCs going no where or learning things not necessarily usable for the job. Excellent place to work  State of the art  technologies to learn  Management is fair and encourages learning new things Employee outings are fun throughout the year Dell provides the opportunity to work remotely and has a corporate direction to allow up to 60% of their work force to be able to work remotely by 2020. Force10 part of Dell created the new market of Metro Ethernet.Employees were proud of these initiatives.It was great to work with senior leadership in Force10. Great company. The company is great. Approve agile request. Approve employee certifications. Work with customers to solve critical issues and problems. Difficult to advance if you were not considered in the upper part of the management team.  Dell had the basic right ideas and produced a very good product.  However work life balance was not always the best. Dell was a roller coaster ride of an experience..overall it was a bad time for me. I would not recommend this for anyone. pay was low and management was shaky at best. I have enjoyed my time at dell, however my recent manager tends to flip flop and has caused me to want to find other employment.The pay is decent and the benefits are great. The people here were very nice and although I was layed off I was given plenty of warning. This was really a nice company with plenty of perks and PTO days. I really enjoyed this place. Many great memories of working at Dell, early mornings and late nights.  In the end, it's a decision made by a manager and a finance team that doesn't care about the individual employee. Coworkers are great!  Work with interesting people.  Good work/life balance.  Challenging projects and get to work with a diverse group of people all across the globe I didn't work long. They were not hiring full time which is not good to retain employees. I would have stayed with the company for more IT experience but they didn't seem interested on direct permanent employee's Tj maxx was a fun place to work  but it as extremly ahrd harder than anyon thinks. People aren't very nice when it comes to their money.  had to take care of 3 at 5 different depaments. Clean pick up and organize the fitting room, do cashier at the same time. The pay wasn't very good nether my co workers are the best and the management needed some work Dell is a competitive place to work with many rewarding benefits and opportunities, however it can be very stressful in regards to interacting with customers on the phone. Working in a new production manufacturing facility is very busy and somewhat stressful because you are building PC to the customers requirements and not duplicates of each other. the workplace is antiquated and they are not open to new digital trends, the quarterly planning stil relies heavily on old strategies that wouldn/t necessarily work in today's landscape. My opinion of Dell is that it is a fantastic company to work for. The brand recognition is an excellent addition to any resume and I have enjoyed my time. However, the frontline agent role is one with high turnover due to high-stress workloads and hard numbers based performance. Customer service is not a fun job, but Dell does a great job of filling the cubicles with fun coworkers and truly helpful support. Really won't ever feel like your lost or alone because the managers and supervisors are there to help and make your job easier. As an intern I only had one specific job I had to do but the people were all very nice. I usually didn't have enough to do during the day because I only had one project. I worked at Dell for a dozen years as a phone technician.  I had to leave for family reasons.  I could not go back if I wanted to, as my entire job function has been outsourced to India.  Used to be a good place to work, but between outsourcing and 'enhancing shareholder value', meaning the rich guys keeping all the money and not sharing with the workers, I do not think Dell would be a good place to go back to, and I could not recommend it to anyone.  The danger that one's job will be outsourced is too great. This is not a good environment for minority females in Information Technology. It was very hard to obtain work/life balance, most team members were single males without kids and family. Even though you are given PTO/PBO you are scrutinized for taking time off for family and personal business. Promotions for women are hard to achieve, it is mostly a good ole boy network.Middle management and team leadership is reserved for white males. Career  Advancement were given to males and most women are excluded from training and career advancement. Michael has positioned the company for success in a very tough market.  His goals and plan will transform the company from hardware to services while providing the appropriate hardware for success.Work is challenging but doable. Overall good company to work for.  Positions can become stagnant with not much opportunity to advance or move potions. Have been able to travel a bit and meet new people. The environment at Dell is laid back and care free. There may be times of stress due to high call volumes, but there are incentives to continue to perform at your best. On days when the allotted  lunch time is reduced to 30 minutes, lunch is provided. The support staff can have a tendency to be absent, but I feel we are trained well enough to be left alone at times. My time at Dell helped shape me into a more well-rounded sales professional. I had a lot of product training and became a mentor to new hires in my time working as an ISR (internal sales rep). Dell provides a strong culture for learning and top performers are given opportunities for advancement. Dell also supports work/life balance, and they are leaders in remote employment. Dell is a huge company, and the opportunity to do anything you are interested in exists there.  The culture is generally very good, but some orgs are better than others. As a whole the people are great - the intellectual horsepower is tremendous, and almost everyone is willing to help since DELL acquired EMC the employees can notice the quality of management have changed and have less control on their careers within the company poor internal management processesDELL HR is useless when needed in a conflict or mediation I liked working here because the hours/ work life balance is fair as long as your manager is flexible. Culture is good, people are encouraging and nice. Good people, but cut throat environment, Decent benefits and flextime work from home some days.There your just a number which can be wiped away at any time. you will work hard, but learn some amazing things. It is all up to you what you want to take away. This company will train you if you do not know the industry and set you on your way to a great career This is the lowest paying IT job I've ever seen, with erratic work schedule ranging from 4-12 hours per day.  Schedules are unknown until the morning of the day in question.  Most days totaled around 6-7 hours, with at least half the time being behind the wheel of your own vehicle, and some long drives for minor work, and poor scheduling leaving multiple technicians going to one location in the same day. - A typical day I used to start with my productivity report in order to verify the challenge and goal action plans.-I learned how to manage people, reports, trainings, sensitive cases and not only limited to manage there are a lot of work.-workplace culture was full of retaliation, thing that soprise because the culture in the book says that there are 'open doors policies'.-bosses never accept that something is wrong even there is a report saying it.-the most enjoyable part of the work was After trainings/meetings/1x1 people got better integral persons (personally and profesionally). If you like to travel then this is the company for you. There was a lot of management turn over but most management was great. Benefits were great and pay was ok. Tj maxx was a fun place to work  but it as extremly ahrd harder than anyon thinks. People aren't very nice when it comes to their money.  had to take care of 3 at 5 different depaments. Clean pick up and organize the fitting room, do cashier at the same time. The pay wasn't very good nether my co workers are the best and the management needed some work cool work environment with great benefits opportunities. but management at times can be unsensitive to employees. overall great workplace and i would recommend to others on 14 months, 4 different account assignments.  Impossible to get traction with clients for data center transformation projects in just a few months.  My experience was less than pleasant. I enjoyed my tenor at Dell, the people there that I worked with were friendly and helpful.  I learned and grew at my position due to I was given the opportunity to grow by the those who managed me.  I enjoyed the time and hope to see some of those folks I worked with down the road. This was an excellent job very good employees and managers and very relaxed worked place, great co-workers. Had a good experienced working in dell never had an issue. Plenty of opportunities to volunteer for community activities. Many opportunities to work from home. Dell has a great culture of networking, you are able to reach out to anyone and set up time to chat. Dell is all about results, so they are flexible when it comes to working from home and work/life balance. A very dynamic work place with a typical work day would consist of 10-12 hours over the telephone. Learned many clerical skills dealing with Finance/Customer service. Management was professional and worked well with their employees. Adapting quickly to constant work process changes was the most challenging. Enjoyed driving distance to/from work. I started out as a SMB sales rep and ultimately became a Technical Sales rep, selling Enterprise level server and storage solutions.  I also became very proficient in the world of virtualization and cloud computing. Good training, and coaching throughout the scope of employment.  I think this company is well run, but it is massive so it is easy to feel lost in the fray. I enjoyed 13 years working for Dell and would do 13 more if the opportunity was given to me.You learn how to build high-trust workplace culture that engages employees and drive a better business. Enjoyed the early morning shift,no weekends, paid holidays, & the way everyone pitched in in helping out,good customer service,quality food & service providers to customers. Opportunities to learn across the business.  Smart people, dynamic market. fast paced. Flat organization expects people to own and make recommendations and decisions. The place is alright. I can't think of much else to say about it. I hope the people do well there, but I am ready to move on and try something different. Great company to work for.  Managers, Team Leads, Supervisors were great to work for and with.  Fun atmosphere was awesome, fun activities and games done at the end of each quarter. While I was only with Dell for a short period, I enjoyed the nature of the work, the level of responsibility and the autonomy I was given to perform my job. Expect the unexpected, or as Dell likes to say in the new hire classes, expect 'ambiguity' daily. Metrics change constantly but not communicated  clearly. Working five days a week from home using your home electric and internet without any compensation. Low salaries and very few increases. Remote staff work much harder than the regular staff with less pay. I had some of the best bosses while working in Dell/EMC. They were understanding and never micromanaged you. You were able to get your work done and that made them happy. I may be biased but the teams I worked with and for, were great. I enjoyed work everyday. The daily work was fun and complex at times, and always rewarding  If I can find another position with DELL/EMC, I would go back. As a former longtime employee, the culture shifted dramatically from 'do what it takes' and 'do the right thing' to 'get it done'.  Doing the right thing became ambiguous, depending on the leadership and manager.  In my organization, it was more like 'get it done now, and we'll let you know how we like it'.  Management churn (I had four managers in two years)  I would not want to work in services again, but sales would be a good place.Diversity in culture is deep.  But diversity in thought is not.   Your manager's temperament may limit how much you should or could say.  Be a yes man-- do not speak up, even if it's worked for you in the past. I was myself for over 15 years.  Great reviews.  Then my last manager's review, non-committal and then released.  Very sad. Advice:  Even if your manager is only worried about their numbers, try to get to know them and cultivate the relationship.  If you find it difficult, start looking for a role internally elsewhere-- don't delay.  Before the EOY cuts. Dell is full of opportunity assuming you know what you want to do there. If you go in thinking you'll move around until you find something you like, you'll be disappointed. Changing career direction from inside Dell is difficult. That's one of the reasons why so many people come back to Dell in another role and/or a higher level. It's easier.That being said, the culture at Dell is inclusive and many people find that there are groups at Dell that offer support. The work/life balance is generally pretty good. You typically have a great deal of work but you can do it at home if needed. Tj maxx was a fun place to work  but it as extremly ahrd harder than anyon thinks. People aren't very nice when it comes to their money.  had to take care of 3 at 5 different depaments. Clean pick up and organize the fitting room, do cashier at the same time. The pay wasn't very good nether my co workers are the best and the management needed some work Dell is a great work environment. Everybody relaxed, which helps people get along.  I do not recall petty disputes or any conflicts at the location I worked in. This isfast pasted environment, highly collaborative,  opportunities for advancement. There are challenges associates with Dell's acquisition of EMC.  Mostly notable up course in the inherent redundancies and the the need to eliminate some jobs. I can only say how it used to be, and not how it is today.  Everything has changed since Dell went private and bought EMC, and I have no idea of the culture today. Dell EMC is reshaping the industry through IT Transformation, combining leading infrastructure, data storage, hybrid cloud and data protection solutions. Our team of technicians were Great. Constantly learning newest equipment. Technicians  responsible were to maintain constant flow to shipping. Maintain conveyors, divertors, scanners, motors, replacing comm cables and pod systems. (Location I was at.)Great place to work and gained knowledge that some companies copied from Dell. SecureWorks is a great place to work as it is a constant learning environment. My job provided me with daily challenges as well as opportunities to advance my skill set in a variety of areas. Dell has a unique culture of being fast paced, which I work well in.  You need to be able to be self driven and motivated to learn. They pay well and you work hard.  I recommend working at Dell I enjoy working for Dell. Managers are awesome and the team environment is very supportive. I learned a lot about sales and how sales industry work. Sometimes, it is high stress but the payout is worth it. I'm from the OKC branch of Dell. The culture is the best of any company or any branch of Dell.  The benefits are the best, the call center is like not working in the typical call center envirement. Understanding the concept of any product that is not given your immediate attention will be lost forever, with not another opportunity to fix or stop the assembly belt to finished productivity. Good Job to get your foot in the door for Health insurance enrollment.  Monday through Friday type place except during open enrollment. Starting pay isn't bad, but there is not much opportunity to gave actual promotions, just a lot of unpaid Interim positions I throughly enjoyed working in Corporate Marketing for Dell.  It was a fascinating experience taking a company private and one that is hard to come by.  I am grateful for the experience. Shadowed by EMC leading to a Structured environment with Management politics. Promote new tools  often. Possibility to grow if you find the right niche within the business. Management has since been replaced..which was a good thing because... they couldn't keep good employees with the clowns that were in charge...rude ,obnoxious and unprofessional Love my team and the people that I work with on a day to day basis. The benefits are good and the flexibility of WFH and time off are much appreciated, especially when coming off of 50+ hour weeks.Management, however, has gotten lost in 'the numbers' and neglects the basic needs of employees... especially in the area of career growth. Career growth of an employee is based on if their manager wants to keep them on their team or not, not based on where the employee should actually be. Dell has an 18 month rule (and longer on different levels) that is stated there is no exception for. This stunts the growth of anyone looking to rise up fast and deserves to be challenged at different levels faster than this arbitrary amount of time set by Dell.Also, there is a lack of accountability from management for team members who don't pull their full weight. This adds extra work onto others, with no repercussions for the person causing the extra stress and churn. Provides opportunities for learning new skills and allows you to gain a  global perspective and outlook. Good mix of cultures and diversity providing a balanced work place. For a big company, this is a decent place to work.  It is not as bureaucratic as some places I have worked in the past.  Good products, passionate employees but there are some on-going pains with the EMC acquisition which still need to be resolved. Lot of opportunities to gain reward and recognition financially or in kind. A great diverse talented workforce to interact with and room for career growth and rotation. Overall, it is a fine company to work for...if you're in a group that is not a strategic focus...good luck getting any funding to get anything done. They are great for flexible working, but not so much for work/life balance. Autonomy was good, I was in a position to do so, and was able to navigate through groups much easier. •	Recognize the various types of effective communication skills in customer service•	Acquire excessive experience in proficient problem-solving skills•	Recognize the role and value of compliance through effective documentation and policy guidelines. Tj maxx was a fun place to work  but it as extremly ahrd harder than anyon thinks. People aren't very nice when it comes to their money.  had to take care of 3 at 5 different depaments. Clean pick up and organize the fitting room, do cashier at the same time. The pay wasn't very good nether my co workers are the best and the management needed some work I was a remote worker stationed at a customer location, we did not have alot of contact with the corporate office. What contact i did have was always professional and I have no complaints Employee for Dell, get on the floor, check email, review open tickets, must arrive 20 minutes early to complete that process.Just want to find a stable job in Houston Now that we have our Customers systems working properly.  The work load has decreased.I'm continuing to learn about the Data Domains and NetBackup, we are in the process of upgrading all of our NetBackup Master and Media servers to 8.1.2.We've reviewed the process provided to us by our Customer and have found numerous errors in the documentation.  Best part of this job is working with the People (Dell/EMC) and our Customers. I was a contractor at Dell for over 6 years.As a contractor you are not given recognition of your performance. All recognition was given to the Dell employee having the same job responsibilities as myself. Dell/EMC is a  good place to work, with a lot of great people, a strong focus on customer satisfaction, competitive benefits, and opportunities for professional growth. Services was growing, very new.  I was involved in building the new service organization. It was great problem solving on the fly, when Dell brought Perot services it was also great to bring in some certain points of view around service delivery. EMC was a great place to work.  Very challenging but also very rewarding.  I am not sure how the culture has changed since the Dell acquisition as my division was sold off shortly after. this is a great company to work for. Culture is fun, and coworkers are amazing.I had some really good managers, and some not so great managers. I would definitely work for Dell again in the future. I've been at Dell a long time, seen many ups and downs.  I think Dell's best days are behind it.  I'd be happy to be proven wrong.  Lots of good people, a few a-holes, just like anywhere else. Was able to work a flex schedule. It was a positive work environment you were paid on how you worked. if you gave a 110 percent they gave it back to you. The people are great. Management can vary from great to poor depending on what team you are on. The workplace culture is pretty good too. The work is very interesting. The only problem is workplace stability and morale. the people there were nice and friendly and I would go back if they called me back. I enjoyed meeting Ross Perot he would come to the company every now and then. Everyone was nice, including management. We could listen to music. It was fast paced yet easy. We rotated, which I found helpful to keep the momentum of things going. Nashua was a small field office and therefore most of the time, that allowed a local culture to exist that was less corporate and more relaxed than HQ. That was a good thing. Customers call in to build computers but can buy same computer from larger retailers for cheaper prices. Very hard to upsell customers and have them wait for their computer to be delivered. Awesome company to work for, supporting management.good benefits and perks.New challenges everyday, extensive training program to make sure you are up to industry standard Market leader in the enterprise product space.  Most job roles are challenging and satisfying.  The work-life balance is very good and employees are encouraged to continue their professional growth while working (non-specialists are encouraged to change Dell roles about every 18-24 months). No career advancement in US, Management BS a lot, No clear communication and overall Morale is way down.  Though they offer a great benefit package including everything. Worked 4 x 10 hour shifts. Decent workplace culture. No room for advancement in current department. Call center environment with dedicated break times. NTT Data is great company to work up under. They are very helpful when I have questions in regards to benefits related or timesheet correction. As far as work day goes, it is good. Some days will be hard calls to resolve, but we are able to reach out to a team lead for assistance. Tj maxx was a fun place to work  but it as extremly ahrd harder than anyon thinks. People aren't very nice when it comes to their money.  had to take care of 3 at 5 different depaments. Clean pick up and organize the fitting room, do cashier at the same time. The pay wasn't very good nether my co workers are the best and the management needed some work Since Quest was split from Dell and sold to an investment bank,  the management has only one goal : Make it look good and sell to make $$$It is all about revenue. My scoring may have to do with the fact that I worked for Dell while being my company was being acquired by them. However, this job itself was not difficult, but it lacked any advancement or or investment in it's people. Dell's school policy was that they were willing to help fund your college while attending, but would only do so if you held the position you were currently going to school for. This made no sense especially if someone was in one role and trying to move to a different department (i.e., marketing or HR). I had gone 3 years without a raise and no promotions, but already making a less than livable wage, I knew I needed to seek out something that would help challenge and push me so I could expand my skills. Buen ambiente de trabajo y buen ingreso salarial mensual Dell, like all companies, had its issues but overall was a good place to work.  The people were bright and professional and there were good opportunities for advancement. I really enjoyed working at EMC. I loved the different languages spoken at the call center. The people were very nice and smart. I would definitely work again here if I could. Besides the poor management and micro management of their employees, it was an excellent place to work and continue to learn. Due to the CEO leaving and coming back, disrupted the company for a couple of years. Loved traveling to different customer sites and working with different environments. Dell EMC is a great place to work with lots of opportunities for career advancement. Work/life balance allows a flexible workday. Given the opportunity, I would work at Dell EMC again. They're actively moving jobs offshore. Management is short-sighted (even after going private), and doesn't care about customers or consistency/quality of service. Discover client needs and provide innovative solutions while maintaining and building strong clientrelationships through providing education and training to meet client expectations. Deliver effectivetechnology, consulting, and support services for clients as well as provide hands-on support forlocal and remote clients. Perform troubleshooting activities that involve recognizing, researching,documenting, and accurately Dell/EMC (especially Isilon) is a fast paced environment. The workplace culture is very diverse and inclusive! I have learned a lot in the past few years. Dell is awesome i was stationed at tyhe health connector site in oston and the staff is amazing training is awesome and full and the opportunity for growth is endless I was ok at this job until I had a car accident not of my own fault and they ended my contract then and there. Not cool guys to kick someone when they are down. I don't forget things like that. I was happy working with Dell.  I received recognition and awards and bonuses every year.  I didn't like being on call, as I was supposed to support systems that I didn't know and didn't have access to and I never received training on these foreign systems.  I requested more duties of my manager and never received any additional duties or training and there was never opportunity for advancement and we only received just over 1% raise each year. I also could never gain access to the Dell Portal which was frustrating, but that was a facility issue and not a Dell Issue.  Management didn't seem to care.  But my benefits were good and overall had job satisfaction. Being a remote employee has been a great benefit to have. The team works mainly via Skype and it seems to work well. Being remote comes with a downside of not having too much visibility with leadership and thus one ends up becoming stagnant in their career path. The benefits are spectacular and the amount of paid time off is above and beyond all other companies. The pay is on the lower end of the spectrum but I feel that Dell tries to make up for that with supreme benefits. The hardest part of the job is dealing with the lack of direct leadership... it is difficult to grow when the leadership is not totally vested in your team due to being vested in too many teams. It has been 2 years with Dell and unfortunately  it is about to end as it is a contact position. I have enjoyed everyday at work and there is a lot that i have learnt here. There are quite a few experienced mates who have helped me in difficult patches and also in improving my skills. There is noting like 'hardest part of the job' because we take it as a challenge and work with competitive spirits. The most enjoyable part is when people around you appreciate for the efforts you have put in. Great Job. I enjoyed the enviroment. The staff was treated wuth the utmost respect. Unfortnuately, we were part of the Washington, DC BRAC so we had to relocate. Very good benefits, excellent work life balance, challenging work and technologies, innovative, customer centric, transparent, very good paid time off. I loved my time at EMC. Great people who become your extended family. The work demands can be stressful at times, but the people make it fun. Many people have been there for their entire careers, and there is a reason for it. Working here I found that there was alot of free time in between calls that would sometimes be a bit dragged out so there was time to be on the internet and for the smokers, you would have enough breaks to fulfill the need.Everybody got along with each other and for the most part very cordial. A real family type environment. Dell has an incredibly professional, positive and inclusive culture. My only reason for looking outside of the company are for my own creative and career development opportunities. Tj maxx was a fun place to work  but it as extremly ahrd harder than anyon thinks. People aren't very nice when it comes to their money.  had to take care of 3 at 5 different depaments. Clean pick up and organize the fitting room, do cashier at the same time. The pay wasn't very good nether my co workers are the best and the management needed some work Overall, Dell services is a very good company to work with. Work times are flexible, and People are very good to work with. I would highly recommend this to other people looking for a job. I have worked at Dell since July of 2015 and from day 1 I have loved the people I work with hands down. The day to day job itself gets very old and promises are made that are not kept throughout the company. Was there very briefly. Position was eliminated because I was hired during merger. Was brought back for another contract. But overall not a bad place to work. DELL/EMC  has a very workmanlike culture with very little drama.  People just come in and get things done.There have been a lot of changes lately but the core culture is still intact. I worked for Dell for over 15 years. I worked hard and was able to take advantage of my opportunities for training and advancement.The culture is supportive and Management is willing in most cases to go the extra mile to help you achieve your goals.Training is provided and is based on your role with company.Pay is competitive, bonuses when appropriate based on business and individual contributionBenefits are good, they were better in earlier years, but are still very competitive today. Long hours and lots of travel. Otherwise the computer repair jobs were fine. Pay was reasonable. Lots of testing to retain certifications which was all paid for by the company. I've heard of fun jobs that people have told me about at Dell, but working for Global Materials isn't one of them. The hours are horrendous, the management maintains a 'lean' bandwidth which forces many people to work 12+ hr days and weekends. They tell you they'll advance you're job grade, but never do despite outstanding reviews. Not the place to go if you want to advance and have an actual life outside of work. Also, Dell talks about having their workforce working remote, GM does not support that at all and have very little flexibility. Company does have Workforce reductions, experience was disappointing due to many org changes. lots of cooks in the kitchen - stay away from high tech if your looking for any  work stability. bring back job security to high tech workers.. please.... Good workplace for growth, but the salary is not very competitive. Opportunities are there to learn and advance your career. More management focus is needed esp in the light of the recent Dell-EMC merger. Do your job well and you can have a stable career there. Moreover, there is opportunity for advancement and growth.  I would go back if the compensation followed suit. We had a great bunch of people in our branch.  We all worked well together.  Work was challenging and rewarding.  Dell just decided to close our branch and we were all laid off. OrganizedCustomer focusedSolution oriented Loyal to employees FlexibleProfessional Experienced managementChallenging Leading edge technologyGreat compensation Mozy (SAAS software backup company with good corporate culture) is acquired by EMC (hardware onsite backup company). EMC is acquired by DELL (hardware company). DellEMC sales Mozy backup services to competitor (Carbonite) to pay off a tiny bit of its' debt for acquiring EMC. Good work/life balance. High caliber people doing high quality work. Very collaborative work environment. Supportive of working remote as needed. Work groups supported to do community service. good work life balance. Scope to grow.good compensation. good management and values employees. Scope to explore into different divisions. encouragement to grow. Most days 9-5. Flexibility to work from home and leave as needed. Some amount of freedom to pick work / initiatives. Some amount of politics and and ambiguity on decision making. As a travel project manager it was awesome. Met great people and learned no much! It was a fulfilling role. Benefits were great. All expense paid housing. Round-trip ticket home each month with rental car. Good internship at a volatile time in the company. many changes were being made so things were hectic and people around were unsure if their jobs were secure. I enjoyed working at Dell/EMC due to the people I worked with and the way they collaborated on projects to help ensure success.  Direct customer access in my role was a plus in understanding their needs and issues and how the products could aid their business success. Do more with less seems to be the common theme more and more each day. No end in site. The company is s Granat company for exposure and experience but it’s takes its toll. Moving up isn’t easy as it’s all about how you know and with the hope someone doesn’t intentionally try to hold you back. Would change the past and work a different company to start as I gain a lot of industry knowledge and experience. Tj maxx was a fun place to work  but it as extremly ahrd harder than anyon thinks. People aren't very nice when it comes to their money.  had to take care of 3 at 5 different depaments. Clean pick up and organize the fitting room, do cashier at the same time. The pay wasn't very good nether my co workers are the best and the management needed some work Dell is a great place to work granted that you have great management just like any other place. I have absolutely no complaints. There is plenty of advancement opportunities as well as continuing education. Pros- they keep you focused on learning the changes to the product line. The benefit of Dell / EMC Technologies is the width and breadth of the product set. That is also the curse, most employees tend to narrowly focus on a set of technologies. Great place to work, great benefits, great people.  Poor Leadership in some areas.  The Security Operations Center lacks leadership experience -- many people promoted without enough experience. Overall experience was excellent. The environment can be very fast paced at times, not so much others. Going private changed the atmosphere and allowed employees to focus more on the customer and infrastructure vs. shareholders profits. The work was dynamic and frustrating before as tools needed were ignored and hacked together at the tactical level. After going private, tools and infrastructure became much more strategic.The people are good at what they do, friendly, and smart. Despite frustrations with a stalling career, Dell was good to me. As a contractor, my tenure was short and restricted. The culture is friendly and concise. The people were dedicated to the work they did and found fulfillment in it. Leadership was excellent. As per a starter, good place to start career. Growth rate is bit slow with respect to work and increment. Workplace culture is not  very formal, feels good to be a part of the current team which makes life enjoyable along with work. -Typical day involves taking whatever case is handed to you by the work flow managers.- The culture seems to be too cliquey for my tastes, seems like only certain workers get all the benefits- The hardest part is figuring out how to solve cases not in your skill set- Leaving the office on time is the highlight of my day Working at Dell was very enjoyable.  Generally well staffed with some very talented people.  It was disappointing to be sold to NTT DATA just after the EMC announcements. Creating leaders through thought-leadership hierarchy and mentorships. Empowering future leaders which a mindset to challenge the status quo, opening dialogue to innovation and breakthroughs. Dell was a mature, fast paced environment.  I enjoyed the people I worked with and I was well managed.  I would recommend Dell to anyone.  Excellent benefits and compensation. Following the acquisition of EMC by Dell many changes were expected and layoffs did occur. The company is positioned well if they can execute but must do so faster to continue to maintain or expand market share in a shrinking profit margin environment. May struggle to innovate ahead of smaller nimble competitors. It was healthcare work . Dell  sold out to NTTDATA. our job was included. Job was fun lots  research  but still learning for me to do. I like  it. We had very helpful supv . Who always there to give us help when we needed. But job I am on is contractual so not sure how long job will last . Great company to work for good full time experience and great at great people good atmosphere; Invested in the learning of its employees and great culture The sky is the limit. The hardest part was the commute, Everyday was a different experience. The longevity of the contract made it especially rewarding.  I even got Project Management skills, a skill that I did not anticipate. A typical day at work is very busy and I always have something to do. I have learned to have more attention to detail with my work, as well as problem solving. The workplace is quiet and coworkers are friendly. Management could use some work; they are overwhelmed. The hardest part of the job is the 6-day work week. The most enjoyable parts of the job are the data entry, and learning the new pins to enter the data. Difficult place to work at due to the nature of the job.  Associates definitely take too much heat for customer call back that was not part of issue resolved. Dell took over EMC--and proceeded to reduce EMC staff by 50%.  The culture in the IT department was great.  We had a great collaborative environment, and worked well together.  Dell destroyed that. Dell is not a company I would recommend any body try and work for.  They seemed to care more about getting people of the phone in the call centers than they were with patient experience. Good company to work for, but bad management and sometime from the different organization team ............................................................ A typical day would start with early morning prep at home, followed by an 8 to 10 hour day, followed by several hours of finalizing the days work at home each night and begin prep for the next day. Knowledge of time management and prioritization of tasks are skills you will learn and master while working at Dell/EMC. The work culture is excellent. The best part about working there is the people, the benefits, and the salary. The most enjoyable part of the job is that no two days are ever the same, and you are always learning and gaining experience. Overall it is a great place to work if you like to work hard with outstanding people, and get excellent  compensation and benefits. Tj maxx was a fun place to work  but it as extremly ahrd harder than anyon thinks. People aren't very nice when it comes to their money.  had to take care of 3 at 5 different depaments. Clean pick up and organize the fitting room, do cashier at the same time. The pay wasn't very good nether my co workers are the best and the management needed some work Don't look for something that may or may not be there.  Make your own experience.  Whether hostile or nurturing, you surroundings can't affect you unless you allow it to. I do not have any information re gardening Dell.  It was still EMC Before I was restructure.   EMC typical day was busy and always had something new.   never the same day always different, and I enjoyed all 20 some odd years  that I was there You get what you put into the job. Dell does provide good work/life balance. Although you can find yourself in a sales account set that is not buying and you will be held accountable upto and including termination. While somethings are great, with Dell EMC merger, Dell has fallen back on the pizza box mentality of everything has to be an appliance and killing a lot of good EMC products. I would answer phone calls 8 hours a day.  They didn't provide any real rest periods it was non stop till you had your break. you couldn't really catch up on stuff that you needed to get done through the day and then your numbers would be low, you were consistently on hold waiting for someone to help if you had any questions sometimes the client would be on hold for 30 min or more and they would not be happy and do not blame them but we were unable to call them back with the answer had to keep them on hold.  When you had a call for the supervisor they were never available and never made the calls back to the clients. Dell is  a great company to work. Great team, nice work and life balanced style, good management, very inclusive and diversified culture. People are nice to work with, everybody is doing his/her best to get the job well done. very stressful job and a lot of travel. a lot multi task and a lo of admin work.Job involves a lot daily visits to customer locations to install or do maintenance on dell-emc products all over south florida. Originally when I worked at Dell management was real good.  They offer good work life balance, the position was good and I enjoyed working hard.  Then Dell sold the services org I was working for to NTT Data Services.  Things went from bad to worse and the sale was devastating to both my career and work life balance.Management also went from bad to down right horrible during the sale as well.  Expectations went to unrealistic and slave driving mentality.  The culture also changed, they went from caring about the employee and nourishing/encouraging the employee to if cant do the job we can fire you and find someone else.  They just stopped caring about the employee. Working for Dell was awesome, they valued their employees.  The sale changed everything and I would recommend working for Dell but not for NTT Data. I learned how to work in a fast paced environment and get things job on a timely basis.  We had several 'fire drills' and needed to provide information on the spot. Dell is excellent plot form to develop the skill set and it's an excellent company.  have good Polices associate friendly policies. one of the best company if anyone gets the offer blindly join. Dell was the origally job then it was switched over to NTT-data. with with that since their is a few different departments. Everyone has their on superivsor who they report too. Competitive unfair working environment with lack of growth for legacy female leaders out of Hopkinton in the new company dell. Female leaders were not promoted or considered for roles when building out the new company. Leaders were promoted from Austin and demoted and bullied  out in Hopkinton. Several female leaders were not treated fairly by DELL leaders across the company. Round Rock is a great campus.  Smart people are everywhere.  When i was there they were new to services and it took a while to get the business model perfected I loved my 11 years at Dell.  My job was moved overseas and i was given a severance package.  I was told that i would be able to work at the company in a different position.  I would love to return. My first day at Dell was the same day of layoffs.  Management was bad which lead to a negative work culture.  Pay was reasonable and work life balance was good. Dell is a laid back culture with all of the resources to drive home results. The internal processing tools lack performance and are not reliable from a daily basis. As a Crisis manger I would coordinate  communications between upper management and the client. Communication would include all parties that had a specific interest in the crisis at hand and it's resolution. Slow paced.Find many opportunities in learning more tech and skillsGood at exploring new technologiesLong-term hope for the company is diminishing since Dell acquiring. I had previously worked in startup companies. Dell is definitely a large company with the work atmosphere to match.  There is much more bureaucracy and pointless exercises in spending time satisfying edicts from corporate headquarters. I would recommend Dell \ EMC to anyone looking for a job. They are a good company that pays well and has dynamic leadership.I have worked with some very talented people and have learned and grown because of it. Tj maxx was a fun place to work  but it as extremly ahrd harder than anyon thinks. People aren't very nice when it comes to their money.  had to take care of 3 at 5 different depaments. Clean pick up and organize the fitting room, do cashier at the same time. The pay wasn't very good nether my co workers are the best and the management needed some work As an intern you have opportunities to meet many other interns as well as different people in the company. Cost of living is low in Texas. Not sure what it is like after merging with EMC. Global collaboration opportunities, learning environment, entrepreneurial freedom and multi-cultural work place are some of the highlights of working at Dell. Management and coworkers all worked together to achieve a common goal. Empowering all employees the ability to make decisions in their area of responsibility to assist segment in reach performance goals. the new Dell EMC culture is made up of mainly younger people and the older workers are pushed out for one reason or another.  They say they promote from within but they do not. Job is very easy but mundane, the workers are great but the job offers no career advancement without someone leaving. Also contractor conversions are very rare. Decent place to work, good challenges, but lots of pets and protected people.  Boasted work/life balance but then high pressure to work nights/weekends/holidays.  Team members are generally good, management not so much. Watch your back, they espoused 'quality' but then laid off the group's only quality engineer (me). Dell/EMC is a good company and has a good culture and wonderful resources for its employees. The software tools that they have are very good at finding what issues the systems may have, also they have very good resources for hardware issues that arise as well. Navigating the org charts was often a challenge, but this is a company with lots to offer. Very customer-focused, with a strong ethical foundation. Innovation encouraged. I like to go to work every day because its enjoyable.  The manager and staff are very friendly and helpful. They also take their time to train you and care about not over working you. Dell is an Austin staple. There are many opportunities for advancement and team exploration. They are very flexible with remote workers, cultivating a strong balance in that area. I did not work for DELL. Working at EMC was pleasant, challenging and a positive work environment. Most were professional and uplifting. I enjoyed working for the company. This was my ideal job. The people were great. Everything was top notch and balanced. They seamed to really care and I would love to return. I have already applied to return. This is definitely a great company to jump start your career in the IT industry. Dell is growing immensely with lots of opportunities. Great benefits and work-life balance I was paid very well. I worked as a contractor for 6 years. I was paid very well, I was paid incredibly well. Can't complain too much when your making very good money $$$. You will be paid poorly and given stock options that will fail to meet your expectations.  You will never be given a serious opportunity for advancement. The actual last service technician job was with CES.  Indeed defaulted to Dell and I couldn't change it.  Repaired multiple types of equipment for multiple companies. Working at Dell was an enjoyable experience.  I put in a lot of hours to make up for disparaging work requests in different systems. The hardest part was ensuring that customers needs were being supported properly. I do not want to leave information about my work experience. It was a contract and I do not have a enough information to state an accurate account of my experience at the company. The people are great to work with. The pay isn't very good. My typical workday is fast-paced. I have the learned more about leadership in my position. The hardest place of my job was the pay. growth was vital to EMC and it showed in my objectives; the company wanted professional services to be an integral part of growth however constrained my ability to generate revenue for services. Tj maxx was a fun place to work  but it as extremly ahrd harder than anyon thinks. People aren't very nice when it comes to their money.  had to take care of 3 at 5 different depaments. Clean pick up and organize the fitting room, do cashier at the same time. The pay wasn't very good nether my co workers are the best and the management needed some work Building a work relationships with the customer. Implementing new fixes on systematic issues in the PKMS AS400 environment. Great  Manager and excellent support team. Very diverse company to work for with all nationalities. Hardest part is the job is never done for systematic issues. The most enjoyable part is knowing you have given your best to research, analyze, and fix current issues. Depending on area, it is a good place to work.  For sales, it is good short term to get experience, but compensation is lacking when compared to competition with unrealistic quotas.  For example you may have a nice quarter/half and the next quarter/half, they increase your quota by 100% so that you really can't achieve the number so that they can control how much they pay you. It can be a high stress job if you let it be.  It's easy to meet your quotas when you apply yourself.  I was answering double of the quota each day.  Not so bad. •Enrolled physicians into medical practices using an in- house software •Handled Fee schedules•Explanation of Benefits for Physicians’•Researched and analyzed special projects for executive purposes / use I loved the fast pace of work in Dell.  The quick turn around on projects and the decision process kept me very alive at Dell.  Being a senior employee i had access to management and was directly involved in projects for Dells growth. I had a contract with Dell to setup computers in schools across NYC. They ranged from elementary to High School. The setups were pretty straight forward but it would take a long time due to the quantity. DELL SecureWorks is good place to work. Management is trying to take new approach in SDLC and doing okay. Work life balance is manageable. Overall good experience. Requested to come in at least 15-30 mins prior to scheduled time unpaid, at times manager watching your every move or listening to your conversations on the phone of your troubleshooting practices with particular emphasis on shortcomings at one on one's (monthly reviews) Not to mention the difficulty of having an equipment failure, because at Dell we NEVER have equipment failures. It was always exciting to work at Dell.  There was a sense of winning and putting the customer first.  The pace was fast and the scope of work was very dynamic.  Managment was very supportive and they respected the work life balance. Accuracy of data was far from expected, however changes made improvements. Most managers only cared about making numbers look good, versus team and being a leader. No team spirit with constant manager changes and quarterly changes to role. The organization is trash and they will use you, make a mistake with the client and have you take the downfall for it.  There's some terribly crooked and racist people within this organization. Spent 15+ years at Dell/EMC and found it an exciting, place to work.  It provided good advancement and good educational opportunities.It provided challenging projects Dell and EMC have fundamentally different corporate cultures.  While EMC invested significantly in intellectual property (R&D), dell it much more apt to invest in process improvement and mainstream or laggard technology.  R&D investments are shrinking. Dell was a great place to work and grow with the company. It provided a lot of skills that I still use today. It was a great company to work at and I will always appreciate my time at Dell. The culture is rrich and dynamic, but its the people that make the culture.  People are good nature,fun to work, diverse in culture and ideas. The work is challenging with respect to producing a best of breed product from a marketing perspective not necessarily from a technical perspective, although that can and does happen. The benefits is amazing.Training was good.Some supervisor and mangers are good.  There is a culture there where some supervisor are 'race' bias.  Half of management are not professional.  They curse during meetings and during 1 on 1 are rude to below average employees.There are great leaders there that will help you grow and advise.  There is a lot of growth here.  I was fortunate to have been a great employee and was treated w/ respect.  start of the year, they will give you 160 hrs vacation and 9 days of sick!!  people take advantage of this early but has nothing at the end. My manager give me very excellent review. I like to work with Del. They treat employees very well and very professional managers. I like their culture so  much.Strong leaders, promote work life balance, focused on success. Goal driven with strong communication to all employees. Strong sense of pride of Dell brand. Enjoyed working at DellEMC, very dynamic group.Exposed to many different facets of the business. Like all companies of this size, there are sub-cultures. You just need to find the group that you enjoy working with. I worked from 8:30 am til 5pm,Monday thru Friday in the Shipping Department.Learned a lot about shipping/logistics/distribution. Management was more questionable after merger with EMC. Co-workers were great. Hardest part was feeling unappreciated by management. Interacting with co-workers as best part of the day! I would not go back to Dell.  It is an extremely stressful place to work.  It is very cutthroat and management micromanages everything you do.  People are OK Tj maxx was a fun place to work  but it as extremly ahrd harder than anyon thinks. People aren't very nice when it comes to their money.  had to take care of 3 at 5 different depaments. Clean pick up and organize the fitting room, do cashier at the same time. The pay wasn't very good nether my co workers are the best and the management needed some work emails, reports, scheduling and dispatch, coordinate engineers schedules for upgrades and IMAC requests. I enjoyed working with my team, I need benefits since I was a contracted employee Dell did not offer benefits. Overall this is still a great place to work. Since the merger with dell, the culture has changed, benefits have declined and morale has gone down due to the every increasing change. I advanced quite quickly at Dell.  Management team was smart.  Very busy and growing company.  Good starting salary. They offered a lot of flexibility for time off , and were compassionate if any emergency happened. The only reason I left is because our office was eliminated. Ability to define work/life boundaries is a must otherwise the job can consume you.  There is excellent variety available and the organization does encourage cross functional training and experience.  This is a good environment for those that enjoy taking the initiative and responsibility for tasks and projects supporting the business. Dell is the leading provider of IT solutions in the industry. The company culture is very collaborative and the company provides a broad range of flexible work options to suit their very diverse workforce. It's a good place to work but unfortunately it is really a Dell takeover, not a merger, and this has significantly impacted legacy EMC.  Hopefully things will get better. I had a chance to explore myself, every day was a learning session for me. Had a good time with dell. Happy for the days i have worked.I would also suggest my friend to explore as part of working in dell Productive and good Job Culture.Encouraging management.Very organized training modules.Periodic Performance Review.Well organized team structure.Growth in the role. Strong leaders, promote work life balance, focused on success. Goal driven with strong communication to all employees. Strong sense of pride of Dell brand. There is a culture of teamwork to keep customer satisfaction as its maximum level and help the company grow as wellI  constantly keep leaning new skills The people at your campus are great to work with. Had a good amount of great years there. High tech companies they come and go.  That is the main problem. Perfection is barley good enough at Dell.If you can do the job perfectly, life is great at Dell, anything less and life becomes difficult quickly.Over all Dell is a good place to work.Good Benefits and Work life balance.Most managers and good as well. Decisions are really ever decisive and frequently flip flop for some time before any direction is taken. This creates much frustration as you scurry to prep material that will change tomorrow. Paid very well for a contract job. Management was a hassle but we organized ourselves to work seamlessly and delivered without a hitch. Paycheck was never late. Learned a whole lot at this place.  Hours worked were great for me.  Management needs some improvement.  Workplace culture is worldwide.  Enjoyed my time at Dell. small chance for advance unless you work at headquarter in Austin, Tx, most people get a better job if you sleep with your boss or a member of executive management, Serving as project manager for various large corporate clientsManaging the delivery and operation of security offerings such as Web Application Security Assessments, Advanced Penetration Tests, Governance Risk and Compliance, Email security, etc. for various large, corporate clients for a very large corporate environment, it could be a lot worse, but it wasn't bad. job security is basically nil, if you last 3 or more years you are a senior member which isn't a good thing...I'd go back but again, one must realize its a revolving door... warehouse job putting computers and laptops in boxes fast paced working well paying job would reccomend it for those seeking warehouse work good supervisors enjoyed working at Dell, however, recently with the acquisition of EMC, and many duplication of job roles, there have been a sense of insecurity as far as the job. Tj maxx was a fun place to work  but it as extremly ahrd harder than anyon thinks. People aren't very nice when it comes to their money.  had to take care of 3 at 5 different depaments. Clean pick up and organize the fitting room, do cashier at the same time. The pay wasn't very good nether my co workers are the best and the management needed some work Dell was a fast paced work place and provided room for advancement.in all areas of the plant.Management looked for employees ready and willing to move ahead. I enjoyed my time at Dell.  However, since my shift was weekend overnights I couldn't find the work/life balance.  The hardest part for me was the drive to and from work. Selling IT product Very fast basePaid vocation and personal timeGreat experience to learn and grow Very friendly culture with professional trainings Great pay with commissions worked for EMC and a joint venture; VCE.  Working for EMC and then VCE was high paced, customer and success focused.  EMC experienced business downturn, was purchased by Dell.  Major reductions planned and since implemented.  The company I left is not what the company currently is. worked from home from 7 - 3 Monday thru Friday . Always had work distributed to us from the managers. very great team and always got our work done. loveed working there If you are infrastructure focused, Dell is great. I am more solution focused and that is not the culture at Dell. Working in the consulting organization is a career dead end. Work place in Dell EMC is very productive and fun with ping ping table. There is a work life balance in Dell EMC and the management insist on work life balance. Dell was a call center built around metrics. You were expected to handle calls in a timely manner, at times, the call handle time was not  reasonable. It was a fast paced environment. I was very comfortable working at Technisource.  I had serveral positions within the company.  (Contract work). They took great care of me.  Once one contract was over, that found me another.  Positions included Dr Pepper/Snapple, Dell Computers, Walgreens and Pepsico/Frito-Lay. Dell was a great company to work for, but not without its opportunities for improvement. Dell has a strong focus on community service and workplace culture. It also is making advances in environmental impact programs. If you work in a manufacturing environment, you can expect to work over 40 hours each week with paid overtime, competitive hourly wages, and limited opportunities for advancement. If you work for Dell corporate, you can expect to work over 40 hours each week without overtime pay, competitive salary wages, and accessible opportunities for development and advancement within the company. Regarding Work/Life Balance, Dell is pretty good about working with employees to accommodate their needs, within reasonable expectations of the role. Dell has very competitive pay compared to similar companies in the industry. Benefits are great, including Medical/Dental/Vision/Life, 401K, and some others.Job Security can be an issue at Dell. Organizational changes happen frequently, and it seems you never know if that means there will be a workforce reduction. Layoffs would occur annually, although the scale is typically pretty small.Management can be hit or miss. I had some fantastic managers at Dell, and I also had some that were not so much. In my organization at Dell, there was a strong push for personal development, so getting comfortable in a role was viewed as a negative to a lot of managers. The pressure from management was often based on how long you had been in the role. This may have been limited to the organization I was in, but the emphasis  on personal development was definitely company wide. Internal movement is also very much about networking. You have a much easier time moving in the company if you are good at networking. Not sure why this showed up as a place I have to review. I have never worked at Dell, for Dell, at a Dell location or manufacturing plant. But if I had, I am sure they are terribly nice people to work for. Dell culture is very direct and straight forward. One have the opportunity to grow professionally based on the exposure his/her work gets through the company. Lots of training and great real world experience as an intern.  Managers were interested in my professional maturation and intern program provided exposure to multiple lines of business and internal resources. Its a 9-5 job so if thats what youre looking for great! It is a desk job which at times gets really boring but as long as you ask for things to do they will keep you busy. The ping pong table and Wii were seldom used.  The culture changed when Dell purchased SecureWorks, and the CFO and Controller left for other opportunities. In certain departments I feel there was favoritism by managers to certain employees.  I felt advancement was difficult there.  I did enjoy the people I worked with and the work that I did. I enjoyed developing training, training employees and mentoring the most. There were many different companies that worked in the same building but with a different company in every room. The job was a fast paced inbound call center. Most company there were for some type of insurance. If you are looking for a company that has a lot to offer in the way of advancement and opportunity, then work here. It has been a great place to work so far. Had a great experience with Dell in my many titles.  Various departments great valued employees.  Great food in the cafeteria.  Able to balance my work life able to challenge myself in other areas.  Great opportunities to grow within the company. Change was a part of the culture, new products, new management, new priorities.  When Dell took over, the changes accelerated and continue at a prolific pace. Tj maxx was a fun place to work  but it as extremly ahrd harder than anyon thinks. People aren't very nice when it comes to their money.  had to take care of 3 at 5 different depaments. Clean pick up and organize the fitting room, do cashier at the same time. The pay wasn't very good nether my co workers are the best and the management needed some work I spent 15.5 years until my division closed. I was offered other positions both in Nashville and other locations in and outside of the US. My part time food truck business got so popular, I opened a restaurant. They treat their people very well and understand a company is only as good as it's people. I was never bored working at Dell, I will always be proud to say I worked at Dell for over 17 years, in IT.  When I started working at Dell I didn't think I would stay more than two years, I never wanted to leave. Non-American managers are not good. Communication/collaboration is very poor. Don't expect replies to emails or IM messages if you are a contractor. Don't expect your managers to attend a meeting if you have sent an invite. With recent reduction in force is a concern for job security.  Management speaks about transformation of the business, agile development, DevOps, how actions still are about pushing the hardware and not leading with solutions Great company to work for. Great benefits and life work balance. Management for the product I worked for treated everyone like family. Onsite cafe and gym. As in most large corporations, there were both good and bad managers, but 2 of the 3 I experienced were above average. Forward thinking with remote working environment led to a good overall culture and environment . The culture is work hard - play hard. This is a great company to work for - good benefits and pay. Advancement is good but you need to work hard for it. This is a business environment that that operates 24 hours on normal working days.It has also time deadlines requiring working over holidays and weekends.it has a work [population of about  a thousand  and need of security provisions to track entry and exits.This is mainly contract based engagement and the beauty part of it  is that the workforce are self motivated and knowledgeable.They understand the operations and essense of teamwork and production. •	Configured converged and hyper converged server solutions for data center infrastructures.•	Develop accounts by checking customer's buying history; suggesting related and new items; explaining technical features.•	Develop sales opportunities by researching and identifying potential accounts; soliciting new accounts; building rapport; providing technical information and explanations; preparing quotations.•	Updates job knowledge by studying new product descriptions; participating in educational opportunities. •	Accomplishes department and organization goals by accepting ownership for accomplishing new and different requests; exploring opportunities to add value to job accomplishments. I actually worked at EMC and just for Dell a short time after acquisition, but it is a fast-paced, giant corporation which provides lots of opportunity and excellent benefits. This job can be enjoyable if you find yourself in the right division. Make sure you can network if you want to move around within the company. It's not what you know but rather who you know. Dell has a unique work environment that allows you to work from home considerably.  The work / life balance needs improvement.  Some managers are not very supportive of commitments outside of work. EMC was my first approach to vendor side, I met several friends that I still have, I got many things from there, I learned a lot, I really miss a lot this job. after 2 years, the pay sucks and the job is terrible. client pro supportthere is no room for growth in client pro support, get in the door and get to another department asap. this job will kill your soul. It was a dream job minus the pay that was below industry standards. I got along with everyone in the office, at the corporate offices, with partner firms and most importantly with our customers. No micro-managing, but expected to do your work.  Full benefits and good work/life balance.Work with business partners from around the world, so time worked can sometimes be late depending on time of month and ask. In my decade of service I had the privilege to work for so many great leaders. It made the difference to my development and daily motivation to excel. Michael himself is approachable and always has a smile and a positive word. I miss the home team! I enjoy meeting and speaking with customers and discussing their security concerns.  My management was supportive and is happy to jump in and help if needed. the main problem was communication because they were all from over seas and hard to talk with. the work was good and plenty of overtime if you wanted it I do not want to partake in this at this very moment. Thank you for your time as I did love working for Dell a lot of my years there. I am done at this time. Tj maxx was a fun place to work  but it as extremly ahrd harder than anyon thinks. People aren't very nice when it comes to their money.  had to take care of 3 at 5 different depaments. Clean pick up and organize the fitting room, do cashier at the same time. The pay wasn't very good nether my co workers are the best and the management needed some work Installed, upgraded, and troubleshot software requests. Additionally, installed and replaced hardware components as needed and configured enterprise systems and applications.Provided user training for remote access tools, wireless solutions, and BlackBerrys.Imaged approximately 25-30 laptops and desktops weekly in preparation for deployment using Norton Ghost Good Place to Work.  Advancement opportunities are there if you want to add skills.  It is competitive.  Sometimes its busy other times its not.  Job security is there if you perform well.  Training is provided. A typical day at Dell will start early and often finish late depending on what issues have arisen during the day.  It taught me a lot about the corporate culture on a broader scale as well as allowing me to grow my technical abilities.  They always were good about taking unplanned time out for sick family members to maintain the work/life balance.The culture is work hard play hard - my colleagues and I had a good rapport; everyone would help out if there was a problem, but were able to have some fun along the way. Working in sales for Dell will teach you A LOT, but depending on who is your manager, your worklife balance can be drastically different from reps on other teams. They’re good about providing plenty of resources to help you succeed. But if you like to do things your own way, heads can butt as training/coaching is often mandatory. This is a great company for college grads but I would not recommend it to veteran sales reps.  The culture is immature, unprofessional, lacking.  This a great company for college grads as it will provide training and allow you to get the experience you need to advance.  Very political and close minded.  They teach that those that scheme and are unethical will advance.  There is no work/life balance.  You take a vacation you come back to 500 emails. Many great, intelligent people here, but information dissemination (after the EMC/Dell merger) is dismally lacking. Beyond 'reorganization' and 'product rah-rah' emails, there is little to let us know the company direction or plans. Worked at Dell for 8 years, and really enjoyed my coworkers but management and opportunity for advancement are based on who you know, rather than your performance. Interesting work and plenty of it. Lots of talk about work/life balance. And there is some flexibility in some cases. But the work load is not sustainable even for the most dedicated and efficient of employees. Responsible for the management of departmental resources to maintain operational excellence for the plant. Manage a staff of five direct reports consisting of three Production Supervisors, one Administrative Assistant, and one Training Coordinator. Assisted senior management with strategic planning and worked across functions to solve technical, business, and personnel issues. Developed performance measurements and drove continuous improvement. During my 6 years of employment at Dell I enjoyed working with peers, coworkers and management.  Dell encourages growth within the company.  The culture and morale was great especially having to cross function with all levels within the organization.  Looking forward to get hired back on with the company. My company was a part of a larger acquisition. I joined a fast paced collaborative place with a true startup culture, but since the acquisition the amount of bureacracy has tripled. Basic enablement services such as helpdesk, provisioning, tech support, and even SKU and administration setup grounds to a snail's pace. To get anything done you need to be part of management's chosen project, which could change at any time. Reorganizations appear to have every 6 months. The place is clearly in transition for something else, but it's difficult to determine if it's a good place to work until the dust settles. For now, it's hard to make that assessment. The team is very diverse, super proactive and will always go the extra mile to get the job done. Working with different teams to provide the fastest and best solution makes the job exciting. Workplace culture is not homogeneous -- differs from location to location. Work flow dependent on the work group you are in. My work was challenging and rewarding for the most part and I was able to have work/life balance in my role. Management doesn't have a good understanding of firewalls or threat analysis The employees are friendly and welcoming, but the firewall the management team doesn't  care about the employees, once you have been assigned to a customer site. Why is it, that something forces you to write a review for a company? Isn't this, I don't know, forcing people to divulge information so they can apply for a job? Are you sure you're morally correct in this? Ah who am I kidding, of course you don't! Great place to work with great benefits when full time. Temps and part time do not get benefits. Clean campus with security. Comfortable work areas and friendly people. I enjoyed dell because it was easy to transfer to different departments and gain a great breadth of experience.  I was able to work in the IT Finance Department, Latin America Finance Department, Service Finance Department and Sales compensation Finance Department Many jobs have been outsourced to India. Dell has over leveraged themselves to make the EMC purchase. Now everything is about cutting costs. Our benefits have been cut. Many jobs have been cut or moved, and a lot of us have had to train our direct replacements hired in a 'low economic impact areas'. Overall Dell has been a worst case scenario for the legacy EMC folks. With all the outsourcing that has happened there is now no room for pay increases or career advancement. I couldn't recommend them as an employer for anyone in the United States. Very good company if you like comfort zone and good work life balance benefits. They need to invest more in their internal tools and challenge more their employees, but in general a safe place to work. Management has no clue about the enterprise market they've been trying to penetrate by a series of haphazard acquisitions.  They sill have a box-pusher mentality and put no value in deep technical knowledge especially other than in Microsoft based servers and consumer products Tj maxx was a fun place to work  but it as extremly ahrd harder than anyon thinks. People aren't very nice when it comes to their money.  had to take care of 3 at 5 different depaments. Clean pick up and organize the fitting room, do cashier at the same time. The pay wasn't very good nether my co workers are the best and the management needed some work Benefits-Complete a work in given deadline.Most projects allow you to work from home for any number of days.Gives the best work-personal life balance.The best managers to help you deal with your problems and appreciate your achievements.Get recognized for the accomplishments with different awards. Good working environment, great opportunity to grow and expand your professional experience. Quarterly management communication. Well structured with process and procedures in place.  Excellent benefits. Outsourcing, poor management foresight, poor management planning, management refuses to listen to line managers. Disregard for customer feedback. Overall poor. It was a tough job and face paced with very demanding schedules and customers, but I excelled without any formal boot camp training and enjoyed the culture and the opportunity for growth. Dell EMC is a great big lumbering machine, and from what I have seen it is in a state of confusing disorder. Incorrect/late compensation is an example of the kinds of problems I have seen. Early days were terrific, good career advancement and training abound. EMC management driven by Sales and they were ruthless and not technically knowledgeable. One of the first official sales jobs I had and it was very fun!  We were trained exceptionally well and learned how to adapt to the changing culture and position ourselves for success. Dell EMC is focused on ensuring that sales managers exceed objectives and track results on a weekly basis.  Constant inspection is expected but a manager can develop his/her team as they feel necessary in order to exceed their goals Collaborate with sales, pre-sales, training and support teams to help partners and customers get the most out of Dell tools and servicesDeliver technical support engagements with partners and customers via WebEx, voice, and email.  Contributor to Dell/RSA’s knowledge base, troubleshoot complex problems and reproduces where necessary, report product bug where necessary Top notch company. You will be expected to work hard. But the results are stellar. You compete, collaborate and develop solutions with some of the brightest minds. It was a great place to work. Nice people, good management. Someone was always there to help out when needed. I really enjoyed work for Dell. Would love to go back and work for this company. I enjoy working at Dell, they have a good culture of work.  Lots of flexibility, great for working moms. They don't have as many perks as they used to when they were younger but still a very good place to work.  Everyone there is always a joy to be around and respect is given fully.  Career advancement is a big thing for me and not having a line of sight is uncomfortable for me.  Moving up in the hypothetical food chain difficult, you must be in positions for at least 3-4 years to get a decent raise.  Unfortunate because they tend to lose great people to better paying jobs. I spent 20 years at Dell in a variety of roles.  I definitely favored the production side over the services side.  I found management to be much more capable on the production side. Very professional company with many opportunities in each of the separate business units.  was able to expand my skillset by joining other teams and build my career While working at Dell you are given the opportunity to invent and reinvent.  You are encouraged to be creative and proactive.  You are empowered to be your best!  Great place to work! This is day time only, with personal cubicle. The environment is kept very cool. If you don't like to sit in one place for over 4 hours this job is not for you. Working in the technical support department of Dell EMC is as stressful and unfulfilling as just about any other service/retail/food job at minimum wage.The customers retain their senses of entitlement and childishness despite working with a department aimed at business owners.The workplace atmosphere is oppressive and heavily micro-managed. An example is the pitiful allotted time after calls to decompress. When hired, we were allowed 2 minutes between each call to take a breath before diving in to the next. Recently, they have changed it to 5 minutes but management is still be pushed to aim for 2 minutes.We are advised to work for the customer and do everything in our power to ensure their experience is fast, friendly, and correct. We are then pitted against support staff who's goal is quite the opposite (cost reduction and tedious questions), creating workplace hostility.The direct management isn't bad the pay is acceptable. I would not recommend this job to anyone except as a last resort. Interesting work and great colleagues to work with. People care about customers and work hard to meet their expectations. Opportunities are available to learn and develop new products and technologies. The call center I was at was great and most of the management I worked for really did care about their people, but the over all management from higher up didn't really care much. Our call center was closed with no advance warning. We all came to work one day, just to be told we were all laid off, and had 2 minutes to get our stuff and get out of the building. Underpaid for role in Silicon Valley based on other tech companies. Poor management executing decisions with no direction. During EMC acquisition, absolutely no job security with organization restructure occurring almost quarterly. Tj maxx was a fun place to work  but it as extremly ahrd harder than anyon thinks. People aren't very nice when it comes to their money.  had to take care of 3 at 5 different depaments. Clean pick up and organize the fitting room, do cashier at the same time. The pay wasn't very good nether my co workers are the best and the management needed some work Dell call their first line managers 'directors', so they think they really are directors.  Most wouldn't last 2 minutes in a real company.  The good ones tend to leave.  The place is bogged down with conflicting metrics and constantly changing priorities.  The arrogance is thick in Dell mgmt , direction is poor and nepotism is rampant.  Successful employees are folks who like to play the game and are good at schmoozing.  Pay and benefits are good, and mgmt makes very good money.  If Innovation Olympics or Strategy Cascades sounds like things to get excited over then Dell may be the right place for you.  But if you're like me, with a zero tolerance policy for BS, go someplace where you can make a difference.  Dell is not for you. Dell EMC was a great company, relaxed about working remotely when needed and using the technology that enables business transformation. Good management support. Good Culture - putting the customer first and enabling transformation. With Dell merger there has been a lot change and business units left with unsure future. Dell enabled me to become a true leader and gain the experience & education to successfully lead projects. Dell/Genco was bought by Federal Express.Here I made sure that all line technicians repaired and refurbished Laptop and Desktop of Dell Computers. I also oversaw and led a cross functional team to met all plant metrics for productivity, quality and safety Clock in, greet coworkers, pre work meeting and stretches.Receive part and put away in correct shelf locations. Restock and find parts. Work assembly line and boxing line. install motherboards, cable and install newly built systems in boxes to be shipped. I learned a lot about computer assembly, Team work and setting and reaching goals. My manager was hard working and very nice.The culture was friendly, fast paced, very competitive. Working long hours for many months. Reaching production goals and receiving awards for great work. I was there as a contractor to test storage arrays and blade servers.The storage test environment was great to work in.Management was very helpful in getting the tools needed for work. Computer sales from a kiosk in the middle of a mall can be very challenging. With that said, the product I was selling was great at the time and many people were interested. A collaborative culture is highly encouraged at Dell. The company also strives to help employees grow in their careers by providing training tools and opportunities. Cost Optimization over InnovationLarge Offshore teamsMature Technology and retail company hence experience is super valuablePlenty of opportunities for Product Management Not Dell Computers.  The hardest part of this job is dealing with new corporate changes, layoffs, focus changed to profit-driven from patient and employee first philosophy My typical day at Dell was to run reports, distribute work and make sure that the aged claims were getting handled. I also worked on new processes and documenting them.  I also answered Examiner questions. Loved working for my manager. Very fair and fun to work for. Appreciated her workers. Rewarded for work well done. Everyone loved working for her. Very good benefits. Loved the ability to telecommute in my role.  No traffic hassle!  Loved my co-workers and working with other business groups to resolve issues, complete work or projects and participate in developing and testing new software tools. I spent 12 years at Dell, and found their compensation package to be excellent. Well above industry standards. I worked for some really great managers who have since moved on to other companies, and some managers who I couldn't wait for the next role to either move them along or myself along. They work you very hard, but claim work/life balance is a priority. Unfortunately, doing more with less is the nature of the business, so plan on spending nights and weekends on project delivery. This is usually not an issue, but moving to an Agile development method means spending 24/7 for 1 week out of each month on project delivery. People were making themselves ill trying to accommodate that schedule. Fast Paced environment Leading edge SAN/NAS storage technology  company.Performed many Server/storage/FC switch migrations  for Data center migrtions.  Also - I specialized in LOcal Business Continuance/Disaster Recovery   Prodcuts and implementations  in support of many customer Data Center Operations over a 17.5 year career at EMC Corp Great co-workers and a fun environment! Metrics driven. Raises and advancement take a couple years when starting in Sales. Ambiguity the norm around Dell. Being able to work from home is a plus. You get to work from the comfort of your home. Good benefits and work with friendly coworkers and support is always there. the teams are more than willing to assist anyone who needs it and the management will do anything they can to assist you when you need it. on 3rd shift the building is quiet and it is easy to focus on the call at hand, but during the day the building can be noisy and distracting at times. There is a lot of emphasis on company culture.  Very good benefits and management that is focused and driven.  Great place to grow a career with advancement options. The company has gone through many name changes and is now owned by a different holder. The management was good and tried to work with you. Pay was poor with minimal raises or bonuses. Great company and management. I would definitely work there again.Gained additional insight into memory failure modes, supply base management, and server platforms. Tj maxx was a fun place to work  but it as extremly ahrd harder than anyon thinks. People aren't very nice when it comes to their money.  had to take care of 3 at 5 different depaments. Clean pick up and organize the fitting room, do cashier at the same time. The pay wasn't very good nether my co workers are the best and the management needed some work Work is project based. Short term projects do end up with you on the bench for awhile until your manager gets another project. Most eventually get on a long term project that lasts indefinitely. Low turnover - people tend to stay at Dell for careers.  Re-orgs are fairly typical, and can be disruptive to customers. Managed like a B to C sales company, despite growth with channel sales providers. The heading says it all.  Michael Dell is a corporate raider.  He purchased EMC a year and a half ago and things have gone downhill since.  I am not sure what future EMC will have in the Dell world. Absolutely loved working for Dell. Great company with amazing benefits and always room to grow and learn.   Management was great and very fair.  Great place to be. Good Place to Work,   Work is interesting, management is excellent, work-life balance is good.   Employees can rearrange their schedule to accommodate their life. While at Dell it was a good place to work. I would guess that it all depends on your divison and your manager. I was lucky to have a good manager in the division I was in. Great place to work and look at career advancement. Lots of chances to interact and muti-task with several different groups. Chance to work in office or tele-commute as long as work was completed Working on DellEmc products is a challenge.  The equipment is highly technical allowing one to troubleshoot and correct issues at a low level.   This can be very frustrating as well as very satisfying.  I worked with talented and good people. -  I learn to communicate effectively to various types of clients. -  Ability to learn effective problem solving skills more effectively, not just in the work environment.  -  Learn the importance of reaching the goals of KPI in relation to work ethics and best practices. -  Learn better organization skills in a fast pace work environment.  -  Understand the role of compliance through effective documentation and policy guidelines. Dell is a great place to work if the client base is strong enough to sustain a team of consultants. This wasn't the case when I was brought on board, and there were growing pains and downsizing. Otherwise, the opportunities offered were many, the teams were collaborative, and the clients were interesting. A good place to go and learn. Fast paced but fair to work on the cases you get and opportunity to learn. Management is fantastic to work for and the team environment really helps push you forward. Friendly, Kind, Great benefits. Your hard work pays off and there is always room to move up! I was able to travel all over the states for work with them and that was a great plus. •	Project manager for $2.5M Harvard Pilgrim Health Care program to implement member rating and billing for the Affordable Care Act (ACA).  Teams included 70 members with three distinct development tracts and off-shore staff.  Implemented rating services for external MA and CT sales channels including the MA Health Connector.•	Employed Agile scrum for three concurrent development workstreams in the ACA project above while managing all traditional Agile ceremonies and maintaining the project in Rally.•	Led new vendor selection for member card provider. I worked at Dell Inc back in 2004 and got hired on through a temp agency. I was grateful for the opportunity but due to Dell relocating to Ohio at the time destroyed Austin, TX job market and I was forced to take a package due to no job security. Imaging of multiple computers daily, audio visual support and setup for multiple meetings daily. Desktop configure and setup for new and visiting offices. Mobile device setup and configuration for network use and email for iPhone and Android users. Fast pace environment and need to be on point for any situation that arises. Be willing to think out of the box and learn new skills. Team player is a must. I loved my time at Dell Secureworks. I am on severance currently.  I hope to join back to Dell or Secureworks in the future.  If that is not a possibility.  I am ready for  my next adventure!! Great place to work until the department was terminated. I learned new things every days working with database, Excel. Helping our customers was the most rewarding part of the job. Assembly line worker, pick and sort, supplies, kept area clean, worked where ever they needed me never had a set job they treated full-time employees better than temp employees there was always drama with someone.  Never was real happy but I did my job and went home you work hard and get under paid.... the management isn't encouraging to their team members and they don't know what they are doing overall. The salary is not enough to live off of, I wouldn't recommend this company to anyone Tj maxx was a fun place to work  but it as extremly ahrd harder than anyon thinks. People aren't very nice when it comes to their money.  had to take care of 3 at 5 different depaments. Clean pick up and organize the fitting room, do cashier at the same time. The pay wasn't very good nether my co workers are the best and the management needed some work If you didn't participate in after hours parting and dating there was no path to advance beyond sales or retention specialist. I was there for almost 4 years and the only one there to attain senior specialist status. I was never able to advance to a coaching or management position and eventually felt burned out. Dell is an innovative company that is fun to work for.  Many great opportunities to learn and cross train with others.  Great work/life balance and healthy culture. As a contractor it seemed more about the bottom dollar than its staff. For some you work in the same position for years. As for others you were gone in 6 months Great place to work(before NTT Data bought out Dell Services). Great people, excellent place to work, amazing management. Made Lifelong friends here, and great addition to my resume. Dell will pay you for what you know they are not career buildersRecently sold the services side to nttdata an overseas company specializing in service desk support. very unorganized and little hr support Very competitive place to work, I think trainings should be more in depth before employees hit the work floor. it can  better with how computers work, A good job if you're good at marketing and talking to people. Would not recommend for non business majors because the job is not that technical.        . stable company but could do better with work/life balance. pay is competitive. benefits are goodworkspaces could use updatinghardware could be better to use for the jobs we do, we seem to get the bare minimum hardware. Expected to work extended hours, nights, and weekends with little to no incentive to do so, all while be highly scrutinized any time you have 'low utilization', which is completely out of my control to begin with. If you complain, you are called 'opinionated'. Way too much travel for me. If you love travelling, and spending your life in random towns and hotels, and have nothing better to do than work long days, long weeks, weekends and evening with little to no advance notice, you will love working here. Dell is aware of the new side-channel analysis vulnerabilities known as Meltdown and Spectre affecting many modern microprocessors. We are working with Intel and others in the industry to address the issue Worked there 13 yearsStressfull most times but learned a lot about customer service and phone support.Management was more difficultGood starting job for younger folks The first thing you do when the day starts is open the tools and start taking calls. The scope of support ranges from IT professional to older non-technical customers. The support that we offer can be troubleshooting failed parts that need replacement. In addition offering support for software as a best effort to try and resolve, ensuring we have tried everything before deferring to the third party who developed the software. This is very similar to any call center environment but the range of support is so much more broad. Dell is a great company to work for. They were very demanding, fast pace and rewarding. They have gone through many changes over the past several years as many IT companies have. The pay is not good. Other benefits are okay. Dell bought a SV startup here; but many were gone for now.The schedule is not tight. The senior management didn't know what they are doing. Used to be a nice place to work with good work-life balance. Not much job security especially if you are originally from EMC. No clear communications from leadership. Dell is a good place to work.  Great work/life balance, average pay, and the people for the most part are awesome.  However, it is a very stressful environment, and they will cut you at the drop of a hat when they are cutting costs.  They have ZERO loyalty to their employees, everyone is expendable, and will become so at some time. Smart peopleYou are responsible for your own career at DellGood work life balance Good vacation and compensation package All managers are not created equal The company is undergoing a tough restructuring. No room for advancement. My co workers are nice, but my manager is a new manager who has never had that role before. Attrition rate is increasing each year. Job security is low in the support department. I liked the fact that the company encouraged the employees to participate in volunteer work.  The company allows up to 15 hours a year for volunteering and those hours are considered as paid-hours.  They also matches your donations to non-profits. Pros:Relaxed work environment. Good benefits and culture.Management is people oriented.Cons:Career advancement is limited like in any big companySalary increments and promotions are also hard to come by. It is more based on years in company that performance. Tj maxx was a fun place to work  but it as extremly ahrd harder than anyon thinks. People aren't very nice when it comes to their money.  had to take care of 3 at 5 different depaments. Clean pick up and organize the fitting room, do cashier at the same time. The pay wasn't very good nether my co workers are the best and the management needed some work Dell can offer many opportunities that come all at once. Management works closely with employees to make sure they are meeting goals. employees are pushed to achieve certifications to better themselves and Dell's objectives. Started over a year ago. have no complaints, except they feed you all the time. Great work environment. Love the onsite gym. great manager and coworkers. See myself there a long time. The people were all down to earth and everyone got along so it was always a good day. I absolutely miss working at dell. I miss all the people as well as the job The company and Myr individual experience while employed thereProvide details about why you liked working at the company. Lots hours work. Daily learning at Dell There are a lot of great people at the combined Dell/EMC company.  My experience is they work collaboratively in the best interests of the customer.   Best of luck People working in Dell regularly use the expression of 'The Speed of Dell'.  It means a lot of different things.  On the positive side, it means that Dell can implement good ideas faster than any company I've ever seen.  On the negative side, it can implement bad ideas faster than any company I've ever seen.  It is agile in its ability to respond to new situations, but it also can change strategy in an almost arbitrary manner.  Every day there is a new initiative or new idea to try, and that activity generates an unbelievable volume of work.  I have worked hard my entire life, but harder at Dell than anywhere.  When the experience is good, it's gloriously addictive.  When it's bad, you wish you could get off the crazy carousel. Dell is great place to work and grow.  The opportunity to move around and continue personal growth is outstanding.  The pace is fast and frenetic--never a dull moment Having worked for Dell on two separate occasions in different positions, it's safe to say that everything is done to keep the company running like a well oiled machine. EMC gave me a good experience of the corporate world. EMC had a good culture and very positive company and some of my good friends are still with the company. Dell was fun in the day until they thought they had to run the the company just like every other large company. when they started doing that they just became another big company where you only got job advancement on who you know....not what you know. Dell is still a good place to work although they were much better several years ago. If you're a sales person or account manager I would recommend Dell/EMC Since the IPO, the work environment changed. You are expected to go faster/quicker in less time than you were given before. When other teams were decommissioned, and those tasks/requirements  were dumped on you with no added pay and still expected to meet your normal deadline only added more stressAdding additional requirements to positions that were not there previously and not giving you time to learn the new requisites (again) added more stress and took away from work/life balance.While the 'average' day is said to be 8 hours, that is creeping up due to the amount of work and less time to do it. Its not uncommon to see people working 10-12+ hours daily in order to meet deadlines.Hearing *many* co-workers complain about the long hours and how this is impacting work/life balance is not inspiring. Unhappy workers leave companies and then you have lost knowledge and gaps to fill.Going from a private company to publicly traded company has not seemed to be the best decision. It seemed fast paced in all departments. Lots of collaboration. Always someone around to talk ideas, solve problems. Great coffee bar, gym on site, walking/workout trail around pond on the grounds. Like any other large consulting company - as long as you are billable and want to disappear its great.They do a fair job of helping find projects if you are in between gigs, but they have a limited bench. While at Dell, I was encouraged to seek several opportunities.  I felt management viewed me as an asset and was invested in me as an employee.  Team meetings were fun, enlightening, and left me feeling encouraged. Work wasn't too stressful here, but the leadership is what killed it for me. Product leadership (and direction) changed so many times, then advancements were held back due to that (??). Nice break areas with ping pong and foosball tables and cafe. Professional and friendly management. Hardest part was every 2 hours there was a rush of orders and receiving of products. Good exposure & lot of learning. Good benefits and insurance. Flexibility to work from home. Flexible hours & timings. Challenging opportunities & advanced technologies to work on. I worked as a software engineer and this is my assessment of my organization.My manager was the best I could have ever hoped for. He's competent, kind, open, patient, and humble. He put in projects that were a good challenge for me. Higher management is friendly and humble. Management also makes sure quality results and teamwork are rewarded. My team was extremely qualified and its rather amazing to watch them work and see the solutions they make. There is a sense of camaraderie. Everyone is very willing to help one another. The work in my organization at my level (entry-level) was straightforward. Dell uses an Agile structure. I worked on sprints and solving defects in code. The master code is a bit overwhelming for a new hire considering it is so large. Also the org I was in lacks documentation of the master code. You're given a reasonable time frame to ramp up and actually become a substantial part of the team. Dell culture is relaxed. Work hours are very flexible and work from home is perfectly acceptable. As long as the results are there you can schedule your day any way you like, to a reasonable extent. Dell has a great culture. I loved my job. Fast paced environment. Competitive environment promoted to be better. Opportunities to grow. Flexibility. Tj maxx was a fun place to work  but it as extremly ahrd harder than anyon thinks. People aren't very nice when it comes to their money.  had to take care of 3 at 5 different depaments. Clean pick up and organize the fitting room, do cashier at the same time. The pay wasn't very good nether my co workers are the best and the management needed some work There is a great work life balance. Dell promotes working from home which is nice. However, sometimes the office is very quiet and feels like there are many people leaving the company. I enjoyed working at Dell, the people are smart and engaging. The manager was a good listener and allowed team members to take on new projects without a lot of oversight. Very positive experience working here. The culture is very collaborative and helpful. Had an opportunity to work with some great people. Management is accessible and helpful as well. A good learning environment.All of the management has only worked for dell out of round rock so none of them really know the 'real world'All have their MBA's... but nothing else.As we all know, 'people' Solve problems, not company's. Inept Bank team management.  Nepotism. No one manages client.  Team is consistently threatened with being fired for any human error.  Expected and literally told to be a robot.  We are told that the goal IS to replace us with robots.  Terrible morale. Good culture and good time off, but they consistently under pay all their employees.  Medical benefits are pretty bad.  Until you get up to L3 level, the pay does not compare to other companies. I do not want to comment negative or positive because everyone has different opinions and I don’t see the value add for providing my experience at dell. Great place to work. Peers are very supportive, and the actual support is competent and helpful. Plenty of time off, with very understanding manegment. It is a volatile time at Dell, in particular with the DellEMC side of the company as integration/assimilation is still underway from the acquisition.  EMC was know for having great benefits, Dell follows the industry standards and trends more closely.  You can get exposure to some current technologies, as long as the operate in an on-premise private cloud infrastructure.  You will not get  exposure to the public cloud utilities. Many parts of the company manage development of projects through agile but are wrapped in a waterfall delivery process.Management still supports the family first ideals, but the scales are tipping on the work-life balance away from life. Dell was a good place to work. One of the nice benefits was working from home and the flexibility of going to appointments if necessary. If I didn't get laid off, I would still be working for Dell. Dell has changed a lot because of the recent merger with EMC so I do not have much to add as I have been gone from them for many years.  I have friends there who love it better than the original Dell company. too many managers, not enough workers. Cut throat atmosphere within HR, unwilling to find out best person for the job. No communication amongst the workers. Good company but with the recent merger between DELL and EMC things seem unstable. There did not seen to a be comprehensive transition plan in place and there seems to be some confusion as to which group has certain responsibilities. I enjoyed working at Dell. It was not a stressful environment. During my time there I had two excellent managers who were very people oriented and supportive. I enjoy my team and my manager, but year after year I fear for my job with annual OPEX cuts and reductions. The benefits are good, but they used to be better. Pay is pretty fair, so no complaints there. I worked for Dell as a campus ambassador on the ASU campus. I engaged with students and faculty at the bookstore to discuss our line of products. I was managed by an off-site team of managers. Dell is overly inward-looking and obsessed with measuring its own effectiveness. Employees don't feel empowered and are discouraged from taking ownership of problems that cross over into other functions. A lot of your time there is spent on 'managing up' and creating information solely for the consumption of people who are evaluating your performance and supposedly optimizing operations. Not an innovative company but a stodgy stalwart. Not my cup of tea but for some, a reasonable place to make a living. I enjoyed my job and the people that I worked with on a daily basis.  I met and worked with lots of people who became friends and I am still in touch with them.I learned a lot about working with many different groups of people and merging together in a cohesive unit to complete a project.  I worked with people from many different countries delivering supplies, mail and information needed to help them do their jobs.I think the hardest part of the job was closing the office and leaving the company. It has been an experience working for a contractor with this company. It was a great experience in their building. They offer great security. The company I am employed with covers call center Health Conector for state od MA. New company and have great ideas. The  PMO is young and requires development to provide structure.  Management is working on building teams to strengthen the company offerings. Tj maxx was a fun place to work  but it as extremly ahrd harder than anyon thinks. People aren't very nice when it comes to their money.  had to take care of 3 at 5 different depaments. Clean pick up and organize the fitting room, do cashier at the same time. The pay wasn't very good nether my co workers are the best and the management needed some work I loved working there. I just didn't like the city I lived in. My supervisor and coworkers are amazing and I miss them terribly! And we had Starbucks. Culture could foster more software in the solutions. Great people that work there, and they have a genuine interest in making sure you are taken care of socially, mentally and professionally. Overall, Dell has been a great learning and networking experience. I have gained numerous certifications and trainings. Management is always changing but the ones I've had have all been great leaders. Long work days due do rapid growth and understaffing. Asked to do more with less and in many instances it was simply too much work for the resources that were allocated. In a world where sales teams are looking for some extreme x-factor in their new hires, Dell will take anyone and teach them what they need to learn. It's a great place to get your feet wet in the tech industry but it is a big machine. You can easily become just one of many cogs or if you really want to put the effort in you can push into the higher parts of the company. There are metrics so the job can be demanding but it is pretty forgiving of new employee's which you don't see in a lot of sales based roles. The culture is ever changing but I believe Dell is finding its stride and becoming a better place to work gradually for the newer workforces out there looking for jobs. During the transition from EMC to Dell change was a daily thing. Many times change was not articulated - causing a lack of transparency and ability to my best work. I loved the benefits and the work environment. I enjoyed working with my coworkers and always strived to come to work and help my team out and also our clients Every day was a grind and a challenge at EMC.   Great productGreat cultureGreat Leadership team!EMC was always ahead of the industry curve. Overall it is a great place to work but hard to get anything done as there are so many layers of management to work through.  People are willing to talk about advancement but not many are actually willing to help. Due to separation agreement I am unable to discuss my views on my time at dell for 24 months. until that time I will not be able to provide requested information. Well managed machine.   Driven by metrics and concerned about employee and customer feedback.   Since going private, less quarterly churn and more longer term thinking. Gained good knowledgeExperience working with cross teamsParticipated in live deploymentsLeaned Dell owned frameworks for application developmentsInvolved in L4 support Working for Dell EMC/Isilon Storage Systems had to be one of my favorite places to work.  The people, the culture, the benefits, as well as the opportunities to grow. Great, fast paced, work environment. Very in depth 6 week training course. Unfortunately there is a very high turnover rate for management. Constant change in management and Constant change in the medical field was sometimes quite stress full and led to alot of time re doing things on what a previous manager said, When new management came in. Very low morale keeps things from being as productive as they could be as a whole. Lots of lost benefits when we merged with Dell.Managers seem to onlyi care about themselves.Not a lot of room for advancement, and no clear path given to do so. Dell is a extremely fast pace company that expects excellence from its employees.  Departments were driven to improve on processes and key business metrics.  Cross-function communication was key to success.  The culture is very competitive, which drove high performance and results.  I learned a great deal from the high level of talent in every organization.  Great high-tech company. Company continues to optimize post the largest IT merger in history.  This presents a very uncertain future for the company and employees contributing to the high stress environment. Unfortunately Dell took over EMC and continued the lack of vision on the training environment, putting the same managers in place that couldn't drive the business for EMC. The training is lacking and the professionalism is lacking as well.I was not trained correctly, the management was not helpful at all and what they told us would happen didn't happen. Dell was a great place to work. I enjoyed working at the international (global) level of project management dealing with multiple and diverse cultures. Tj maxx was a fun place to work  but it as extremly ahrd harder than anyon thinks. People aren't very nice when it comes to their money.  had to take care of 3 at 5 different depaments. Clean pick up and organize the fitting room, do cashier at the same time. The pay wasn't very good nether my co workers are the best and the management needed some work Dell is a great company with transformative technology and the management has the vision and strength to realize their goals.  All in all, I could not recommend Dell highly enough. This place always had a lot going on.  There was always new people coming and going and it was hard to keep track of everyone.  The management was easy to get along with and never had a problem with them. Get place to work if you enjoy a fast paced environment. Pay is great, but you have to work long hours. Constantly learning and able to move up to company ladder quick. Con is that there is a lot of rotation Great place to work! I started out my career at Dell and from the beginning i had meaningful work with high exposure to executives. The org structure is very flat which allows you access to upper level management. If you want to get awesome experience in the technical field, Dell Inc, is a great place to get that experience, while also having time to be independent. Fast-paced, dynamic, competitiveDell does not invest heavily in nice equipment for sales employeesCyber-holidays are busyManagement tries to get people to work overtime, weekends, and holidays Generally very good benefits and work environment. Work environment is amenable and there is fairly good support for extracurricular interests. Could benefit from increased mentoring, review and structure in providing opportunities of advancements. I learned a lot about sales and the computer industry as a whole. Dell takes care of it's employees financially. However, the sales work is mundane, grueling, and stressful. Sitting for long periods of time and constantly on the phone with customers. I was a logistics coordinator as well as being a trainer for at that time EMC Corp. This job required traveling. This was by far my favorite job of my working career. My classes were approximately 10 to 20 people per class. I am very passionate about training it allows me to utilize and share my experiences with others. Management with EMC was always open to any ideas and suggestions and allowed and trusted their employees to carry out their day to day responsibilities. Typical day included team collaboration/conference calls.Management is committed to team and personal goals.Great benefits, terrific training programs. I had a lot of great experiences at cliebtlogic which was a third party outsource for Dell computers Customer care and technical support call center. I learned a lot and earned 16 Dell computer certifications there durning about a year. My contract with Dell under Insight Global was a great learning experience. It sharpened my skills with Desktop support and migration systems helped me gain IT tech positions elsewhere. Worked in teams with manager and  everyone had the same schedule on the team. Many opportunities for overtime. Paid salary plus commission. Everyone could earn commission if they sold enough. Some places only pay commission to the top sales people but not Dell. good company, lots of good people, i will recommended anyone to go work for them. work culture was good, management was ok lot of time to learned and learn Flexible work environmentLearned the art of diplomacyPeer opennessStrong management support within own functionMostly a good work - life balanceStrong emphasis on charitable work I started as a call taker and moved up to a team lead. was responsible for the training of my team and helped to manager the training cycle for the other teams in my group. The primary problem with working at DellEMC is the significant amount of red tape in place to hamstring your personal success. You cannot move up more than one job level per year, you cannot increase your salary by more than 20% per year by any means, and you cannot leave your department without one year in role. The one of these that is the major issue is the 20% salary increase. Should you start entry level, your salary is so low that 20% is not enough head room to move into a position you are actually qualified for. The only way around this is to quit and then get rehired else you have to work at the company for 5 years plus to get into a decent job. You are told grand tales of being able to move within the company once you get in, but those are daydreams at best. The work culture is great and the company treats you well most of the time. Unfortunately this culture is only able to keep you distracted for at most a year before you realize you have no where to go, and the only way to advance your career is to leave. Dell Technologies offers a vast array of career paths.  The culture is fast paced and you are in full control of your development path.  You will get out what you put in, work life balance can be a challenge but only if YOU let it. if you have a problem and need help just ask on of you co-workers on your team and they can help you.if no go with co-workers there is a team lead that helps or your manager can help. I interned in a group that lacked the collaborative culture I expected.  While everyone was willing to help, everything was focused on units, revenue and margin.  I did not feel integrated with nor did I make any personal connections with full-time employees during my summer experience. Tj maxx was a fun place to work  but it as extremly ahrd harder than anyon thinks. People aren't very nice when it comes to their money.  had to take care of 3 at 5 different depaments. Clean pick up and organize the fitting room, do cashier at the same time. The pay wasn't very good nether my co workers are the best and the management needed some work Review supervisor orders and process accordingly.I've learned that I have to be diligent on the orders since it was pharmaceutical products. The culture was fun and interactive. I would love to work for this company again. If an offer came along that fits I would join the Dell team in a heart beat. Between EMC and Dell merging they made the perfect mold to form a working force like no other in the data storage industry! I worked for Dell for 14.5 years. During that time I was afforded the opportunity to learn something new every year. My days started at 7am and ended when I got my work completed. Because most of my positions were global, I worked late hours Mon-Thurs. There was fantastic flexibility around where I worked. I was able to work from home and go into the office as needed. This makes working long hours tolerable. The people I worked with were brilliant. It was a good experience. one of the best things I like about working at Dell is the employee resource groups where you can volunteer in the community and give back while doing great things for other people. Great place to work! I had wonderful managers and great experience overall working with Dell. Flexible when you needed to change schedule last minute. The culture was geared toward working many hours and feeding u at the desk and trainingI liked the team environment that helped me look loke a pro was great Dell is a great place to work at, but if you do not have patience and cannot take outside priorities out of this workplace it is not a place for you to work. The pay is exceptional, the hours are also and the customers you have to deal with thru the health insurance companies are sometimes rude. But if you can handle it, then go for it. I loved working here, I quit only due to transportation. The staff and managers were always helpful also even though they were busy more than we were. Training was somewhat okay, overall it was well needed, but if your not willing to cooperate during training you will no doubt do terrible on the floor. This facility also has a cafeteria including a Starbucks and also a gym. It has a walking trail as well as a basketball ball court outside. The environment is somewhat comfortable similar to home, but just a workplace of course. Furthermore, overtime is mandatory. If you want extra bucks you wont have a problem with that, but if you don't you will; look forward to a challenging job 'not a hard job at Dell'. I've enjoyed my tenure with Dell Secureworks.  However, I am looking to grow in other areas of the industry.    A typical day involves an 8 hour shift answering calls from clients for assistance with troubleshooting network issues. The job can be stressful at times. Enjoyed working there, and keep busy and always willing to help others. Great group/team to work with. Fun & work balance. Love the dayshift hours. great. Way too stressful. And I did not like it. I don't like being stuck at a desk tied to a phone and being yelled at all day long. I will never work in this kind of job again. We had long days and worked alot of hours. Overtime was great and the pay was okay. Very competitive among co-workers but good people to work with. Good benefits. In the 16 years I worked there, both as a contractor and then 13 years as an employee, I created a lot of work that I'm very proud of.  Some of the oldest material is still in use today.  I am also proud of the programs and standards that I spearheaded, which helped to bring quality and new revenues to the company. The job came with a lot of autonomy and my mid-level managers were excellent to work with.  The team I worked with was 10 out of 10 and all very competent in their skills.  I worked hard and I delivered on average about 4,000 pages of published work per year for 13 years, which is also a great accomplishment that I am proud of. Good job. Dell provides technology solutions, services & support. Buy Laptops, Touch Screen PCs, Desktops, Servers, Storage, Monitors, Gaming & Accessories. Good pay, good benefits. Dell provides technology solutions, services & support. Buy Laptops, Touch Screen PCs, Desktops, Servers, Storage, Monitors, Gaming & Accessories. •	Executed to a $1.4M. monthly quota by coordinating project plans between ourselves, our customers, and outside vendors thru the purchase or production of necessary materials and service, as well as the appropriate financing Dell is a great place to start your career, however as you move up opps are limited.  great benefits, great people.  Work life balance is great and managers are encouraged to support healthy lifestyle. Three years ago, when I departed Dell, I would have given it a much harsher review. Looking back, it wasn't bad, but some unfortunate occurrences surrounding the privatization move foiled a couple prospective internal opportunities that would have kept me at Dell had I the chance to pursue them as planned. Nevertheless, your politicking is going to bigger the single most important thing you can do to advance your career. Do good work, know the right people, and, with a little luck (unlike me), you'll fall into the roles that you want. Management are disengaged in terms of vision, and concrete direction. Too many layers.The best part of the job is flexibility.The worst part of the job is everyday the structure becomes more and more rigid and bureaucratic. What supposed to be a 1 hour job becomes 2 weeks or even 1 month job due to the restriction, unavailability of subject matter, and lack of communications, and changing priorities or conflict of priorities between different groups. Answer calls Support customers, manage team members Assist customers with general enquires Train new staff members, hardest part was the traffic and dealing with matrix As an assembly team lead I had the opportunity to get into leadership and help others grow. I learned so many things myself I like to grow in what I do. Tj maxx was a fun place to work  but it as extremly ahrd harder than anyon thinks. People aren't very nice when it comes to their money.  had to take care of 3 at 5 different depaments. Clean pick up and organize the fitting room, do cashier at the same time. The pay wasn't very good nether my co workers are the best and the management needed some work Contractors are treated like second class workers while employees watch YouTube/Netflix all day.  Major division of labor, management plays favorites.  Very over the top ridiculous with safety, too cautious impedes work.  Hardest part of the job was sitting through nonsense meetings about statistics and numbers that did not apply to me when I knew I had actual work to be done in my own area.  Most enjoyable part of the job was going home. Enjoyed the work and team.  All the managers were great.  Beware if you don't work in Round Rock, TX your career growth is VERY limited.  You'll see almost every US mgmt role wants you in TX. I have been through two mergers within 2 years so it's been a bit of a roller coaster.  They have done a great job with the integration but there is always some challenges when merging tools, operations, sales forces etc....  It's a great company and strives everyday to improve customer experience. For the first 10 years, my career was active, vibrant, and constantly increasing in both pay and responsibility. The last 10 years has brought it to a complete halt. No pay grade or significant pay increase, and a huge expectation to perform with empty promises for the future. I developed new teams, created new processes, and helped build a Federal Services team single handed.No recognition. This company does require a lot of your energy and drive. They expect you to move up through the ranks or at least be come more of an expertise in the field that you work. the job is great, you will make great friends but don't expect things to go swimmingly all the time, if something happens keep your head down lest you get hammered After EMC was acquired by Dell, they went through some integration struggles that are not uncommon, especially for a merger of this size and magnitude.  But overall, Dell has treated everyone at EMC fairly and listened to their concerns and recommendations on best practices.  Combined, Dell EMC has over 140,000 employees with revenues north of $70MM.  For a company this size they still try to treat everyone like an individual and value your input.  There are still some pains between the 2 companies, but they are always listening and try to improve. Great company to work for and has excellent benefits.  I have had great potential to work here. The benefits are great even after the merger to Dell.  Management is transparent The work is repetitive but the job has definite upsides.  Management was pretty cool, if you're decent at selling.  You receive health benefits on day one (and they're good ones), which is pretty sweet. I enjoyed working with salespeople and helping them improve.  I loved the experience of moving to Oregon for 3 months to open a call center and train employees.  The only reason I left was to pursue a lifelong dream of opening a business with a friend. start of shift is great everyday. I have learned alot since working for the company. Management is great. i wouldn't say the job is hard if you can pay attention to details. I enjoy the people I work with and of course end of shift. Dell promised that the majority of EMC would remain the same however organizations were turned upside down, health benefits all changed (and not for the better) as well as many policy changes. Great company to work for.  A positive experience for a student intern to gain exposure to corporate environment.  Management is helpful and provides solid support. EMC was a great place to work. Culturally there has been a significant shift since the merger with Dell, for the EMC staff it has been a difficult transition. Ability to work from home from time to time really helped the work-life balance and the people there were fantastic. I cannot speak poorly about Dell as a company, but my work environment was hostile.  The director had a bad temper and on many occasion would curse, throw things, or break his keyboard or phone, thus why I left. Channel is where the action was in Dell, great learning as a CAM you have to know all products and teams.  Very enjoyable, rewarding and mentally challenging. I only left Dell to retain my position with the company we were supporting. They decided to insource Dell employees who had been supporting their infrastructure. Without this insourcing change, I would likely still be working for Dell (NTT) today. Dell es una empresa de muchas oportunidades, donde valoran a sus colaboradores y les brindan el soporte necesario para desempenarse mejor. La cultura laboral esta basada en altos entandares de etica, respeto.Igualdad de oportunidades y oportunidad de crecimiento dentro de la compania. This does not have the culture of Dell the parent company.  It is run by a bunch of egotistical crazies that are constantly in a power struggle with each other and looks at Engineers as fodder. Great place to work while it lasted.I learned a lot from other technicians. I met great customers while troubleshooting their issues. I would recommend working for them to anyone. Tj maxx was a fun place to work  but it as extremly ahrd harder than anyon thinks. People aren't very nice when it comes to their money.  had to take care of 3 at 5 different depaments. Clean pick up and organize the fitting room, do cashier at the same time. The pay wasn't very good nether my co workers are the best and the management needed some work I truly enjoyed Dell! Left because I needed to get back home and help with the family. The managers were great, my coworkers were amazing and helpful. Job training was fun and easy to learn. There were many opportunities to go further in the company, but I had to leave. I loved working for DELL. They promoted a positive environment, continuous learning and provided ways for advancement as well as training (if applicable).I have been fortunate to have been sold with the business originally from Dell to GENCO then to FedEx Supply Chain. Was able to work from home and there were lots of overtime hours processing health insurance claims .     Learning occurred via webex and would be assigned trainers.  Lots of work and good team members and staff to work with EMC, acquired by Dell, was a great company to work for as an engineer up until 2001.  After that, acquisitions and engineering leadership replacements turned it into your typical heirarchically bound corporation. no job security, constant layoffs, heavy processes to get anything done... a lot of unhappy people here, no career advancement under current environment Putting customer deals together using new technology, global environment added complexity to daily work.  Constant change.  Going private was an interesting decision. Dell provided a great opportunity for me to launch my career and was a vibrant place to work. Over time, the company became very 'corporate.' The benefits were great, but the compensation was not, especially, for long-term employees. The benefits were average, the PTO was pretty good. My department manager was good. Communication could definitely use improvement. Other than that it was a kick back job A typical day at work involved collaborating with numerous diverse coworkers.  Quality and safety were main priorities at Dell Computers.  There was never a boring day at work.  The management worked with you and assisted with any needs we might have. Your success at Dell is dependent upon your group and management. It was an excellent place to work, but challenging based on all of the companies that Dell had acquired in the last 2-3 years, which is why the culture can vary depending on the different areas of the support organization you worked alongside.It was a great learning experience working with internal Dell cross-functional teams such as sales, consulting services, support maintenance contracts/renewals, customer care and various technical support staff. Great Place to Work, Top Ethics Company, Transitional, Great Company Culture. Enjoyed joining both companies and meeting a lot of great professionals along the path.  I was able to take advantage of my skill set to support several executives through transition.  Learned a great deal about the business of presales, sales. Dell is a great place to learn how to develop your skill sets and develop your goals and never give up. Your team can be critical and you will rely greatly on them for the answers and support you will need in the stepping stones to your success. At first it will seem overwhelming but you must remember the hardest part to life and anything you do is just show up - 70% of succeeding is just showing up, writing you name on the exam can be 70% of the passing the test, and that is what you will get from your team and mentors at Dell - They want you to succeed. I enjoyed EMC as an employee and manager. It was an environment allowing an individual to be creative and develop systems on an on going process. You were expected to perform daily. worked for emc2 which I considered the best company to have ever worked for top notch wish I was still there really made me feel like i was important. Overall good place to work. Organized, proficient. Stressful however. You definitely need to know what you are doing in order to work here.Managers were all good people and easy to get along with Dell was a fast paced, cutthroat place to work. It was fun at times and pay was moderate. I was given a great opportunity when I was hired on at Dell. My contract ran out as the EMC merger was still young. Lots of changes incoming, I can't be certain of how the work environment will be moving forward. As is typical of mergers, there was pretty strong uncertainty about the organizational changes accompanying the merger. Upper management had very clear execution direction, which unfortunately didn't get passed down to mid-level management. I loved working at Dell. I expanded my skill set to global and worked with cultures and personalities from all over the world. I highly recommend to anyone. Very rigid clock and phone management. Not able to do the job effectively in the time allotted. No real support when it is needed. Workload is way to heavy for everyone. Your support is to busy doing other things to help you in a timely manner. Tj maxx was a fun place to work  but it as extremly ahrd harder than anyon thinks. People aren't very nice when it comes to their money.  had to take care of 3 at 5 different depaments. Clean pick up and organize the fitting room, do cashier at the same time. The pay wasn't very good nether my co workers are the best and the management needed some work Its fun to work at Dell. The hours are flexible and the management doesn't stress you to deliver your work. Everything there was balanced. It was really a fun filled environment to work. I consider Dell as my Home company. Great Company to work for. The team was really good to work with. Team-Player environment. Great supervisors. Good shifts and hours to work. Nice pace job. Provide clinical support to customers. Learned different aspects of the different areas we support such as lab radiology and pharmacy. The workplace is very culture oriented. The hardest part is not always having the time for hands-on training.  The most enjoyable part is there are always opportunities to learn something new. Extremely fast paced with unclear objectives and lack of management. Very little work/life balance, worked very long hours and often 7 days a week. Strangest work culture I have ever worked in, everyone is very concerned about watching their back and never making a mistake. Time is spent making sure if a mistake is made that it can be traced back to someone else. The only plus is that there was decent compensation. Can learn many technologies according to different projects. People there are friendly and would like to teach if you have any questions, and food there is delicious. I was with Dell for 20 years all in a sales capacity.  Duties were many different hats.  Sales, Customer Service, maintain retention customers along with building new customer base. Maintain accurate reporting and forecasting using Sales Force tool. Every Day is different was one of the things I liked best, was never boring tha's for sure. The culture and people were always number one in G500 Global accounts. Management was always as fair as possible and I never had problems with any of the numerous managers I had over the last 20 years. I was actually a manager in Enterprise division in 2000 for a year. However they consolidated Enterprise and combined the Segment up into two segments instead of 3. I then went back into sales where I stayed and managed multiple G500 accounts over the time of my career. I worked at a Center of Excellence before Dell was in control of EMC. The work was standard cabling and racking of equipment with very limited opportunities for hands on technical training or experience. The point of my interneship was to receive technical training and experience to bolster my resume. I disclosed this information before my internship began and was given very little support towards my future. I ultimately became bored and felt unappreciated for all my work. Dell EMC is a driven company when it comes to sales, but they give significant resources to the sales teams on the front lines.  The work is demanding, but there is a great opportunity to earn, learn and develop your career within this company. This was one of my favorite places to work. The work was challenging and rewarding and no day is the same. This is the place to be if you want to constantly challenge yourself. Supervised all activities of 26 pre-sales resources in conjunction with sales and services managemenDeveloped strategies to prioritize resources toward the largest and most profitable EMC opportunitiesManaged the organizational effectiveness, efficiency and alignment of all technical resources with clear divisional services bookings and product revenue goalsAdvised national sales management in the effective use and deployment of technical resourcesWorked with internal EMC cross functional teams such as sales, services delivery, and product engineering company is great on everything, would like to work for it again, many great professionals and talented people here, great technologies and products, overall is perfect I contracted for the NSA (National Security Agency). Due to national security concerns I cannot reveal my job description. My job was DoD TS classified therefore I am unable to give information requested. work would be very hard but it paid off at the end of day. managers did an good job of communication. i  also liked the resepect they give you. also have the latest technology No work life balances,  No training, No benefits, No directions, not stable schedules and no  supervision,  No team works, No advancements, no meeting and discuss the problems if found. Working Dell is all about your group and manager. Overall, it is a great place but management is everything, and the culture can vary widely based on that. Excellent pay and benefits, unlimited training opportunities, strong pre-sales culture with enablement to drive solution strategy. Dynamic industry with constant change.Complex set of products/solutions with overlaps which can be confusing to customers and partners. Dynamic industry with constant change - if you can't keep the pace you will not survive. stressful working and slowing overnight manangers work  not strict over us...  everyone of us got layoff at once included manager...Dell business had financial problems The temperament has been to not expect to advance in anything passed the Sr. Technical level for me experience. After several one on one meetings with management still there were no lateral opportunities for advancement. Met some of the most amazing and intelligent people I had a change to work with. Productive environment with upwards mobility.Very flexible work scheduling. Dell has a reputation, well-earned, for being a hard place to work. Dell prides itself on being 'direct' - meaning people who rise to the top of the stack can tend to be very forceful in their demeanor. Nice guys finish last in that type of environment. The culture is changing, but slowly. Tj maxx was a fun place to work  but it as extremly ahrd harder than anyon thinks. People aren't very nice when it comes to their money.  had to take care of 3 at 5 different depaments. Clean pick up and organize the fitting room, do cashier at the same time. The pay wasn't very good nether my co workers are the best and the management needed some work The manager was easy going and helped me understand the work required. Got a chance to brush up my LMS and LCMS skills, learnt quite a bit about the IT industry Learned all of the key points of sale for Dell technology products along with the step in creating a business to business type of sale. This is a great company to work for. Effectively articulate the value proposition associated with Dell’s products and services. Responsible for driving inbound and outbound calls, emails, and proposals to focus on maintaining and expanding business relationships as well as gaining market share with existing and new customers Difficult culture to work in. Incompetent managers. Too many management layers. People afraid to make decisions. Everybody is expendable. Very poor work/life balance. Not unlike any other sales person day in life at other companies I have worked for namely IBM, Oracle and Symantec. EMC at the time I worked for them - was very successful in Storage and Backup and Recovery markets. Good company to work for. Enjoyed working there. Good perks, good salary.           Norhing more to write. Very nice organization, considerate would like to work gaain Meritocracy, many various functions, fast paced and lots of good people. Most rewarding job I ever had. There were some of the best managers I ever worked for. I don't want to write anything here. Seriously, this is completely unnecessary, and absolutely asinine. Does anyone actually read these? Everything is stars now, or thumbs up and down. Dell is trying to reinvent itself - thus the merger with EMC.  While the merger is presented as being of 'equals' - and the executive management may believe that - lower level legacy Dell and EMC staff are at odds.  EMC was the more technically advanced company and knows how to drive the change the combination needs.  Legacy Dell was very manual and many of their processes are outdated and inefficient.  Legacy Dell staff are actively resisting change - even that initiated by their own management - and work to drive out legacy EMC staff.  This creates a dysfunctional and hostile culture and produces no improvements or value for the company.I am hopeful that this will change and the resistance will be pushed out and the combined company will move forward together.  I have my doubts though and believe I will find better opportunities at other companies. Business managers oversee the activities of workers; hire, train and evaluate new employees; and ensure that a company or department is on track to meet its financial goals. ... In a smaller company, the production manager might perform these activities herself. As part of the services team (now NTT data), our support team provided app support for dozens of hospitals. Each hospital/organization had different policies and workflows so the majority of your day was spent trying to wade through the BS so one could actually tackle the technical issues. I don't see how they make money considering the amount of time wasted every day on navigating the red tape (prob why they sold out).  Pay is decent and some of the higher up managers are awesome, but you rarely deal with them soooo.. PTO/benefits are also well below grade compared to any local hospital in the area. Basically on par with local unskilled labor (factory work, etc). Living overseas and working at the latin american headquaters for Dell Inc was the greatest work opportunity after retiring from a twenty year military career. The company provided their employees with plenty of training and the opportunity to grow within the company and the ability to move to other departments when opportunities were available Dell had some issues when it came to the direct stores and have since shuttered them. Poor management and lack of pay were biggest contributors to their problems. Be ready for fraudulent credit requests' especially from New York.  You learn how to read reports and know what to ask.  Management was great with the APS Department. Great brand name - can get a meeting wtih almost any customer. The key is your account base and geeting your specialists into all your accounts. The role of the AE is to oversee all the sales aspects within the Dell family of products. To be clear, I worked for a BPO of Dell and the oversight of the 3rd party support was pretty minimal. As a result, these large BPO companies enjoy sucking every drop of productivity out of their employees for minimal returns. Reviewing as a legacy EMC employee. Dell is only focused on the bottom line. Customer service roles are no longer valued as they were at EMC. Employees seem expendable and will be outsourced or contracted out if possible. Too many managers that do not come from the inside so not only do they not understand the job they are managing they are turning the culture to Jr high back stabbing. •	Managed the day-to-day operations of the development team, including project progress and forecasting resource availability for future projects.•	Responsible for the delivery of several time critical projects to support the immediate needs of the internal customer. Dell is a great company to work for as a contract employee.  This particular department of Dell provided insurance solutions for insurance and IT company all across the world.The hardest part of the job was not having stability, as our contracts were subject to terminate any time without notice Tj maxx was a fun place to work  but it as extremly ahrd harder than anyon thinks. People aren't very nice when it comes to their money.  had to take care of 3 at 5 different depaments. Clean pick up and organize the fitting room, do cashier at the same time. The pay wasn't very good nether my co workers are the best and the management needed some work My time at Dell was mostly positive. There are great people that work for the company.  There is room for growth and advancement as well I would work there again. Dell is like most IT companies in the new millennium, it is a very competitive environment. The company's bottom line does not take into account the employees working there hence the reason why they constantly go through work force reductions to compensate for shrinking margins because of over commitment to clients. That coupled with acquisitions like EMC make it difficult for employees to have a sense of comfort in their job security.The one positive is that they will pay for performance but for that you have to over achieve. Quarterly driven sales environment. Lots of meetings and working with different divisions within the company. Can be demanding at times, especially at the end of the quarter. As an employee of EMC Isilon Systems, this has to be the best place I've worked so far!  EMC Isilon System was ranked one of the best places to work in Washington, due to the staff and management who showed they cared about the employees. EMC bought out Isilon Systems and the transaction was as smooth as it can get!  Nothing that we all couldn't handle. The flexibility to work from home is great for a work-life balanceTechnology being worked on is cutting edge and there is a lot to learnExcellent online learning resources are available to employeesPeople are fun to work with This was a temporary remote position. I enjoyed being able to work from home. The hours were great and management was as well. The training was thorough. Enjoyed my co-workers and the fast paced environment.  Some seasons were busier than others leading to long work hours that sometimes became stressful but overall a good balance.  After having children it was hard to find a good work/home balance. If you're looking for a flexible place to work, this can be it. Although they have employee and team goals, setting your own goals is taken with a grain of salt. No real preparation is given to move into other roles, especially if you excel at your current position. same as any other company IT and no comments about the specifically about that company or the management of that company. its nothing new in there that is not there in other companies. I loved the culture and people that I worked with at Dell. Everyone I met was supportive, even in a sales environment. The only thing that I really struggled with here was the difficulty of the position. Sales is just not a field I believe I can succeed in, but others certainly could. Dell only gives out contracts to low pay for higher skilled positions with no benefits to Contract Companies. The majority of their staff for Sales, Customer Service, and Tech Support are contractors. Most are not allowed to work more than 18 months before they are laid off and never hired full time on Dells payroll.  It is a shame they have a revolving door of good talented people that are left without another job to replace their one at Dell due to contract was dropped due to the 18 month rule. Good place to work. Workmates are friendly and helpful. Good salary as a co-op student. Learnt a lot during in the work progress. Lunch is not very good but acceptable. Company paid you well for the job at hand. Best quoting system of any major IT company I've worked for...Very good 1st & 2nd line management.Quality of products was not consistent Company was well-suited for a telecommuting work force. All the equipment needed to work remotely was sent next day air and the culture was very conducive to a global team. Good company on the cutting edge of IT transformation. Not bad to be here if you're used to the culture. Technology is great and very competitive. Noticed a significant change over the last year where there seems to be a diversity quota attempting to be met. Overall, it was ok. DELL doesnt care about employees. They could be fired anytime. Doesnt matter how many years you have been working. Better not to join DELL. At Dell, contractors are made to feel that they are valued and are equal contributors. Information is not restricted to full time employees only. Contractors are invited to most, if not all of the meetings involving organizational or company wide changes and directives. Great pay but awful working 12 hour shifts over the weekend. Very stressful but the management was very helpful and accommodating to employee needs. Might have been more tolerable if I worked regular hours during the week. EMC was a great place to work. they give you opportunities for career advancement and training.if you work hard it will pay off at EMC.They have a good work environment. You are always learning something new. New systems, .I was in charge of hiring and training administration staff throughout North America.You would travel 45% of the time.I enjoyed learning new systems and enhancements and training the teams on how to use them Tj maxx was a fun place to work  but it as extremly ahrd harder than anyon thinks. People aren't very nice when it comes to their money.  had to take care of 3 at 5 different depaments. Clean pick up and organize the fitting room, do cashier at the same time. The pay wasn't very good nether my co workers are the best and the management needed some work I really enjoyed working for Dell.  There were mentors assigned that helped you grow with the company. At the end of my time there, I was working remotely from home which I no longer enjoyed. Very good management and encouraging team lead.Always there to hepl and guide you. Complex developement styles and framework used.Very advanced technologies. Spent a summer @EMC. Great people but the intern program (at least 7 years ago) was limited to business and sales ops and there was little room to do anything else. The sales environment is cut-throat, lack of training and collaborative management. The territories are not specifically assigned to one team, so customers receive over 10 calls per day about the same product, from the same company. No job security, about 10 people would get fired every Friday. I would describe the ideal job as a job that makes the most of my qualifications and abilities, and gives me a chance to constantly challenge myself. I look for a stable job with quality supervision, a positive work culture at a successful company that will encourage me to work at my best Was originally part of EMC and when Dell acquired the culture has been shifting from one that focused on top down sales model to one aimed at middle up. If you can't say anything good, don't say anything at all. I like my hours. The TL had a hard job, in force dumb metrics. Not sure if it was due to not wanted to give rises. Talk with customers, diagnosis of issues, determine parts availability. Collect several possible parts that could cause symptoms then drive to customer location, Thankyou! For all you have done over the years..You all are very organized very trustworthy very productive.. Flexible hours care for you and excellent co workers as well as management! Initially due to staffing the workload was constant and fast paced.  If you were not available for a call management was right there to see why.  Later after staffing increased the pressure went down and eased. Dell was very fast paced and stressful. It was in the front of the pack for online sales. My job was the small business online marketing and content manager. Great if you're single. Not great if you have a family you want to see before dark. It was a good place to work in but they don't substantiate good talent after investing resources in these talents. Overall it was a good company and I  would work for them again The QA manual testing and automation with Agile process was interesting.The software department in my group recently do away with QA folks and retain only devops. Great people and work environment, Challenging opportunities. People are willing to jump in and get any job done. Lots of opportunity to move around in the company, Great team, energy and amazing opportunities at Dell in general. Very exciting fast paced work location. It is a very dynamic energetic group with tons of opportunity. I learned a lot working at EMC. It is a relaxed environment. No one really bothers you as long as you're getting your work done. Co- workers are great. i love how everything is communicated via work email. keeps you in the loop. Dell was very fast paced and stressful.  It was in the front of the pack for online sales.  My job was the small business online marketing and content manager.  Great if you're single.  Not great if you have a family you want to see before dark. Trouble shot problems and changed Dell hardware on laptops and desktops in customers’ homes using technical skills and excellent customer service. Worked at my own pace. It's been awhile since I was there, but what sticks with me about my experience on the manufacturing side of the business is the vast differences in culture and methodology between different business units. I was told openly by leadership that there was no growth and they do not give raises. Leadership in office was high strung and over worked, my manager wasn't even in the same state as me which was a problem when trying resolve issues at work. Tj maxx was a fun place to work  but it as extremly ahrd harder than anyon thinks. People aren't very nice when it comes to their money.  had to take care of 3 at 5 different depaments. Clean pick up and organize the fitting room, do cashier at the same time. The pay wasn't very good nether my co workers are the best and the management needed some work call center jobs do not offer a lot of advancement opportunity. I am looking for a career that I can grow in as well as add my personal contributions. Good for starting your career.  Operations are yet to be stream lined after DELL-EMC merger.  Helps for people living in off-shore locations if you are in IT. when orders where sent out  to pickers and packers we had to make sure oreders where correct and properly pulled and love working with fast paced people and a safe inviroment It has been too many years since I left Dell to write an accurate review.  It certainly was a great career for me from 1992 - 2010. When I started at Dell they were selling just under a Billion in revenue per year.  By the end of my career at Dell they were a $60B company.  Truly a great American success story. Enjoyed working with many professionals at Dell.  The camaraderie and teamwork was great.  Management was good. However, management did not offer clear paths for advancement. Dell EMC is a good place to work.  Company is large and going through a few changes due to large acquisition of EMC, but that also provides opportunity for career advancement or change This company hires primarily Indian men to work here. There are entire department and floors consisting of only Indian people. I constantly saw groups of new employees in the lobby waiting to start their first day at Dell and they were ALL Indian men. Some Indian women but primarily men. This is racial imbalance beyond comprehension. Answered calls from customers to help find their order and any billing issue that may have happened. Great co-workers and management. Only quit due to job no longer being available. You have to work hard to get exposure.    Fine place to be an employee ....  Id go beck if possible .    Everyone can succeed if they work hard.     Yep Dell was well on its way to changing their culture for the better. They were learning the value of teaming vs every man/woman for him/herself. They were pushing employees to innovate, test and keep testing new ideas. It was rocking. Then they acquired the ultra-conservative, ultra-CYA, and failing EMC and took a big step backwards in many, not all, but many ways. Dell decided to get intop the Healthcare business, but I don't believe they understood it and eventually they sold our division and got back out of it.  I never thought they had a grasp of this industry. Great company to work for......very conservative values and work ethic.  rewards for a job well done.  Some insecurity with Dell still making changes stemming from the 9/2016 purchase of EMC. My job at Dell was very rewarding.  There was so much to learn and this is a company that was well run.  I attended meetings, took minutes of meetings, planned meetings and provided assistance to two supervisors.  Unfortunately, the area I worked in was disbanded and I was laid off.  I was told that I could reapply in 30 days.  I made many friends at Dell. Dell is a mixture of stressful but rewarding.  The atmosphere there can be a little bit competitive, depending on what segment you're working in.  Sales is cut-throat, but that's to be expected.  Overall, a great experience. Great technology company with limited ability to climb up the corporate ladder.  Loved evangelizing and selling the solutions, great territory and customers.  The great part is you are your own P&L center and you manage your own success.   Comes at a price though, success equates to a larger quota and smaller territory. Great place to work.  Location opportunities, vacation etc all great.  Long hours if you have the appitite for that.  Lots of large scale projects, time etc Dell as a whole is a fantastic company to work for. I would recommend it to anyone. My organization, not so much. The role I was in, as inside sales, is like constantly being stuck between two different places. The job as it stands is not really a sales role but you are compensated as though it is. That's not to say you cannot make money it's just largely a matter of right place right time as apposed to any real sales skills. You'll see people in higher ranks than you despite you having more experience, lack of consistency in management and desires. One team has a good manager and they do well while another is left in the dust all because the person they put in charge isn't up to the task. Difficult to move up or out without a bit of luck. I'm all for working hard to get where you want to go but hard work doesn't do much in this specific org. I would love to continue working for Dell in literally any other role. Dell is a superb company, and especially since they've gone private, the drive to do everything possible for Dell's customers has been the almost sole focus of the organization. This customer-first attitude has helped change Dell to be a superb workplace. Nothing to say. The company new how to run an account based DC.They didn't know anything about a client based DC. They keep trying to run it as if the clients didn't have any say. Dell just acquired EMC, 1 year later they sold the software divisions which i supported the hardware and software design, installations and configuration of the Documentum suite of products. Tj maxx was a fun place to work  but it as extremly ahrd harder than anyon thinks. People aren't very nice when it comes to their money.  had to take care of 3 at 5 different depaments. Clean pick up and organize the fitting room, do cashier at the same time. The pay wasn't very good nether my co workers are the best and the management needed some work I enjoyed my time as a cook at Dell/EMC. I acquired many  new skills while working with different chefs. I also enjoyed interacting with my fellow coworkers and the many different staff members throughout Dell/EMC. Great place to work. Multiple acquisitions and integrations have made simple tasks seem harder than it needed to be, driving inefficiencies in the systems and daily chores.  I would still recommend Dell as a great place to work though. Answering inbound calls for users having backup/storage issues. Learned way more then I ever did in school by being on the front lines with support. Alot of very smart people all around you. Great way to advance knowledge very fast. I did a temp job there in recruiting from March 2016 to August 2016 and I really enjoyed the experience. I worked with a great bunch of UR people and would go back in a second Benefits are ok, standard for the corporate world. Growth is close to impossible. Jobs security very low, hence the morale low too. Decent work life balance though. Most managers are not concerned about leadership or managing a function.They are only interested in advancing their own careers. Most have no business being managers. It was a good place to work. Room for advancement.  Educational opportunities offered.  The pay could have been better.  Bonuses were offered.  A lot of our recourses were not within the state which was frustrating.  IT was in India.  Our computers were not compatible with Dells. All good no complaints, solid leadership and high expectations on flawless execution.  CEO is very bright, very involved and very interested in all aspects. As long as you network during your time at Dell/EMC, you can advance BUT many managers do not create advancement paths for their direct reports. I was given latitude in my roles to do what I felt was best for the company, so it is a good place to work in that regard. Dell trained you to perform your job pretty efficiently and then did their best to help you to constantly improve and move up in the company, they are pretty supportive of their employees I learned an extreme amount regarding Claims Systems and the claims processing business unit. I was involved in the day to day operations uin claims services as well as the details behind the IT systems that support it Dell services, was a fast paced call center where the work you put in was never appreciated. you never get raises and there is no career advancement opportunities. Teams cannot see the North, as the company constantly (6 in 6 months changes structure, management organization, etc.). To many employees restructure and instability. In a sales role, the number is the key driver for success. Though I understand this is the main responsibility for a sales professional, there needs to be some trade-off for establishing deep roots in a sales territory to help cultivate large and sustainable opportunities for greater revenue. When the drive to get to the quarterly (or half) sales quota is the only priority, sales people tend to cut corners to help get the job done. In a lot of cases, this is ultimately doing a disservice to the customer. The nature of the sales role requires the 'always on' mentality. This can be extremely hard on a person that has a family or any semblance of a life outside of work. Travel has increased for me personally, so I am ultimately seeing less and less of my family. Definitely getting the burnt out feeling. Vision of management seems to be very narrow minded. Most upper level managers are solely interested in the numbers. Most mid-level managers will make tactical decisions to help get to the number, but jeopardize the long term strategic plan within an account. Came to this company from a job that  I loved because it was an opportunity to gain a lot of knowledge into he IT world from a true technology company  that was on the rise at the time High volume work.  Remote opportunities helpful for work/life balance.  Career path isn't clear.  Salary and bonus fair and balanced.  Paid time off commensurate with time at Dell. I enjoyed the challenges and liked working for healthcare. I was treated fairly by all and we worked hard for the customer. I also had a flexible work schedule and was able to take time off for family if needed A typical day Included packaging and shipping of computer devices.  I really did not learn anything new.  The workplace culture was diverse.  There was not really a part that I considered being difficult.  The most enjoyable part was the job was easy going along with the people. Fast paced work environment. Company provides excellent benefits for their employees and family. Good work environment and work culture. Provide balanced work life culture. It was ok for a plant job. Very fast paced and exciting at times, but there is very little work life balance at this company. It is very difficult to advance from within as well. Poor management of labor and overtime. Tj maxx was a fun place to work  but it as extremly ahrd harder than anyon thinks. People aren't very nice when it comes to their money.  had to take care of 3 at 5 different depaments. Clean pick up and organize the fitting room, do cashier at the same time. The pay wasn't very good nether my co workers are the best and the management needed some work Executives don't stick with priorities, communication between functional areas is very poor, employees required to work from home leads to non-existent corporate culture Dell/EMC is the most interesting job for those who want to interact with data storage machines.  Your coworkers are awesome and helpful.  However, after the recent merger, downsizing has been happening, stressing many people out.  Definitely apply, because having worked at Dell looks fantastic on a resume.  Understand that permanence is not guaranteed. Very inclusive company, all are welcomeCareer Advancement are what you make of itThe culture is fast paced but relaxed. Dell is very supportive of community involvement and stewardship.Hardest part of the job is finding the right manager to work for and work life balance depending on the role and team. Most of the job perks are tailored to an older generation (eg. family healthcare, college planning for children, etc.). Add more flexible work options or educational benefits to capture the millennial crowd. A budget for an occasional happy hour or the ability to work from home can go a long way towards making younger employees feel connected to the company. Dell was an excellent place to work. I was there thru a temp service. I would not have left if husband did relocate. Never minded working long hours or going to work everyday. Corporate benefits are good. Culture is good. But in such a huge place - every team is different.Overall positive experience - if you have an opportunity to work there - go for it. Dell is hard to beat when it comes to work/life balance.  It is not uncommon for people to move throughout the company until they find the perfect fit The main culture of the company is to quality product above everything else. The upper management drives innovation and quality at every all hands meeting we have. Work 8 hours a day.  Received federal holidays off.  Management could use some improvement.  Overall a relaxed environment.  Could use some more support from management to complete tasks. Enjoyed being able to work from home. A lot of hours and stayed very busy all the time. I liked that Dell supported the community so much. Chance to advance your career. My team was very focused and relentless in getting our goal and objective achieved. The company took very good care of us and always encouraged us to achieve greater heights by rewarding us when we achieve any milestone. The company had good medical insurance coverage and other benefits which were very good. By and Large it was a Good company and the atmosphere at work was  conducive and fun to work in. I'm done being emotionally invested in a company that does not care who I am or why I'm there. I went through two buyouts, but this last buyout by Dell was by far the worst one. Dell cultivates a winning culture where everyone works together to help the customer, the company, and each individual accomplish their respective goals. Since this was my first job out of school, I learned a lot about job structure.  I was taught a ton about Excel, how to work with a group, time crunches, and how to conduct meetings. The day started off with taking multiple calls while trying to deal with other calls from the past week and getting everyone taken care.I learned many social skills and how to work in a focused manner. Every one there was willing to help you if you asked for it. The hardest part of the job was the sheer amount of worked you were required to do, while the most enjoyable part was getting to close a case and get your case load down. There are a lot of hardworking and smart people at Dell EMC.  The work/life balance is pretty reasonable. Software teams use Extreme Programming methodologies. Dell was one of the best workplaces i've had a chance to work.  The challenges never stop and your day goes by due to the fast pace and constant moving parts.  Everyone there is open and willing to teach and help you get to the next level.  It's more than just a workplace its like being with close relatives. Overall my time with Dell was good and I advanced through the ranks. My performance was in the top 5 percent every month. I left Dell because I retired. I really like the work and life balance in this company. Very flexible. You could work from home. Also it gives you many opportunities to work in different functions. Workload is much more than anticipated which leaves no time for proper training and proper designs before implementations.  The pace at which we do implementations are too fast and cause more do overs.Work type is very challenging and good technologies are available.  Projects and tasks are usually interesting and challenging and a typical work day goes at a quick pace.  Staff is usually helpful and always ready to land a hand. Tj maxx was a fun place to work  but it as extremly ahrd harder than anyon thinks. People aren't very nice when it comes to their money.  had to take care of 3 at 5 different depaments. Clean pick up and organize the fitting room, do cashier at the same time. The pay wasn't very good nether my co workers are the best and the management needed some work •	Orchestrated and managed the day to day revenue cycle functions for 34 ambulatory care centers and multiple in-hospital service divisions. •	Developed an on-site department that directly trained, monitored, and controlled work processed in Chennai, India and a call center in Bowling Green, Kentucky. Work functions included accounts receivable, in-patient registration, coding, charge entry, payment, credit balance, collection placement and denial posting.      •	Worked extensively with all levels of management and practitioners to maintain an effective workflow process and profitable outcome of that process. There are many software products competing to get attention from a few hardware products. Since most times the software is given as part of hardware sales. Your products relation with the hardware sales guys makes a huge difference.Besides at any point, they may acquire a competing company and then release that product also into the market.Its a nice place if not for the lack of understanding of the market needs and handling of these requirements. I enjoyed my co-workers.  Laid back environment.  The work life balance was not the best - the overtime hours required made it hard.  The Managers were very supportive though. The company doesn't focus on employee development they just want you to get the job done anyway you can. Manage is too top heavy and don't understand how to manage or develop employees to help get the best out of them. I like the flexible work schedule and employees can work from home occasionally.  People are generally nice and treat each other with respect.  Dell doesn't invest in R&D. A typical day at work goes with meetings and helping Application teams and coordinating with Project Managers. Challenging and innovative work opportunities are tremendous. Company is too big to be agile and react to competition of smaller, more agile players in the space.  Overall great work/life benefits.  As an employee, you are just a number at this point. Friendly work environment. Worked from home for 5 years. My typical day has couple of meetings with global stakeholders and managing data analytics for a services team Depending on the department I was in at the time, my typical day included inbound & outbound calls with customers.  I also reported quota attainment, sales forecasts & call information.  I would also attend sales meetings with managers, team & directors. Dell is a great company to work for.  The management helps you build your career, while meeting and exceeding your goals.  The teams you work with are encouraging and helpful in advancing your knowledge and career. Really isn't a bad place to work. My team is fairly small. Not a lot of room to grow in my area without but certainly is if you branch out. Great benefits and pay. My time spent at Dell was working on an internal help desk. We only supported Dell employees, while they were at work. It was an entry level IT role, but I enjoyed it. Dell is a very technology driven company that strives for high customer service and product quality. They treat their employees very well. Very diverse culture. EMC was the cream of the crop corporation to work for and be apart of. EMC had the best team of workers and everyone was in it together and helped each other succeed. The best benefits of any company I ever heard of and really cared about their employees. Great pay during the time I worked there also. Dell recently acquired EMC.  While some transitional changes are disruptive, mgt worked hard to minimize.  EMC sales leadership continues to be strong and bringing in additional Dell technology leadership will create a major enterprise player.  Like the opportunities this creates for ambitious sales professionals. Working at Dell is great to really learn and experience multi tasking but its a call center and still has the culture of call center life. Numbers are put before employees. This is a great place to start right out of college. You have the ability to learn about the technical side as well as hone your sales experience.  It's a fun and fast paced environment. Over the last 14 years I've had the opportunity to work in several different areas within the different sales segment. Each of them allowing me to gain valuable experience which has always given me a competitive edge. Serving as Senior Solutions Architect on a global account with functional responsibilities including Professional Services, Problem Resolution, Project Management, and Enterprise Solutions Architecture.•	Provide constant communication to team, team sponsors and customer(s) to pro-actively reduce problem areas and issues related to the storage area.•	Managed the delivery of multiple complex simultaneous projects from design through release.•	Provide expert level technical guidance and direction to peers, peer groups, and business partners in all areas of Business Intelligence Great culture with high level work ethic, ethical. Like the zero tolerance harassment policy. Comp was fair and work life balance was encouraged. Strategy was confusing. Tj maxx was a fun place to work  but it as extremly ahrd harder than anyon thinks. People aren't very nice when it comes to their money.  had to take care of 3 at 5 different depaments. Clean pick up and organize the fitting room, do cashier at the same time. The pay wasn't very good nether my co workers are the best and the management needed some work Overall - I met some great folks at Dell/NTT/EMC/Secureworks and value those relationships today.  We worked hard, made time to 'do some good' in our local/global community and had fun along the way.Personal time management and workload balancing are key to success.  Dell provides the flexibility to manage professional and personal life - it's up to the individual to define what that success looks like for them and work with leadership and their team to make it happen. I worked on many project teams .  I had 5 consecutive 6 month contracts. The management was always helpful and willing to train new things.There was always recognition programs for employees. I did not work for Dell, I worked on/with Dell computers. I have installed apps on Dell computers. I have configured and installed Dell computers, both desktop units and laptops. The job is good, the management is good the benefits are amazing but the pay is low for 2017.  When EMC came to Utah in 2011 they paid very well at the time but now 6 years later they've fallen behind and the raises are a joke (if you get one), when one complains about pay they say that you should have negotiated a higher salary when you got hired, the only way to get a good raise it to leave to another company and then try to get re-hired and if you do manage to get re-hired you will be making quite a bit more than you were before you left. Great place to work! Fantastic team members and culture is very fun.If I had a chance, I would have retired from there. There are many leaders that you will find in this company that you would love to follow and work for. A typical work day would be to come in 30 minutes before the start of shift to count parts (dims, ram and processors which are considered high dollar parts). Also keeping a very detailed inventory. Very unfortunate work environment and poor choices for people in leadership roles with poor communication.I expected a lot more from a top global company. Working for this company you will learn about how to deal with all types of business situations. There is a diverse workforce so you are exposed to different cultures, people and ways of doing things. The culture has changed dramatically.  Doing what is right is not stressed rather doing what suits the company is.Customer service is no longer a critical part of the operating culture. Answered calls from customers related to problems with computer hardware on home and business systems. Led customers through problem solving to determine what was causing the failure. Sent out replacement parts for onsite repairs. Very good company to work, great environment, dynamic and there is  a lot of room for career advancement, especially if you are starting your career, this is the place! Company had just acquired another company therefore everything was in flux. They were firing people left and right, therefore moral was low and job security was uncertain. Working for this company you will learn about how to deal with all types of business situations. There is a diverse workforce so you are exposed to different cultures, people and ways of doing things. - Great bonding team- Co-workers were great to work with and were always willing to lend a hand- Team members always tended to share information  and skills- Dell going private up-ended the culture for awhile Started Work at 8:00 a m got off at 5:00 p m had a 1 hr for lunch. The job was very different from what I had work before. The work culture was ok but if you need help the others where to busy to help that was frustrating. Good work/life Balance. Dell is a big company. Lots of moving parts to get used to. Overall is a good place to work once you learn to navigate the internal infrastructure. I loved working there and hated leaving.  If you enjoy getting on a plane every Monday and returning on Friday DELL/EMC might be for you.I did enjoy working for them but it's very busy.  Getting laid off was actually a relief. I can't do a review for this company. I never worked for Dell International Services. I worked for Dell Perot Systems. This is frustrating that I'm being forced to do a survey on a company I never worked for! Note that different organizations are managed differently.Had a (first time) manager who came from external consulting, where Dell prefers to hire leadership from, who felt the best way to get the most out of his employees was to inject stress into the workplace.  Everyone on the team was in constant threat about getting fired with no support from the manager.  All escalations to his manager on up to VP were completely unproductive, as these leaders did not want to appear to not support their direct report.  On the positive, the higher you go up the hierarchy, the more inspirational the leaders are.  So that's good. Nice place but rapidly changing culture with the Dell take over.  Very little opportunity for advancement under the current management structure.  Downward salary pressure Tj maxx was a fun place to work  but it as extremly ahrd harder than anyon thinks. People aren't very nice when it comes to their money.  had to take care of 3 at 5 different depaments. Clean pick up and organize the fitting room, do cashier at the same time. The pay wasn't very good nether my co workers are the best and the management needed some work Easy to get along with co-works. Most the people I have worked with are here to make Dell a better company and will help out when their skill set is required. I enjoyed coming to work and accomplishing what I needed to get done. I interacted with many co-workers and vendors throughout my day. The Hopkinton facilities had everything you needed. I rarely had to leave to get my errands done. They had multiple gyms, a pool, dry cleaning, ATM/deposit locations and onsite vendors would also show up once a month to get things done like insurance and cell phone plans. Dell life depends on which manager you have, in the end my manager was a incompetent boob... other managers are good... I choose to leave for a different career path I worked at EMC, not Dell.Work was interesting, learned new things all the time.Friendly work environmentManagement team was professional and treated employees fairlyClear career pathsTraining opportunities Like most technology companies adjusting to being past their prime a bit, Dell tries and buys a lot of things to be relevant. They provide a good product, but they're in a tough industry. Being an employee is good, but I did question the management's strategies at times, and often you have to navigate the ant-hills of competitive directors to try and get things done. I stayed in the same role in a stressful position too long and burned out. Time to take my knowledge, skills and passions and do something else. I'd rather stay at Dell actually but the PC gig is getting kind of old. Enjoy the job environment , my boss, my co-workers, and generally the interactions are positive and edifying as an employee. That said, they are still lacking in development of training, especially soft, interpersonal skills, and aren't really paying persons with bilingual skills at the level they probably should be. The process engineering department is a good place to grow at your own pace; the other engineers were easy to get along with, helpful, and good mentors over all, but I had to go out of my way to find problems to solve and most of the nominal responsibilities had nothing to do with engineering. I know that the internship program has been revamped since I worked at EMC (Now Dell), so maybe some of the kinks have been worked out. The environment isn't overly structured, but there's definitely a corporate culture that I personally didn't mesh with. One more thing: don't be late, that was a lesson I learned the hard way. poor managementaverage salary compensation lack of developmentnon friendly working environment good benefitsexpensive medical insurancemedical, dental, vision and life insurance Good people working together to solve real business challenges in a fast-paced upbeat environment.  There is a lot of freedom provided each field sales team member to affect their business.The Dell EMC merger has created a bit of uncertainty.  Some roles were aggressively reduced and re-tooled, which did not benefit the company or its customers.Very good benefits package.Sales training is good, but technical training could use some work. Great work, great people the work was challenging and  high pace. Everyone was committed to getting the job done on the second shift Team. This was a great Team of people. Fast Paced company.  Workplace culture is good.  People are friendly and nice to work with. Nice gym and facilities to use to de-stress. Good work life balanced. dell acquisition caused brain drain, talent loss - despite upper management euphoria, emc-ers morale tanked.no vision/hope for future in sight - pity to see a giant becoming another has-been. Awesome management and best Work/Life Balance. You get to work with smart people and latest technology. Dell is one of the best employers I worked in my life. I highly recommend the CorpIT at Dell. regular day at work very enjoyable. very diverse  great customer service good benefits, good training, good people.Work from home. Great cross-functional teams to work with. Developed analytics model in SQL to create customized development path for sales managers in North America by quantifying strengths and weaknesses of managers, resulting in saving 1100 manhours (60% savings).• Interviewed over 25 sales managers and executives to understand the activities of sales managers and map performance/activities into quantitative metrics.• Presented the result/recommendation to VP of Sales, Corporate strategy, HR, and Training. Based on the project output the scope was expanded to a global level for additional sales roles. Dell is a great place to work, lots of opportunities and amazing people. As a L&D professional at Dell the people make the company culture. The workplace is flexible with the ability to work from home.  The most enjoyable part is the challenging work. The Dell culture is a very fast paced environment that is also very matrixed and constantly going through reorganization - all of which can make it challenging to navigate Dell and get ramped up fast. Initially I felt like a mouse trapped in a maze, attempting to navigate myself around to find that 'cheese' or answer to your simple question and getting the answer to your question can take longer than you expect. Because of this, ramping up took longer than I anticipated but once I got the feel of the culture, systems and processes, then I felt more equipped to thrive. To succeed at Dell, you have to be tenacious in finding and getting what you need to get your job done. You can the same. Basically, here's why I chose Dell. You may or may not have the same.- I get my 'E' for energy by working and being around a large breath and depth of people and enjoy the diversity in people, work life, and career opportunities so a large company like Dell fits my criteria. - Large companies like Dell also have more of their systems and processes making completing my work more efficient- Opportunity for career growth and advancement while still staying with the same company processes/systems/similar culture- Comparable comp package for what I was looking for-  Good work/life balance - this depended on which department I worked in, the manager, and role. Managers I've worked for weren't micro managers and rather was more concerned over results vs time on the clock. There were opportunities to work from home.- Relationships: Like all things, you get what you put your time into. Dell was a great company to work for. They really allowed you to put your family first. There is great support in helping in advancement of your career as well. Although the work can sometimes be stressful, the rather flexible work hours makes it easier to balance work/life.Being a large employer, there are opportunities to move within the company. "
                },
"encodingType":"UTF8"
}
