{
"document":{
"type":"PLAIN_TEXT",
"language": "EN",
"content":"fun but really competitive place many kids at the school wanted to sell things.sometimes we would not have enouph stuff to sales so you would t not get that much money Worked at Ebay in a seasonal position through Adecco temp agency for the holidays and while taking a 6 mos break from school. I enjoyed working there. I enjoyed being physically active instead of being sedentary all the time. It was very different from what I was use to doing. Great place to get your foot in the door of eCommerce, customer service, and entrepreneurship. No more yard sales picking through rubbish, try a professional look on ebay.com eBay is a great company to work for. They listen to what you need and make changes immediately. Managers are great in most departments. If you can handle sitting at  a computer all day every day with controlled breaks and lunches and a bit of micromanaging on most teams, it's a pretty chill job with suitable pay! eBay is a fantastic place to work.  people and culture are excellent, however with slowing growth overall, and limited options to reignite growth rates, quarterly results will rely more and more on cost cutting and increased marketing spend. It was really fun working with the management as they gave me a space to showcase my skills. The most enjoable part was Team lunches where we used to have immense fun within the team. eBay is one of the best companies to work for, decent pay, great benefits, employee focused, decent schedules, great culture, everyone willing to help you succeed. The company really takes care of you interms of financial, health, and fringe benefits.  The people I met there are generally very friendly and helpful. Work and Life Balance with Brutal Efficiency. The Company promotes innovative culture while continue to improve daily operation. Overall a good company to work for. Had fun working at thismjob the hours was great and the pay was good. Every woker was excited to come to work, its a very productive job. I will recommand everybody i know to work at this job, you get all the benefits you need. eBay has a fun culture. They are also very diverse. They like to participate in a lot of very diverse activities. They claim to champion people being brave but the company moves too quickly to really do this. I do not work at eBay.  I work for myself and own an ebay store.  Ebay is only the advertising mediam.  I have done ok with them.  But its not enough to live on. Amazing team to work with. Very good environment. Learned new products. Sometimes I felt I am going away from own expertise but at the same time they give enough time to learn a new skill. no pressure. eBay was a great place to work as a consultant and I was nicely engaged.  Manager knew what she was doing and what she needed from me.  Whole team was enthusiastic. It was a good place to work. Good money and easy work but there was no upward growth. Good starter job, but consider it a long term job as opposed to a career. it is like a high school, everyone gossips, is loud and annoying, There are clicks and you are judged the second you walk in. You are expected to do more than your job title on a daily bases with no compensation. Supervisors are children that got picked to be in that position as favorites by their peers. I  thought eBay is horribly hard on the people selling on their site.  There were many a time when a customer was misrepresenting themselves and I still had to pay for their mistake or attempt at fraud.  There are a lot of people who do fraud on eBay and eBay chooses to put blinders on because they are not the ones that are having to pay for it.  I was able to do fairly well financially on eBay but it is not the way I would choose to make a living.  Being a seller on the site is a constant fear of what the last buyer's feedback is going to be. Busy work place during peak season and all the hours you care to work each week. Caring management always willing to work with you if you have problems at home Alternate workforce is allowed to work 1 year before needed to leave for a minimum of 6 months.  Very autonomous management style and family/friendly atmosphere. Self employer, business use to be good ,but now its not. I'm seller 9 years. After so many years looking for better placeI don't see better future if I'll continue work in this company. the most enjoyable part of working here is being able to collaborate and work with multiple teams and always having the opportunity to learn something new. fun but really competitive place many kids at the school wanted to sell things.sometimes we would not have enouph stuff to sales so you would t not get that much money An overall excellent experience. Honestly, it's one of those dream-come-true kinda places that you could settle down at. I'm very pleased to have been afforded the opportunity to work for such a great team. Unfortunately, it was a little too nice. I felt like one of those places you could get lulled into a (non false) sense of comfort. I eventually quit because I was afraid I would wake up after accidentally working there for 10 years. This was one of the best jobs I had, people are friendly, team members work together as a cohesive unit. management is open minded, the business is understanding of the technical challenges Ranked as one of Austin's Top 10 workplaces for a reason! Employee culture is unlike any other company. Great environment, great managers, great policies. But like most companies, behind in cost of living adjustments, and it can be felt when salary. I loved working as a eBay Coordinator for the small office job I had.   Ebay is a great company they make buyers and sellers alike feel confident and safe about any transaction that takes place on their website. I loved working at Best Buy and selling electronics to a vast community of customers. I learned all about new technology and the cool new features that come along with them. My coworkers were great and loved working with all of them. The management was great as well and they were very helpful with things. The challenging part was becoming a subject matter expert in such short time as technology rapidly cames in & out of this type of business as it is ever advancing. The most enjoyable part of the job was sales and seeing the customers reaction when they learned something new. If given the opportunity, I would strongly suggest working at eBay. I have nothing but great things to say about eBay. Their culture is very unique, unlike any other place I have worked at before. #fillyourcartwithcolor! I enjoyed working at Ebay because it gave me the chance to be home with my children when they were small but make money too.It is very flexible selling on ebay. ebay is a get place to get what you want in a couple of days.if you you need to pay some bills are try to get a car in 2 mouths then this is the job for you My ebay store just consisted of a few items and the ease of use is astounding, this job takes a very reasonable amount of time and energy to complete and is well worth it Employees seem to constantly be nervous and worried that they would get laid off at any given moment.  Many people were cut short on their hours, even if only an hour or two of starting a shift, or called just minutes before their shift to be told not to come in.  There was no feeling of job security or schedule consistency to fulfill the 40 hours. Ebay sucks.  They will charge insert fees if you go over your selling limits.  My account got hacked and ebay was absolutely no help at all.  My account was destroyed by someone else and I was unable to use ebay anymore. I was hired to work remotely for eBay.  I was shocked at the ages and lack of knowledge on basic info. the trainer Zachary whos previous job was manager at a chik Fil a.  He went on and on about his hair length and than we were asked who are favorite super hero was.  This was the level of maturity throughout training. Favorite disc jockey where to go skateboarding. Things normal grown ups don't think about.  I quit on the 2nd day realized I couldn't tolerate anymore.  My guess is eBay is too hip for me.They also dump a ton of equipment off and oh yes you set everything up yourself.  It's heavy the equipment was also defective. Productive and fun place to work.  It was kind of a fast paced job that would keep you busy.  I worked there through the Christmas season. The people I worked with were very friendly. There is no requirement to sell on eBay, just a registration. It is the perfect place to start growing a small business. If you have something with value, then it can be sold on eBay. Unlike Amazon, you can sell individual items without having to worry about ordering products to sell in bulk. Ebay is a good place to work for had many good benefits and the people there were friendly. They like for you to be cross trained which i was to help where needed I worked with a great manager, so it was a very nice experience. I had the opportunity to learn a lot while on the job. Has the downsides of any large company, so it can be difficult to track down architectural knowledge, and the onboarding process can be dreary. This was a amazing place to work fast pace not to hard loved packing and my supervisors was a hard worker made sure his team did a good job not to hard on us I did not work at ebay, I sold items for various persons at different times. I enjoy ebay and have no problem with them. I believe they are a fair company. Selling on eBay is strictly as much or as little as you want to on a personal level. I sold items for myself and friends strictly for extra cash for my family and myself. Ebay is a good place to make some money while you are at home.Management are very professional and are not bothering people all day long like in some places.  In my case, I used to have other activities out of home and the amount of  money depends on  how serious you are in this kind of business. I learn to buy clothes and articles in a good price and make profit of it; I learn to write the perfect descriptions of products, and  find the best way to sell the products promptly. The hardest part of the job is when you do not sell enough or you do not know exactly what to offer to sell more. And the most enjoyable part of the job  is when you get enough money for your expenses and some to save.  I will keep doing this at home but I want a P/T job out of the house to keep an active mind  and I like to be with people. I am a people person and I like to help people in need too. Thank you.MA fun but really competitive place many kids at the school wanted to sell things.sometimes we would not have enouph stuff to sales so you would t not get that much money Ebay proved to be a great learning experience . There's a nice work life balance. You get the opportunity to participate in numerous events whether it be learning /mentorship sessions, hackathons or recreation. Productive and helpful to everyone. The salary is on time and this kind of work is big help to those people who stay in their house. The employer is good also very good company and good support team in facebook and on the phone, good deal, very modern, I work for 1.5 years in it as a top rated seller and I like my work. Easy Flexible work with great staff and floor leaders. Pay was good and if something came up I could work and different shift and I wouldn't lose any hours. eBay as a company can be hard to pin down in a singular sentence. They really appear to care about their employees and invest heavily in them. The benefits they offer are excellent and entry level positions are paid a living wage with reasonable opportunity for advancement. The call dynamics are not script based, so you are often having to do a large amount of research in a short amount of time in order to satisfy both the customer's demands and the expectations of management. Management is personable, but heavily goal driven, and it can be stressful for those not accustomed to the atmosphere to meet the metrics laid out for them. If you have experience in a call center, or tend to thrive in semi-competitive offices, eBay may suit your style. eBay is a great website to work at home. I personal never had a bad experience with any of my buyers or had a problem with paying the low fees. As long as you post as a fair price, its good as sold. eBay seemed like a nice place to work. I was a remote writer for them, so I didn't really get to know the company internally. If I had to say something about the company, it would be that I have always liked eBay. I would not hesitate to work for them again. Whenever I have things I need gone eBay is the go to for me.  A great way to have a foothold on what value a product has and a good way to analyze how to run a store. I am a seller not an employee. I randomly sell miscellaneous items on eBay. My seller rating is Advanced Seller. I have been selling for approximately 15 years. The majority of eBay's 'employees' are long-term contractors. They are treated like regular full-time workers in a lot of everyday ways (free breakfast at cafeteria; they can attend 'all-company' meetings), but the best perks of being an eBay employee (generous sabbatical; health insurance; free gym; lavish Christmas party; reimbursement for commuting on public transit; the list goes on...) are reserved for full-time employees.And the path to going from a contractor to a full-time employee is unclear. And long-term doubt about career progression is not great!In my experience, the work environment was very friendly and professional, and the work/life balance was reasonable for a tech company. A lot of phone calls back to back but good advancement during peak season. Managers willing to work with you to advance and set goals with you. Just a normal call center Laid back work environment with good hands on training, however $9.00 dollars an hour at 30-35 hours a week isn't enough for me to live. I also don't think that company exists anymore I think its Radial now eBay is an extraordinary company in the benefits that they provide and the culture that it exudes. However, I do feel underpaid for the line of work I'm in, with little room to climb the latter. Very easy to get pegged into a whole here. Managed very well from the very top down. All of the execs and leaders (middle and upper management) are very straightforward and let you know why certain decisions are being made or certain policies are being implemented, etc. I enjoyed everyone that I worked with at the company. My only complaint would be related to the shift times available for reps. When I started there I had to work from 3:30 PM to Midnight Tue - Sat and by the time I left I was working from 6:45 AM to 3:15 PM Sun-Thu. Was able to produce extra income for my family while staying home with my children.  Ebay gives many seminars, etc for learning opportunities.  Very good market. eBay is a great place to work. Advancement is very possible and the company is actually fun to work for. Cutting edge technology and opportunities abound at eBay. Mandatory overtime all the time especially to peak season no raises for them. I’ve been there for years no employees to come and get hired on and get paid very well management sucks work life balance is terrible by the time we get home you’re too tired to deal with household stuff I would not recommend this job for anybody that is trying to grow this is definitely a job just to get money The culture here is amazing. Everyone is really nice and friendly and When I needed help people were there to help with every aspect of Business intelligence and QA. Lots of autonomy. Lots of work gets done with no micromanagement. Strong Android and QA team. Flexible with schedule, work from home when needed. Early morning and evening meeting due to distributed nature of teams in Europe and Asia Pacific. Overall, none yet. The hardest part is trying to elevate our systems and standards to that which we elevate our clients to. Some expect that we would be best-in-class on all things Human Capital, but that is tough and something we are working on. fun but really competitive place many kids at the school wanted to sell things.sometimes we would not have enouph stuff to sales so you would t not get that much money eBay is a great side business. I am able to make a decent income and enjoy researching items, listing items, on time shipment, with excellent customer service. Management was hard on the agents, and some agents matched what management wanted but were not supportive of customers. Many people have been long time agents and were not promoted. I loved my time at eBay! I worked under a few different managers and they were all excellent people. Some were better managers than others, but overall they did not change the way I felt about the company and work culture. My only complaint would be that I was a contract worker in Recruiting and I wish that they would value those workers more and convert contracts like they say they do. I had to leave because there was no conversion opportunities after a year. Very great boss and co workers. Fast paced work enviorment. Shipping items. Packaging items correctly.  Customer service, inventory and price adjusting. I typical work day would be like providing customers with effective and quality customer service. This means understanding Ebay and all it has to offer. This is my own business. I do not work for Ebay.Inc. I buy and sell items on Ebay. For example, I shop at thrift stores and antique stores and look for items I can sell for a profit. This is a Great place to work, you are usually of by yourself doing your own thing, aloud to listen to music, and get a lot of overtime during peak seasons. I believe eBay had a great work culture and positive leadership mentors. I think that the future in online purchases will go far with this company. There are new ideas and policies that will take eBay far in it's industry. possible to advance but it's important to keep up with new technologies as they come into the industry otherwise you get left behind. best part is being able to work with highly knowledgeable individuals and build relationships and friendships along the way.  unless you are part of a team that works in shifts, the workday hours can be very long for non-hourly people. excellent work-life balance and team oriented, giving the staff autonomy to make decisions within an inviting and open environment to ask questions and request support I had my own eBay website, and posted for myself.  I had a perfect customer satisfaction.  five stars.  I never worked for eBay corporation. It is the best job and most rewarding job ever. Bilingual goes a long way . nut because they were in such need of them they couldnt work with my schedule . even when sometimes i didnt have a choice. other than that. not to bad of a company to work for. Great work environment with dedicated employees.  Management from the team leads is solid.  Working with new sellers on the site for the first time was very rewarding.  Helping them become successful was the most enjoyable part of the job. The workplace its self wasnt bad but the supervising and management teams were terrible. They treated their employees like animals and constantly disrespected them. Ebay was fun to work with. i worked with clients that need me to input data and to input there listings for them.  this was a very easy job and i wished that i could continue working here but it was a temporarily job. I have never heard of a company that is willing to fire somebody when they have gone to the ER.   They were unwilling to take a doctors note from the ER. The management lied and stated that they would talk about options, and Instead of the options I was terminated.  I’ve never heard of a company cell and willing to work with somebody, due to a possible heart attack. Worked for a manager who pretty much was incapable of doing their job function at all and passed responsibilities on to the team. They were recruited from a completely different industry and had no knowledge of the actual job. When things were implemented they were not ever communicated well, and numbers became an on and off issue at different periods. Amenities were great and the people I worked with were cool too, but management was inexperienced and immature at times. Scheduling is pretty much locked in to whatever you sign on for, so anything you plan to take on in life will have to work around this. eBay has a great culture and benefits.  They have a sabbatical program, paternity and maternity leaves, great 401K and other benefits.  Aside from that, the management is horrible.  They don't take employee consideration into account.  Work life balance is not taken into consideration. The overall work experience was great, some managers and supervisors need training, climate controlled, clean work environment. Benefits are excellent and affordable. The hours are less than desirable. Very fast working environment, SLAs and UPH are of great importance Good place to improve communications and work culture  and interactive team and innovative place. Team lunches and team meetings and offshore interaction. fun but really competitive place many kids at the school wanted to sell things.sometimes we would not have enouph stuff to sales so you would t not get that much money Good income opportunities from independent sales. Selling online has taught me a lot about owning and operating my own business. It has taught me how to manage various orders on a weekly basis. I can say I excel in gaining new business and customers. I thoroughly enjoyed my time at eBay.  A great company, with a great vision that is positioned to do great things.  Currently experiencing some issues, but I have no doubt that they will overcome them.  Highly recommend them to any potential job seekers.  Truly sorry that I no longer work there. During my tenure at eBay, I enjoyed my work and the number of people I got to work with. eBay provided me a place to figure out my career path and helped me move on to getting there. Easy to use and learn. Follow the seller guidelines. Take pictures that sell!!! Always have fast as possible response!!! Include detailed listings to keep your customers interested!!! Package everything as if it were your own gift!!! Expect the occasional problem customer and ask Ebay to step in when need be!!! Most transactions are smooth and simple. When I was working for Ebay Valet, I was fortunate to handle customer service, receive items, research, appraise, photograph and list.  Since Ebay Valet has been closed as of 3 months ago, I've been working in the main warehouse at Ingram Micro in the pick module, and would love to get back to working with Ebay.  I do have my own Ebay  store; silver_lace_antiques. eBay has a problem with decision making and duplicate roles. There was always fear of lay offs and reorgs. Job stability is not stable and room for growth is limited. everyday uou go to work and then you have a lunch and then you work some more and then you go home.  you sit at computer and work, you answer phone or make phone calls Manages all administrative functions including expense reporting and tracking, purchase order preparation and tracking, coordinating complex domestic and international travel, calendar management and prioritization of requests for time. Partnering with executives and senior leaders to exceed expectations and outcomes.eBay seeks leading edge solutions to make its' customer community a better place to live, work and learn. We are committed to the care and stewardship of the community. We take a collective approach and give the best of eBay.Many smart people, innovative, long term vision, family friendly, good work life balance, good culture, sustainable, and continues to  works on improving the customer experience.Teambuilding events were very enjoyable. I never worked at eBay. Not sure why you think I worked for eBay inc...I never did...I worked for a luxury watch company that used eBay as a platform to sell. The company provides excellent medical, vision and dental benefits and 401 k match up.The company also give quarterly bonuses to employees based on company's performance and individual performance Good company.  You have to be a go getter and keep up with company changes .  Limited control over listing.  Must know what is selling at a given time. I work with amazing people! They aren’t  just engineers or product owners...they’re my friends. Having a team like that makes going to work easy. Best group of people I’ve worked with in a very long time. there was something always to do. fast paste. on your feet all day. good management. pay  was ok but the  pay rate always went up and down when working as a temp. and when full time you pay rate is 10 per hour with raises Ebay provides great working environment and encourages engineers to be creative and pursue their goals. You have opportunity to work with bright people in the industry and build software used of millions of people Not a good culture at the company. no fair opportunities for everyone.I am looking for another job because it is not interesting for me anymore. I do not like to go to work there, very bad micromanagement and culture. Great company to work for, they are constantly looking for ways to streamline processes. I would recommend eBay to anyone.My years there taught me how to work with a diverse group of people and lead them effectively. Have worked on Ebay for over 20 years and still to this day i stand behind this company.only problem is that there is so much competition now in this industry that its hard to make a living working alone on ebay so its better for a supplement of income now. Managed personal eBay store with 100+ items annually resulting in 200+ purchases since 2015.  Sources products such as clothing, books, toys, kitchenware, and electronics. Inbound call center handling escalated member calls.  Management is only concerned about Customer Satisfaction Survey scores, but they do not provide any empowerment to allow you to make the customer happy.  They want you to support the company's policies, and change customer's opinion of the policies, without providing empowerment tools.  You are written up and your job threatened if you do not meet survey goals. collecting positive feedback's was the best Super quality! Quick respond. Ever so marvelous packaging.  outstanding. 'Remarkably pleased.'improve Excellent quality! Superior delivery.' fun but really competitive place many kids at the school wanted to sell things.sometimes we would not have enouph stuff to sales so you would t not get that much money eBay was a great company to work for.  They offer great benefits and support.  Once you are working for the organization you expand on your expertise in other areas and they like to promote from within. This has been a great and fun place to work! It has a break room with nice pool and ping pong tables.  TV's with sports and news. Free drinks with cans and soda fountain. It was a learning experience and I learned how to sell my own things on eBay. eBay is pretty hard to sell for unless if you have an item that is in demand so you have to compare prices most of the time. Independent sales only.  Worked from home to sell items onebay website.  I gained education on pricing and shipping.  Thereis no steady income unless you have a vast amount of itemsto sell.  Researching your item before you sell on ebay doestake a extensive amount of time. My experience working with ebayc has been great. Working here feels like my work is appreciated, working with these kids has taught me alot. Watching the kids have fun with all the activities we do is amazing, It also feels great knowing that when the kids need help we are there for them. ebay was my dream company to work for and it did not disappoint. I loved everything about it and very glad I am rehireable if I decide to go back. The culture is great as it promotes diversity and great work-life balance. A typical day would be working at home and learning how to use eBay tools and the support system that eBay gives like performance records,marketing strategies like creating discounts, traffic, performance, and others. I didn't work in a office and this is my own income. The hardest part would be determining the best strategies to sell an item or which item would give sell the most and give you the most profit and the most enjoyable would be learning what you are selling and listing them. I worked there a year and never got hired on. all they kept was temps and never offered people jobs. The temp agency guy was a scum bag too. Terrible place to work. Ebay enterprise is a call center that provides assistance to customers who need helps placing orders and editing their orders as well. the company provides excellent pay I have a store on EBAY and love it however prices for shipping and such are getting higher and people are getting pushed out by big stores. I would recommened this as a part time to earn extra cash, Loved working there. The bosses were great and the environment was always positive. They always showed their employees a lot of appreciation and had great benefits. Not a dynamic organization. Most of the people I worked with moved on to other companies. Benefits are a bit below average for a large tech company in the Silicon Valley. eBay policies are a pain, but it's a great way to make extra money on the side or support yourself for short periods of time. Very buyer focused, sellers are second. I love selling on ebay as a way to make some extra cash on the side.  I recommend all young business students giving it a try. It's easy to start and you can learn a lot about marketing. Chaotic work environment with constant change.  Work load is too large for the time allowed to complete tasks.  Management provides conflicting priorities and does not support its people.  Be prepared to be blamed for things that are not even under your control. Been selling on E-Bay for almost 15 years and it's a great way to make good income especially when needed, Go away or take a break whenever you want. Job Freedom It is a fast-paced job with lots of different instructions to follow, and they must be followed to a 'T'.  Management listens to recordings of the calls, and each employee is graded for their performance on a weekly basis.  The judgments are harsh; sometimes brutal.  Perfection on the calls is a must.  Perfection on the part of supervisors and management, however, is optional. always a busy and fun atmosphere!!!! I had so much fun, worked on extreme makeover facility small and large construction projects, worked closely with project managers and software managers, as well assisting architects and softwaredevelopers engineers. I worked as an independent seller on Ebay. It has given me a chance to deal with the public hands on. Solving complex problems that may have arisen during processing of orders. Flexible working schedule and enjoy interacting with people who are interested in items which I am selling. It is a great way to join your hobby with an option to earn an income at the same time. fun but really competitive place many kids at the school wanted to sell things.sometimes we would not have enouph stuff to sales so you would t not get that much money Easy place to work. The people at Adecco are always so nice. Work environment was pretty steady paced. Never really saw the manager or line lead though. fast help 24 7 support a great venue to resale electronic repairs and resale whole/brand new electronics. provides seller protection against hackers and scammers. If you want to be stressed out and tired work here. if not DONT DO IT!!!!!!!!!! they do not care about their employees. I hated my time at this company. I got to enter my own items I was selling. It was a hassle but it was to make my own money for a short amount of time. I constantly sold things and it was fun to do. It is a great help at first for someone who cant get around much. It is pretty basic stuff but highly competitive. If someone complains you basically end up giving away your item to avoid it to 'escalate' or a negative review. Unfortunately many have figured out how to game the system and get away with freebies. Research accounts that would normally been sent to collections to determine if the account has been taken over or opened fraudulently.•	Special project to review accounts that would have been sent to collection.•	Identify trends so filters could be put in place for the future.•	Decide if it is passed on to collections or held for fraud. What began as a shopping experience became a full time career over a decade ago. Working for eBay has allowed me to make my own hours, control my earnings and reach out to thousands of customers all over the world.When you sell for a world wide company you need to be able to uphold the integrity of the company, and eBay rewards  store owners that excel  with notable levels of awards. I am and have been a power seller for at least a decade and I have achieved a perfect 100% feedback score from my thousands of customers. I would highly recommend this career for people who need to be able to telecommute, new moms, disabled people, and people who want complete control of their salary and work hours. Fun culture at eBay lots of happy hour events, lots of off site planning on my part, calendaring, ordering snacks, expense reports for VPs. Lively bunch of co-workers all with exceptional personalities. ebay like gsi was bought out by radial its a good place to work same as radial only a few things changed but other then that dont know what else to say Taking transportation freight invoices from the vendors & adjusting the bills by searching for the correct code to bill the client.  Training new on boards in research & escalate issues. • Sourced and acquired inventory using online channels and distributors • Designed web page auctions for individual and all specific items• Handled shipping and provided quality customer service Check your emails for possible new orders. You must verify that your current price for what you sell is going to be profitable each week, otherwise you may sell at no profit or a loss. Any new items must be entered according to EBAY rules which must be followed in order to list them. It's nice to be your own boss, but you have to beware of businesses that supposedly teach you the business, but refuse to reveal the true costs of taking additional steps so that you can make a living at it. The environment and co-workers make this place a great working experience. They often have snacks and free drinks available. Management is approachable as well. I loved this job the pay was great I just didn't have transportation definitely a job I wouldn't mind working again it was easy and simple and it wasn't stressful and u get your hours and everything The company is managed by blithering idiots who think that they're intelligent but have no idea of what they're doing.  They routinely brutalize employees and treat them like slaves.  One of the managers there even tried to control my home.  The man had no business managing anything. Stable and secure place to work.  Always found positive and fair treatment of employees.  It s a large company so management differs.  Some fantastic managers and senior leadership and others not so much.  It really is dependent on your individual group. I loved being able to work from home and help manage my brothers company he started with E-Commerce.You don't deal directly with E-bay, and that's all the better as well. I would not recommend working for this company. I worked there and would almost cry because of the worst training and having to lie to customers about them getting there product on time when it was the holidays. I knew they would not especially when they were in other countries. I also won a gift card and had it thrown at me because I did not want to take a picture with it. It was in front of other employees. It was the lady manager sitting in the office that did it. Way stop close to home while unable to drive. I learned about how products sell, what products sell more than others, Pricing, and photography. Managed Store. It was a glorified sweatshop! It's good for people who need something quick, while they search for an ACTUAL job, instead of signing up to do this slave work for PENNIES on the dollar. fun but really competitive place many kids at the school wanted to sell things.sometimes we would not have enouph stuff to sales so you would t not get that much money I sell vintage clothes. Not sure why I even have to enter any of this in here but alright, here is my review of being an ebay seller. I like it. It's great. Innovative, very fast paced.  Good compensation.  Needed improvement on speed of decision making.  Analysis paralysis at times.  Recommended to my friends. Great place to work I would recommend it to any friend............ the only thing is you have to walk a lot around the whole building maybe sometimes up stairs didnt work here for very long stressful place bery long training time mandatoty ot sucked sitting all day sucked pay was alright at the time  give it a shot Great customer service, unpredictable adventures with great outcomes. Multi task job with knowledge to always learn. Sales were simple and fast let alone easy. Fun place to work! The most enjoyable part of online sales was that I could sell what I wanted when I wanted. The hours where always at my disposable and I could make money selling online. If you are a seller on eBay, make sure you know that it is a job.  Your customers sometimes get the impression that you are at their disposal 24/7.  Make sure you make time for you or you will get burnt out quick. I have worked at eBay for over 10 years. It has been great to me and my family.  I've been able to grow, develop and greatly increase my role within the company as well income. I started at an entry level and transitioned into a professional level and eBay fostered the opportunity to entire way. Your results depend on how you run your business. You are your own boss and you decide how your time and money is spend. Ebay is a great place to start your business. A typical day would be pulling all the orders, wrapping them and then shipping them out. I learned that i have very good wrapping skills. Everyday of work was pretty much the same routine. Good work experience. It was nice to have flexible hours where I was not required to be not have a choice on when I needed to work and didn't. I could make my own hours. I really enjoy working at eBay, mostly because of the people I work with who are super kind and friendly. The one thing I wish was that people could relax enough to hang out from time to time - things are so busy that even finding time to schedule a lunch with co-workers could take a month! But overall everyone is really smart and thoughtful and they don't micromanage, which is great. I really liked working at ebay well mannered people nice pay rate and nice hours nice managers you get three breaks two fifthteen minute smoke breaks and a thirty minute lunch break I received a red Negative from a buyer after spending over $8000 over 15 years at Ebay and not one Ebay representative cared when I said I wanted to close my account.Red negatives issued by buyers at whim without regards to honest sellers, Ebay system is flawed.  Therefore I certainly wouldn't work for them.Regardsssliderr The only reason to stay is the people. Everyone is really great, it's just the companies strategy is strictly about the clients. While I get that outlook, they rarely look at retention on good talent that they have which is sad. I would clock in. Found out what I would being doing that day and then go do it. I've learned how to pick,pack, research, and train. I love the bosses. I would ask to learn something new and i would get trained. Loved the people I worked with. The hardest part about the job was the hours during peak season. Bay is where the world goes to shop, sell, and give. Every day, our professionals connect millions of buyers and sellers around the globe, empowering people and creating opportunity. We're on a mission to build a better, more connected form of commerce that ... Read moreMission: eBay connects people through technology and enables commerce that creates greater opportunity for people, business and society. Great place to make quick sales. you do your own working hours and is a great opportunityto make some money from home. you are able to meet some great people, you are able to learn about customer service. It is easy to start and can be learned in a decent amount of time. needs constant attention, you do all aspect of small businnes. Great culture, good people, great place to work.  Very supportive management.  They care for there employees.  I work with great team of people who have great vision for analytics Had a decent job with decent money and benefits for my area. Stressful job dealing with individuals who always had issues but that is what you were paid to do fix the issues. fun but really competitive place many kids at the school wanted to sell things.sometimes we would not have enouph stuff to sales so you would t not get that much money The work I did at eBay was totally different than what I did at Fenwick but it was a learning experience that taught me a lot.  The pay through my recruiter was very low in comparison to what I left at Fenwick but what I was to learn made it worth it.  I'll never forget the people.  I was surrounded by the friendliest, most helpful and sincerest folks that made a permanent impression on me. A typical day to day was pretty easy going, walking in there seeing new things.  I learned alot of new things with eBay valet; such as authenticating clothing, shoes, high end bags everything in general. Also pricing the product and listing it on the website.  I also got the chance to get to work on electronics department, which means i got to test the electronics. Such as phones, laptops, monitors, etc. The work place culture was amazing everyone got along along with one another always learning new things from each other. The hardest part of the job was literally to identify if the things were fake or not. Learned to be Self driven and Self oriented. Was given the tools to take charge and earn my own salary. You are able to make your own hours and make as much as so desire. I have owned and operated this company for ten years. In that time the sales have dropped off some leading me to seek employment outside of the home now that my children are grown. A group of smart,  collaborative and very team goal oriented folks.  You work hard and still have fun doing it. Leadership training for those who want it. Unfortunately, I did not work for Ebay long enough  to rate this company, but 2 months they treat us very well, typical  California style management company Had a great time at eBay, enjoyed my team and my work. Loved the company purpose and mission. It's a slow engineering environment on an arcane tech stack so things move slowly and cross team dependencies are hard to align. Overall good working experience, well organized, good team spirit. Good workplace culture, a typical day at work would be quick paced. The most enjoyable part is celebrating the team achievements. I would work here again in a heart beat. The culture was great. The training and management was always very helpful. The pay was amazing and they had a lot of options as far as time to work detail-oriented, work well under pressure and on deadline, enjoy working with a variety of people, and have a great attitude.  I’m looking for a creative, challenging, growth oriented position and would like the opportunity to learn more about the position and get more experience You have to invest a lot of time and money to get started, but it can be done. Keep up with all sales you will need to claim them on taxes. Great to be on your own schedule, but also requires a lot of self discipline. Working at eBay is different than other companies. The management has their own set of rules that applies to them but not to employees, managers have lied about when people would be able to get to change shifts when they knew they weren't eligible. Don't apply here. 6 bosses in the last two years.  Very 'me' focused culture.  Cliquish work environment.  Politics trumps knowledge.  Despite all of the press around technology advancements Ebay couldn't innovate its way out of a wet paper bag.  Sad.  Flawed growth strategy.  Trying to emulate competitors instead of building a better marketplace model.  Same old transactional platform they built over 20 years ago. Long hours at a very fast paced work enviromrnt but able to work at a pace that is controlled by the worker. Management is far and will work with you at all times I’m very good at Ebay I just go to Goodwill or second hand stores buy my merchandise and resell it on eBay. It’s that simple. Ebay is a fast paced company as soon as you make a sale you’re expected to ship immediately. And if an accident happens in shipping you’re responsible so you have to make sure that the fragile items are packed excellent. They provided me with exposure to various sales and customer service techniques that has helped me throughout my career. They have good benefits for there employees. The Management Team does their best to make the job as fun as it can be. It is a call center, and that work really isn't fun. You take so many calls that you eventually feel like a robot. But you turn around and see someone dressed like a monkey... and it lifts your spirits. Great people!! The people make that place. During my time at ebay I had a good work environment experience. It was a steady fast paced job that wasn't stressful nor overwhelming. the work hours and pay where both very fair Great health benefits, great 401k, great stock options and ESPP, good PTO, sabbatical every 5 years, friendly employees, fun work environment, and a pay for performance company -- they actually give you extra stock and quarterly bonuses based on your ranking against your peers!! Most of my reviews are good and never had no problem with selling. Its fun to sell collectable online,its helps alot when i needed some cash.its great fun but really competitive place many kids at the school wanted to sell things.sometimes we would not have enouph stuff to sales so you would t not get that much money eBay is a great way for someone who wants practical experience running a business. It's easy to start and can be learned in a decent amount of time. if you ever need help they are always there by the phone to help new sellers. They could have paid more for the knowledge you had to have for so many different departments. They pay their employees for many holidays that I am pretty sure other companies dont pay for. eBay as a company to sale products online is great a great means to have a second job or extra money each month.  Would not recommend for full time work unless there are plans to fully work in a B2B type business strategy. There has been times when I loved working at eBay and times when I could not stand it.  The culture overall is good, but definitely helps if you are a software engineer vs.  working on other job functions.  Very stiff competition and just looking for a better work life balance and maybe a company that does something other than just help people buy stuff online eBay has very good benefits including stock awards for most employees.  There are great advancement opportunities.  For the most part, teams are very collaborative and everyone's input is valued. Was a great way to earn extra money. Fun and competitive and could become a full time job if you are committed. Most enjoyable part was creating my own listings and making money. Paid 2 weeks training. Once you start working you'll realize how stressful/ boring this job really is. you'll also realize you're broke and need this job for however long eBay brought out a company i worked for called Gsi commerce m. It was as a nice place to work but didn’t pay enough to raise a family. I learned to drive a lot of equipment there Overall a great company to work for; I would work for this company again give the chance. They made it easy to communicate with if given any situation. working in this environment was very educational, but yet fun. I had fun working with American eagle . Although some days you can get back to back calls with little breaks it’s all worth it ! eBay San Jose was a great place to work except for the parking. The First Street campus, prior to PayPal spin off, was more spacious, but there you had  morning/evening commute. Both campuses were lovely, people were friendly, culture was inclusive, amenities were plentiful and available, and events were fun. It's a fast-paced corporate tech environment. This job is no longer located in austin, so anything i type here is pretty much irrelevant. The call center people always looked really happy, if your looking for a CS job it seemed like a great place to work. This was an online job opportunity to work for myself! I've learned how to calculate sales price, taxes, shipping & profits all in one!  I love the freedom, the profits & satisfying every customer! The most challenging part of this job was in posting merchandise that people would actually purchase! I really enjoyed marketing merchandise on this site & look forward to a prosperous day despite the odds!!! Working online is probably one of the easiest jobs you can do. I can be anywhere at anytime and still be working and making money. If you're looking to make money and finding a job is hard, try selling stuff online, you'll always win! Flexible hours because I run my own store, sometimes business is good, sometimes it's not, it all depends on what sells. I learned how to do market research, negotiate with buyers, and communicate with buyers as well. It is eBay there is not too much more to say. You get the results you put in. Your pay is limited to your imagination. Personally I only sell things around the house. Great way to make money off of things that would end up thrown out or collecting dust! I take pictures, descibe my items, decide on what price is fair, decide if there are shipping fees or not, go to thrift shops, yard sales, antique shops and more. Warehousing was fun and fast paced, you were constantly around your co-workers to have people to talk to while maintaining your work speed. Never left doing one job all day, often you  were moved to another section. Good place to earn extra income. Highly competitive specifically with on-demand items like brand name purses. Photos should be clear and taken in broad daylight to attract potential buyers. Flexible schedule. Not sure what this review is required for since its a private business with few employees so others wont have a chance to work here considering its a small company. fun but really competitive place many kids at the school wanted to sell things.sometimes we would not have enouph stuff to sales so you would t not get that much money Good opportunity to learn different aspects of fraud in e-commerce/retail space.   I've learned multiple aspects of the fraud business throughout my career here. •	Install network printer, Multi systems user (MAC/Windows), diagnose and resolve system hardware, software, or operator problems.•	Install & Verify HP Drivers, troubleshoot Printers, Scanners, Passbook Printers and Static IP settings.•	Change or setup Networks ports for users (using Cisco 2900 & 3900 series) •	Install, maintain and troubleshoots all types of application and software issues for all users on windows 7 environment.•	Document the changes of any open tickets and perform quality control of complex tickets to ensure they meet company ebay is a great place to work, they give you the tools you need to be good at your job right away and everyone is extremely friendly. Highly recommended. eBay is e-commerce Company which provides a platform for buying and selling of consumer products. Involved in merging entities from GSI to eBay, setting up recurring for every month. As per the client requirement I need to prepare the flux comments on the balance sheet accounts Everyday had new tasks and challenges to overcome, regardless if it was a new or existing project. The due dates for projects were very realistic, manager was considerate and aware of employee struggles and progress. I enjoyed my experience , but eBay was alittle un prepared and alittle un organized as far as management and project management, not alot of communication between recruiters me and what management . Younger managers Working with customers, reviewing their orders, upselling, operating several computer systems. Great benefits, since they were bought out, management has certainly changed. eBay is a good place to work - the people are great and inclusive. It's often difficult to get things done because functions are siloed and goals are not aligned. Since having an ebay store has been mostly a hobby for me, I would typically spend my free time searching thrift stores for items to sell as I was going through medical school. The most important things I learned through selling items on ebay are that buyers expect honesty, consistency and detail in the way items are described and depicted-if these criteria are met, success should be imminent. Live free and set your own potential at EBay. The sky is the limit as long you have something to sell. See the world differently and never look back to the days before EBay. Poor life exp poor management would never go back. It's just a fashion show that doesn't go anywhere. No chance to get promoted. Why work there? Just the insurance is good. competitive and mean. hostile to women. Hard to advance. Boys club in upper management. old technology and design. lots of games and politics. doesn't have to be this way. Ebay had a great culture.  Leadership was respectful and inclusive.  Workin conditions were good.  Peers were qualified.  Training was not as strong as I expected. eBay is completely what you make of it.  Although I feel their fees are a bit too much.  Must be self motivated.  eBay does a lot to give you statics and reports as to how you are doing, as a seller.  Very good and useful info. eBay is a fast paced place to work with a lot of opportunity for growth. It's a fun, friendly environment that draws in a variety of people. There is often challenges that need to be overcome with strategic, creative thinking. The focus was on delivering the website as fast as possible to beat the others to market. There is really nothing else to say in this assessment.Thanks I could work while taking care of my daughter at home, it's been a really good experience selling on ebay, and getting experience for customer service areas At Ebay enterprise, there were many seasonal employees that they hired but that was why seasonal workers did not last long. Everybody that worked there had polite behavior and the performance was easy to accomplish. It was probably the best work environment I had as far as the labor went, but they worked me about fifty to sixty hours a week, sometimes more. I wanted more time off for my personal life. The management was caring for all employees. Self employing yourself and selling goods to people is one of the best if not the best thing I was doing, I got to write my own schedule and worked from home in my underwear every single day and I took in money that pays more than 50k a year after taxes. The culture at eBay is infectious. They really care about their employees and work hard to make their employees feel wanted and appreciated. Those who have had the pleasure of working there have nothing but positive things to say about the company. fun but really competitive place many kids at the school wanted to sell things.sometimes we would not have enouph stuff to sales so you would t not get that much money I sold menswear on the eBay website under the store brand Premium Clothing. I enjoyed productively selling menswear under the eBay title and offering a variety choices. It was fun selling affordable fashions! There really isn't much to say. If you have good stuff you can sell it easily. There are problems because the company can shut down your listing AT ANYTIME even if there is a mistake on their part and you cant even argue about it. I was hired by eBay in their start-up phase to design develop and direct the Customer Support department for High-Volume Sellers.My department was responsible for 85% of eBay's revenue.I was proud of my design of collaborative infrastructure. This infrastructure allowed me to Direct Operations, aligning the company mission and goals with all internal eBay departments across the organization.Was selected to represent eBay at Job Fairs and Tradeshows. great to work on Big Data platform and hadoop echo system with analytics on Spark  and machine learning  , enjoyed working on kafla  writing AVRO eventing framework Although i do not work for the corperation, i do have an Ebay store and i must be honest, its a blessing to be able to be in control of your own destiny. Contract assignment however the benefits are excellent once you’re a Permanente employee with eBay.Small office with inbound calls and support for dealer services. Team very helpful and knowledgeable. I have never loved a job more than eBay. Just an amazing company to work for. I have great benefits. Superb insurance. Friendly and Supportive Supervisors and peers. Typical day at work involved catching up on emails and sorting work requests. I would then check my ticket queue, perform work that had a quick turn around, then plan how to perform larger projects. Some days I would get to devote the whole to day to developing applications and scripts to automate or remove human errors from the process.I was able to learn how controls and monitoring systems work with physical devices for the support of a data center. I was also able to continue learning new things, as has been the case throughout my career, that weren't necessary for my immediate job duties, but became an asset for my team and company.The management teams at ebay are great, i didn't have a lot of contact with upper level management team, but they did hold town hall meetings that were broadcasted to other locations and helped me feel included in the overall progress of the company, and help me see the big picture. My direct management were helpful, understanding and showed me examples of how to make decisions and help me understand why a certain decision was made. The hardest part of my job was understanding how the more technical functions of the monitoring system would break and stop working. I would eventually find a solution, which was rewarding, but some solutions seemed to temporary fixes.The absolute best part of my job came out of my desire to automate some job duties, which my manager encouraged me to continue, which was coding in C# and to learn and polish my understanding of coding. I love being in the zone and figuring out how to get logic and processes  to work to ease the more tedious parts of my job. Programming is the best part of my job now. work your own hours and just relax. service center set all appointments for you. I really have nothing more to say but this system makes you type something. Sure, you can sell your unwanted collectibles or antiques, but if they're heavy a lot of buyers don't like the high shipping costs. If you can make a profit it's great, though! To become a great seller you need to take great photos (of every angle) crop the photos, then list the item including measurements and any defects. You have to decide if you want to start with an auction or a 'buy it now' and once your item sells (if it does), you then have to wait for payment before shipping the item, which ebay makes easy with their shipping label discount program. A typical day includes managing your store and answering any questions or inquiries about the products listed. I purchased a camera to enhance and bring in more customers. I also devoted my time to listing quality products. I worked for eBay for nearly a decade and several roles and functions.  I thoroughly enjoyed the tough challenges, the smart people and working for one of the best and most recognizable tech companies in the world. it was a simple job did not require a lot of thinking to it once you figured out where everything is your job becomes a bit more easy just dealing with different people I would say the hardest Over worked a lot and very disappointed with management team . I did make great money while I was there but was not happy . I felt I was treated unfairly many times due to a lot a favoritism. Nice to place to work seasonal.great pay during Christmas time.would recommend they hire people on more full time. Mangement team full of leaders.very comforable atmosphere. Good place to work at your own pace.  Typical day includes researching items to determine a resale value then taking quality pictures combined with an accurate and detailed description.Calculate shipping and handling costsSafely & properly package breakable items for safe delivery. Your typical pick/pack operation, was very quick paced. They train you fairly well and the job is pretty straight forward. I was only there for a week before I took a job closer to home so I don't have much to saw on it. i love ebay  It's a great company with cutting edge technology.  Very vibrant in job, where you need to constantly upgrade yourself to fit in the job. Learn how to work at a fast pace and still get the job done and work with people as a team on getting the job done I've also learned that a cleaner work place is a safe work place The job was laid back and easy to learn. Only problem I had was lack of work they had and the reason I was let go! I really wanted to stay and hoped to be moved to different department but nothing was available at the time and then I moved out of state fun but really competitive place many kids at the school wanted to sell things.sometimes we would not have enouph stuff to sales so you would t not get that much money Pros: Snacks in the break room, relaxed culture, active participants in the communityThey were not very disability friendly, and gave me and other employees lots of difficulties for reasonable accommodations. They have great benefits and also have a great work and home life balance. I got reimbursement to take the train to work every day and also got 12 weeks of paid paternity leave. The only thing i don't like is the career advancement. They don't take every candidate into consideration equally.Specially the benefit to start my online businessbirchi.in Enjoy working ebaby, i like that i can thifting during the day and list at night. I go at my own pace. The income from this is what pays for my family vacations. Sold items to customers around the world namely in sports/hobby related items.  Worked around my schedule.  Ebay has fairly reasonable collection fees on my sales.  Ok for an extra/side job. You would check your ebay email and ebay often.  I learned how to deal with people.  Management was laid back due to you being like self employed.  The workplace was ever you wanted it to be.  Let be in your home in your bosses home or wherever you could package and send the products out.  Of course, you need a laptop or computer there with you to see your ebay screen.  The hardest part of the job was not knowing how much you would be getting paid.  I liked working with ebay because it gave me a flexible job to do other things as well. Working at the eBay IT store was a great experience. I had a great supervisor, and a great boss. The work environment was laid back, and I got to help interesting people every day. The environment is very good for making sure that each individual in the department truly works as one - as a team. There were always some type of incentive going on. Whether within your own department or as an entire company. Awful, just awful. Worst place I've ever worked. Like fake botox filled faces on steroids glaring at you all day. Makes you feel like garbage for not having the implementation of any basic training that they don't give you. They treat you like chum to throw out to disgruntled sellers who the flawed system they designed has screwed over. Nice place to run a business, but the pay was all over the place. Larger retailers have made it very hard for a small business to make a dent in the market. I was a graduate fresh out of high school and the owner gave me the job to be one of the main leaders of the company to the rest of the associates. Leadership of cleaning,inventory, and sales were the main ones. Always there and wanted to know how he could make the company better. Great benefits, wonderful work environment, nows the time to apply. Advancement is available depending on who you know. Wonderful company! Apply Apply I actually love my job here at eBay, just looking for something more to do with my free time. The environment is noticibley amiable, and  hardly competitive, which I find very pleasant. Processed emails from buyers and sellers. Great management to work with. Co workers were always willing to help with tough emails. Supervisor was the best. Meetings were held each week to discuss goals and to help us with whatever was needed. Being an Ebay dropshipper was rewarding, but also somewhat challenging. This job involved finding profitable products to sell from Amazon or other popular retail sites and sell them on Ebay. The most rewarding part was working with customers and gaining a positive feedback from each of those customers, knowing that I've helped them make their lives a little easier. great company to  work for. Great perks! Huge potential  for career growth. Cutting edge technologies to work on. Pay is pretty good. Overall nice employer Good Place to work and advancement is available for trainers and leadership positions. I liked working here and the staff are all very friendly. They also have a good training program. This is an excellent job with a lot of flexibility. I will continue this job forever, but also want to build a career in the corporate world. Each day I enjoy going to work, and helping people buy products. Nice place to work what you want and make how much you want. You can make it what you choose.  It was easy and fun.  I had did it in my spare time and made some great money doing it. The harder you work the more reward you are given. As being self employed it is essential to be driven and highly motivated on your own. Seeing when the challenges and issues arise to meet them with a since of urgency. Management cares only about numbers, employees are only worthy of their  time if they make numbers. Management is not very helpful, any  questions are usually answered with a question, management will not stand behind you and will throw you under the bus at the first chance. Very high turn over rate my class was about 90% turnover in the first six to eight months. Calls are non stop and break and lunch schedule to the second. No real chance of promotions and raises were few and far between. fun but really competitive place many kids at the school wanted to sell things.sometimes we would not have enouph stuff to sales so you would t not get that much money A very rewarding and welcoming atmosphere. I would recommend to anyone with or without experience in Customer Service. I would definitely go back if I had the chance. We worked,10 hour shifts, 7 days a weekVery fast paced work place. The hardest part was standing on cement floors all day, 10 some times 12 hours everyday. great hours - created my own pace, the person I was helping stopped doing EBAY - so the job went out and I no longer had the options of work.  It is important to give accurate descriptions of you selling items! Listing on ebay is a self paced, self starter environment- first you have to identify your Niche and research your product and the market for what you want to sell. You can work as much as you want or not at all. However, that does determine the possible amount of money you will make. You have to be dedicated and knowledgeable of the product you want to sell to be successful.I have learned a great deal while working with ebay- how to do product research, how to find hot selling items, how to create a professional listing, how to take great photos, how to describe items using keywords. How to market my items. Granted, I only work part-time doing this.I am my own manager, with regard to ebay's policies for listings.Relaxed for the most part and stressful at times due to rapidly changing technology.The hardest part of the job is getting the pictures just right, writing the description of an item to include any and all possible details a customer may inquire about.The most enjoyable part of the job is searching for that treasure and finding an awesome item, then submitting the listing when completed and seeing that item sell. The management I had in my department was horrendous. The Senior manager didn't know what he was doing most of the time. And talk about pettiness, he fired two great supervisors because of personal jealousy he had towards them. After that everything went down hill and we almost lost our client due to him. had my own business made my own hoursworld wide salesfun to write ads and sell1200 positive customer ratings100% and power sellerjust need to not work from homeanymore ebay is always there for meto make extra money its amazingwhen you are honest and good at itrepeat business from most customers Loved this job! Would still be there if I hadn't moved. Great environment and really interesting job to keep it from getting stale. Plenty of departments to move up into. Work Life balance was great as was benefits. Sorry to be sold off to a  different company. eBay had a relaxed and comfortable work environment, I enjoyed it very much. Fine if you put your head down take the calls and then don't ask to many questions. ONce you start to question the way they do things don't expect to advance I work from home and sell on Ebay when I have time. It is great for when you want some extra money. It’s not too hard, but it can be a little difficult because you can’t always find things to sell. The internship at eBay Inc allowed me to interact with people of different walks of life. The job was based around information politicians of the grassroots benefits of a small business. I really enjoyed my time at eBay Inc. eBay was great until they were sold to an investment firm. The company was great, the co-workers and environment were outstanding, however after the sale, the culture changed and the best workers and supervisors departed for greener pastures. I learned that working for yourself thru Ebay is very good way of mastering good money and time mangement skills. There is a lot of stuff that we all have in our homes, that people will gladly pay for. Do yourself a favor and sell them thru Ebay. It will reduce clutter and make your bank account a bit more. This is a home based business. I own and operate this. Sales depend on supply and demand. I will continue to do this as there are not set hours or days. It was a okay company. Just the management isn't organized. The people is diverse and a good place to meet new people. Also the scheduling is pretty set. Asking me to write a review is fine, forcing me to write a review is not.  You don't get good reviews from forcing people to write them.  I am sure someone has to understand this at indeed.com? The schedule had very flexible hours, but the compensation for the amount of work was not enough and there was no room for advancement. However the ability to cross train and build your knowledge base was vey helpful. I work for myself basically with EBay as the middleman. It's kind of difficult in my opinion, but if you stick with it and are consistent (which i haven't always been), in the future you create for yourself a money-making machine. Overall I like, it's really just to facilitate extra money. I go to Auctions a lot and pick up things and post them (collectibles, glass, old advertising products etc) on ebay and make decent money at it. You can do it on your own time when you want. The hardest part is getting the product in the mail on time, but that isn't that bad. and the most enjoyable part is the satisfaction of getting an item to a person that they want for their collection that they remember from their childhood. Overall, its a good way to make some extra money. Typical day at work was laid back, i learned on how to talk to people, workplace culture was more Americanized, the most enjoyable part of the job was overtime and pay fun but really competitive place many kids at the school wanted to sell things.sometimes we would not have enouph stuff to sales so you would t not get that much money I hated working at a place that only rewards kiss asrses nd people that know how to lick the daily dicc fucc this place I ha E hate hate hate hate hate this place Great company really takes care of their employees. Just wish there were more opportunities for career advancement. Great benefits. They have really taken care of my family and I throughout the past years. Management has no vision and ideas. They lack vision and leadership. Favoritism and politics . The environment is unhealthy. New talent is the only working strata. It was a good experience  greatful for working therelearnd some new things like picking and packing hopefully I can take this into the future with the things I learned .. None, you are your own boss. You are the only that holds yourself back. Work hours etc. are dependent on yourself. There is no management or work culture. Great place to work for, company support was outstanding, very diversified,  good pay, unlimited earning potential. A great company to grow with, continuous education I worked at eBay for almost 7 years. Was promoted once. Applied to 5 other positions and was turned down each time. It isn't what you know or how well you perform your job, it is more who you know and how well do you know them. Easy part time work to maintain, selling products from a previous business that are no longer needed. Ebay's website is easy to navigate and easy to manage. I was a professional seller. I did not work inside Ebay offices. For a highly motivated person it is a fantastic opportunity to be your own boss. It requires selling daily to keep in the competitive market but it was wonderful The job has its ups and downsLearned not everybody is for youManagement changed a lotNo workplace culture it was all types of cultures that worked there Fast pace working environment will need good communication skills and problem solving ability. customer service is in demand due to the feedback ratings. Shipping is also very important, we want our product to get to the consumer as fast as possible. I love my job I feel like time go by quick being busy I love being busy I love people in I love to make people smile I also love my boss packing in picking it was kinda stressful dealing with very unhappy people constantly, free coffee was nice but picked up smoking due to stress of work an everyone smokes there I like working at eBay. They have great benefits and also have a great work and home life balance. I got reimbursement to take the train to work every day and also got 12 weeks of paid paternity leave. The only thing i don't like is the career advancement. They don't take every candidate into consideration equally. I enjoyed my colleagues and support the company's mission.  Middle managers are a mixed bag.  Some are excellent, some are useless.  The company tends to hire senior managers, then sticks them in an individual contributor role where they get stuck. Working for eBay is good for students, if you don't plan on making a long-term career out of it. They try to make working at a call center more 'worth it' with a game-room, cafeteria, free drinks, and a weekly snack day. A typical day of selling items on ebay consisted of posting the item for sale with a photograph on the site and waiting to receive bids. The most enjoyable part of being an ebay seller is the independence of setting your own hours. Just a job... People want everything to be done yesterday... Mostly about the project... They take a lot of time to decide on how to create the project and spend money on flying in Prod Mgrs from all over who come here and just do some talk and when they find that budget is over, the pressurize the Dev team to get the work done fast... So for a 4 months project 3 months is socializing by Prod Mgrs and dine & wine and 1 month the Dev team has to work and still then the Prod Mgrs. are not available to answer any queries. I helped manage the world's largest (commercial) Teradata instances.  I was responsible for operational excellence, user training and other performance tuning of large systems.  I spoke at conferences and conducted training all over the world. While working for eBay I can work from home at my own pace. I get to be my own boss and make my own schedule. Of course the more I put into eBay the more I would get back. While working for eBay I learned a lot about collectibles, auctions, and internet sales. The most enjoyable part of my job at eBay is working side by side with my wife. I would definitely recommend eBay to other parents who enjoy having time to spend with there family. fun but really competitive place many kids at the school wanted to sell things.sometimes we would not have enouph stuff to sales so you would t not get that much money My job was for specific client which I loved my work but it was under the umbrella of Radial which  I felt could use more coordination in the management and structure of agents. I'm ready for a new job and am a fast learner I recently heard about the Microsoft affiliates program and think that I would be a great fit for that job Assisted top 1% of eBay buyers and sellers with any questions they may have. Learned detailed operation regarding our site, billing and policies. Management was great. Daily challenges due to the vast variety of issues we would assist customers with. Enjoyed assisting customers with resolving their issues. Recommender if you are values driven. Management could really improve, by being more focused on real customer needs rather than bells and whistles.From a day to day perspective, best perk is really the people you get to work with. Most of them really passionate and willing to go the extra mile to help you out. Great work life balance. Health insurance is great and they have good options in it. company is not growing much and management need to be more efficient. Selling on ebay from home provides an awesome income. You can work as much or as little as you would like. You can sell for clients and charge a certain percentage per sale. I worked at home for myself, so many of these questions do not apply.  It is a home-based business that takes dedication and hard work. It isn't for everyone, I enjoy it more as a hobby than a fulltime job. Ebay has many activities and committees for their employees to join.  I enjoyed the fast pace and enthusiasm for teamwork building.  I learned negotiation skills, customer service, and research skills. No review........................company no longer exists.  Was not 'eBay' but an independent seller..................Company was sold and no longer exists Great job. Excellent pay. Fast paced. Always busy. So there was always work that needed to be done. Hardly any downtown.  I made a lot of money working with eBay. I have nothing but good things to say. Every initiative is to keep the jobs and engage employees.I don't see any productive output or any great innovation. compare with  amazon.  nothing else to say. Rebranding and changing the Marketplace. The brand partnership team works hard and strategically to grow, improve, and drive results for current, past and new brands. Good, stable, slow-paced environment for senior folk and parents. The benefits package is one of the best you'll find. But, if you're looking to have an impact, move quickly to beat the competition, build something new or advance your career, eBay is not the place for you – they like to stick to the status quo and not rock the boat. I set out in 2006 to start my own online store and eBay has been an excellent platform to do so. I have gone from making $500 in a year to my 2016 posting of $16,700 in sales. Being in charge of my own success has taught me a great deal about business ethics and successful marketing. in 11 years of sales, I have never received a negative customer review in over 4000 transactions. Too many events occurring at one time nationally and globally to keep up with. Too many meetings to be totally productive. Too many on the fly changes and misinformation form SMEs Working as an ebay technician, I would take orders and go to the warehouse and fill those orders.  I also handled ebay emails with complaints and refunds and credits. El trabajo depende de e-mails  de la empresa que de acuerdo a ellos son los horarios de trabajo semanales. Aprendi a publicar online productos para favorecer las venta, gestionar la atencion al consumidor y la manipulacion adecuada de  productos para envios nacionales e internacionales junto con las normas de la empresa. La parte mas dificil es la atencion al consumidor especialmente la atencion de reclamos, porque debes tomar desiciones a favor o en contra de la transaccion.Lo que mas me gusto del trabajo es conocer otras formas de ventas y aprender lo que favorece a las ventas. Fun environment with many career opportunities. Received great benefits. Not very helpful in getting employees where they want to be within the company. Its been great the work that a I do as a Part Time Seller in Ebay. I get lots of sales for all my items that I have sold in the past. Quick and easy, no hustle! ebay has a very balance culture within the work environment and encourages diversity in the workforce.  They do encourage inter-departmental collaboration in solving problems and creating new opportunities which helps in balancing out the work load. fun but really competitive place many kids at the school wanted to sell things.sometimes we would not have enouph stuff to sales so you would t not get that much money Ebay is a great platform for the individual looking to make an alternative jump in the employment market.  Simple and easy to use, I'd recommend it to those who have products to sell. Fun and full of opportunity. Lots of new projects to work on and meeting new people from different backgrounds allows for inspiration to venture into new fields. Ebay/PayPal are global companies with global presence.  This can be challenging if not primarily located in one of their established sites because the result is significant travel.The team is great, the technology is great, the travel takes getting used to. It was through a temp company. most of there IT jobs are. we didn't have any holidays off and didn't get holiday pay. We also didn't get PTO or benefits. the environment was fun, they did a lot for there employees like weekly lunches, free drinks every day, the campus was beautiful and they had spacious desks Working for ebay was one of the best experiences I have ever had! I met amazing people and made friends I can call family! The pay was amazing, and the work wasnt too bad neither! I do ebay from home. The work is enjoyable but the income is not reliable .Its nice to work from the comforts of home but, you are disconnected from the workforce structure and the relationships you form with coworkers.That is probably one of the hardest parts of working from home.I prefer to work in a fast paced company with room for advancement . I was my own boss selling second-hand clothing on EBay.  I enjoyed sourcing the clothes and writing the advertisements as well as providing customer service. A sometimes good company to sale several items, but the percentage for each sale has increase lately. Too much pressure when buyers are not honest.It is hard or impossible to resolve a dispute with new buyers. Definilty a full time job and then some. This is an all consuming job. Between looking for the item, listing the item, taking the photos, pricing the item, coming up with a good sales pitch, invoicing and shipping. Then you have to insure accounts are paid you’ve spent numerous hours on one item. But to see the customers satisfaction makes it worth it. And you get top seller and power seller awards. That’s rewarding. I enjoyed getting those awards. And to see your feedback build is energizing. All in all it’s angood job but it is a full full time job Some technically good people. Many in the middle management are incompetent.Work culture varies across teams. Some teams are heavily loaded while others are very lightly loaded Not sure what to say since I am self employed. I work from home selling my own items. I make a few bucks off these said items and Ebay takes a cut. Nothing more, nothing less. eBay is one of the best company to work .Lots of benefits ,competitive pay and many more facilities available for employees.Lots of learning and career growth I spent many years at eBay and, in the beginning, it was exciting and our opinions and ideas were encouraged.  As the company grew, they became weighed down in middle management and lost touch with what our members wanted.  tT For the most part they are a decent company. However the management is very poor. There isn't really a structure system. They do what they feel like instead of doing what needs to be done. The manager will tell you what you want to hear verses actually listening and taking care of the problem/issue. The workers there are great, if anything I do miss working there with them. The best part was getting all the items listed and watching them sell. I liked shipping. The hardest part of the job is no stable income or benefits. Took Inventory and Managed Taxes. The job was very enjoyable and I worked with a lot of great people. We sometimes needed to work on a team for something and we always had a blast. The hardest part, I would have to say, would be when it got very slow and there was not much to do until you got your next client on the line. I love this company with all that's in me. Training was informative and engaging, which set me up for great floor success. The support is phenomenal! Metrics are not that difficult to meet as this center is really a customer driven call center, unlike most. I was able to mentor (internal training for new hires) shortly after going into production. I had to move which sadly took me from my job, but I will always be an eBay member. Thank you for such a rewarding, family oriented, culture rich environment. I make your own hours work from home.I buy things online, flea markets and garage sales I sell them online it's a fun job but there is no benefits / Healthcare in this job. I liked working there, I learned many things about many different products. I learned to manage and fulfill orders in a timely manner. I would work there again if I could. fun but really competitive place many kids at the school wanted to sell things.sometimes we would not have enouph stuff to sales so you would t not get that much money Many marketing roles are now outsourced overseas. Tough to find the role you want these days. All in all most managers are good about helping you achieve work-life balance. Holiday season is brutal and work life balance will be challenged. At times eBay gets ahead of itself and tried to implement without proper infrastructure in place. At least that’s how it was in marketing. I work for myself and I dont pay myself very well and I do not give vacation days. My boss demanding and cranky most of the time. I need a day off, but he does let me get up from my desk. Great company, takes care of its employees and encourages innovation and growth! Leadership team encourages individuals to seek their dream career and work towards that by partnering with their TL and Coach. I work for Security Industry Specialist, which have the contract at the ebay/paypal data center.  My management is very poor, the running joke among the other contractors there, is if they know they need something from security management they can just forget it. Working for eBay was exciting refreshing,working with a team was awesome management work place was up lefting the hard part was just temp work. I sincerely enjoyed working there the support from management was up lifting, the work surrounding were awesome with the awesome work stations break rooms were very bright and cheerfull . the work is pretty great if you like to lift all the time. some of the people are cool and easy to work with and some people are not. the is great though. I never worked for ebay but only worked on an ebay account for a company that used it to sell merchandise. Overall, it was easy to use and has very tight security. If you know what you're doing, you can make some good money flipping (buying/selling) on eBay. The website is easy to navigate, and account setup is fairly simple. I work 5 hrs, 4 days a week. I learned how to operate a wrap-pack machine. It was easy to make friends and management was always there to help. The hardest part of the job was walking the length of the warehouse several times a day when on support for the packing line. The most enjoyable part of the job was winning the Halloween Contest taking First Place! It was lovely exprience with ebay and  fun workplace place and They also had some pinball machines. Open work environment, so it can get loud. Team is a blast to work with, and the management is great. Free catered lunches. Great place to intern at, and likely a great place to start or continue forward in a career It's incredible , because they giveaway.hey care about your health, they pay wonderful, sometimes in exchange of money I get iPhones, eBay is the best hope I could find one just like that. Working via Ebay allows me to control my day and produce with no limits. I believe this will be the way for the future worker of a home based business. Great ideas, strong future and adapting to change.  There's lots to say about eBay, it has a great / established history and is highly focused strongly on re-branding and reinventing itself as a new company. ebay has gone downhill and has bad service help for issues.if they take your account you cant get it back, and you cant get a new one because they flag you and your paypal. IT was a very easy job but fun, Enjoyed all the merchmerchandise,Very exciting watching stuff sale and getting in out in timely manner,Really enjoyed my job. EBay is a great company, great  projects, great benefits. Lately there has been a culture of constantly changing management, which hurts a lot of things! very good Job Work/Life Balancevery good Compensation/Benefitsgood Job Security/Advancementvery very good Managementvery good Job Culture NANANNAANA As a Senior leader it has been a great place to work and develop skills and resources. With eBay selling us we moved from a customer focused both internal and external focus by moving away from our core eCommerce Practice.  The Private Equity firm has been clear with us Senior leaders regarding their desire to re-sale and recover their investment. At this point my skills and leadership ability as well as ability to build and drive operations would be benefit other companies lucking for experience, energy, depth and excellent clients facing skills. eBay really cares for their employees whether you are a full time or just a contract. It has a very welcoming environment and lots of great perks. Culture is everything here. This doesn't just mean a cool coffee bar, cafeteria and foosball tables. It means that the campus feels like home. Everyone is nice and loves working here. One of the best Silicon Valley companies to work for. team is good.  co-workers are smart and nicetech is advance.  analytical team and methods are better and more advanced than others. marketing campaigns are complicated and very comprehensive. fun but really competitive place many kids at the school wanted to sell things.sometimes we would not have enouph stuff to sales so you would t not get that much money Working on ebay was rather exciting. You get to manufacture your own products and present them to an audience which can be educated in what you do already, as well as educating and presenting to a brand new audience. Because every part of my work is performed by hand, when lost partial use of my left hand, it became a problem. While I maintain enough control that I can still do modified HIT strength training, I no longer have quite enough control or endurance to keep up my artwork. ebay is a great place to work on real world problems, technical astuteness, test and learn environment with customer focus. I learnt a lot while working at eBay. What I like about eBay is that I can price my items, set my own hours and be my own boss. I love to have an extra income that is set at my own pace. eBay has been a great second income that has opened many doors for me and is one I highly recommend for a stay at home person or someone that needs to work from home. I would build and customize 6' scale action figures to display them on-line for sale. After collectors witness my portfolio, they begin to message me about commissions. I'd work within the week and ship to the buyer within two weeks. 100% positive feedback and ratings. -Strong job culture -Supportive management-Perks-Involved in community-Top health benefits-Paid time off-Paid sabbatical-Maternity/Paternity leave Working as Ebay seller, it allowed me to schedule my own working time and I do work at home.  I do have more time to spend with family.  The negative point is Ebay monopolized all rules and regulations.  For instant, a buy can not make a purchase transaction without paypal account. One listing can take hours to get everything right from the location of the item to the specifics needed for the description, photographs and the purchasing process which can be very time consuming as well, for the amount of time I spent the financially compensation is just not enough. eBay is an amazing place to work! The pay really well, They have free vending machines, they bring in a company to feed everyone once a week. They truly care about each one of their employees. Expected to work above 40 hours a week and be available all the time.  No option to advance. management only cares about numbers and not employee health and stress levels are high for everyone Here, you work with kids, some may be good, some may be bad. If you like working with kids then you should join this program. I loved working at my first site but things happened and I got moved and I didnt like that. it was work. changed jobs either explained already or needed more money, or baby sitter issues, iu have been working from home since 2001, need work,, Its a great company to work for. Great pay and benefits but definitely micro managed and leadership changes too often which can effect progress and movement. It is great and a fantastic place to work yes it is fantastic having a wonderful job. Every morning I rise and shine and head off to a fantastic job, thank you very much. The outsourcing industry seems to be unstable. A number of contracts have pulled their business from MarketStat in the past 2 months- a good majority of the team is nervous about the stability of their contracts. The culture of the company is pretty good. Senior management is awesome! decent way to make money as a student without worrying about hours. Things can be listed and then shipped out when someone buys it without needing to be at it for hours. Great place to work with developing culture.  CEO engaged completely with company mission and developed a great attitude for others to emulate.  Loved attending quarterly business updates and seeing progress being made and feel empowered as a part of a full functioning team.  However, senior management did not effectively communicate with their teams and understand the challenges, leading to a lack of trust at times and concerns on what direction the team was moving towards. To work in ebay is very good experience. Had a chance to learn new things.work  environment was great. Had a chance to work with best team. Management is also  quite good. Work life balance and great work culture makes ones life easy to work for ebay. Great campus and facilities are good. Flexible timings and commuter service available for people commuting from across bay area. eBay is a platform I use to sell goods, I was not employed by eBay. I would buy goods from sites like liquidation.com and resell them on eBay for profit. At first it was good business but now things are not going so well. I am self employed & Business has been slow .. Great part time / full time income that I can make my own hours up as needed. I work from home and travel is light.. fun but really competitive place many kids at the school wanted to sell things.sometimes we would not have enouph stuff to sales so you would t not get that much money Great company just starting out - it was very profitable. However, over time they started nickle and dime you and it became very hard to make money... Great benefits, great people and great atmosphere. If you are willing to work hard, take some risks and put yourself out there you can do grow and excel. I worked at eBay for 17+ years. I couldn't have done that if I hadn't felt I was treated fairly and equitably. Lots of room for advancement if you're motivated, and leaders are very fair in work-life balance, compensation, providing a positive, uplifting culture. The benefits are excellent. The managers are not the best, but compensation is fair.  Many many changes to adjust consistently. Culture is not bad. Changes bring layoffs and adjustments. Big corporation now. Employees are just numbers. Excellent customer support and buyer/seller protection. The few issues a had with selling my items had nothing to do with this business but rather USPS in shipping and delivery protocol. Highly recommended. Using R program to record, transcribe, visualize and distribute sales Data. Purchased and maintained supply inventories, and being careful to adhere to budgeting practices Worked selling on eBay for 9 years. Its fun and you learn a lot about business and products. Depending on how you do the job you can make your own salary and really have a go get em attitude! Fun overall self paced job that really can be rewarding. I was a seller for eBay so it was basically self employed because I would sell items that was either rare or I knew someone else will want it. Some days it will take forever to find a customer some days it wouldn't. But overall it put money in my pocket. it can be stressful, you must have a lot of patience, but overall a decent job for the pay. It is ultimately a job that  you will succeed with as long as you follow instructions and guidelines given by your supervisor. It is a very large call center, but had fairly adequate amount of supervisors. I hated working at ebay they overwork the employees and under pay them,Your always on your feet and they don't seem understanding nor do they see that the employees need bath rooms breaks. They spend a lot of time telling lower level managers they have to play by the rules.  They have to follow the policies and procedures.  Then the Senior Leaders don't set the example, blindside people, say they will coach, but don't.  The culture is promoted as being very positive and employee oriented but it is not eBay is basically a good supplement income job. It is fun to go to auctions and search for items to buy and resell. Competition is high for someone is always lowering there items more than yours and finding a wholesale company to buy items in bulk for low prices. I was a contract worker, and believe they should invest in their employees. I liked the people in my team, but it is very silo-ed off. I guess I would say that they need a better business model and category tree. they are way behind in e-commerce We included our eBay store with our retail store and online forum for motorcycle parts and accessories. We were a small office and slow paced.  We owned the company and sold after a couple of years. No work/life balancePoor managementLack of accountabilityOnly room to advance if you sped your day shmoozing. do not plan on promoting based on merit and work alone. This was a great way to manage your own business. I learned some great skills and was able to make some good money. Great as a side gig as well................ For me it was a relatively easy job, it just became repetitive and customers started to get on my nerves complaining about orders on a daily basis, but breaks lunches shifts etc were all great in my book, had a break lounge with pool table etc and vending machines. No Proper directionStressful being a consultant.Did not enjoy the job.Will not recommend position in the same group to anybody else.Work culture is the worst part. The place was in Ga, and now is known as Radial, I don't know anything about the business now since it was changed but when it was Ebay Enterprise. It was my favorite job. This job was so much fun. I answered calls for all companies but ended up with a permanent job in Keurig. If you had questions or needed help, there was someone always there. The opportunity to advance was very easy if you were excellent at your job. I found it amazing that every week or so your Supervisor would take you into a room and grade a few calls. They really stressed teaching you the best way to handle calls. Always opportunity to have overtime. During seasonal times it was hectic but the supervisors and managers took pride in making it comfortable. Throwing minis parties and get breakfast and coffee alot. The company also took a huge roll in giving back to the community every chance they could. • Provide top notch customer service in a fast-paced environment • De-escalate calls while delivering difficult messages to customers in a way that creates a positive    customer experience• Maintain high performance metrics including average handle time, after call work, quality, adherence, as well as customer satisfaction• Ability to work independently while doing what’s best for our customers• Involved with all aspects of customer service, including solving problems, answering questions and working with customers to ensure fantastic service fun but really competitive place many kids at the school wanted to sell things.sometimes we would not have enouph stuff to sales so you would t not get that much money I loved it.. Would love to work there again.. Picking and packing love doing it..Wouldn't mind working in a warehouse again..I worked hard to get where im at I like the job it was ok i jus didnt get enough jobs an the job was a temp job so we got laid off after the seasonal position was over there was no room for growth It was okay for a job, the pay wasn't too great but they changed it now. As long as you stay to yourself you should have nothing to worry about but it wasn't that bad. It's a factory place so no phones and earphones allowed. I was assigned to packing, so I boxed up boxes and had a headset on following the instructions from it; which told me what and where items went. Once I had everything wrapped up and in the box I'd put a sticker on it and place it on a moving belt next to me. Working with Adecco was very easy.  They make sure you have all of the tools and knowledge that the job requires.  Unfortunately, working with them is very unstable.  the job assignments are short and there is no warning of upcoming lay offs. It wasn't a bad just, just the hours and shifts were always changing so it was hard to get into a solid routine. I would recommend to anyone just starting out in the workforce. Think it was a nice working place with fun people to be around.The pace of the job kept you moving and also made time go by faster. Hours were long and tough but by end of week paid check was well worth it. This job has a very structured environment. They do a lot of business during holidays and will almost let you work as many hours as you like during that time. EBay was by far one of the best jobs I've ever had. Ebay is a company where you can start on the ground floor and go as far as you want based on your own job successes. Everything seemed to change when eBay spun off the company and it became Radial. New owners split the old company into three divisions, only one of which actually had sales. This led to budgetary issues and an exodus of top talent. Layoffs happened after that, leaving people either unemployed or scared for their jobs. eBay was by far one of the best jobs I've ever had. I wish their scheduled needs lined up with my personal schedule because I'd love to work for them. Learnt lot of things.Focus on people development.Attended lot of management trainings/programs.Initiated technology mentoring Program. Was selected for Emerging Leaders Program. Easy to make money selling items on eBay. The hardest part is making sure to sell what people will buy from you and making sure you sell items at the right price. My job was to train and coach staff on customer service - and to review individually with the team the progress and shortcoming. This included identifying weaknesses and opportunities for improving performance. As an eBay seller, you take a lot of risk for very little reward. I made $2000 profit but took 4 months to do so. Heavy competition and making trips to the post office also got very old quickly. It was a great experience looking back but I wouldn't recommend unless you're going to be selling a quality product and have a good game plan. I was self employed during this time when I was listing vintage items on Ebay and selling them.   I would select the items to sell, take a picture of each one of them, (making them as artistic and balanced as I could) and then listed them, which entails data entry abilities as well.   I loved it and still do it on occasion when I find vintage items to sell. Not a hard job at all, I loved it and of course the most enjoyable part of the job is when I sold the items.    Some times with a very nice profit. Busy fast paced fun job. This isn't really a fair review as I'm self employed for the time being and am essentially reviewing myself. I get to choose my own hours! It was quite convenient to work from home and to have the accessibility to products and customers. I was able to have hours that worked with my schedule. Started this company with a partner and bought him out in 2015. Have hundreds of items listed for sale online store named Crichway with daily sales and package delivery. The best thing about working at ebay was staying busy. They rarely ran out of work. The management was very considerate and they had no tolerance for workplace discrimination. fun but really competitive place many kids at the school wanted to sell things.sometimes we would not have enouph stuff to sales so you would t not get that much money I loved working here, but with my anxiety, working in a call center is not the best thing for me, you have to have a hard shell in order to work at a call center and handle some people and their attitudes Unlimited potential to earn and as much creativity as you like.  Being your own boss is great when you have young kids and a lot on your plate.  Highly recommend Started in 2012. It is harder to sell now than it was then. Less traffic. fees are high but the work life balance can't be beaten. Overall I have enjoyed the experience. Ebay allows ability to work independently. However, seller fees can add up and get expensive if not managed properly. Allows freedom to manage household and continue education while working from home. Company was proactive and fun.Moved up fairly quickly.Enjoyed helping customers.Team atmosphereDecent payOvertime Available in busy peaks.Extensive Training. great work but you need to not have a soft heart.  There are a lot of rude people on phone that treat you like scum.  eBay will not protect you when you find yourself on other line of a bully. Reaches a wide variety of buyers. Easy to use and create business for small time seller. Able to advertise a few or many items at one time without expenses for listings. Pay when sell item. Able to choose shipping method and cost. Very typical customer service job usually seasonal. Gets bought out every 5 years. Only real industry in the community so it is a great place to start if you are in school or want to advance in life. Most workdays take place on weekends when you are looking for things to sell. Any product you find could be sold on eBay, so you need a very good eye for it. The job can be stressful at times when your salary depends on you and managing the business. There are good days and bad days. Some product may not sell and you risk the chances for buying things and never knowing if they will sell. I started this business when I was a freshman in college. I learned a lot about product and supply management. What I learned will forever be ingrained in me, and I will always turn back to those times when I have questions in my future jobs. I would spend my day either taking calls, or making calls to customers who were having problems with the website. Lots of tech errors could happen so I would often have to strongly problem solve to figure out why, and how we would fix these for next time. Consistent scheduling. Above minimum wage pay (even for entry level). Paid two week training. Revolving door for staff employment. mandatory overtime during holidays. eBay, is one of the most relaxed call centers, as well as, the most productive, and well put together. Ebay geniuinely cares for there members, and the pay is nice. I started in the call center and then moved to work at home. My supervisor was very helpful, and patient. Benefits were extremely good, and paid time off was awesome! I worked for Ebay Enterprise for 4yrs and LOVED it!! eBay represents a strong culture of their values and goals. Company provides a wide spectrum of benefits.  Driven by success, lacks communication with employees occasionally. Overall it is a great company to work for. I Enjoy my job working on Ebay as a seller and Small business owner, I just want something with more structure to do full time, as I've been doing eBay part time for over a year now. What I stated previously about Midwest Service & Supply also applies here, as this was our own store on the eBay site.  They really focus on each employees strengths and will find a place where you fit.  The staff and management go out of their way to create a safe and friendly work environment.  They are all about productive fun! I liked my job as a packer better than a picker. only downfall was standing in one place for 8+ hours. I do feel that they expect a lot out of you considering the pay that they offer. great working there it was nicegood supervisorpeople worked togetheralways on timegoodgreatawesomebetter always worked together with one another awesome people The scale of traffic is amazing. The amount of data being processed is impressive. The tech stack is very outdated. A lot of poor choices when it comes to tech stack, too. Very busy order filling business. Management is fair and wanting you to succeed . The Christmas rush is very fast paced. The hardest part of the job is the hours if working the weekend shift. 42 hours in 3 days is rough. fun but really competitive place many kids at the school wanted to sell things.sometimes we would not have enouph stuff to sales so you would t not get that much money I personally worked at ebay during there peak season which was honestly a physical nightmare and a wallets dream. working in resolutions was really enjoyable up to the point that peak was at its absolute worst. the job is highly physically demanding both on your legs and your arms also the high shelves in the racks were extremely hard to reach for some one 5'3. working at ebay taught me to be more active and to push through minor aches and pains in order to receive what you are working toward. the management here is not very personable and genuinely treats the employees like nothing but numbers. however I did find many people I worked with to be highly kind and enjoyable. I loved working at Ebay Enterprise...The job was wonderful. A little stressful but it was a very good place to work. I would recommend this job to friends and family only job in town, no work life balancetied to emailon call 24/7frequent travel requiredcompany changed hands recentlyhad to leave due to workforce reduction ( let 2500 people go at one time) Talk to different national people. You taking orders or help solve a situation with a order. Stressful and quiet. Team of different station.deal with customer satisfaction great place to work, got two referrals in the door and wouldn't mind telling all my friends to work there. the environment was not stressul for a call center nor were they metric drivin like you hear other call centers are. You can work when ever you have the time but you have to have items to sell which most of us have things we no longer need or use and get new all the time from gifts and other places. You can work your own hours, sell whatever you want to, take vacation when you want to, just realize that you can't make money if you can't ship orders. I'm new to business and want to learn as much as I can. Even though I'm only an intern, I still gain the corporate experience and culture experience that comes along with working at eBay. I work on the intranet and help enhance and bring the experience to the employees globally. Bringing people together through effective communication is something that I truly enjoy. eBay is involved in cloud, Kubernetes, OpenStack, various Apache projects, and global datacenter/networking and infrastructure. And of course its the beloved application of eBay... Associates are treated for the most part like second class citizens. They are 'talked down' to and disrespected daily. I learned that in some cases you are nothing more than a number and if you aren't producing as your management thinks you should you are completely expendable. The hardest part about that job was not returning the disrespect that that was being handed out by the management. Rough workplace, management needs work. But if you work the weekend shift its condusive for school and worth the work. Pay was alright, benefits were lacking Training class turned into high school drama. When I reported lewd and inappropriate conversations when the trainer left the room I was then ostracized and harassed by the immature trainees. Protect and serve the ebay employees. Ones job is to patrol not just the outside of the building but the inside.  Constant communication is required as well as knowing the commanding codes of communication. Enjoyed my time working here with awesome co-workers. Free snacks and breakfast food. Near the Irvine Spectrum with great shops and restaurants. Learned a lot working in tech support. I dont feel like writing anything here. And i tried to buslhilt the review several times but dang you indeed you would not let me copy paste my answer. I Have leaned so many thing over in all the companies.what work is to be,how to work in all the environments.this is thing that i learn.please go throgh it and provide me a another new project *Climate-controlled workplace*Learned how to pick and pack orders accurately and according to audio machines, played by ear and numerals*management had patience and professionalism, while constructing employees to be safe and accurate per order selects* Competitive pay, however every week heavy overtime was offered weekly eBay is a great place to work with superb Office and office culture. U wud just love the place the way it is. Very nice people and managers who make working such a fun. Was a fun experience owning and operating a business. Making jewelry and selling my product could be tedious at time but was all around an excellent company Ever.Now this was a long time ago, so I cannot state the current situation but I would really check out who your manager is so that you are aware of things. fun but really competitive place many kids at the school wanted to sell things.sometimes we would not have enouph stuff to sales so you would t not get that much money Ebay has been a great place to work, i have grown exponentially with working with the co-workers that i have been dealing with for the past year. Would recommend Ebay to anybody to work there I enjoyed my time at GSI. I left the company when i mived out of state to pursue bachelors degree. Management was great but there was a high turnover rate. A typical day at ebay was high stressed. It was miserable. Getting death threats from customers all day while you are around stressed coworkers is a horrible working environment. Constantly getting sick from poor hygiene. People actually wore surgeon masks so they would get sick. Blood on the walls in the bathroom. They will hire anyone, including drug addicts that would use drugs in the bathroom or the back of the building. The pay was not enough for the amount of stress and the terrible environment that you had to work in. Excellent time management! Work as many hours as you like, clean your home and make money. Supplies can be costly, but in the long run receiving excellent customer satisfaction is the goal and is worth every dollar spent. Returning customers are a priority for a business to succeed. •	Tested account system changes by upgrades and inputting new data•	Secured information by completing data base backups.•	Maintained operations by following policies and procedures; reporting needed changes.•	Maintained customer confidence and protects operations by keeping information confidential.•	Contributed to team effort by accomplishing related results as needed. Back to Back Phone callsExpected of 20 seconds or less in ACWbreaks reduced to 5 mins everydayPTO is greatgood benefitsSupervisor work balance needs work Salt Lake City office has too many levels of upper-management. Directors are often uneducated in new strategy, and dismissive of change to old-school call center culture. Company wants and tries to have progressive culture, but result was leadership abdication and confusion for leaders and rank and file employees. When all was said and done, it was an awful lot like other companies - all about the money and very little about the employees. My experience with Ebay Enterprises was a very good overall work experience. The management was very helpful anytime I needed their assistance. And the incentives they provided their workers were also very good. Ebay was an amazing place to work at. Awesome teams, moral boosters all month long and cafeteria always stocked with goodies! My only issue was there is no room for personal growth. You have CSR that goes to coaching that can be promoted to supe and thats pretty much the areas within the call center. Wish there was more diversity when it came to opportunities. If there were other areas provided i would go back in a heartbeat I've not yet met a salaried member of management that has had a single positive input regarding the direction or mission the company is headed. The last year the organization has been under a restructure and with it blended eBay and Innotrac associates.  Many are also previous UPS employees. It's a good ole' boy network. If you're not in the click....FORGET IT. eBay is a fabulous company to work for. The culture is great, the management is great, and the people are great. Benefits provided are more than expected, as well as some pretty sweet perks like free soda, ping pong, and foosball tables. eBay has amazing benefits. They need to work on their culture though. They have an on site cafeteria which is nice but expensive. Also has a coffee shop and on site gym terrible treats you like your just a number, management is unprofessional and no one there properly trains anyone there. i got fired for doing what they trained me to do This job was my own personal side business. I do not have very much to review as I only worked with one other partner, But it helped me develop skills in sales, management, and inventory management. eBay is the best company I have every had the pleasure of working for. They provided me the opportunity with grown my skill set and apply my new skills to benefit the company, all while maintaining an amazing culture. eBay was a fun place to work for a year but the low pay and difficulty in moving in to a higher paying job left me unable to keep this job. I simply needed more income. It was a good place to work for someone who needs fast or seasonal employment. I worked there seasonally through a recruiting company and it was a good job. Ebay was my first opportunity and attempt at running my own business. You are given much autonomy, which is a great thing, but at the same time, you have to take responsibility in each and everything that you do.  Just like any other job, you really have to pay attention to detail to increase sales and keep your customers satisfied in order for them to come back to your store again.  I put much effort in to my listings with good visuals, and clear and concise explanations of the products.  I set myself apart from the other sellers that sold the same products by identifying the customers' skin type, and recommended specific products that were the most suitable for their skin type.  Communication via message through Ebay was always ongoing, and I had to package and ship all the orders myself.  I enjoyed this job since I was extremely passionate about the product that I was selling, which was called Skin Food, but they ended up opening up stores in the United States, and sales started decreasing significantly since all my buyers were based in the United States.  Through this job, I was able to learn the importance of customer care, and it really showed in the gradual increase of sales since regular customers kept coming back to my store even though other sellers were selling the same products at the same price. I continue my Ebay site that I call Debbie's Gallery of Collectibles with the extra store merchandise that I was given to sell once the family gift shop closed down. I then encourage sales with my sewing ability and my embroidery sewing machine to personalize Christmas stockings, door hanger signs, and baby blankets. I have created stuffed animals, potholder hot pads, small baby blankets, wall hangers, door hangers and aprons. fun but really competitive place many kids at the school wanted to sell things.sometimes we would not have enouph stuff to sales so you would t not get that much money ProsGreat work/life balance and flexibility when neededOpportunity to voice concerns or ideas and management listens and helps to determine ways to bring the ideas to lifePeople are genuinely nice and always willing to help or point in the right directionConsMany people don't know how cool or awesome Autodesk is so there's a gap when trying to explain been years working for marketing.is my passion. but i decided to change my job due to low sales.great customers service and salesshippping is fun and profits are outstanding.will definetly recommend anyone to sell there. Went to any available computer in the sports section to work atLeaned how to up sale a productManagement was always there to helpThe hardest part of the job was getting connected to the help desk for the customer Co-workers are nice. Willing to help; answer any questions. It can be quite busy with a lot of work to do. Some room for growth however not ideal place to learn new technology. Great job with excellent benefits and good pay. Terrible management.  Made simple things very difficult. Often want you to come in on your days off or change your schedule with little notice. Company is consistently going down hill. Losing more and more clients. Customer service comes firstI've learned to be polite no matter what, Speak impeccably to even the roughest customer.It's easy to organize my business as I work out of my home and a storage unit.Awesome freedom! A typical call center. Company has good benefits. Free drinks. Free food once a week. Sign up bonus and quarterly bonuses.Take inbound calls. Some customers can be difficult. EBay is a company that actually cares about there teammates and does everythibg they can to help you out leaders actaulky answer questiins and will do research into what you need help with. HR is ridiculous loved it and wish i could have stayed. i was one off the best pickers and packers they had. went back for four seasons to help them with filling customers orders Company was great until its last year, when they sun-setted our platform and we no longer had anything to sell.  No real advancement opportunities though. eBay is great for those looking for a competitive fast paced working environment. I really felt like I had a voice of change in the company. Management was wonderful. This review is kind of silly. For instance, it asks below If I like the CEO, Yes or No. I was a seasonal worker at a eBay warehouse in Kentucky, what on earth makes you think I know the CEO of the entire company? As for the job, I loved it! It is, so far, my favorite line of work. I wish it had been a long term position. Good place to work for. 16 days vacation on hire date. 30 min lunch you can leave facility. Fast pace. learn more about e-Commerce and online shipping. Lots of room to grow and learn. Absolutely one of the best call center opportunities available. Had I not lost my truck and health for a bit, I'd still be there. Still, having worked in the company for a while and learned what I could from my position I am seeking other jobs where I might grow and expand. This company offers amazing benefits but is a tough job.  It's all about perception and reputation so don't mess around!  I miss the pay and benefits.  Do the bad job for a good pay. A typical day at work: Work,lunch, work, go home.What I learned: N/AManagement: Little to know interaction with managementWorkplace culture: Diverse The hardest part of the job: Overall I had a good experience. However, there was a big lack of advancement opportunities. There were also issues with misinformation from management, and poor communication strategies. Great work/life balance. I've learned many skills needed for sales. It was a great company to work for.  The benefits of this company were generous. I was allowed to create my own schedule. Great work environment and amazing management. It was an easy job to maintain and the pay was steady. All shifts were available and management does work with you in case of emergencies Answer incoming calls from customers to take orders, answer inquiries and questions, handle complaints, troubleshoot problems and provide information. Main Job Tasks and Responsibilities. ... provide customers with product and service information. fun but really competitive place many kids at the school wanted to sell things.sometimes we would not have enouph stuff to sales so you would t not get that much money They have high expectations but give you all the proper training you need in order to complete the job. They do a lot of customer appreciation and have excellent benefits. Great hours. Many different shifts to accommodate everyone's lives. Worked 10 hours shifts, so 3 day weekend was nice.Management were nice, lots of small group events.Fun environment and diverse and fun coworkers.External events sometimes created a crunch, company growth could be chaotic. eBay solutions was an enjoyable source of valuable experiences in which I took full advantage of to mold and detail my researching and data entry skills. During any typical day at the shop, I would exercise what I have learned in the beginning of my time with the owner at eBay solutions by researching whats selling and locating the target buy to turn it into profit. Collecting the right information about the product and categorizing it all on to a spread sheet was definitely the hardest part of the job, but making the sales and seeing the money coming in was the most enjoyable part of the job. Over all, a great place to work. ebay is and amazing place to work. A place full of fun goal oriented people. There is plenty of room for advancing within the company. The hardest part of the job was being team lead. Having to step back and lead rather than do the work myself. But the best part of the job was the gratitude and thanks and happy energy from everyone everyday. This was an excellent place to work with great people, the ability to be a free thinker, free drinks, game room, birthday celebrations and a relaxed option for clothing. I worked third shift which was a smooth shift it kept me busy which made the night go fast. I became a people person.I learned to work a line as well as a forklift. eBay is a great company.  That should be the end of the story but there are so many layers of management that making decisions is impossible.  Those with the authority to make decisions are so disconnected from the work being done that they pull the people doing the work in one direction after another without rhyme or reason.  It is well known inside the company that there is a decision making problem but the people making decisions seem to think it is everyone else problemI actually think company leadership is pretty good it is all the mid level managers that can't seem to get either strategy or execution right. eBay really helped make you feel like they wanted you there. There were unlimited drinks and you could work at the on site GYM at any hour of the day or night. Good place to work and worked knowledgeable people. It was a team oriented group that worked in a high technical data center. We had good leadership and it was a great learning position. When I started at eBay the culture was more of a start up feel to it. Towards the end of my time there it felt like things changed to a more large company model. Not as much fun but still interesting work. Daily routine was monotonous but the job itself was invigorating. Management was amazing but had their moments. Benefits were subpar but time off was given when necessary. Overall, a great place to work. Advancements in the company were offered consistently but seniority won in the end. A fast paced commerce company. Provides sabbatical and quarterly vesting RSUs. Has good technology talent. Lot of cool projects to work on with niche technologies I loved working from home although you don't have much communication with other people, it can be very busy, especially at holiday time.It is kind of nice to go to work in your sweat pants. Limited internal promotion opportunities. Very limited management training and professional review. Learned a great deal due to a lack of upper management support. Enjoyed the job and not the politics. Fun place if you like call center work. It can be a stressful environment at times but it can also be a lot of fun. People are nice pay isn't bad and the setting is alright No clear vision of where the overall company was going after being sold to an investment company.Very high turn-over in the corporate center and then following in the individual locations.  When sr. leadership start jumping ship, you know you need to start looking. very fun place to work at. everyone was nice there. nice pay. nice hours. lots of good work. good management. they would always check up on you to see if you need help. Took inbound calls for customers that had questions on their accounts. Could get pretty busy. Management supportive of employees and constant training. Room to advance, but hard to advance at the same time. Many opportunities to learn and grow. If you need a job just to need a job. this is the place. Not too many people to talk while working. Very independent job. Free food and gifts during the peek season. Great place to begin your career with extremely smart people. Agility to move around in the organization. Poor decision making at upper management level. However, roles below director level have good scope and opportunity fun but really competitive place many kids at the school wanted to sell things.sometimes we would not have enouph stuff to sales so you would t not get that much money Love what eBay stands for and the values and commitments it holds as a company. Throughout the last 5 years, I have seen a shift in focus from large retailers to med and small sellers - and from new, in season products to the spectrum of value. These fit eBay for the next generation and I am happy to be contributing to this. You always knew what to expect. Positive management, clean working conditions, Always received breaks and lunches.The hardest part was 10 hour days and scheduled 7 days a week for the peak season of the holiday projections.Gave notice that I would like to come back at a later time. They said not a problem because I met my quota of Units per Hour. If you like being on your feet, or keeping busy this is the job for you. I enjoyed working at eBay( Which is now Radial) because of how efficient the job was. It was easy, and fast paced. Plus the pay was always good. During peak you get a lot of overtime hours as well. So if you enjoy money, and fast pace work. This is the place for you. workplace culture: First day join the company, there is a good orientation which you will learn about the company structure, including building arrangment, meeting areas...Company provide detailed power point to help you get what you need; Great place to work with great benefits for senior level employees.  Downsize is that the company is changing and trying to adjust to shifting market trends, so whole departments can be affected by layoffs. Very good company to work for and a lot of good people employed there. I don't have anything bad to say about this company. We would have team meetings in regards to different company updates and also on policies. It was good I just worked temporary and it was a good job I wish I could have progressed to go further and I like the job overall it was really nice place to work at Ebay is a very productive company, I enjoy working for them, its fun, professional and rewarding. management are very easy going and supportive, and I learn for them every day. I met some of my best friends while working at eBay.  I cherished my 4 years at eBay, and I was happy that I was able to move up in the company ladder... We have worked in the resale business on and off for 30 years. We have found Ebay to be quite productive financially. We enjoy this part of our lives and it's easy to forget it's work. I loved the atmosphere, the energy was always warm and stress free. Employees went above and beyond to assist others. I learned leadership and customer care skills. The most important part of the job was to always listen to our customers. i worked there for a nice period of time. hardly any days off and when i say hardly i mean only days off you get is when you call in or have something else you have to do. Although the service is long gone, it had the makings of something special. Had it not been for management I could of seen this app succeed as well as all the employees be very happy with the job. Easy going job, very little stress (as far as work goes). They have pretty good benefits and constant change (if you get bored easily). The company does change pretty often, 3 times since I've been here. That doesn't effect the job but the benefits and rules do change around a little. Overall very easy job, it worked out perfect for me because I am also in college. I had a wonderful time working working at eBay. They were great to me, and my boss was amazing. I was working through a contract company however,  but was still great. A warehouse where they pack and ship what you order online.  you will pick and sort and ship the orders that are generated from online orders.  there are jobs where you recieve the product in Work/Life balance was worst I've experienced in 20 years.  Leadership managed by fear.  Executive vision and culture was a positively incomparable fun, energetic atmosphere. Great cross-functional teams to work with, but direct team was very individually competitive leaving a bad taste in anyone's mouth. It is a good environment to work at. I had a lot of typical days but with the help of the team i did well. I learned a lot here. The team helped me a lot to learn. Good management and culture of the workplace. Great job. Good opportunity to learn all about tools and  some on computers. Good 8-4 job usually. With overtime if you want Great boss really understands work to family relationship. The management here simply does not care about issues raised by drivers or customers. It's no wonder they ended the program. They tried to prolong the program by switching w-2 employees to 1099 contractors, which is when I left. fun but really competitive place many kids at the school wanted to sell things.sometimes we would not have enouph stuff to sales so you would t not get that much money I was happy working at eBay classifieds, although they had allowed their iOS code base to deteriorate over the years, and had no plan to refactor it.  This issue caused numerous problems.  Pay was somewhat below Portland standards.Aside from that, it was a fantastic environment to work in - very supportive, flexible and positive. EBay/PayPal was a very challenging team to work with. I had lots of opportunity to learn new things with my team. We had everyday status meetings where we had to report about our work. There was good and interesting work to be done with people who wanted to accomplish good things. eBay is going through some big changes and helping to change that has been fulfilling. The politics were extremely difficult to navigate across multiple llocations While I was there in those short three months I have learned a lot. I learned how to assist our customers the right way and soon I was promoted. I think actually talking to the customers was the scary part of my job because I felt like I was going to mess up something. But the most fun I had was actually doing the refunds and stuff. working there  was a lot of fun they treat you like family. it was a lot of walking but the good part you can listen to your music and talk to other people It is a fast pace job that has alot of opertunitys, All though it can an may take awhile to get hired on here, if you do your set, it has great pay and benefits as well as being a friendly staff. Good and sound top level mgt. Has a lot to offer in terms of talent and culture.  Good work life balance and perks are great as well. eBay is a fun working place, with loads of new learning opportunities. People are very experienced, and very friendly open minded.  The team members were very helpful and supportive. eBay is a good place to work. I would go back to eBay if I found the right opportunity.  The only issue with eBay is the inability to advance your career there. First, I would pick orders using paper slips, pack items on cart that have been picked with a specific slot number. Next, take items to embroidery room and monogram items following an instruction sheet. Management was one of my major dislikes because they never were organized and didnt know what was going on. There was no hard part to the job except for most of the time you were doing other jobs that were not in my job description. I like to monogram items and that was the only thing I liked besides the pay. Moving at your own pace and being your own boss. I have learned that everyone is searching for unique items. Most difficult part is locating the high demand items. This was a fun job for me because I got to stay at home and raise my children while I sold Mustang and Chevy parts online on an Ebay Store. I started off just selling small items, then got to where I was selling enough parts that I could open a store. I took inventory, put up pictures and descriptions of parts. Talked with customers via phone and email. Shipped parts all over the world. Also talked via phone and email with the supplier of the parts on a daily basis. I also cleaned homes for several of the senior citizens in our town. Great company where you learn a lot and gain a lot of experience and meet very smart people. Work-life balance. Very friendly culture. It was mediocre while it lasted. Liked being able to work alone. Did not like being deceived and led on about pay! Did not like constant verbal abuse from supervisor! Ebay you can work your own hours no Supervisor. just make your customers Happy. Sales are very up and down as Ebay does not do a lot of advertising. the items that i sell are Collectibles and the Market is Flooded with them. I loved working at ebay. It was my first call center so I was pretty shocked at how hard it can be, but once you learn not to let customers get to you it can be a great job. Sometimes I dreaded going into work, other days I was chipper. I played cards and drank free soda much of the time. They really do a lot to keep you happy since it's  a hard job. I had one super fantastic manager and another one that seemed to not care at all. I had trouble getting positive surveys back, and they were all negative about the company's policies, not so much about me; but still it's my fault. Still, left with loyalty to the company and feeling great. Challenging, but boring every days  work. I learned the courteous way of serving employees through valet parking. Pro Park company manages well with the customers' parking organization. I found eBay  employees are very courteous people. Valet parking is a tough job whenever there is a big company events. The best enjoyable part of the job of taking care of other people's car in the parking area is when they are satisfied and appreciated the services of valet parking for free. Good place to work. Management and other employees are nice and willing to help you if needed. Many different jobs to learn and they give you as much time needed in training you Good place to work! Good management. They believe in growth and development of the employees. They promote employees. Good location. Salary is also good! Ebay needs a big dose of its own medicine that is deals out so much misery to its loyal sellers.  Gouging, lying, cheating and manipulation all to the advantage of Ebay. fun but really competitive place many kids at the school wanted to sell things.sometimes we would not have enouph stuff to sales so you would t not get that much money Overall, this is a great company to work for.  The overall atmosphere is very positive and the environment is certainly focused on personal and professional development.  The one negative would be that with the given management structure, departments are so compartmentalized that they don't do well when it comes to working cohesively. Also, in certain instances it can be very difficult to operate in circumstances where you reporting staff is not in the same location as you.  However, it is very exciting to be a part of a global marketplace as big as this one since you get to see how much goes into giving the buyers and sellers the best experience possible. Fast paced busy environment, great atmosphere and benefits.  The campus is very nice once you can get to it from the parking lot.  eBay has a strong presence in the community encourages charity and commits to not only the employees but the communities and the world.  The company is always changing management and in doing so operations goes through many changes.  Some have been great and some not so great. Work/life balance encouragedGreat pay and benefitsAmazing talentManagement supportive of professional developmentLots of change in preparation of split with PayPalYou must be agile and willing to step in whenever and where ever needed. I have worked for several companies throughout my life. If I could work for eBay Enterprises again, I definitely would. Excellent benefits for part-time and full-time employees with affordable plans and outstanding coverage. The company has a strong anti-discrimination policy to support all people from all walks of life. Regular training is provided to make sure that you are able to successfully do your job and grow. The opportunity to move up in the company is there for those who are interested in doing so. Ebay allows you to work from home and on your own schedule but income is not consistent and you can work a lot of hours with very little pay. Overtime availability.  Peak is rough.  Management has both associate and customer interest in mind.  Over-all good job, just not a career for myself. Manager was easy going but frustrated often with having to deal with eBAY and their policies.  Had great personality especially when it came to working with the employees.  He displayed patience, understanding, flexibility and fairness when mistakes were made.  Postings included model, make, and year of auto part, picture, installation instructions, refund procedures, price and shipping costs.  Posting instruction consisted of being guided through a few postings and then employee was left on their own until assignment was completed.  Pay was an hourly wage based on the average of the  amount of time it took to complete the first few postings, and then adjusted on the number of postings overall.  An invoice was prepared each week listing the completed daily tasks, posted at the end of the day.  Each assignment listed the auto part, model, make and the calculated assigned charge. eBay Enterprises was not a satisfying company to work for. There were too many supervisors and no shortage of condescension. ...if you are an eBay employee. I wasn't. I worked on contract with CSC and they RIF'ed me for a lower wage worker who I helped train as my 'assistant.'It was a great job and I miss it. I'm employed full-time somewhere else but it isn't as magical as that place was. This was more of an experience job than anything. I learned a lot about landscaping and working as a constructive team member. Everyday was a ne adventure full of learning experiences and hard work. eBay is underrated and is a fun place to work. Great pay and smart people. I would encourage others to find roles here. Strong leadership. Global presence. Established history. Over the years of working with Ebay which is now Radial, I've learned how to connect with customers on a more understanding level. Talking calm to people makes a huge difference and eventually their tone of voice changes completely. Basically, don't work here unless you are desperate for some income, like I was! I was forced to work 6.5 weeks straight during peak season with no days off, on a 12-hour shift! HORRIBLE I loved this job it was easy once you got the hang of it,fun work enviroment, management is great and your co workers are friendly, the worst thing was short lunches since alot. had to leave to get there lunch. eBay is way past its prime.  I worked in a solid group of people, but overall the business is a boat lost at sea.  You have to expect that while HR has its hype, in reality the business is a business and as an employee you are just fodder and don't be surprised if the day comes you get laid off and lose all your benefits. Great Job! Great team to work with, daily job variations, shipping, receiving, store clerk, cashier, front room merchandiser, product installer, web site designer, eBay management of all items on eBay and all paperwork that goes along with it. I liked eBay a lot, but because the department was so thin and new, many people didn't have answers, if I didn't come to the table with the background I had, it would have drown within days. Pretty decent place to work if you like to type, talk, and help people. Not the worst place I've ever worked and hours are good. When I work at RIA we had warehouse parties and the teamwork was fun! Learn a lot of exciting things and filing was difficult but everything is all digitized now! a los equipos le hace falta motivarse con los proyectos en lo que participan, todo el mundo desaparece antes del trabajo. fun but really competitive place many kids at the school wanted to sell things.sometimes we would not have enouph stuff to sales so you would t not get that much money I wish my contract at eBay had been extended. It was an amazing company to work for. Very professional and they know how to take care of their employees. Plenty of overtime great benefits Management chooses a favorite and will let them do what they want and then pick on people until they quit or will lie and get you fired. Management had no idea what they were doing or how to manage. No way to advance.  Everyone acts like they are in highschool. Everyone is rude and angry all the time.would never recommend working here long days and nights that keep you away from your children and family.  Its an easy job but the hours are demanding.  Its definitely a seasonal position for a reason. Easy and friendly to make extra cash I only sold items on ebay I did not work for the company it was a great time and had fun selling my items this was a good beginner job to develop the necessary skills needed to proceed in life. would recommend to anyone who was looking The company needs to better communicate its directions to employees. Since what used to be GSI Commerce/eBay Enterprise was acquired by and re-branded to Radial, the business keeps going down, which reflects onto over all company's culture and inter-department relationships. Good department to work for. Great team member to work with and interface with. Travel to remote site working with other teams. venkat gopuExcellent place to work. very supportive people and very good management group.employee benefits also very good. career growth also very good as always more opportunities to explore on different tasks. I like working there but it was a seasonal position and it was too far away located in Boone County Kentucky but I enjoyed my time working there I will be there next year. I enjoyed my time there its an easy job just do your work and you have your freedom, supervisors are nice and extremely fair and understanding My work day was filled with a variety of duties beyond my main duties as the eBay clerk. I was also the patrol clerk, which  required attention to detail to ensure everyone was paid correctly. I also assisted other team members m]when my world load allowed. Working at Ebay/Adecco gave me a different percpective on how hard and deticated you need to be for an Respresentativs job, all though your speaking to customers over the phone that doesnt mean you cant make them feel welcome or smile, Its always goo to listen and pay close attention to customers, it gives you a clear understand of what they want and need, This job made be Wiser and i kept my focus on what i wanted and where i want to be in my life. Shoe store with limited stock room. It was difficult to reach the appropriate sizes for customers. It was a great environment with great management. They were willing to work around my other job's schedule. Great schedules for the holidays. Work at your own pace.Awesome hours, if you want more hours you can have them. Long enough lunch breaks. Excellent place to work. very supportive people and very good management group.employee benefits also very good. career growth also very good as always more opportunities to explore on different tasks. Well paid and great environment. Working here is like having a second family they watch over you and make sure your well taken care of. I honk this is the best job I've ever had and I recommend it for anyone. I enjoyed by time at eBay because I had a great managers.  She had the ability to recognize strengths and weaknesses.  I liked that she held people accountable for producing a good product. Enjoyed working there, many tasks to many to list but some are management, training, reporting, customer service, supervising a staff of 12 24/7 and being on call Great work environment, Very flexible work schedule, you are making a difference by enabling connected commerce in all corners of the world. Fun place to work with many talented and friendly co-workers. Needs more organization and training more for representatives. There was a lot of hiring but not very many chairs open. A lot of under time was given and people were sent home A lot. It is a nice place to work if the promised hours were given. fun but really competitive place many kids at the school wanted to sell things.sometimes we would not have enouph stuff to sales so you would t not get that much money Great work environment, Team orientation and lots of team efforts. Great work culture to work for and a balance work and life style. Team motivation. Team Focus If you want long hours you will find it here. Which can be a good and a bad thing. Yeah everyone needs the money but at the same time the astomspare of the whole place is kind of a downer so it just makes it a hard company to work for. They have very strict policys but they do offer alot of free lunches and a turkey at thanksgiving and ham at christmas. Every holiday they try and offer either a lunch and a gift or raffles. Ebay enterprises was an amazing place to work, very laid back but structured environment, there was no other job like working for them, if they were still here I'd be there today Great place to work while it was GSI Commerce.  Has since been through acquisitions and a sell-off.  Company is not what it once was. Telecommuting Infrastructure allowed for flexible workplace environments and schedules with excellent full-time training opportunities and benefits. Good work life balance, but some employees are in coast mode.Could be better opportunities for advancement, seems like they bring in a lot of senior leaders from outside rather than cultivating inside. My main responsiblities were parts sales to the shop technicians but also included retail and wholesale sales, new car internal sales, inventory control and stocking. I learned how to interact with several personality types, both employees and customers. Management was great, the hardest working manager I've ever worked for. Most of my co-workers I had known either through previous employment or by over the phone sales and were a great group of people. The hardest part of the job was being a part-time employee limited my role in day to day operations. The best part of the job was I enjoyed my co-workers, as well as the pay was excellent for a part-time job, and the hours were flexible due to my attending school. The overall concept of the account manager is simple, meet all customer needs.  I only worked for Radial for a short period of time.  I was thrown into an environment where I did not receive any training.  The managers are very rude.  They do not have an onsite Human Resources.  Managers will use profanity and write you up when you ask for training. I had a good time. It helped me practice my skills in a professional work environment while I helped people achieve their goals in the real world. It was an enriching experience. If you enjoy working in a standard call center then this is perfect for you. I did not like anything particular about the job. They were not organized when I worked there and they made the training a little stressful. Very flexible schedules, very relaxed atmosphere, with all types of people. Easy job, talking to customers and resolving issues. Supervisors are generally capable and supportive. Had to leave due to medical issues. Pay is substandard, considering all that you have to learn and memorize. Internal computer programs are good. Good benefits. Highly recommended, wish I didn't have to leave. Posted postings of CE items to be resold on Ebay. Took pictures and wrote descriptions about the product. The hardest part about this job was to find what to write about the product when you didn't have all the information when they give to the task to do. Learn how to write great marketing ads. Research products and pricing. Assign correct shipping values to products. I represent myself and my merchandise and I do not have any co-workers. The hardest part of the job is always keeping up with what is trending now in sales. The most enjoyable part of the job is dealing with people through customer service and having satisfied customers. Full of life lots of people in and out. many interesting characters. Always extra work time available and constant feedback there for your growth in your profession. They take good care of there employees and everyone loves working here, they are plenty of opportunities to advance and they love to hire within eBay hasn't innovated the main product in years and it shows. The new CEO post paypal split has been good, but the site has still been slow to take risks and make changes. Work life balance is great, and working remotely is accessible to everyone. It was a great working environment, plenty of overtime available.  Coworkers were very friendly and easy to work with! I would recommended others to this job! working with ebay was a great experience in the unique role I was deployed as a technology evangelist . Really good working culture. Technology explore was great. Management was mostly set by the example. Awesome company.  Very good to employees great benefits.    Family oriented  place.  Not alot of room for advancement.  However i would not say anything negative in regard to this company easy way to sell products, although they do have listing fees and you can only work using paypal. I don't feel that their customer service is the best ,or that the app is a good fit for me . fun but really competitive place many kids at the school wanted to sell things.sometimes we would not have enouph stuff to sales so you would t not get that much money This was the best job I ever had great people , environment . Always doing something for the employees long days and nites made good money loved it Wonderful environment to work in along with a wonderful staff of coworkers and managers. Growth opportunities could be more available along with better job security, but the compensation is definitely better then the industry standard. It not even worth the review.... did not like it at all, they pump you up by acting like this place is the greatest when it is not.They promise your certain things and never deliver. Dont even get started on management Company was very flexible,fun, and had good benefits. My friendships are still here after so many years and thanks to this job. better keep those metrics up. no one cares about anything else. great for somebody in dire need of a job, less so for anyone with an ounce of self respect. Ive learn how to be a great customer representative. Learn that all people want is help. From management to co workers, you get to learn a lot from each and every one of them. Things such as knowing how to use your communication skills. Knowing how to get out of a escalation call. The hardest part of the job is back to back calls but the most enjoyable part of the job is hanging up the phone after im done with a customer knowing I just help a customer and theyre indeed satisfied. Great place to work and good learning experience in terms of learning new technical tools like R, Tableau, Qlick View etc.Overall gave an opportunity to grow A good starter job where you can gain valuable experience in the warehouse industry. Not a lot of room for advancement and the pay is low. There is a high turnover rate and very few full time employees. Working at eBay wasn't terrible, but I don't agree that it's one of the best places to work in Texas. The managers were never there and training wasn't all that thorough. I worked at home, selling here and there on eBay. This was a great opportunity to work on my own terms. It just did not pay the bills. I have a lot experience with ebay.. i was very hard work on gift wrap who they want us wrap gifts from order and i have to follow thier order any color with gift wrap.. transparent in process. supportive.I recommend any one want to get into consulting jobsThe company gives you a stable and positive environment to work. The management is always approachable for any issues that you face at work Working with passionate and dedicated business leaders to find the best talent for the positions open.  Working with a talented Talent Acquisition team that was able to take on multiple projects and successfully complete and hire the right talent in a timely manner.  The hardest part of the job was to balance priorities.  The most enjoyable part of the job was the opportunity to work with and build relationships with business leaders and provide exceptional service to our teams. Difficult to see how this company will survive without innovation of its products and services. Add to it the high spend vs incoming revenue and it makes for a questionable future. As a customer services rep, I would spend an eight hour day sitting at a desk assuaging customers' concerns. I learned how to deal with multiple on a daily basis and how to resolve conflicts. The management was very nice, taking on tougher calls as well as providing a friendly environment for us to work. The most difficult part of the workday was receiving a particularly stressful call, but getting a positive result for both parties was definitely the most rewarding. I was very successful at internet sales for several years. It takes a lot of research to find what to sell. If you are willing to put the time into it, you can be successful. Was good at what I did I am a great people person. It was a good place to work fast pace at times, but you get to talk to many different types of people and help them. One of the best place to perform internship for software engineer (Machine Learning). The higher management pays a lot of attention towards interns. They have the best intern event I learned how to use RF guns then transitioned to voice pick in the outbound department. I loved that I was given PIT training for nearly all of the vehicles at eBay, the only vehicle I was not  trained on was the Scissor lift which only maintenance used. I loved the teamwork when I was in both inbound and outbound. My review on this job isn't a pleasant one. You sign up to do certain things and keep getting switched to do something different. Certain procedures aren't reasonable at all times. fun but really competitive place many kids at the school wanted to sell things.sometimes we would not have enouph stuff to sales so you would t not get that much money Great, easy, going environment. Atmosphere is great. A family type atmosphere with your team. Most difficult part are some of the phone calls. Great benefits. Cannot ever miss work without preparing ahead of time. If sick, auto trouble, etc., you will receive occurance.Low pay scale. Selling Items at home for others on Ebay. Worked from home listing and packing items after they sold. I had the ability to work when I wanted and do other things. The downside to this is that sometimes items do not sell as the owners wanted more money than worth. Then you make no money with this. I only sell now for myself from time to time. Work was always hectic depending on the client and the time of year. I spent most of my time fixing issues, and was excellent at resolving the issues at hand. Most of the people were wonderful to work with. I am looking to move forward as I no longer wish to work weekends, or miss out on the holiday season due to working extended hours. A typical day was like a root canal 2 seconds every 5 minutes across the entire day.  Middle management liked to surround themselves with idiots and 'yes' people while E and C level managers really wanted to get things done yet couldn't figure out how to get rid of the old infrastructure and dead weight.  Each department had rays of hope, people working for a cause, but the organism as a whole asked for mediocre and didn't reward good behaviors.  eBay Inc doesn't think a customer service center adds value to their operations, it's a cost-center.  This means they give a budget and consider the expense of running that center as a loss, they don't have a model to value the work that is done.  This mentality has stagnated their ability to improve NPS over time while most changes to NPS come from changes in policies (no feedback from sellers/agents heard there). a typical day at e-bay , was preparing shipping materials, pulling inventory, preparing  packages, and finalizing shipment. I learned a lot about warehouse duties and how to multi-task and resolve issues under little supervision , I enjoyed working in a team but also having times where I worked independently. Due to effective training there was not a part in the job that was difficult, I enjoyed the opportunity for over time . Great fellow employees, they will be your best resource.  Selling/buying department incur many changes to site&policies which made it difficult to provide quality customer service. Empowered to regurgitate what leadership or technical team says but not empowered to escalate it to them if it would be best for the customer and retention. overall not an enoyable job. awesome co-workers and customer are very hard to deal with. thats really the hardest part of the job and long hours Self Employment with total Flexibility are the best values for this type of work.  I do it mostly as a hobby. I use buying selling and writing skills to enhance the experience for the customer. If you enjoy buying and selling. Everyone should eBay! I only typed this line because it has to be at least 20 words.Thanks for readingThe owner is amazing. I learned a lot from working in a call center setting. There are a ot of variables when working in a call center. Some of the time I was there I did work at home and maintained a score on my calls above 90%. Much work and pressure to get things done sooner than later.And have it done correctly.My co-workers are all great.We had great perks (unlimited drinks and snacks,bagels days, free T-shirts, picnics, etc.) No pay raise when you get converted to a permanent employee. $10/hr with no questions asked. Benefits are available, but quite expensive. PTO given is generous, but nearly impossible to schedule and you will end up taking most of it when they are overstaffed and you are forced out the door. Management has no concept of what it is like to be on the bottom and the top performers are almost always held where they are with incredibly incompetent employees being moved up. basically signing kids in following the days assignment and agenda.I learned how to manage 18 plus kids in one room.My co-workers are the best friendly and very supportive.And I don't think theres a hard part of the job.Most enjoyable part of this job was interacting with kids Endless  work. Not enough money. Your house becomes a store...cluttered. If you can carry the right stuff for the right price, you can make money on Ebay! I learned much more about Corporate America and how public companies are run. There is a great culture at ebay and it is paramount with the leadership. My co-workers/team were the best people in the industry. I loved working there, loved my job and loved the people. Worked with resellers to procure a next generation firewall for deployment within the Data Tactics IT network.•	Port scanned servers using NMAP and closed all unnecessary ports to reduce the attack surface•	Design a comprehensive set of policies that are customized to a unique security business Working with DesirableDynamics on Ebay was a great experience. We earned monthly bonuses for high sales and minimal returns. work hours fun customers very friendly management  staff very pros great coworkingshard part time to eat fun part busy days great working people no trouble with any other sales rep steady job great benifits management staff very helpful any question asked was answered very well work day would incoulde ten hour shifts call back to back or steady for the better word hardest part i would have too say would be some of the customer would be a little over baring but nothing that could not be handle by the well trianed staff greatest part would be working with other how made the job easier and that were willing to step in to help out there fellow coworker Typically, I would check my ebay email to see if I would have any customers. If I had any customers, I would mail out the package asap! fun but really competitive place many kids at the school wanted to sell things.sometimes we would not have enouph stuff to sales so you would t not get that much money I was only there for four days and I was lay off my 4th day and I felt like they didn't give me time to learn how to do my job and get my numbers up. Great company with startup culture and seasoned leadership team that is trying to reinvent itself in the ultra competitive but rapidly growing e-commerce market. I feel that eBay was one of the most positive influences of my life from the day I started training until my last day it was a great experience. Working at Ebay Enterprise has been amazing, It is the best job I have had so far in my young life. All of my co-workers and managers were down to earth and really provided a warm and comforting environment. It really felt like we were all one big family. the manager was always rude, i couldnt ask my friends for help without him getting mad at me. i would make my quota for the day. i loved the hours and the friendly co workers. the manager was my big problem I took inbound calls from various partner I really enjoyed doing this on a daily basis, also helping my coworkers gives me a since of achievement at knowing my job. Working for Burbank Sportscards has taught me to treat each customer the same. Working the ebay department, and having to do daily emails, I thrived on making sure my customers would leave our company with a positive experience. Furthermore, the company's friendly environment helped me grow as a person for the past 10 years. i worked overnight fulltime and the pay was about 11.25 per hour also if you worked overtime it was a time and a halfgreat supervisor must be able to deal with angry customers and know how to work on a computer also must be quick I came in at a time of increasing company change and instability. Very kind people but not much direction. Managed the integration strategies of multiple companies with EBay’s enterprise system. Designed the technical solution for the transitioning of multiple, disparate platforms into a large enterprise ecommerce environment. Worked with many different teams and technologies to enable new, highly functional and high performing solutions including new web solutions, Omni-channel configurations, Affiliate marketing, mobile architecture and strategy, Search Engine Optimization, and supply chain management.  Estimated project costs, delivery and maintenance costs, budget forecasts, and total return on investment. I really enjoyed my job. I was devastated when I was laid off. I worked as an on-site tech and they use an outsourcing company for these positions. They went with a new vendor and let the entire existing team go. I was told for months I would keep my job but in the end it didn't happen. Everything else about the job was awesome. They have an awesome atmosphere and lots of perks. I have found that the eBay culture is a unique one. Although the business has its flaws I would consider it one of the best opportunities that I have had. I recommend them as a great place to work and enjoy what you do. They appreciate their employees and are always rewarding hard work. This job keep you on your feet and keep you alert. You will never get bored and you will love to get to meet people from all the calls you get. Come into work clock in head to the lunch room for breakfast. go outside for a little air then head into work. sit at the deck put on my head phones and start collecting calls. love helping a customer find their packages and tracking them. to help and customer will turn they day around great.. even a mad customer will turn happy... It was great working here. They have great hours and wonderful staff. It just wasn't the right job for me.The hardest part of the job is dealing with angry customers. Love working here.  Down sides are  the pay- pay raises are small, stress is high to get numbers, and favoritism is an ongoing problem with managers.    Easy to learn new jobs. Management seems to change every few years...Co-workers are great, everyone is willing to help out. The management was incredible and if the company had not burned down I would still be thereGreat job and great benefits package as well Typical day at work would involve handling customer escalations as well as back line work dealing with Warehouses directly through email correspondence.  I have learned a vast amount dealing with managing a team as I have been a supervisor for over a year.  Learned many different ways to talk with my agents as well as my peers and superiors.  The most enjoyable part of this job was to finally see resolution and see the customer happy. Ebay isn't to bad to work for. The job itself can be very physical, but overall easy. Some of The management can be very questionable, and not very well with communication. Unless told to be from upper management. As for the rest of the work crew, we all get along well. You will face your typical drama starters, and favoritism.Though, those can be easily ignored. Many of us work as a team, and help each other out when possible. Overall Ebay has been a good place to work. I absolutely loved the actual job i had and the people i worked with. The only problem i had with the job was the location was a little too far to only be making 9 dollars an hour, on top of being sent home within a couple hours because the job would be finished due to too many temps hired and not enough work. It stunk willing and wanting to work, and never being able to. company shows no interest in providing ways to move beyond the temp status no matter the willingness, efficiency, determination, nor time put into the company. also terrible raises, few and far between. I was honored to be eBay Enterprises first Process Improvement Manager.  The environment was ready to be challenged.  They warmly accepted Kaizen Improvements but not without some bumps in the road fun but really competitive place many kids at the school wanted to sell things.sometimes we would not have enouph stuff to sales so you would t not get that much money eBay is a great company and obviously one of the biggest players in the marketplace, but I did not fit in here. Rather than being given flexibility to drive growth and maintain customer loyalty, we were given a script to follow. Call Center was in transition while I was working there, gets pretty busy and hectic around the holidays here, pleasant staff sometime serve up pizza and promotional stuff to employees, Nice break area Only a few full time employees, they say if you work your but off you will be rewarded and offered a full time job at the end of peak season but it rarely happens. A typical workday at Ebay was packing or picking. You have to maintain a certain percentage each day. You learn the codes on the computer and the codes on the scanners if you are a picker. The co-workers are nice and good to get along with. The job is not hard at all. The most enjoyable part of the job was going to work and working with people you got along with and built relationships with. It makes the job much better because you can pack with one other employee in your pack station. No where near the pay that should be received for the cursing, angry customers that call in.All starts from the top of double charging customers credit cards to receiving packages all broke or not at all. self motivated job.a lot of fun.flexible schedule.need be on the computer often.need check the marketing on ebay.goes to the post office everyday. Clear requirements and very helpful team.Good work culture.Provide training on new technologiesTypical working hours Ebay isn't what I would call a amazing place to work. The atmosphere is calm, and laid back, and other than basic job functions there isn't much asked of you. Great place to work with great people to work with.  eBay treat their full-time employees great but they treat contract employees terrible.  Contractors are forced to take two weeks off during Christmas time with out pay and you may or may not get to work 40 hours a week.  When Sr. Management comes into town they take the full-time employees out for lunch but not the contract employees.  Only given a two day notice before the contract ended. It is a great company, work on your own terms. Make as much or as little as you want depending on your inventory and how much youre willing to list. Only negative is site sides with buyers to much and can hurt the sellers. - Typical day at work- Able to develop multiple skills by working with ebay- Great co-workers- Tough speaking with some rude customers Good experience. I wanted a schedule change for school but unable to get one so I decided to look for a new job. I would suggest it to anyone who do not mind Customer service. Learned a lot from the colleagues, great place to work at,Cool place with work-life balance,Challenging workTeam spirit The job itself is not hard, but only taking phone calls all day, everyday can lead to a person getting burned out.  Night shift and day shift available.  I work night shift, and it is not conducive for our family. I work at home on my own free time, package and print labels out, send them yo UPS or USPS for shipping and handling. I also order and receive plenty of items when purchasing. Disorganized to the hilt. No normal systems seem to exist. Endless meeting soon forgotten. Organizationally chaotic. Taking huge regulatory risks. Easy to balance schedule, nice management, and laid back culture. No opportunity for growth or benefits if you have either bad credit or a criminal charge. eBay Enterprise gives plenty of opportunity for advancement and while hectic at times, it make up for it with a productive management and fun atmosphere. Walking in every day to energetic co-workers ready for the day was a very rewarding and inspiring feeling.I learned how to stay motivated and lead a team to hit our daily goals as well as picking, packing, inducting, dunnage, loading trailers, forklift operating.Fun, motivated, and willing to help at the drop of a hat is probably the best description for the employees at eBay.The hardest part was taking a step back from production to keep everyone else motivated and lead the team to our goal.The most enjoyable part was just being there and being around all of the friendly people. Ebay is a great company to work for. As with any corporation there are bad points. Ebay has been working very hard on reconstruction of team members to ensure a better work life for their employees. fun but really competitive place many kids at the school wanted to sell things.sometimes we would not have enouph stuff to sales so you would t not get that much money The Hartford Life Insurance ‘s Field Sales and Claims Application allowed Agents in the field to give quotes to customers and for Claim adjusters to input claim information and monitor and update the claim progress. Overall experience was good.  Very friendly and accommodating work place.  Looking for new job opportunity to further my career. fungreat culturerelaxedgreat managementfree foodgreat benefitscomplicated websitevoted best place to work in Austingreat paybonuses Management by Adecco is a joke, they have favorites and bend/break the rules and even laws for people they like or to make certain quotas. They are also condescending and rude behind closed doors, but sweet and smiling when the client or a supervisor is around. They are disorganized, inefficient, and poorly led-an HR nightmare!Ebay management spends a lot of time having 'meetings' and parties to pat eachother on the back and take pictures of all the fun things they do while front line agents are doing all the real work. They both treat agents as though they are dispensible and stupid. The only pros that come to mind are that for all their meetings, they do plan some fun contests and give away good prizes during peak season, and starting wage is well above minimum wage. A typical day at work started around 8 a.m.. We would check the computers to see what had sold. We packed and shipped items that had sold the previous day.I learned the art of negotiation working with people via computer and telephone if they wanted a better price. I enjoyed researching the items on-line to determine a fair price for the items.The most enjoyable part of the job was the very flexible work schedule. I thought I would love working for ebay. The training was poorly facilitated. I am not working the job I was hired for, which made me lose trust in the company as a whole. Offers some great features like patent incentive plans, and performance-based bonuses. Has a culture where developers are encouraged to inspire each other, and has clear paths for advancement. Once great, still good company to work for.  Large company, too much middle management, but overall surrounded by some of the smartest people around. Good company for carrier build. Good company to work for. Lot of things to learn. Good salary for the position.Based on your job role , you have to perform. Co-worker are good and friendly. You look at the thing you are going to post and you research it and than ad what you have learned about the item to your posts.Then you take the items and add a photo to them, take the photos of the items and than photo shop them  and add them to your posts. I have learned about the Items I have posted and it is kind of nice to walk into an OEM parts store and know what things you are looking at. I had no co workers. The hardest part was cleaning some of the old parts. The experience was the best part. Good people working there, management is decent and willing to help with some situations. Will not help when you request for extra training. Fast paced, challenging, great employees and people to work with.eCommerce expert and leader.  Great satisfaction when accomplishments are met. I worked with the Global Talent arm of eBay. Lots of fun, but to be promoted you will have to stay there for 3+ years.But, there are lots of fun things! Pool table, soccer games, gym close by, super cheap breakfast. It is also incredibly close to the FrontRunner station if you are commuting from Downtown. Environment built on the buddy system. The work isn't hard but requires patience. Outside of peak season full time associates rarely get enough hours to support their families. All skills that included Microsoft, scheduling, and conference calls were learned while there. The hardest part of the job was dealing with the politics and favoritism. Hard working employees with the skill and knowledge are always looked over for promotions because of the new management team. I work on an On-call basis for the entrepeneurship.  I love doing the quality control work that I do for her.  I have learned a lot about the Stampin' Up Company and all of their products.  The hardest part of the job is that I never know when I will have work and when I will not.  There is no room for advancement with this job and that is the hardest part about this job.  I make a total of $65 a month at all times.  The most enjoyable part about this job is working with the owner and learning about the company. This is a great place to work with many benefits! The environment is very diverse and there is advancement opportunities! None, It was ok for a call center.Typical call center setting, management was ok for the most part. once I started doing management team lead work it was better Able to work from home on my own time at my own pace.Begin and end the day when I needed to.Able to take time off when needed.Work alone. I enjoyed my time there, the people are great.  The communication of  change needs some  work. You always find stuff out after the fact. Great company to work for. Talent acquisition is done very carefully and made sure that the right person is hired for the job. fun but really competitive place many kids at the school wanted to sell things.sometimes we would not have enouph stuff to sales so you would t not get that much money Great Benefits, not much room for advancement.  The culture and employees are great.  Management seemed unable to learn from previous mistakes. Overall, this is a wonderful place to work, I really enjoyed myself and my co workers I will always be friends with. You are given every tool available to help you succeed in your position and it is very low pressure. Good clean environment.. A very good job with good pay and great benefits. A lot of nice people and it wasn't to hard of a job at all On a typical day we would sign into a computer and sign into all necessary programs and then start taking phone calls and answering customer questions and taking customer orders. Days were smooth, Typical clerical employment management was professional coworkers were great . The hardest part was seeing sick patients and not being able to personally help. most enjoyable was Loving what i did and making money while doing it . tough physical demand on every day shift. takes a toll on the body from day to day and requires an extra insole for both shoes They had free Soda and Bagels. Can't beat that. Some customers were difficult, and sometimes the job was hard. Management were jerks a lot of the time, but the little people were usually nice. The main thing I learned was how to work well with others who have a different background or upbringing than I had. The hardest part of the job was learning to pack with precision while maintaining a certain level of speed at the same time. This work environment is one of the most friendly, and organized environments I have had the pleasure of working in. The employees there were always very helpful and understanding. I couldn't of asked for a better work experience. Wish I would have stayed with eBay longer but as a contractor it didn't seem possible.  I loved the GL team especially my management staff.  They were a great group of people. We come in on a typical day and have a morning meeting, also stretches. I've learned a lot about organizing, minor computer skill and a different way of leadership. Never came in contact with management, but I had nice supervisors and great co workers. I couldn't quit say there is a hard part to the job, no part really over whelmed me. Over the year I have worked there I've met wonderful people, so I'd have the to say that's the best part. Pay in need of increasing, sanitation of work space is needed on an hourly basis, computers are in need of upgrading, cubicles are in need of upgrading The work itself is pretty good. A little numbing at times, but they're good about getting you on your feet to keep the blood pumping. My only real issue is the hours are really inflexible for a seasonal job. Overall working for Ebay Enterprise is an enjoyable experience. You are constantly busy with calls coming in. You have the resources you need to assist the customers and the environment is very diverse and welcoming. no notice that the contract was ending although processing the termination was quick overall it was a great expierence Makes sure that you treat the customers the same way you would like to be treated.  They expect only the best from the agents. Great place to work if thinking about the companies and people you work with. Love my day to day but compensation is something to be desired. ebay is an amazing company that brings people together through connected commerce. eBay lives its values and provides a great work environment. A lot of changes, and unknowns at times.. Hard to keep things consistent - but overall great place to work. eBay is a great company - you can learn a lot if you want to, lots of chances for advancements Benefits are great, pay is not that bad, and we used to have cool in office perks like beer on fridays and christmas parties.All that changed after GSI was sold to ebay, company made the great mistake of using a complicated and difficult to maintain ecommerce technology platform for what was meant to be the next platform since 2011. Everything went south from there...Management never rectified direction and instead started layoff waves at least every half year. fun but really competitive place many kids at the school wanted to sell things.sometimes we would not have enouph stuff to sales so you would t not get that much money stand for long periods of time working up to 10-12 hours a day and using a RF scan gun to locate pick orders using a picking Cart The hardest part of this job is the red tape that comes from upper management making decisions before fully analyzing all potential problems. The Best part of this job is knowing that every day I am preventing our members from being victims of fraud related crimes. High-volume, omni-channel, multi-client call center and all that comes with it.  As a phone agent, expect to be trained on their software in a fast-paced training environment.  If you like helping people find the right gift or assisting customers with order issues, this is a great job for you.  Spoiler alert:  Customers will range from friendly to down-right rude.  Know that going in and you'll do great.  Great starting pay rate too!Other departments like management, training, business intel, reporting, WPA, client services, security, facilities, etc. There are many opportunities for development.  Six Sigma business strategy is a big factor.  Compensation is fair for the area and the industry.  Great group of people to work with. i liked ebay. if you like easy, on your feet job. this is the job for you. especially during the holiday season, you get paid A LOT of overtime. expect no off days during and until holiday season is over. Great place to grow a career. There are uncertain times ahead due to major divestment of previous acquisitions. If you can weather the storm you will definitely be rewarded. •	Serve as one of the main points of contact for all executive-level candidates for eBay’s Executive Talent Acquisition team.•	Schedule and coordinate all phone and in-person interviews to include travel, special requests and interview team preparations.•	Host candidates on-site for interviews, and create a positive interview experience.•	Partner with eBay executives to facilitate communication across interviewing teams in development of interview scheduling and strategies.•	Work on complex international interview calendaring for high-profile eBay execs; to include interactions with support team.•	Work with eBay’s executive recruitment team to drive a differentiated candidate experience.•	Identify operational opportunities to increase efficiency of process and systems.•	Work as required on any additional support activities related to the closing of a candidate. I did like working at Ebay/GSI Commerce, great warehouse experience for those who have not worked in that type of field. The only problem I had with it was the distance from my home to work, but overall working there was good. While I was looking for a job this was a great way to make some extra money and clean out some of the collectibles in my home. Work real hard to get to the next level (glass ceiling). Good place to start out your career and get great exposure to situations related to your career. it was an okay place I just don't like working in a warehouse I would rather be doing some sort of construction work. supportive management the where really nice and understanding. Everyone at this company was great all the way to upper management. They treated you as a person not a temp employee during the peak season. Typically i load trucks and do paper work. I've learned new things such as paper works on shipping. The co-workers are good people. The hardest part about my job is moving the heavy boxes. The most enjoyable part of my job is my co-workers and the work hours. I loved working for Keurig. All the people are really nice and I loved working with them and am excited about the possibility of coming back to work for such an Amazing company Fast paced company to work for.Supportive co-workers and management.Very political company, but to be expected given it's size.Room for professional growth.Fair bonus payouts If you can find products to sell you can do well and stay busy. If you dont like working alone it can be a lonely life sitting in your home. Good place to work. Fun and can learn a lot in marketplace. Decent amount of red tape and politics, but this is expected of a big company. Fun place, nice building, nice people. Poor management. They add more and more responsibilities for the same pay.They have paid training, which is fun and even though it's a long process. Recruiting process takes forever. Wonderful company to work with. Great management and coworkers, very small staff so we were all hard and diligent workers. We had to meet quotas and make sure our customers were satisfied. My fellow coworkers and the management staff were very friendly and helpful. This warehouse was huge and very unorganized, so it made picking orders really frustrating, and it being so hot inside the warehouse made it even more irritating. But working the bag line, packing orders, and gift wrapping were very enjoyable because you get to see all the different kinds of items & inventory that this division of eBay held. This was also only a seasonal job. Manage SharePoint service request and assign to IT team (off shore and on shore). Take requirement from the Business users and create a ticket in the SharePoint Ticket system and assign ticket to the SP ops team. fun but really competitive place many kids at the school wanted to sell things.sometimes we would not have enouph stuff to sales so you would t not get that much money - a typical day: answer incoming calls from members inquiring about their accounts, huddling with team to discuss updates and changes, participating in engagement activities.- what I learned: I learned a lot about fraud, investigations, risk review, business development, intellectual property rights, negotiation, conflict resolution.- management: they listen to what employees have to say and genuinely cares about employees and creating a great place to work.- co-workers: employees are carefully selected and are very high quality, smart, fun people to work with.- hardest part of job: listening to members complain about how they have been 'wronged' by eBay and not be willing to take ownership of their actions as a seller of products through an e-commerce venue.- most enjoyable part of the job: the people I work with are awesome, the benefits are great, hard to beat. Fantastic co-workers and management. Fast paced and fun place to work. Great room for advancement and on and on and on. No more feedback to add. the best part of my job is there is a platform learning new technologies every day. its exciting and fun.our mode of working is agile model and starts with daily scrum call where we discuss about the milestone achieved each day and the roadblocks. and then we would start up our day to day routine tasks based on the sprint plan. Flexible work schedule.  Provide customer service.  Some traveling. Sale what you think you can sell. Its great for single parents who need to be with their young children. While eBay can be a stressful place to work, they provide great benefits. Good medical, plenty of time off for the year, and the management is great to work with. eBay is generally a very good place to work at.This firm values employees, hires best people, treats everybody with respect, and offers competitive salary, good benefits, and many incentive, such as compensating for use of public transportation, etc. Fun environment with tons of perks. Great job for college graduates. Good benefits. Compensation isnt the best. Would recommend. I enjoy doing internet sales because it gives me the flexibility to work my own hours. I have access to agents to assist me with any issues or problems I may be having. Learned a lot about business and the inner workings of how data is collected and refined for areas of opportunity for the business to improve Learned many bookkeeping/ managements skills, shipping reciving, ect. Company was only open a year after I was hired but jained alot of new skills and took them to my next job, Responsible and accountable for Global eBay Information Security Compliance, Risk Assessment and Audit Adherence.Fun work place with decent amount of red tape and politics; however, it's glad to ensure each activity associated with every/multiple projects are successfully deliverable in timely manner. I enjoyed with work in eBay. colleagues are more support. nice culture to work in eBay. food is good. office environment and transportation is good. They have commodities for the employees. etc.American Eagle vertical was one of the best verticals to work in. Supervisors actually.. you meet lots of great people. had set schedules. Undertime was a bit of a hassle If call volume was low they would mandatory send you home, if overtime, it would be put it in our schedule without notice I am very pleased with my role in this organization.  My colleagues and managers are all exceptional people to work with and for.  Although my position is challenging, I enjoy it and am very happy to come to work every day. I enjoyed the people. Learned many things . How to give great customer service and how to work switchboards. I learned how to time my customer service calls. A typical day at work consists of risk assessment of new products and processes and how they may interface with our systems.  The consistent communication with technical staff across all lines of business in order to address requests for policy exceptions while ensuring that long term mitigation plans are implemented in an acceptable time frameI am the only individual at eBay that performs my job functions.  My management and co-workers are extremely professional and courteous.The hardest part of my job is ensuring that all aspects and zones of the network are secure while incorporating the myriad of different in house and third party applications that are required to do business.The most enjoyable part of my job is utilizing my experience and education in providing solutions for different lines of business while at the same time ensuring that all zones of the eBay network are secure. I'm very proud of the contributions and success I have had in my various positions. I enjoy working with my large team of 20+ agents who I have had the privilege to learn and grow with over several years. Great place to work w/ interactive and dedicated leadership.  Collaboration w/ many teams to ensure proper QA, forecasting and execution.   Learning new skills everyday and enjoy a change and challenge. it is a fast pace environment where i learned a lot. i am really grateful to ebey because of my present position of carrier.i recommend this company for keen learners. I have great bosses even management. I love working with my coworkers as a team. My day can be different everyday from: picking, packing, driving yard dog, covering for the supervisor. I'm always trying to find something else to learn. There is nothing hard about this job. Most enjoyable is the friends I have made and enjoy working with them. They are like family. fun but really competitive place many kids at the school wanted to sell things.sometimes we would not have enouph stuff to sales so you would t not get that much money Operations Supervisor for a multi client operation.  responsible for day to day operations.  very fast paced place to work. I worked for the American Eagle vertical. Ebay treats all employees with dignity and respect. The schedules are a set nature, not rotating so it was great to plan other personal responsibilities. There were also many extra hours you can pick up and also possibilties of promotions. Boston market was a nice environment to work with. A day at work wuld be every one getting along but all do doing our job duties and doing them right respect others and customers. The hardest part was really nothing if someone was not satisfy we would make it our job to make sure they were.Ebay was a great place to work positive attitude positive people have people from all over calling it was great people were friendly and staff was always fun aware and there for us. Comfortable being at home. Very convenient for my schedule with the kids and after school activities. Enjoyed conversation with other while assisting them with there accounts online. My co-workers were in online chat and they were very supportive throughout the day with calls and tips on how to handle difficult calls. Its really hard not being able to resolve the customers issues. great atmosphere to work at. Long hours and hours weren't the best lots of weekends and nights. a lot of different feedback with everyone you talk to Love the people, love the environment. Management is hands off, sometimes too hands off. Easy to advance here if you've got a good head on your shoulders. There was a great teamwork atmosphere from the employees on up to management. I great caring team that was able to be understanding of family situations. loved working at ebay relaxed enviroment mos friendliest people ever to work with all one big family easy to get into but hsard to get hired not many hired at end of yr Fun place to work with great managers and team players. The motion of technology is forever changing and eBay empowers you to keep up with the fast paced changes that sometimes happen from day to day. Better for those with great Customer Service Skills.Hardest part is listening and taking the blame for everything wrong, even if it was the customers fault. Account support/management for top sellers within eBay AU community.  Received high volume of inbound calls seeking practical and technical assistance with listings, customer disputes and site issues.Put together training modules for outsourcers overseas, travelled to Philippines to assist in delivering these modules. There was not a difficult of this job, training was top notch and I loved the challenge and opportunity options. Was satisfied with my time there. Managers were motivated and initiated change. Workers seemed happy, although the nature of the job could be difficult; dealing with irate customers. Great place to work. Fun staffing and great management team. Good customer service experience. Energetic environment and comfortable work areas. You work 7 days a week for a year straight and they would get mad if you ask for a day off  it was just to much for a person with a family there is no home work life balance there at all Management set you up to achieve high and when you fall, the step out of the way. No support what so ever.They tell you how bad you are doing and never coach you on how to get better. I had 2 great sups, but when they left I was stuck with 2 of the crappiest sups ever. The place gave me so much stress it s not fair. The QA and Cust sat is so scured its not funny, no way to win. Hard work does not pay off with company, only who you know. My most enjoyable part of my job is being able to get the job done at the end of the day.  Knowing that I had a lot of work to do and was able to complete the tasks at hand.  I work with some very nice people. It is hard to find a job that you like with people that the generally get along with. Good team work, good benefits, rewards for doing a good job ie BBQs, gift cards. Safety first always. I worked in the inventory dept. We monitored the stock to insure the orders shipping were not short, damaged. Montitor email requests to cancel orders, anwser customer request, ie check description of parts, does it match the website, or match the description of the part the customer received. Consolidate inventory, Cycle count.Pick parts for incomplete orders. Pick, pack, ship, return to vendor orders.Add locations to the warehouse Great working at home.  Being your own boss is always a plus. You can make your own hours, the work is very easy but it is getting very competitive. Good work life balance and great place to learn new technology. Good work culture and co-workers. easy to find new opportunities withing company Work is pretty much flexible. Colleagues are good and the management is fine. Ramp up could be a little better but I would not term it negative. As a consultant I do not get perks and hence it is the only con. fun but really competitive place many kids at the school wanted to sell things.sometimes we would not have enouph stuff to sales so you would t not get that much money I am on-call, when needed, to check quality of products for re-sale on eBay.  I check ink pads and markers for ink; fill ink bottles; and make full 24-packs of card-stock paper, among other office duties as assigned.  I have learned a lot about Stampin Up, a company I had no knowledge of prior. The owner is a VERY good owner/manager of her company.  I have no co-workers.  The hardest part of my job is if I were to spill a bottle of ink.  The most enjoyable is learning more and more each time about different products they sell. This was a wonderful place to work and I wish I could have remained employed there as my family was relocated. The people were great and it was a great environment to work in! Good and Nice place to work .Healthy and supporting environment.eBay provides ample comfort and healthy atmosphere as well as scope to learn new things. I wasn't there long, but it seemed better direction was needed. They acquired a lot of smaller firms, only to let those folks go. I've learn to use my communicative skills very way from dealing with all sorts of people. I've also learned how to multitask effectively. very unstable environment. poor management. never knew if your job was secure or not. you hardly ever get a full break. Lots of backstabbing going one among fellow coworkers. When I reflect upon my experience at eBay, the first thing that comes to mind is 'perfect project execution at scale.'  From the initial idea, to Gantt chart, to milestone execution, to delivery. Perfect.The second thing that comes to mind are the people.  Even though I was a contractor, it really 'felt-like' I was part of the team, my contributions were welcomed. My colleagues were available and approachable via Skype, phone, or e-mail.They trust you to do the right thing, and they trust that you have enough sense to ask if you're not certain. eBay connects amazing people with a desire to do great things. Management encourages innovation while supporting change and improvement. Fast paced, they kept us inform about companies changes, will let you move others areas if was slow, hours when by fast and friendly co workers There are many aspects of the Ebay company. The department I worked in was very enjoyable and had friendly co-workers. Benefits are great for insurance, 401K, and stock options. In the short period I have had with this company, I have noticed that people are very technical. Very passionate people. The job is all about 'crowd control'. Many people call upset and it's about being able to communicate efficiently with them as well as being able to help and assist in any way possible to make the experience more enjoyable for the customer. I'm so happy I started my career with eBay!  They're very good at helping you grow and develop.  People are extremely kind, and slightly overworked.  It's a great place to grow! The company has a great work culture where you will get support from your co workers who are more than willing to support you to make you get comfortable with the environment. The management offer a great deal of support to the new workers and are very supportive. The most enjoyable part of the job is the flexibility you get at work. It is a fun and beneficial place to work at with a steady work environment, no outgoing calls, great management and a variety of companies to work for. pretty good big tech company, working environment is so good and relax, free coffee, drink and fruit all day at kitchen, and high paid for both interns and full time workers.People here are all friendly and helpful, hard-working. I guess advancement will be hard if you cannot master good relationship with the higher management people. With the work-life balance that the company promotes, it gives me the freedom to do more activities outside of work that help enhance my personality. Stress, for me, is just a thing of the past. My job selling with EBay has many aspects to it. I have to buy items at a good price, so finding and negotiating prices are a high priority. Knowing the trending market and prices take daily research. Shipping can be demanding also, shipping the right way can make or break your profit.Overall, I enjoy the challenge of the job. I like being my own Boss, and working from home gives me a flexible schedule. A typical day at work was enjoyable. Took over 50+ calls customers were easy to talk with about their online orders it was a nice environment. Love to sell unique collectibles and antiques when I can.  I've been selling since 2002 and never get tired of it.  A typical day at work is taking pics, measuring item, listing it, waiting on someone to bid.  I have no co-workers or management.  Hardest part is finding a box.  The most enjoyable part is when someone receives my item and they love it. fun but really competitive place many kids at the school wanted to sell things.sometimes we would not have enouph stuff to sales so you would t not get that much money A taxing contradiction of highs and lows in moral, sociality and ethics. A gravitation for those less burdened with acumen. eBay is a great place to work, but work/life balance can be kind of tough.  Especially during the holidays.The culture is the best part of working at eBay.  Everyone works hard and is passionate about the company. Wake up at 6. Arrive at sales at 7. Back home by 11 to list my purchases. Route myself the night before.Hardest part: Listing the stuff at a fair price that wont be undercut before it sells.Most enjoyable: Finding valuable stuff before the next man. Ebay is a fantastic place for a career in customer service. I not only enjoyed the work I learned professional management skills. I also coached the Ebay Corp Softball team. We one Championships. Ebay is a great environment to work in all around. The only reason I left was to relocate to Phoenix Arizona. I fell in love with eBay because I can buy and sell things online while I was in school & college. I needed the money to support my livings. So I didn't have a job back then due to school. Basically its a side-job and not a real job. I worked dependently and its hard work being the only person doing all the work at home. I like to advertise very professional with photos and details of the item am selling. Pretty much I sell collectible & rare items, posters, movies and video games. I ship daily depending on the item I've sold. I don't drive a car so I had to walk back & forth to carry & drop-off packages. I never had a problem with my customers because they're always right and I want to make my customers happy. I answer phone calls 40 hours per week and speak to customers who need business development. Usually, the calls are inbound. When I am not on the phone, I am training new hire classes to take calls and field the inquiries that we get as phone agents. The most enjoyable part of the job is the different personalities I encounter all day and also getting to help develop other employees. The hardest part of the job is the abuse that sometimes comes with speaking to a disgruntled customer on the phone. I have been working for this company for a while simply because I can work from home. The pay is very low and the client I work for is very inconsistent and is not agent oriented. I truly feel like they don't care about the agents as long as their unrealistic goals are met. What I learned while working at ebay is that dealing with customer can be overwhelming but each customer is different so therefore you have to find techniques and the proper words to use without getting the customer upset even when they are wrong. Productive and Fun work place with large data allover. Good work life balance. Company that uses latest technology and its been a great learning. Answer customers inquiring concerning paypal accounts. Fast past environment. Need knowledge on different account transactions to provide accurate information to customers. Co-workers are team players and easy to get along with. Management is very informative and helpful. on a typical day there you'd walk up to 10miles during yourselfi learned how to work at a steady and productive pacenever really got to meet managementmost co-workers complained all daythe hardest thing about the job was maintaining your energy to last 12 hours I enjoy working for e-bay enterprises, through the Adecco Group. I was a managing personal supervisor over the Adecco staff.I really liked my position, and what I did on a daily basis, but due to the nature of a seasonal position, and lower then expected sales forecasts, the mid season peak was much short then first calculated.But overall I enjoy working with all the E-bay management, and had the opportunity to learn all about the world of e-commerce, and what it takes to make it work. My day starts very early, 5 a.m., four days a week. My supervisor and Lead have put me in charge of the Petsmart department for the moment. I get my scanner ready and walkie. I would be picking or packing pet supply all day, such as dog food, kennels, etc.. I also know how to engrave pet name tags and embroidery which is sewing into the leashing and collars.  Being organized throughout the day make life at work much easier and less complicated. I like to get things that need to be done quick and neat done first so we don't fall behind. Also being on task and working makes my day go by very fast. The management is somewhat involved. They sure do see what we, as employees, are capable of and acknowledge the skills we have.I've have many friends at work. I get along great with everyone and i don't like having that negative energy around me too much. My co-workers are always telling me how I'm a great worker and always seem happy to be doing my job. I would have to say the hardest part of my job is trying to stay on top of your production and well long you can keep it up for, I have not had a problem in the because I always made sure to stay on top of my game. I like working at Ebay. They just have a friendly staff and the job itself is pretty easy. nice place to work. Very smart coworkers. I have gained a lot collaborating with others. Challenging place but rewards are always given. Very stressful at times, hours vary week to week. Some mandatory overtime and mandatory under time. Pay is to low for the stress level and the job requirements. I love being able to buy and sell things on the side to make some extra money. I highly recommend buying or selling on eBay. Ebay is very employee orientated. They treat you like family. I enjoyed helping my customers and all the incentives. The hardest part of the job was when a customer was not happy. I always strived to ensure happiness. I started working full time for Ebay. Same place as GSI. The only difference was I received benefits and more pay per hour. My job stayed the same. I worked at ebay for a long time.   Not all members of management understand the value that someone can add and are dismissive if they don't understand.  I learned a lot I over all enjoyed the experience, but I would not go back. •	Picked orders and delivered them to the delivery platform.•	Reported any damaged or malfunctioned products. I lived working there and wish I could work there again. fun but really competitive place many kids at the school wanted to sell things.sometimes we would not have enouph stuff to sales so you would t not get that much money fast pace work environment.  Management changes hands frequently.  Company going through a split on top of that they are using many new systems. Good if you don't have a personal life. No consistency. Always changing. No organization at all. A fly by the seat of your pants type of management.If  your BFFS with the owner your untouchable and the rules don't apply to you. I enjoy working at ebay because of the flexible hours and the ability to work from home. The only thing I don't really care for is the call scoring. Some of the things that they say 'you should have said this instead of that' or being counted off for something that you did not even realize was something that they expect you to say to a customer while placing an order. It just seems like the scoring has the ability to change with every call, nothing is black and white. The position offered a lot of great benefits and accommodations for the employees. However, the management did not follow through with any of the changes and promises that the company offered regarding to changes being made to improve the overall employee experience. eBay takes very good care of their employees in many ways. They provide great insurance options and a retirement plans, as well as employee stock purchase programs. They not only welcome, but truly embrace diversity in their workforce. There is plenty of room for advancement and promotion for anyone who's hard working and dedicated to the eBay brand and culture. Great peers and management, fun work environment. Work/life balance is as important to the company as the employee. They allow you to be integral part of change for the company and allow  you the latitude to take care of customers eBay is an okay place to work, but they don't care about family. So if you have small children better make arrangements if they are sick or have dr appointments Started day out with doing a box audit, then putting away product that was incorrect. Learned that it was harder then it seemed to work with the same people everyday that had odd attitudes, but loved learning how to get a time management down to a the very last minute. I learned a lot of new things working with ebay. Like how to work a scan gun and all about shipment. The brakes were great and they had a pool table for a little fun and unwind time. They provided lunch most Fridays and they try to work with everyone. eBay bought GSI (an e-commerce company) and laid off key personnel without any logical reasoning. Then they decided to sell us off. Laid off the personnel who made them the money and put those how didn't know what they were doing in charge. Morale is very low. Many employees have left. Middle management has no idea what direction the company should be going in. eBay is no longer a good place to work. The board cares more about money in their pockets. I left because I had nothing to do since November 2014. Some might find that appealing but the days get very long. My manger and supervisor and half of the team I worked with were left go in February. I just figured my time was next. This has been a great experience to test my personal skills and work ethic to the max. The job is not incredibly labor intensive nor are their long hours but, the work is weighted differently during the course of the week. Typically, per start of the week (usually Friday and Saturday) I gather the auction items, photograph them, write the individual descriptions, write the various conditions out in detail, list the items, and then monitor the auction for the duration of the time limit. During the course of the auction, I was responsible for answering questions, monitoring bids, or sold items, negotiating terms of the auctions with interested customers, packing items, shipping items, inventory management, and ensuring quality control at the time the item is received by the customer. While, the job does not have strict set of hours per say, it does require constant computer/technology monitoring and a very high level of persistence to ensure that customer's needs are met. In addition to that, I was responsible for the products to be received as the listing has outlined. If the item was not received as described, I was required to then fulfill their needs through customer service to ensure that they had been treated with respect and the problem had been solved to the best of my ability. More times than not, that meant bending over backwards to make sure the customer was happy. Thankfully, I have not had too many issues but, every time something did not go as planned; I can honestly say I learned something to better help myself down the road. Also, it makes getting positive feedback  from a happy customer even more rewarding knowing that I did the job perfectly. I have really enjoyed the 'weight' that this job entails. What I mean by 'weight' is that all the responsibility of the  job falls entirely on my shoulders. I do not have anyone else to blame if things go wrong but, I also do not have anyone else to thank when I do my job correctly. I have to manage the items, be the photographer, pack, ship, buy, sell, answer phones or emails, advertise, promote, and provide customer service. Most jobs have individual professional careers for those positions I listed in order to fulfill all of those responsibilities. Having to wear all of those hats at once has really made me appreciate multi-tasking and having to answer to only yourself. All the success, the strides, the achievements, and the problems are a result of me and me alone. Their is truly something special about having to answer to yourself, being your own boss, and being your own motivator to push harder. It makes working with others much better as well. I know what I can do, what I can handle, what I am good at, not so good at, and has made me even more of a team player. From this job, I am more confident in my abilities so I can be more help to those around me because they will never have to pick up my 'weight.' I know what I can handle from being the owner of my eBay storefront. working at ebay was very fun i had a lot of positive hard working people around me who motivate me to work harder and reach higher goals The job was amazing, the people are great, and always willing to help. They are a great group of people and are willing to help you get where you want to be. Working in the dispute appeals dept is awful. The pay to listen to people literally scream all day is horrendous. I get that customer service can be bad sometime but this is out of control. sellers calling in and screaming like small children throwing temper tantrums is insane. Not worth the pay. I was part of layoff in 2013. Almost all of those I worked with have been laid off since in the account management department.Managers are very restricted in what they can share with their teams.Everything at the top is very hush hush. You feel competely helpless to influence anything the company is doing. I worked in marketplaces. You have to have college degrees to move up. Receiving calls from customers with questions or concerns about their online order. Co-workers and managers are very nice with correcting mistakes or if you were uncertain about a policy. Also very encouraging. It was hard dealing with customers who always complained, but it was great when you can hang up with a smile on your face. eBay was the best company to work for ever, until it wasn't.  The company cared about employees, and rewarded hard work.  That lasted about 5 years and then it changed.  Sad, really. I loved working for Ebay (GSI Commerce) through kelly services because not only were the benefits great but the pay was as well and the overtime was good as well. This company has strong plans and goals they would like to hit. However by them being a new company with the global and collection world they have struggles to keep consistent with rules and policies. My typical day at work is working with large cross functional teams to ensure we meet or exceed the clients' campaign goals. fun but really competitive place many kids at the school wanted to sell things.sometimes we would not have enouph stuff to sales so you would t not get that much money Ebay USED to be an AWESOME!!! place to work, UNTIL the management changed hands, NOW, people are Quitting left and right! The Current Manager over our vertical IS A COMPLETE Dictator! Assigned Seats and ALL, ( I mean Really, We Are ALL adults HERE! ) My coworkers are EXACTLY What made the job enjoyable and bearable! The pay is Already Horrible enough! Now WE have to be Miserable too!!! a typical work day is waking up late checking your computer for sells.. shipping out the merchandise as fast as possible.. the most enjoyable part of the job beside the late wake up time is all the free time.. EBay is a great platform that allows you to work for yourself. You post when and what you want, within guidelines, of course. You can charge what you want, and you interact directly with your clients. It has made supplementing income a breeze. Enjoyed doing international business. Increased traffic to my own individual business.  Great Communication.  Time management is an essential benefit to selling anything online.  It allowed me to become an excellent researcher and provide customers with product knowledge. Fun, productive and fast paced environment.Innovative and Industry leading.Great balance, associate friendly atmosphere.Great benefits and great teamwork. Manager show favoritism some people work will others sit in the office with management. Pay Sucks!!!! The health benefits are great though. flexible hours, unlimited income, the only thing i dont like about them is that they only protect the buyers not the sellers This is the kind of job that I doubt I could stand for more than two years. Yes, it seems easy (from an outsider looks in perspective). We get to sit down for 8-hours a day and basically do nothing. (Almost) all of the information is laid out in front of you, and you just need to assist the customers in the best way that you can. It sounds great, and simple (which it honestly is) if it weren't for the people who are actually calling. I would say about 90% of the contacts you receive are because the person is experiencing some sort of problem. Many people are angry, and they are not afraid to take it out on you. It's not that I as an agent take it personally, however the negative vibes definitely wear you out. After a full-time work week of hearing people complaining, moaning, cursing at you, and basically calling you the biggest idiot they have ever had the displeasure of speaking to, you wonder how some people have done it five days a week for 5, 10, 15 years. I could never. I would literally rather do ANYTHING else than work at this company longer than I have to. As a chat and email agent, you are also expected to take phone calls at a moment's notice, while still maintaining the email/chat productivity expectations. This is fine every now and then, but incredibly infuriating when it is an everyday occurrence. Particularly frustrating is the fact that the management of my department can't seem to get their act together long enough to realize the huge and unhelpful scheduling errors they are accommodating. I work a late night shift, leaving a few hours past midnight. Usually,  I am one of two people in my entire department at the end of my shift. Daytime shifts, as coveted as they are, are far overscheduled... to the point where massive amounts of people get sent home every day, leaving service levels to begin spiking around 8 or 9 p.m, when coverage starts to thin. This kind of timing mistake is so easily noticeable to everyone. Everyone, but the people actually in charge of the schedule. Advice: if you are an upcoming agent and your vertical features an 'amazing' email and chat team... do not join it. Under any circumstances. If your vertical is anything like mine, then your supervisor will expect you to do three times the work of a phone agent while upholding far more stringent quality standards, for the same $10.00 an hour. It is totally and completely not worth it, unless you have a short temper and are easily irritated, in which maybe the phones would not be the best option. Either way, every training session you go to for new partners or tasks basically just means that you are earning the company more money while making barely over minimum wage... so don't stress too much over this job. Pleasing the customer is far less important than your sanity and blood pressure. Maintain Video Conferencing equipment in 150+ conference roomsWork with deployments to ensure accurate deliveryShipping and Receiving of all AV equipmentWork with vendors to execute accurate project completionAssist in closing tickets and handling escalationsWork with operations on new policies and proceduresConnect and assist in executive meetings Maintain inventory of all AV equipment	Participate in meetings on overall VC activity. Ebay was one of favorite places I worked in, I enjoyed working with the my Ebay manager and co-workers who were extremely helpful in my career growth. Great job, I worked for many different verticals including Sports fanatics, Kuerig, and American Eagle. Great people and over all great management. Lots of opportunities to learn different aspects of the business internally and externally as there are so many faucets of eBay Enterprise to work within. Locations span across the United States and there are teams working on everything from agency services to developing an in house brand. Working at eBay has had to be one of my favorite jobs. The people were great and the facility was a safe place to work. The hardest part of this job is conditioning your body to get used to walking for 8-10 hours a day. Helped customer with their ordering needs as well as trouble shooting brewer issues. assisting co-workers with any questions they may have. Replying to customers via email. Work was usually busy, always running around picking out the contents for the order. I learned how to pace myself in order to finish the job on a timely matter. The management was decent, but it was hard to find them if they were needed. The hardest part of the job was actually finding the items because the warehouse was far from organized. I enjoyed that it was busy so that the work day did not take long to actually finish, time flew by. Took pictures of goods, priced and uploaded items for sale for a professional seller. A Simple job that requires a lot of attention to detail and quick computer skills. A typical day at work was fast paced and very productive. I learned how to pick and pack merchandise. My co-workers and myself got the job done as quickly as possible. Great work environment, fun atmosphere, and never boring, different work all the time. Very diverse group. No full time opportunities or benefits. If you were a loner or a family of one with 0 personal life its the place for you and you only if you were a DBA. It was the only work experience that left an extremely bad taste in my mouth and the only place I actually quit since I been a professional. Handled calls learned to follow script dealing with fraud hardest part and upset customers cursing at me. Most enjoyable part of job coworkers and managers. fun but really competitive place many kids at the school wanted to sell things.sometimes we would not have enouph stuff to sales so you would t not get that much money If hard-work-to-growth is your mantra, then this is not the best place for you. The management values blabbering a lot more than actual work. No wonder many people take up that route, ultimately slowing down the company's growth. The most enjoyable part of my job has been turning around an negative situation to a positive for our clients and Assisting our seasonal workers with  their new jobs. Focused on keeping the staff motivated while focused on the job at the same time . The company also held contests to promote higher achieve and rewards excellence. eBay has a great work life balance with PTO starting from day one, excellent health coverage and multiple team building functions allowing for a strong and friendly work environment They talked about how important work life balance is and how we should do the right thing but didn't offer a lot of chances to get time off and policy was too rigid to be able to do the right thing in most cases. Most employees have been in my division for 10 or more years.  The work environment is relaxed and the people are like a family. Plenty of opportunity and fun. Fast paced and not for the meek.You can make a career there. Benefits are great with a few hidden perks Opportunity to take on new challenges but highly political the higher up you go.  Finance leaders seem to need to come from GE or people who are willing to step on others' backs to get that promotion. Management talks out of both sides of their mouth.  A lot of politics and favoritism.  Decision making is slow.  Work/life balance is good. I use ebay to sell extra stuff around the house as well as car parts. Great for making extra money on the side. It can also be used to start a business. •	Lead role in controlling and managing data devices, set up maintenance schedules, distribution lists, set recovery and inventory procedures, group instructions on the applications of the devices, and software and hardware troubleshooting intiatives. •	Installed and reimaged servers, patch panels and switches•	Wired servers in racks and network cage•	Troubleshot Cat6/RJ45 connections along with data and fiber optics•	Software support initiatives as Systems Administrator•	Provided hardware voltage support along with network support•	Responsible for the tape library daily for remote site delivery and part inventory for the datacenter•	Installed wiring Cisco 6509 & Cisco 6513 routers, Citrix Terminal servers and associated peripheral components eBay let me have an impact to thousands of people. eBay has the scale to better the lives of hundreds of millions of people, and for the most part they try to do just that.  Good work-life balance and good compensation.Challenged with high profile projects but not consistently. There are some amazing people at eBay and there is a lot to be done to get the company back on track.Good benefits like free gym, free breakfast. I received a lot of stuff for different companies. How to receive and how to receive right. The management team was very good . Co-workers were like friends and like family. Hardest part of the job was lift all that cat litter. Was great part of the  job was the quarterly meetings and getting the great gifts that give at the meetings. I worked here for only a short period of time, and I was amazed with the stupidity, uptight, ignorance, insecurity, paranoia and other things this company showed me. I was always getting griped at for using the restroom too much. You know what, I'm not going to hold my waste just because it's 'Distracting' to you. They put on this big show for all their new hires but when you have to use the restroom they get all uptight. DON'T BELIEVE EBAY'S LIES! It's not paradise like the people who work here say it is. Great company to work for. Great company for learning about ecommerce, search, and big data.Relaxed work cultureinnovative companyScope for growthgood management A typical work day consists of answering customer calls for a certain client which you have somewhat minimal training on, which can make things escalate very quickly. Learning as you go, its a sink or swim job. You do have resources that are somewhat organized but do not cover everything. The benefits are great, and if you ask for help, most of the time you get great help if you appear to be asking good questions. Its a very business oriented atmosphere, which means if they do not need you, well good-bye. Management is efficient and I have come across some very great individuals working here. The best part about the job is interacting with interesting people from diverse backgrounds. What I have learned from this job is to get my college degree as  soon as possible and be the least expendable wherever I may work. -Enjoyed working for eBay as a full time and contract worker-fun enivornment-great people-mulitple locations in the bayarea-flexible work life balance eBay Enterprise is a young company that offers a culture of innovation. The company is still trying to find its sea legs admidst acquisition and reorgs but it is definitely doing very innovative and game-changing marketing in ecommerce. The most difficult part of working here is the ambiguity of job roles but this can also create opportunity for those who are more entrepreneurial. Ebay is a great environment that has great benefits for it employees. they match 401k on first day and provide great health care and stock option benefits. its a pay for performance company meaning they provide great bonus for their best employees. It was a normal company work day.  Environment atypical due to upcoming ebay/PayPal split and a lot of re-organizing.Like many companies, smart people. fun but really competitive place many kids at the school wanted to sell things.sometimes we would not have enouph stuff to sales so you would t not get that much money eBay was a good place to work. Many smart people. Good work life balance. And it's a great brand name. I learned a lot during my time at eBay. Supervising and leading employees to ensure accuracy and completion of all tasks. seeing day to day tasks were completed as well as working with customers and customer service. Fantastic company. Fun, great pay, great culture. The people are what make this place somewhere you want to work. Great Pay, game room, free drinks, great benefits. Magento (an eBay Enterprise Company) is located in the heart of Culver City. Its can take nearly 1 hour during peak traffic times to drive 12 miles to the location. Once you are there parking is limited and you either have to have an assigned space or fight to find a spot. The Magento product is built on PHP. There are only 50,000 true PHP developers in the entire world (5,000 in the USA) which makes it extremely difficult to find talent to support the product. Leadership is short sighted and does not have plans to use a widely more universal language such as Java (10 Million Developers world wide). Advancement seems to be very frowned upon in several departments. (Mainly due to the lack of talent) eBay is also selling off eBay Enterprise which has also lead to nervousness in the workplace. Leadership seems to believe that work should come first over family and creates a difficult culture for people with young families. •	Owned/Operated an on-line store specializing in designer clothing, shoes, and accessories•	Created and managed a website focusing on target marketing•	Procurement and control of inventory. Managed over 1500 items at any given time and listed items to the public through the online auction or Buy It Now venue via eBay.  •	Dedicated to customer service through constant communication via email and feedback•	Created spreadsheets for inventory and data input, as well as, tracking shipping information. •	Accounts Payable and Receivables this job helped me learn a lot about working in big offices, it shows you also that in the working world its not always about your skills its about who you know I manage and train 22 safety & security officers normally. During the peak season, this number increases to 30. I investigate all incidents especially those with injuries. If a constant is identified, we address this with training or corrective measures. In the fulfillment center, there are many conveyors. Conveyors are very dangerous and I help with properly training the trainers. The best part of my job is interacting with the people. I enjoy getting to know people and if I'm able to, help them make there job easier and safer. At eBay, it was an fast paced work environment with many positive challenges taking place daily. There can be countless alerts or tasks that must be addressed to meet the SLA (service level agreements). The most enjoyable tasks at eBay was been able to troubleshoot technical issues with other groups to find the root cause of the matter, and being able to make suggestions to make their application run more efficient. The important thing I learn was teamwork. As an organization, we were able to logically plan out time and tasks for each team member to do as a part of the bigger operational support shared goal. Enjoyed my time there, albeit short due to consulting contract.  Definitely would recommend, learned a lot and some really good folks.  Millennials there are rude, distant and egotistical, but they don't know any  better as they lack life experience. Frequent turnover in executive leadership, strategy constantly changing, difficult to stay focused, future very uncertain. There is hope that  things settle down and turn around for the better but the company can't seem to get its footing. a typical day would be to go in and attend morning meetings to find out ho much work we had and would be expecting, start work position immediately after morning meeting, be very productive in timely manor, learned how important timeliness can be during a peak season. My supervisors were approachable but firm. my co-works were easy to get along with and worked well as a team. hardest part was it was very computerized and if systems were down it was impossible to do the work that need to be done by a deadline. Feeling to be an important part of a successful company with a strong working team and pay day. Flexible hoursexhibits tech company culturefabulous, friendly, hardworking co-workersamazing talentEnjoyed meeting all of the new hiresno room for development The employees all were very helpful in explaining everything regarding the systems, how to interact with customers, etc. Great people to work with. the company has a good cause to help accommodate transactions with sellers and buyers all over the world. This is an employer dedicated to production as well as making it simple for you to care for self, family and unforseen emergencies.  The overall atmosphere is everyone helping each other.They are truly invested in the employee so that the employee has a clear mind to be productive with little or no distraction. Ebay is an awesome place to work when they aren't selling it every year. They provide activities, meals during holidays, xbox, tv's, pool table, and small gym for use while on breaks. Typical day at work includes lots and lots of phone calls. Management is different through out the building because of all the different clients there are. I learned how to manage a team and at the same time keep the team members motivated. Project Management helped me get promotions within the same company. I learned alot from my superiors and took criticism positively. Talented employees in a fun work environment. Too many large, overarching company direction changes in too short a span of time. eBay gave me opportunity to learn internet marketing business. I am very proud of having chance to utilize one of the biggest and most comprehensive data set to analyze customers' behaviors. Especially, working with smart and nice co-workers in the team helped me finish smooth transition from IT specialist to marketing analyst. A typical day at work consisted of assisting dissatisfied customers, tracking packages, honoring discounts and promotions, placing online orders for customers. I learned how to type quickly while placing orders. Management wasn't very effective, regardless of what they told you or promised you had to be overseer by a senior supervisor. My co-workers were the very best thing about the job, they understood the feelings and situations we went through. The hardest part of the job is being cool while getting blamed for something you had no doing of. The most enjoyable part of the job is knowing and hearing the joy of a regular customer coming back for to place another order because they're so happy with your knowledgeable experience. fun but really competitive place many kids at the school wanted to sell things.sometimes we would not have enouph stuff to sales so you would t not get that much money I learned a lot at this company as far as customer service. It was not a stable position though because they always send you home early. Too many layers and re-org very often, not easy to stay stable ;Good thing is to have cross functional team work opportunities. I've worked at PayPal for almost 15 years.  I've had numerous opportunities to expand my skill set, travel the world, and I've been honored to meet some of the greatest people I never knew I needed to meet. Training was amazing and I loved working with all different kinds of people. The job wasn't for me, but I believe I had taken a lot from this training class. really a great place to work. takes awhile to get used to but is a fantastic experience. really enjoy working here, would recommend to a friend. Ever changing culture that leaves you job status in limbo. Management can't get out of their own way, but they pay super well. A typical day at work was waiting on a open computer, getting bombarded with calls some good some horrible. All around a goood job if you have the skin for it. •	Assist  customers with the purchase of tickets and tracking of customer orders •	Provide tech support in Trouble shooting in customer account and system issues •	Assist with customer charges , payments, credits and compensations•	A member of the Customer’s Resolution TeamThe Hardest Part of Helping is the system Issues and handling each issue within a 1 call resolution. A typical day at work consisted of picking items throughout the warehouse, and putting them in the correct slot on your cart. Normally every cart would have a total of 25 order sheets, each sheet containing multiple items for you to pick. Than I would switch to packing the items from the finished picked carts. I learned to bubble wrap, bag and box multiple items from clothes and shoes to toys and glass items. Packing consisted of inspecting items, making sure the correct items match the order sheets, packaging items safely and correctly, and labeling all finished orders to be shipped out. The hardest part of my job I would say was packing heavy glassware and cookware items, lifting the 50+ lbs finished packed orders. The most enjoyable part of my job was learning new skills and jobs. eBay was a friendly and open company. The emphasis is on getting your work done on time and not necessarily being at your desk from 9-5. It was flexible and working from home was an option. I learned how to strive for great customer service, to always listen to customers issue and problems so we can  find the solution. Management was an open door policy, they were always concerned and interested in our ideas to better help the customers. My co-workers were all very professional and fun to be around daily. The hardest part of my job is to stay firm to our policy and procedure but also find the4 best way to please and satisfy an irate customer. The most enjoyable part is when I will de escalate an unhappy customer, to insure they  will hang up happy. The company is in a major rut especially with the change of Leadership and moving out PAYPAL.  It's going to have to find its way as its no longer a leader at all.  Big 800 Pound Gorilla that survives because of Google Search Placement not because anyone actually thinks I want to go shopping at eBay today. Great Place to work , friendly environment and great work life balance. Aces Data is great , with constant room for growth . I never had a typical day at work, which is what made eBay a great employer.  I was the financial analyst for a single distribution center as well as a member of the finance team.  Each day had a new challenge, either working with the distribution center director or the finance team.  The finance group was a mixture of talents and skills, each analyst was able to work on a task for the entire division that fit their strengths. great people and awesome place to work. the people that work for eBay are amazing. They really love the company and what they are doing. EBay provides plenty of opportunity to learn the newest technologies and implement them in meaningful ways.  Ability to move to new projects is encouraged. Very stressful job. Sports had very poor management. Floor walkers were rude. Became very difficult to find help when needed. Co-workers were very kind. Hardest part was it became very mentally draining. Management is poor and executive management is even poorer - seems to change direction every 6 months. First they bought GSI and raved about it and within 2 years want to sell it off. Ebay is a fun job to work at you get to meet new people, you get to see when the customer service experiment is like, taking calls placing orders, troubleshooting. Working for Ebay Enterprise was a wonderful experience. Great training. I looked forward to going to work everyday. Thank you. fun but really competitive place many kids at the school wanted to sell things.sometimes we would not have enouph stuff to sales so you would t not get that much money A position that requires excellent language skills which I have. I enjoyed most phone calls, others were a bit repetitive and unchallenging On a typical day from clock in to clock out, I was on the phones. I'd log into my phone and as soon as I did I'd be receiving a call. I had to make sure that every customer on my telephone was happy and satisfied by the time the phone call had ended. The best part of my day was being able to make a customer happy and actually hear the relief in their voices that the problem had been resolved. The hardest part of the day was always right before clocking out, because it seemed as though as soon as you're about to clock out you get swamped with several calls. Overall it was an amazing workplace. You had to have patience, but not every customer is the same and it made me appreciate my job knowing that I was making someone else's day better. Customer call center, receiving calls for existing orders, new orders, returns, customer complaints Great team leaders and good environment. I advanced there after a year you can do that soon most of the time. They are tough on breaks and lunches. You speak to great people. eBay is amazing. I love going to work everyday and having the opportunity to collaborate with so many bright minds! I've had quite a few managers over the years and I've never had a negative experience - that is saying something. I truly appreciate the culture of the company.Free soda! Snacks are provided to the entire campus one day a week. It's a demanding company to work for, we work hard. Sometimes, even though most do their best, the work isn't always done in the most efficient way and people can burn out...this is by far the hardest part of the job.All in all, I love the company. I could not have learned more or had a better experience at eBay.  My managers were always supportive and encouraging.  My team members are fun to work with,, extremely smart and interesting.   The only reason I gave 'Job Security/Advancement' a 3-star rating is because of timing. Unfortunately, Not the greatest job opportunity with eBay. They made many false promises and laid off a lot of fellow employees that worked at my side. Others took severance packages which calling a low ball was an understatement. The environment was great! Basketball hopes and other games to keep you busy. Cool people to work around, But the overall leadership is looking to ship US jobs out the country to save money. Not my first choice for a good future for my family and I. I love being a seller on eBay for many reasons. The freedom to work whenever I want, however I want, and in whatever I want. I've learned a lot about this job. One, you're the only boss around as long as you follow the guidlines. Two, the buyers can really do a number on sellers. Three, once you start, it's hard to stop because of how easy and fun it really is. No proper planning, the result of it decision making is delayed for every little thing. WorkLife balance also need to sacrificed due to the pace of the working culture and decisions are made at the last minute.I manage the checkout platform team. work day was simple with the incoming callers.  A small amount of the management and some co-workers lacked in professionalism. In order to excel self-motivation is a mandatory thing. Majority of the co-workers was a pleasure to be around making you want to do overtime. Working for myself is both enjoyable and stressful, solely responsible for all sales, marketing and shipping, this is a great side business, though this is not a full time career and lacks benefits and growth. at home sales proved to be fun and fulfilling. Though only temporary. Good environment to be in. Not sure about how advancement really work as their was no clear direction on a path set out for individuals. Good improve software and company internal resources in order to compete with fast developing companies . good management and supporteverything is VERY compartmentalized (there is a team for everything) and it can be daunting to learn what team owns what most enjoyable part of the job is being encouraged to take time off and maintain work / life balance Great Job. Great people. Good pay.Management is committed to excellence.  People are friendly and willing to help.  The campus is huge and can be intimidating, but the people are nice and will guide you where you need to go. I liked working with Ebay! Learned a lot about warehouse work! Great People to work with! Look forward to going back next Holiday season! I fell in love with eBay!  I went to work, practiced my Spanish (and other languages), and helped PEOPLE!  I learned the importance of hard work and diligence.  I learned of the importance of supporting peers to foster the beauty of community. The hardest part of my job was monotonous emails. The best part was the positive culture, great pay, bonuses, benefits, incentives, prizes, games, events, and so much more! Best Part of CompanyCollaborative MeetingsEmpowered to really take ownership of projectsGreat TeamworkRecognition for EffortsHardest Part of JobLong hours sometimes (some evenings and weekends)Competing with resources I work with talented people and meet new challenges every day! A typical day at work would be just go in with a positive attitude and do your job as fast as you can. I learned how to ship out packages, pack packages, and pick orders to be packed. I enjoyed working with the Leads because they were always positive and helped you when you needed help. I loved everything about this job and really want to find another job like this. Really disappointed that is was only seasonal. fun but really competitive place many kids at the school wanted to sell things.sometimes we would not have enouph stuff to sales so you would t not get that much money Being an Ebay seller is a pretty thrilling experience. Having a stable and secure platform to easily sell items across world while setting your own hours is fun and rewarding though also demanding. Having total control over your own hour is a huge plus but not having a dependable salary can be daunting. This is a great service for any retail sales business that can sell online. It expands your customer market tremendously. I have gathered a vast amount of knowledge on many different items that come in to the shop. Learning the market values has been very helpful in making profitable buys.I normally come in and ship out items that had previously sold, after answering customer questions. I list items on Ebay for the rest of the day, and also buy, sell, and give out loans in store.The co-workers are great to be around, always making it a fun environment. The hardest part of the job has to be trying to find the right price to give on items that I may be unfamiliar with. The most important part is to negotiate with the customer, in which it helps both sides. The most enjoyable part of the job has to be all the different items that come in from guitars and music equipment, to cool antiques, to collectibles and more! I learned how to do consolidation and inventory. As well as time management The company cares about its employees. Their is a fun work atmosphere, and a great morale. I enjoyed working with all the different types of eBay customers, no two were ever the same.  I handled incoming dispute calls, this gave me the opportunity to use my negotiation skills.  It was my job to make sure both parties the buyer and the seller felt they were treated professionally and fairly.  The work environment was one of self discipline and self management. Clean warehouse, nice people to work with, long hours during peak seasons, benefits are top notch, pay does not match the amount of duties and personal effort that one needs to get job UPH in a day, there is no guarantee of longevity as favoritism and many family members on same shifts make it nearly impossible to be recognized for individual efforts one surrenders to this place of employment, many Temp agency layoffs yearly, management does not hide their catering to majority families, ethnic diversity is not on the menu, very loose job culture, the job culture in this workplace is not compatible with a mature adult with a strong work ethic or previous background in warehousing and drop-shipping environments. This is a great workplace for a student or person with little work experience or no previous job skills. Working was a enjoyable experience. working for Ebay I learned how to pack and also wrap gifts. Their management team is really helpful and caring. Some coworkers we're rude but I learned ignore people. The hardest part about working for them is that you have color coordinate certain orders. I loved working for these guys. It was a great, relaxed environment with a terrific work ethic beneath everything. My problem was that I was a contractor and got caught in a layoff. None of the eBay people wanted me to leave. But that didn't make the difference. The eBay developers are a great bunch of people and if you're lucky enough to get in there, count your blessings and work hard. It's worth it. The job itself is a peaceful job to work in but the management for the Sports department has way to much drama. The best thing to do is to find a secluded computer and just work. This is a company who just take care of there customers not there employees, Executed all clerical/administrative tasks and provided member services. Performed supervision and mediation over stocks, sales, trades, and profitable gains. Accelerated through a thorough understanding of the project and company policies and guidelines, and how they were best executed. Administered acts upon phone reception, banking, payroll, typing, accounts payable, accounts receivable, money transfers, and basic operation duties daily under the authority of eBay, Inc. Appointed additional leadership positions, marketed, and solicited all brands of electronics. schedule was 6am-4:30pm Tuesday - Friday. Mandatory over time was every day not scheduled. There were days we wouldn't be there for an hour but would get sent home due to no work. Most people may not consider this, but where you work is only one important factor. A major factor is the people you work with as well as for. You want to have Managers who care about your growth and care about the company, as well as fellow employees who are teaching correctly to the new comers and actually acknowledge concerns of them. This company is much like this, though the hiring team are very disrespectful and always looking for and making excuses. Experienced professional with more than 12 years commitment in emphasizing sales, marketing and business development in internet sales along with the drive, determination, and expertise to take your sales to the next level.--  Sales -- Networking -- Internet Marketing -- Budget Management -- Customer Service     -- Inventory Purchasing wholesale auctions and set price wholesale lots. Listing of lots. Listing of individual items.Inbound shipments.Outbound shipment. Packaging.Customer service via email, telephone and eBay message service.Return replacement and refund service. My job on a daily basis is very fast past. I have learned how to obtain information for multiple clients. Acquired the information to train agents, I have become great at working under pressure and being able to adapt to change very quickly. My co-workers are great. We all work as a team. The hardest part of my job is to not get the procedures and policies of other clients mixed up, because i know so many. I love my job because i get to interact with people on a daily basis, and thats what i love to do, help others. Predictive Coding and scoring tools were used to find the most relevant documents for Legal Hold and Legal review by Corporate Attorneys. Daily job:Handle cash transactionsBalance and check all checking, savings and business accountsMake sure cash drawer tallied at the end of the dayMake sure all checks are accounted and credited forHandle loans and loan paymentsThe hardest part of the job was pressure from management to make sure the customer is happy and the transaction was done in a timely manor.The most enjoyable part of the job was working and bonding with the employee's. I talk to over a hundred people a day during my calls, and I must say that I love it. I meet so many people, and some of them have the most amazing stories and are just the nicest people. I have my angry customers, of course, but even those are good. eBay is a great place to work.  The health benefits are incredible and the work life balance with pto, sabbatical, wfh opportunities are great. Advancement is great.  And if you are willing to move, there are even more opportunities to continue your career in San Jose. fun but really competitive place many kids at the school wanted to sell things.sometimes we would not have enouph stuff to sales so you would t not get that much money It is nice to work on your own time schedule and still have time to fit in family. Developing Framework for Middle-ware Automation using IBM RIT•	Automating Tests using RIT•	Developing Reusable components for Integration and End-End Tests•	Configuring WebSpehere MQ's Sonic MQ's through RIT Architecture School•	Publishing, Subscribing to Mailboxes and Queues using RIT•	Creating XML's based on XSD's and sometimes using XML's only•	Validating Tests using data driven Automation approach through RIT•	Worked on various message patterns like Send\Receive, Publish, Subscribe•	Used Tag-store to Parameterize the XML requests, flat .dat files through RIT•	Setting up validation structures through RIT, generating XML's and setting rules based on the Map files•	Automating end-end flow of a Retail application eBay's benefits are what makes the company so attractive.  They diluted the quality of candidates by lowering their standards over the past few years to allow non-degree applicants to hold leadership positions; which has attracted lower level under-performing, sometimes scheming managers to run things.  Manager Level & Above Leaders are arrogant and lack true desires to be creative.  I always hear...pull a lever, or go for the quick win.  Nobody really invests in the big win (long-term strategies). Fun culture, intelligent people, challenging problems to solve - all that young curious mind needs. Great place to work and great company to be proud to be a part of. Oh, and did I mention the fun culture?! I have learned much about different shipping services and rates, and how to please customers. Great place to work buy and sell antiques and collectibles. •	Answered escalated calls to customers whose issues were yet to be solved.•	Placed orders when necessary•	Gave promotional codes to the businesses that called for price changes.•	Reviewed previous orders for credit card fraud. Enjoyable job and plenty of extra hours. worked 12 hour days for 7 days a week. I only worked four hours a day but they were the best four hours I ever worked in IT. I was the only IT support for 200+ developers and they were the nicest set of people I ever worked with. Even the most difficult problems they brought to me were manageable and they dealt with any tragedies (data loss, dead hard drives, etc.) with great aplomb. I learned the finer points of PXE imaging, inventory management, Casper Suite deployment and Remedy ticketing.Management loved having me there and hated to see me leave, as did I. Excellent stay at home side job, hobby.  International seller.  Customer contact. Management was very supportiveWork environment was goodGood working hours eBay marketplaces is represented by a very small team of about 12 employees in Luxembourg. There are also about 40-50 employees from PayPal, eBay Treasury and StubHub. Joined eBay few years ago with great energy and motivation to improve and develop our messy processes in billing and finance. This energy and motivation have gone away after a while when I realized:1. Whatever you achieve it seems like a drop in the ocean because management cannot focus and deliver elementary goals. The culture of management is 'Fire! Let's work on 100 different projects to improve our business'... after debating, long discussions and hundreds of hours of work... guess what? 80-90% of the the projects are cancelled with the excuse 'are not relevant anymore' and the remaining are delivered with significantly below quality standards expectations.2. The performance evaluation and recognition of each employee is not based on objective performance of individual. It rather depends on your connections with management. In other words, it doesn't  matter if you have worked very hard and achieved great results for the business. Someone else with basic performance and good connections with management can achieve better performance rating from you. This has a result talented people to leave eBay after few months/years. For the Luxembourg office, more than 8 employees (out of a team of 12!) left the company in last few years - a really high turnover.3. One of the benefits that management 'sells' at interviews with potential candidates is the great career development and progression - which  is probably another lie. It is really difficult to develop and progress your career at eBay, especially  in Luxembourg. The trainings are very  limited due to budget restrictions for development that we have the last 2 years.    If you are unemployed and desperate to find a job, eBay in Luxembourg might be a good option. Otherwise don't waste your time - it doesn't worth it! I enjoyed working for eBay, It was as if I got paid to workout. I would lift 20-50 pound boxes a day. Had to break them down into 10-20 pound boxes and organize them on a shelve. Most of the co-workers were nice. I'd have to say the hardest part of the job was when peak begins. Everything can get quite hectic. But awesome pay. Work delegation is poor. Constantly changing deadlines for implementation. Not enough long term stabilityGood work hoursStrong managementStrong seasonal sales •	To assist customers in checking  the status of their orders and to place orders for customers•	To answer any questions regarding products and the different policies of the company•	To provide opinions in different styles of apparel Work delegation needs to be improved upon. Can learn new technologies. Working here seemed like a dream come true, at first. The trainers did what was expected of them, which was make this job seem like it's the best job you will ever have and they love working for this company. I, of course, got sucked into this dream and it did seem like this was going to be a career instead of a job. Once you got out on the floor that immediately changed. They want you to know everything and even if you know everything it will change every week. I can understand change but every company needs consistency as well. Your customers aren't going to have faith in you if they call often and then get told something different every week. Then we get the back lash and cursed out. Management is ok. Have had worse. Can be understanding. co- workers are usually great. The company has great benefits and they start first day you work, no waiting, awesome. Also, free snacks, sodas, juice, starbucks coffee, cereal, oatmeal, etc. Gym on site with free membership. Parking sucks if you get there later in the day. This job will suck the life out of you if you are an emotional/ sympathetic person. People cuss you out on the daily or will want to talk to your ear off about why they are entitled to whatever they want at the moment. So to sum it up, great company but people in America do feel entitled so be ready for that. High call volume. * 7:00am to 3:30pm with 2 fifteen minute breaks and half hour lunch                     break. Operating power equipment placing inventory.* I have learned to operate inventory scanning device.* Management needs to cosider that the employees are the main    means of operation for the company.* Friendly co-workers with a family type feel of atmosphere.* Very considerate of other employees.* Meeting inventory stock quota. Working short hours during the  week and then asked to work on weekend at regular pay schedule.Great benefits. Overall  experience with ebay,it is good place to learn new things personally I love to work here my saness is my project got ended last week fun but really competitive place many kids at the school wanted to sell things.sometimes we would not have enouph stuff to sales so you would t not get that much money It's a fun job and I still do it, the money however is inconsistent working with this companies was a great experience, but not so much somewhere I would refer anyone. the days there were fun and kept well organized we all had tasks each day to complete and got them done! learned alot via customer service and in sales good place to work. Worked in the sports and home styles learned alot on all the sports teams and working with cwd kids and French toast I just loved working there. Great environment, easy and fast pace. Worked with candidates to line up interviews with the various internal teams.I learned some short cuts that I still use today. It was nice working there.Working for this company is Fabulous Extremely fast faced work environment. Long working hours but extremely satisfying at the end of the day. Great place to work Compensation is low per hour yet you get plenty of time off and benefits are top notch. Having a great time at eBay, it has been 5 years now, time to move on. On a typical day at work I can expect back to back incoming calls from customers anxious to solve an issue or make a payment. My management was very supportive in promoting a healthy work place and healthy mind-frame during the busy seasons. Fire, Aim, Ready is the tactic the leadership uses in executing new products, and fixing issues. Unfortunately, the place one works is only as good as their manager. I believe the company as a whole is a great place to work with great values, but leadership has continued to execute poor decisions driving away talented people. EBAY really demonstrates that they care about their employees. They provide coaching and career development to assist their employees with career growth. They are highly recommended. Inventory is gathered from flea markets and garage sales. List items regularly, Once an item sells it is packed up, inventoried and sent to the post office. -Lot of new technologies used-Diverse set of people-Good benefits A typical day consisted of answering a high volume of phone calls while also assisting customers via online chat and email. My co-workers were always able to help when I needed it in the early going of the job. The hardest part of the job was when I was forced to transfer a call to the supervisor because I had exhausted all options and could not help the person any further. The best part was always when the call ends and the customer is satisfied with the answers you were able to give them--that's a great feeling. Smart, hard working people with good sense of mission and purpose.  Management doesn't have a crisp vision of how to best compete with increasing competition. Great place to work...i enjoy the people and the benefits company provides...Great opportunity to move up within the company, simply love it. Good Company, highly political - Great thought leaders and co-workers A typical day at work was clocking in and getting straight to work,.management was great they did a great job showing us the ropes of doing things in a way that was easy and faster to learn.I learned how to be a fast worker yet being able to be sociable with co workers and meeting new people.the hardest part of the job was trying to do a good job and not mess up, but at the same time they showed me that its ok not to always know everything and do it right the first time. The most enjoyable part of job was lunch time I got to meet new people make  friends and feel welcome their everyone was very nice and respectful. "
                },
"encodingType":"UTF8"
}
