{
"document":{
"type":"PLAIN_TEXT",
"language": "EN",
"content":"As a Seller, your experience is completely tailored to make it as simple as possible to share your art with the world. From marketing to billing, the company has ironed out every possibility. I sell my own artwork in this job. I don't really work at Etsy but I do have a store where I sell alot of my fanarts that are in forms of : stickers, buttons, charms, prints, commissions etc. I also sell some of my original art as well. Etsy is okay money, but it only takes one customer complaint to have your livelihood shut down permanently by Etsy.They treat sellers like criminals. I enjoy creating things and selling my creations but I need more. I have really enjoyed being able to do what I do, from home and in my pajamas. Its just not reliable enough for my changing needs. I just started up on Etsy which I wanted to for a while now. I love knitting and doing small crafts at home, so I've been excited to take my hobby and bring it to others to enjoy. The site is easy to work with and it gives me an insane outlook on my views and sales. I've been very impressed with the organization. If you have a hobby and want to inspire and sell your product, Etsy is the place to do it! sending out packages and handling customers was overwhelming. Overflow of orders and confusing website directions made the job difficult to maintain regularly Not a job for everyone, but the perfect job for someone. Etsy is a beautiful, crafty, artistic community with endless inspiration. I'm happy artists can rely on Etsy. Working with Etsy is great. I mean you can set your own schedule and if youre creative or have a good product making great profit your income is limitless. good place to work. nice environment. great people. many are undervalued. all depends on team, manager and organization. Many changes over the past year . This is an excellent position or those looking to make some extra cash in between jobs. Requires discipline, but very fun to do once you get into the swing of things! Great place to sell your art. You can do it all on your own time, which is a huge plus.  I have done this as my side job for over two years.  I definitely recommend I worked as an assistant to an Etsy Creative Entrepreneurship Course. It was volunteer, to gain experience as a university student. I found the program very beneficial as a practicing entrepreneur. I also operate an etsy store account and have been very pleased with the general setup and results. I make my own schedule and manage all orders within a given time frame. I answer all emails within one business day, and have maintained a 5 star rating. You work at your own pace towards an individual goal.  It is not a regular salary, you sell and then it might not sell for  a while. Not a stable job but flexible around your schedule. Etsy was very pleasant to work under and gave me great freedom with my products and sales. I was able to do what I love and get paid for it. Etsy has been a great addition for selling my creations over the years. Etsy is awesome if you can get people to purchase your items. So many people are on Etsy you will need something special to stand out among the rest but if you find it you will love it. conducive environment to learn and grow professionally. Supportive management and encouraging teams/co-workers. offers great work-life balance. Enjoyed working with the team . I enjoy selling on Etsy, it's a good way to make a little extra cash now and then with a crafting skill I possess that isn't in great demand in the general workforce. It's not a typical day job. This business was convenient for me because I was able to stay at home with my son the first two years of his life. It is very well organized. Do what you love, make it happen.On my free time, I work on designing the wedding floral parasols, I get to use many different kinds of materials. My mother and I currently own 3 shops together. When we started this 3yrs ago we had 1 shop and I did the photography, loaded the photos to the laptops, edited the photos, and she did the rest. This worked for quite a while and we even managed to open a 2nd shop but then I got sicker, at that time, and she had to take over everything. Eventually I got better and was able to start up social networking which brought in some views (not a lot but more than before) to the shops. So it ended up that she runs the shops and I run the net (which kinda became a thing of it's own).My mother goes to garage sales, second-hand stores, estate sales, etc. to find things almost every weekend. She takes photos in the mornings and loads them to her laptop when she gets the chance. She does thorough research on all items as well as VERY thorough packaging. As a Seller, your experience is completely tailored to make it as simple as possible to share your art with the world. From marketing to billing, the company has ironed out every possibility. The company is a good company, the people are amazing, its stellar. It is full of so many smart, creative people, there is no doubt that whatever you do there, you will find something cool out about yourself.  What it presents to the outside world, is exactly what it is on the inside. Politics are not prevalent, and employees have a genuine interest in helping you out. Etsy was great in the sense you had complete freedom to choose your work load and schedule. Complete control over your marketing,  design and management. On the downside, you had to juggle many roles at once. Etsy HQ is a warm and truly unique workspace. It offers an open-air seating arrangement with communal desks. The company has made a proactive commitment to sustainability and provides quality, locally sourced goods for employee meals and events. This is a non-discriminatory environment that actually celebrates individuality, promotes gender equality, and encourages work to be executed colorfully, thoughtfully, and communally. There is an attitude that we all have something to learn from one another and that everyone's ideas can propel Etsy's teams to greatness and the company to higher ground. I love working for myself, however the income is not steady enough for my household needs. Great way to make money working from home.  I've been searching for a job for quite a while, and selling on Etsy has kept my head above water for quite a while now. I enjoy the flexibility of selling handcrafted items on Etsy.com. I can easily work from home or when I am traveling. Though products on Etsy are sometimes priced unfairly by the people who use the site, Etsy has become famous for helping artisans connect with their audience worldwide. The site has a positive atmosphere, and the developers tried to make both selling and buying items as easy as possible. loved it the best part was satisfying the customer in what they wanted "
                },
"encodingType":"UTF8"
}
