{
"document":{
"type":"PLAIN_TEXT",
"language": "EN",
"content":"The best company to work for! The workspace is very collaborative and inviting so coming into the office every day is enjoyable. The people are great and the manager's are wonderful. Getting help on work is never an issue, and teams are great at working with each other. great place to work fun enviroment.  benefits are good and salary is fair compensation.  The commute is long but it is worth the drive.  i reccommend working here to any local people. Starting at Facebook as a younger professional was great, it was a looser environment that was focused on the mission. As it became more corporate it lost that great culture. Fun company to work at. I was there as a contractor for two years. Once your two years are up you don't get to extend your contract anymore. I learned a lot of new skills and FB for sure wants you to keep growing and learning. Typical days at Facebook consist of meetings every so often and focused work the rest of the time. The workspace is very collaborative and inviting so coming into the office every day is enjoyable. The people are great and the manager's are wonderful. Getting help on work is never an issue, and teams are great at working with each other. - Provide Training for Contractor- Balance on Work and  Life Time- Good Management Lead- Communication with Team Member for the Special Project- Shuttle Bus High expectations, fast paced environment, great food. Great benefits, sign on bonuses, great work culture, good management, also fun place to work. Nice campus facilities. Facebook offers a good environment for the new grad SDE. The cultural of FB let me learn more and enhance the eyesight. It has a complete training plan for the interns. Great work life balance, vibrant  inclusive culture.Fast paced steep learning curve.Self motivated and constant adaptability is the key for consistent growth Great work experience, great team work. We had a lot of discipline and a very good Corporate management. I would have love to be part of this organisation again, if the pay was good. Great experience, great management style - employees feel valued and taken care. Highly reccommend this company. Interview process may drag on however. A Disneyland where you have to work a lot but also get all you can eat bacon. Everyone is happy, and you can talk to almost anyone in the company (Mark id busy) Great place to work for the motivated. I absolutely love working here. Tons of exciting projects are happening and you'll have the chance to work with some of the smartest people on the planet. I worked as a contractor at Facebook and I don't recommend that to anyone. The pay is below average and the management are terrible.It was a great experience though, where I learned a lot and met incredible people Overall it’s a start to making a little spending money every now and then when trying to find Yard work or and kind of Labor jobs on Facebook near me. I greatly enjoyed working at Facebook for the most part, but it definitely comes with its caveats. The people were overwhelmingly pleasant, the benefits are phenomenal, and the work is rewarding if you're able to get into a role that fits you. It's going through some growth pains as far as people allocation, and the helter-skelter management culture supports that, but that's a product of the pace with which they work. If it's a job for you, then it's The job for you. They have thought of everything.  The one thing I would say they struggle with is hiring remote workers.  I think that is slowly changing though.  Team players, work hard, but there is work life balance. Couldn't ask for much from this company. Amazing place to work, great people, great culture, great mission. A wonderful and enjoyable experience all around. Facebook is a very fast paced place to work, you are surrounded by extremely intelligent people, but the rate of change is overwhelming. The scale of people our products serve is staggering. worked there as a contractor, so some of the reviews are not relevant.  Overall, I worked for an excellent manager who care about the employees - contractor or FTE alike.Very fast pace and demand a lot of productivities One of the best companies I have ever worked at. I simply love going to work. I wish contracting didn't exist. That the only unlucky part on my end. It nearly impossible to get converted. The best company to work for! The workspace is very collaborative and inviting so coming into the office every day is enjoyable. The people are great and the manager's are wonderful. Getting help on work is never an issue, and teams are great at working with each other. Though I'm a contractor, I'm very much happy at my current role. The work-environment is very competitive in a healthy manner. I love working with my managers and have so much to learn from them. My day starts with a daily stand-up meeting at 9 AM and ends with brainstorming meeting at 7 PM. I love the team because of their motivation. I would definitely recommend this place to anyone IF they get a chance to interview. Working at facebook as a valet driver, it is a extremely face paced environment parking employee and visitors cars when they arrive at facebook. As you put in more time increasing your driving skills the job is really enjoyable Fun place but needs more improvement  need to take care of there workers more then how they do and let them be free and listen to them we should all be one team Locally facebook's data center environment is generally relaxed and has good collaboration between contractors and full time employees. The pace is busy but never beyond reason, system wide problems are easy to escalate to the next support tier. People are generally polite and professional to work with. The only substantial lacking point is review process and opportunity to advance along with the wages which is slightly below industry. Overall a good place to get your start. Hard working, fast-paced environment. Filled with professionals who are patient and willing to work through any issues. Team oriented individuals whose primary goal is to have organization success. I loved working for the company although my contract was quick and short I wish I had more time with the company. A typical day at work was to come in, get breakfast and jump straight into a company meeting. This is a review for Facebook as a company, not a review for the vendor I'm employed by. Facebook is a fantastic company that truly cares for its employees - full time or contingent workers. The perks are great, such as free food onsite, bikes to ride across campus, gym, game room, and shuttle buses to take employees to and from work all around the Bay Area.The hardest part of my job is the content that I have to view every day. We are provided an onsite therapist to speak to when we need to take care of our mental health. i enjoy going into work and knowing i will be taken care of. i have met great people and friends and will enjoy working here for the time being as time comes forward. Facebook has alot to offer, however each department has their own culture.  It is very important to probe recruiter about the type of culture that you will be going into. I couldn't say no to Facebook. Being a recruiter in San Francisco, I wanted to know what it was all about. What I love about recruiting is the diversity of talent, and one of the challenges at Facebook was that the recruiting organization was so large that recruiters were siloed into very narrow functions - and very quickly the work became mundane for me. Interesting fast paced company that prides itself on moving quickly - not always smartly or well planned moves, but speed for the sake of speed.  Money and resources are not usually an issue - even if the spend is not well thought out or sustainable.  Smart people work there but due to a constantly varying mission many employees spend time on projects that ultimately get scrapped because someone changes their mind - which frustrates the employees who often work quite hard on different ideas/projects. Great love working here. Meet awesome people. Level of stress is low. Free food and drinks. Wonderful team lead. Fun job! Clean. On the computer all day. Facebook hq is a fun and involved workplace, involved in CONNECTING people worldwide to make it a comfortable, yet effective work place, and social site. Wonderful culture, great teams and overall interesting partnerships across the board.facebook is impacting the world on a global scale daily and you will enjoy being part of that journey. - Incredible benefits- Excellent compensation that rewards strong performance- Lots of autonomy- Tons of room for growth- Very transparent from the top down- Strong leadership- Intelligent and caring colleagues- The most fair and well thought out review process you will find everywhere- Exciting work Only been here for 6 months and I've gained some weight! Very relaxed, friendly, open work space. Everything is clean all the time. Best work place ever. A typical day was inventory of foods for the cafe. I learned that everyone plays a part for a successful team. The commute was a hard one. I enjoyed the diversity. Facebook companies branches start  to india facebook using l anguaes english and telugu  my openion is good respecting in facebook mangement is so good Working as a VR ambassador was a joy with Facebook.  I look forward to other opportunities within the company.  They make work enjoyable and give a unique work experience. I like the fact that you have such large audience, If you can have a great marketing strategy. Facebook is a cash cow. I really like the fact that you have ownership of your on page. I just love it The best company to work for! The workspace is very collaborative and inviting so coming into the office every day is enjoyable. The people are great and the manager's are wonderful. Getting help on work is never an issue, and teams are great at working with each other. I been there since it was only one small building in Palo Alto. It grew very fast and is one of the biggest places to be at. It is a who you know company. Facebook does so many things right that it's a great place to work if only for the experience. But you'll also get top-line benefits and compensation. Whether you do well there in the long run depends on you, your competition (co-workers), and how well you can document your impact across multiple axis. I was just an intern at Facebook but the six months that I spent there was amazing. I love the culture, the environment, and the atmosphere. Everyone is very welcoming and diverse. Felt like everyone was working on making a huge impact on the company and everyone's incentives were aligned. Was my first real job experience and made me become entrepreneurial - though my only goal was to get into a PhD program before. This job REALLY depends on you manager. My first manager was fantastic, and very flexible with hours, my second was extremely micromanaging. Be ready for A LOT of rapid-fire policy changes, since things are very fluid. Being able to work from home is great, the work is pretty tedious but easy, but you can be let go at any time, so this only works as a temporary means to make some money. If you are a contracted worker, you are likely to be ignored when proposing ideas, and if they are good ideas, its extremely likely your Facebook contact will suddenly have the same idea a few days later, which of course has nothing to do with you. It was great working here, but there is a reason a large portion of the employees have worked less than two years. Still, they're at least respectful here, which is more than can be said about working with Google. we can work on Facebook pages with click per cost we earn good from that but now a days facebook blocking some contents and blocking pages so its very harmful for some publishers Awesome work, Fast paced, Fun workplace, great amenities, brilliant people, Less organized, moves fast, provide visibility to your work, great people to work with Fun and exciting, learning opportunities in vast data center operations, management fairly organized. However directors need be more hands on. Fast paced place to work and teaches culture of all round work. AMAZING. The single best work experience of my career. The work will eventually change the world and every employee has an opportunity and a mandate to contribute to the POSITIVE end. You will be paid a wage insufficient for the cost of living in the area and never even given an employee evaluation or a raise. I worked there for two years. Expect to have a ridiculous schedule (some days 12-8 AM, some days 8-4 PM and some days 4-12 AM). As a contractor, you will be viewed as a second-class citizen. Your contracting agency will have little contact with you and your Manager will be a full-time employee, but they are not working for the same company so they can't help you with anything. Your contracting agency doesn't care about you because all they care about is the bottom line. They need warm bodies in seats reviewing content. That's all. There's thousands of people lined up behind you to take this 'prestigious' job, so any complaints will be disregarded. 'You should just be happy to work here.' Everybody wants the golden egg 'FTE' role so they won't make any waves to solve any problems you have. All of the administration staff for your contracting agency just wants to get promoted to FTE so they don't fix anything for fear of being a 'problem' and all of your Facebook Managers are at the lowest level of FTE and they just want to get promoted to a better role so THEY won't fix anything for you. Don't make the mistake of taking this job to move up the ladder, either. It won't happen. NOBODY AT THIS COMPANY CARES ABOUT YOU. If you can accept that fact and just want to say you work there and eat the free food, then go ahead and apply. Facebook is a great company to work for. They provide great collaboration and freedom to express new ideas. I love working for Facebook and I have the best manager in the world. Good job, too much was put onto CSATs and we ended up understaffed quickly. Would recommend but you might not find yourself working their for long. The free food was good. I really did enjoy working for Facebook during my tenure; however, our management of our small team was terrible. They'd change priorities on a whim, sometimes without telling anyone. They were never clear on feedback or performance issues and would not listen to their employees. A great company to be at, the perks and benefits are out of this world, and you'll be among of the smartest people you'll ever meet.  That said, your success can highly depend upon team culture, and unless you're an engineer, you don't get to pick your team. Working for Facebook is unbelievable, great working environment and benefits including free breakfast, lunch and diner from Monday to Friday. i recommend to all who want to work for and amazing company Internship at Facebook is a very good experience. It has very unique climate where you can have fun and learn a lot. Brilliant and helpful people all around It is a really good company, your peers help your growth, always taking care of its employees. Hard to move up within the company. Working hard is always there enjoyed every day a new challenge. things move fast, but you gain experience even faster. work with best in the world talent on every team helps you maximize your potential The best company to work for! The workspace is very collaborative and inviting so coming into the office every day is enjoyable. The people are great and the manager's are wonderful. Getting help on work is never an issue, and teams are great at working with each other. This Company has excellent perks.  It's fun combined with work.  Feels like you are working in a Disneyland environment.One has to work there to experience it.  Amazing. flexible work hours, fun environment, easy to communicate, and open workplace to me are the most valuable aspects of working at FB. There are so many team and contractors which depends on the team and the environment you are working. They are not all the same. Facebook is an amazing place to work. I have been enjoying working here. Great offers: free food, free drinks, free shuttles to work. Everyone at work is very accommodative. Not sure my review is relevant but worked on campus at Facebook as a contracted employee of Milestone. Awesome culture and great group of people to work with. Tons of encouragement and a generous perks. Great people and culture but the management was poor for my pillar and team. This made for a bad personal work experience, but i do not think that is the norm. Great atmosphere and credible training experience. Always enough to learn and opportunity for advancement. Loved the managers and open communication of expectations. ProFacebook has a lot of smart people working in the team. It is really great to working with them. Teams are open mind and supportive.ConPeople are busy, the speed might be slow but fair. A typical day was cleaning up from other companies at Facebook. I enjoyed talking with other companies and they included alot of workplace culture. I thought it was a good company to work for but management was poor. Of course, all of us contractors at Facebook want our hard labor to be recognized with regular employment, which would sure help with gentrification around the city. However, that is not the case; it is very hard to become part of the full-time Facebook family, despite substantial efforts. Controlled asset numbers in and out of buildingMaintained database of all assets on equipment from various companies using SAP, TRACE, SRM and SNOWHandled shipping and receiving using Fed Ex, UPS, DHL and multiple other carriersMaintained all equipment in and out of storage room for site technicians Hardware business is tough as in all businesses. Overall people are smart but hardware is new to facebook so typical growing pains. Good place to work. Great company, great mission, great peopleWork pace is intense; you are always on and always performing at your best - can lead to burnout. Take time for yourself.Great culture, food, campus and people Management does not communicate issues until it's too late. Also, the hierarchy is all out of wack. It's the blind leading the blind. Not a healthy environment for a working professional. Facebook practices on hiring recent, young grads and is constantly changing job positions within the company and team which causes a lot of toxic behavior and thus being hired into a position thinking you will grow or advance your career just isn't a reality. You will be doing the same thing, every day with no minor or major changes to the routine. Busy work almost. It was great. I really miss the people a lot. It was always busy and there were always things that needed to get done. But the good thing is that there were always people to help you understand how to do better. The environment is really relaxed calm there's days where it's pretty stressful and hectic but overall the work schedule is pretty easy the members there are really nice Facebook is a great place to work. They have flexible hours, fun hard-working people and I would definitely recommend to others to try working for this company. I love working here. Everyone takes such good care of each other and the relaxed environment makes it easier and focused on work. It is also a place that provides getaways through different outlets when taking breaks or are having a stressful day. I worked as a contractor, so this is not a review for a full time Facebook position. But this was the best contractor position I've ever worked. Free food, work downtown, and a fun culture to be around. The only downside is it can be very difficult to get hired as a full time Facebook employee. -a lot of things to do to break your day up-fully stoked kitchen-weekly happy hour-3 meals a day-transportation provided if close to shuttle stops The best company to work for! The workspace is very collaborative and inviting so coming into the office every day is enjoyable. The people are great and the manager's are wonderful. Getting help on work is never an issue, and teams are great at working with each other. Accenture is a good company i will refer my friend to work for Accenture.Also, they have good benefits for food and transport I always recommend to everyone to work for them but the pay rate is a little bit under the expectation. Working at Facebook it self was very enlightening. A lot of times I felt very jaded. The only thing I didn't agree with the management was the way they selected which contractors. There was a good amount of them who performed horribly, but due to seniority they were picked over the high performing contractors. Other than that, everyone there is great. It's a great place to work with career advancements. Typical day is juggling several projects with communicating with all of your clients. The workplace culture is great. Was a great place... real risk going on contract. They are super into the details more than results but the people there are smart and will do there best to support you. I manage shopping categories, I think the hardest part of being here is leaving, it is a great place to work, I have no complaints and the incentives here are the best! Facebook provides a good opportunity to grow and develop (and the food is excellent). I loved being able to work from home whenever I needed. The company provided a lot of opportunity for me to coach others who were not as experienced in my field, which led to advancements in process improvements in privacy documentation and audits. The schedule is very flexible which is really nice. Management can be more communicative and hands on. There's an obvious contractor/FTE divide. The work is repetitive and mundane which gets boring despite being promised that it would switched around often, that never actually happened. There's no chance at moving up or changing roles. At Facebook most people working there is teenagers just graduated from High School who doesn't care about anything. No opportunity to grow and learn since you do the same every day. We I joined Facebook I expected do build my career there but that was impossible. Thoroughly enjoyed working at Facebook. Amazing environment, extremely open culture and great people. Everybody was intelligent and amazing to work with. Would definitely reccomend. This is a good place to work. A typical day ar work, what you learned, management, workplace culture, the hardest part of the job, the most enjoyable part of the job Amazing Company with amazing people. I would definitely recommend this place as a great place to work. The benefits and perks were some of the best in the bay area tech space. Great job would recommend to anyone who is a self starter.  You are provided anything you need. The only thing is if you are a contractor you are left out of somethings. Great opportunity to learn and apply your new skills. Company culture is amazing, there is free food, co-workers are great, contractor life is meh, lots of opportunities. Excellent workplace with a relaxed culture but prodcutive and demanding. Must embrace constant change and be able to adapt quickly while delivering excellent results. Facebook's work culture is something every company should strive to become. Though the job position itself can be stressful, working amongst people who support and want to see everyone succeed, motivated and encouraged me to shoot for the best. Typical day is 10-12 hours. Fast paced environment. Open communication with management. Excellent benefits mostly compensate for the intense work environment and long hours. I love to work at home because I feel more relax and comfortable I can create marketing strategies for company's and upgrade sales in each company. I love Facebook It's a great place to learn about Facebook advertising but advancement is very minimal.The culture is very one sided. Everybody has their group of people and that's it. No expansion for new people. - a typical work day will be recruiting others to join in on the job raising your paycheck - I have learned what it takes to build a managing promoting team that can be used for any sort of items/goods using any social media platform-Management is very helpful and considerate of peoples needs and or working schedules, also very respectful to all employees-The hardest part of the job is sorting through recruits who may end up wasting time or not being motivated enough/ getting new recrtuits -The most enjoyable part of the job is that you can work from anywhere you can access your laptop from and isn't required of too much from you A really fast-paced place with 'move fast' culture, wonderful environment, co-workers are expert at their own area and really nice. A lot of perks and events, in general a great place for engineers. The best company to work for! The workspace is very collaborative and inviting so coming into the office every day is enjoyable. The people are great and the manager's are wonderful. Getting help on work is never an issue, and teams are great at working with each other. GoodProfessionalGood ManagementSteady WorkWork Place Culture Respect IntegrityHonorGoodProfessionaltrainingbenefitson going trainingvacations Company was responsive and was always available when I needed them.  They have a very professional staff who will always help.Open environment so lots of employee interaction.  Management was mostly hands-off and workplace culture was mostly positive.  People seemed eager to help as needed.  Hardest part of the job:  Sometimes Management not available (but not really a problem)Most enjoyable part of job:  Please were energetic and always available to help. Great work environment, your co workers and benefits make the job worth it. The management was terrible, and your constantly denied reviews. The managers seemed to look out for them selves, and they often left leaving you to figure out different difficult situations. Amazing benefits, but have to be held under a microscope every 6 months for achievement review.  Anything perceived as slacking or not advancing'  is failure.  Yet breaking things as part of 'learning experience' and 'feed back is a gift' are offered as mantra.  Yet if you are on the wrong side of a manager none of that means diddly.Remember to go directly to HR with complaints. Working within your bosses management structure means drinking partners all know which bottle they last shared. Facebook is a great company. Even though I am contracted, I still get amazing perks. This is also my first job out of college so I cannot complain. Wish there were more opportunities for contractors though. Not much upward mobility. A day at work begins with report and follows a guideline of expectations. The workspace is relax and enjoyable. The hardest part is to maintain employee safe while at the same time enforcing security. The key is to stay on your toes and be vigilant. It's great to work as a contractor at Facebook since they pay you so well for a very easy job. There are three meals provided a day, unlimited snack and drinks and everyone you work with are great. The only con is that this is job is very monotonous. Although they promise raises that are never given they do start you off with a competitive wage and are willing to neg.  Great hours and people to work with at Facebooks data center in NC It's a fun place to work Monday-Friday schedule with a diverse group of coworkers. There's is opportunity to grow in the company, but sometimes there is a lot of employee favoritism at the location I was at. Milestone Technologies incorporated the lifestyle/culture that Facebook has. As a contracted worker it was amazing to have the opportunity to work for such a big name company (Facebook) and receive the benefits that came with it. The Facebook culture really made this job an amazing place to work and help bring together tons of people that will serve as great friends and previous coworkers. MIlestone needs to work on improving their HR staff and the people they put in Management, it is very clicky and has an excessive amount of 'high school drama'. There is no room for growth if you are not in the 'in-crowd' or a favourite of certain people despite work ethic and performance. I had a great run with Facebook! Revana was a good company when I started in 2015. Many changes were made during that 2 years. It was definitely a very friendly world inside Facebook. i would not be leaving if i could afford to stay. great co workers, great hours/schedule, lots of fun. i am encouraged to do what i am passionate about and i am given the tools to do my job well. I worked at Facebook as Security.. Each day was different and I learned something new. The environment was wonderful to be in & everyone was pleasent. The reviews were basically very positive when it came to working within Facebook's office arena in Menlo Park.  Team work and its benefits were expressed a great deal. Working with fabulous smart, creative, helpful people was paramount.  Management left me with a downer view.  Though cooperative somewhat, overall mgt. was not mature in ability and at least, not well trained. A lot of reviewers expressed how they look forward to coming to work every morning. A beneficial, thriving, energetic, uplifting, results producing, fun work environment is obvious.  A great group of people within structured teams.  Tantalizing possibilities working within Facebook's culture. I'm just an intern, but my time spent here has been a great experiences. It is high populated work office, very mix culture. The most enjoyable part of the company was not only my position but actually interacting with everyone. The energy dynamic throughout the company. Always so much to do with little management. Contracted at fortune 500 companies with great atmosphere. Most enjoyable part of the day was happy hour and the many activities. Very fun place to work. I start the day off by looking at my task and email. If I was working on something the day before I being to work on it again. I update my task and communicate with my client(s). I was a manager for a support department that was shut down. It was a good program, and upper management put us in a good direction and worked just as hard as anyone else. Best job I ever had. Competitive wages, provides meals and snacks. Work environment is productive and comfortable. Top of the line equipment for your use. The people are awesome. I learned a lot about how to sell certain events to people. I learned a lot about how big companies work.I gained lots of experience in customer service by interacting with people of all different type of backgrounds. The hardest part of the job was when the events felt rushed and the most enjoyable part was the satisfaction of running a successful event and being able to get prestigious guests to attend. The best company to work for! The workspace is very collaborative and inviting so coming into the office every day is enjoyable. The people are great and the manager's are wonderful. Getting help on work is never an issue, and teams are great at working with each other. As long as you have good time management skills you will be golden at this job. Laid back work environment. Great co-workers. Everyone was always laughing and having a good time. I loved this position, we grew together as a family and I'm sad to see my program close, however, this position has definitely helped me strengthen my professional growth moving forward in life. Facebook is great! Flagship has a lot of things they can work on. The turn around for this company is high, the management support is quick to fire someone. I gained alot of information there which fueled my desire to learn even more. I went above and beyond what was required to learn for the position there. I became an expert in Facebook Pixel and other tools. Even though I have left, I'm still advancing my knowledge learning how to design Facebook BOTS. Originally I was so excited to get to work at this company, then once you see what it's really about and how the work experience is, you realize that these are the values that are ruining the world for the decent middle people. Working for this company was great while it lasted. The pay was more than exceptional, and although there were faults in management, it wasn't the worst experience I have had. The office culture was AMAZING, but I believe that was due to the program we were in. It allowed things to be a little more relaxed. This is a call center environment. I forged lasting friendships with this company due to the tight knit team environment, but again, this is a result of the specific program's atmosphere. I can't speak for other programs within the company as I only experience with one of them. The HUGE downfall of working for Revana is that the programs come and go. While I was employed, I saw 2 programs (within a year) get laid off, and inevitably, our program as well. (despite performing with flying colors). The benefits were great, with 401K, Medical, Dental, Vision, Life Insurance, Short Term Disability, and FMLA This was a fun job some of the old timers were fun some were not so fun to work with. Working at the Star had it's pluses it did like it alot it had a good work life balance. I started on a pilot program for a digital side ImPRESS LOCAL which didn't survive but it was fun while it lasted. I would definitely come back to Facebook as my experience with them was extremely positive. Not to mention working from home can be a blessing on its own. Pay is great, but no benefits as a contractor. By working here, you really experience the meaning of working as a team. Which means everyone trying to help each other in order to improve company's service/product for their customer. Cognizant, overall, is a good company to work for. However, as a vendor company to a major social media company, I question a lot of management's best practices and find a serious lack of support as a manager to a small team. I also feel severely underpaid for the amount of work I accomplish on a daily basis. Really good place to work, super fu nReally good place to work, super funReally gto work, super funReally good place to work, super funReally goo d place to wo Culture, Unlimited PTO, WFH options, open to ideas, value employees, great work/life balance.ConsFavoritism, some managers/directors do not have enough experience, a lot of favoritism, major changes made with 1 day notice, over time is not given to anyone not on the companies mainline. Merit increases keep decreasing.Advice to ManagementStop playing favorites and promoting your bar buddies! I enjoy the work i do at facebook. Best part is seeing the happy clients smile everyday. Knowing im doing my job and keeping them happy is the best feeling. Facebook is thorough and an enthusiastic place to work. Creative minded problem solvers make this company a great environment to be in. Thrilled to be there. Great to place work, treat their employees well. There's a great work life balance and lots of perks to working their including free meals and other things.  Great environment. I have been working at Facebook as a contractor for almost 2 yearsAside from the countless perks that are literally too long to list out here, one of the best things about this company is it's people. Everyone goes above and beyond to help each other to succeed. It truly is a team effort.I love coming to work every morning and I'm always excited about what each day it's going to bring.Probably the best thing I can say is that working at FB is about productivity. it's a pleasure working with people who are all concerned with producing a good product and making the best of the time spent while doing it. My typical day consists of diligence and patience. The medium between what I love and need is always in perspective. I enjoy management and I especially appreciate editing. Working at Facebook has been an amazing experience the culture is amazing. Also, Facebook provides free food for contractors and FTE's. This place is awesome. Very good jobFlexible hoursonline loginManagers are very responsive and willing to teach if there is any problem.The pay scale is greatYou have to be willing to travel be open and bold, focus on impact, move fast, build social value. They encourage you to break things. Their motto and values are spot on to the environment and the people you work with. The best company to work for! The workspace is very collaborative and inviting so coming into the office every day is enjoyable. The people are great and the manager's are wonderful. Getting help on work is never an issue, and teams are great at working with each other. Facebook is a very good place to work. The company initiatives always support the mission statement. Company has talented employees who have the autonomy to work out solutions and implement them, without all the politics. Its a great campus to work at and there are a ton of things that employees do to socialize which builds a better work community than most places. I've worked for almost3 years its been a experience i know my job duties and i get job done. im involved in projects that are related to Facebook. if we have new equipment installations for all the cafes around the Facebook campus in Menlo park The work itself is generally relaxed, and the environment is open and welcoming. If you need quiet isolated space this place is not for you.Management is hit or miss, I know my manager seems to just be a bad apple amongst a majority of good apples, but it is discouraging on a day to day to deal with the precarious decision-making process in my department.The hardest part is dealing with the nearly vestigial startup mentality, and the shifting responsibilities that come with it, but with none of the security and benefits that come with it. Lots to prep in such a short time but the team pulls through every night. Each worker really needs to hold thier own so all is done in time. Team work is key. As a Front of The House to Prep, so I was frequently move around. On a regular basis, I would start my day in my assigned station set up, refill, and help others take breaks. All of it was very simple, but I've learned a lot of health hazards, improved my problem solving, working in different environments, people, and the importance of helping people to improve.The workplace I can say was amazing, everyone was very helpful, enthusiastic energy, fast paced, and very focused people.Hardest part for me was keeping up with a huge amount of work when we were short staffed.It was possible for me to get work done but that was the only difficulty I faced. I enjoyed my whole experience, the good and the bad. The hard days and learning from them to do my very best to not cross through the rough difficulties again, and the good situations to continue and learning it from the team. Great place to make a lot of impact provided you are in the right role matching your interests. Perks and work enviroment is great. A lot of small people to work with. I enjoy my time there was a great place too for and a great working environment. It was great job and great experience.They treat there workers good i did alot of unloading and loading. On the phone and email allot helping with Facebook MarketingLearned allot about marketing on Facebookmanagement is very badWorkplace culture: is bad your a numberQA is the hardest part of the jobLearning about Facebook and Marketing was a good part of the job Facebook is a laid back environment with XBOX and billiards in the break room. The greatest perk is free cooked breakfast and lunch everyday while on site. Other than the new upper management in the FacOps Department (2016-2017), the company is one of the greatest companies in the world. They stand by and believe in there mission, 'to connect the world'. Benefits and salary are very competitive to advanced depending on the location of the position. They give you opportunities to become a better version of yourself, which gives them the return of a happy, more proficient employee. The work-life balance opportunities are great and essentially depend solely on the employee's participation. This job changed my career in a positive light. Worked as a contractor and had great opportunities for growth and challenge. Culture is fun and supportive. Tough to become full-time from contractor role, and ultimate reason why I left. The office was a fantastic place to work in and make friends.  First week was very vague and filled with confusion, as no one knew exactly what I was supposed to get up too.  Loads of fun events.  Many of the projects are run by folks who live in a different location, managing projects in Washington from over seas or in California. The work was fun and environment was fast-paced. There was free food and it was a modern and relaxing space. A lot of progressive, smart people. Enjoyable experience. Because Facebook has fairly rigorous recruitment standards, you will most likely be working with some pretty smart people. Workloads are often high (not a 9-5 job), but it will challenge you and you will learn a lot. The numerous perks are also great! They need to have HR and Management all on the same page. high turnover rate. I have personally had issues with both management and HR playing favorites and not being wiling to help with job related questions that I have asked. Move fast and break things! As long as you work hard and get your job done there is no reason not to  love working at this place or having problems with people. Rapid Growth Phase for the company.  They do everything possible to make the employee feel well taken care of - fair comp, great benefits, etc.  The challenge will be as we continue to grow at this exponential rate maintaining the culture that's made it a great place to work.  Note its not for everyone - you have to be fully invested in your success and I have seen burnout.  But so much of the benefits and being surrounded by great people help balance the demands to make exceptional impact they put on every employee. Hard work pays off. It was an amazing journey. The culture the people the general satisfaction of being an impactful part of the cultivation of the company from its fruition was highly satisfactory. Freelancing at Facebook was one of the most amazing opportunities in my career. I was able to work with a number of creatives and deliver a product that was launched via app. I worked the hardest and learned so much about deadlines and a number of programs to help move the process along. I would be more than happy to work with Facebook in the future. Facebook loves to make their employees feel at home when at work. All play and some work, but really all work and fun are done at the same time. deploying provisioned phone and imaging laptops for employees was a different, but fun experience. The best company to work for! The workspace is very collaborative and inviting so coming into the office every day is enjoyable. The people are great and the manager's are wonderful. Getting help on work is never an issue, and teams are great at working with each other. I work here as a temp for their customer service department. This is a decent gig for someone just trying to get some job experience, but there are not opportunities to advance and eventually be hired on as a Full Time Employee. The food is great, but other than that, this is a tough job, and there is high attrition. I loved working at Facebook.  The problem that I encountered is that it was a younger crowd and very catty and clicky.  That being said it is a great place to work. facebook is a great company allied Barton is not pros. its a job, fb culture is awesomecons. management, favoritism, Allied employees dont get to participate in the culture It's a relax place to work with high standard but with good consideration to the employed and made be happy to the position in the company. Facebook is growing so rapidly employees are becoming just a number at this point.  The perks help a lot with the balance.Free food; gym, spa and health servies on location A typical day was triaging issues for FB Advertisers.  What I learned is that FB is great company to work for and the CEO has a great vision.  I hope that everyone gets an opportunity to work here. Well my experience working at facebook was incredible! An what I took from it was that the company always had a daily goals to reach and was always encouraged to surpass personal achievements. Job is excellent for learning more about Data Centers and the functions of the job. People are great and the environment is friendly. Everyone works together to get the job done. Benefits are a little pricey but manageable. Awesome atmosphere! Great people, wonderful training and informative team meetings.This culture applies at a lower level too. You feel comfortable giving feedback to each other about each other, about product decisions, about management, etc. The flipside of this openness is that you of course, have to be willing to receive the feedback, you have to recognize that while openness and feedback is highly encouraged, decisions have to get made, and actions and data are more valuable than words. At the higher level, since the company trusts employees with access to so much information, keeping such info confidential from the outside world is taken seriously. By now you probably have heard rumors that Facebook is the adult disneyland for workers. Well it is true! An array of food options that is catered to everyone. Free gym and showers on campus, many interactive activities that your guest will enjoy. One of the best jobs for a food service professional. Good pay and benefits, plus weekends and holidays off, which you never get in any other food service job. Great place to work. Great work experience. Typical 8-5 work schedule working with amazing people to make a difference and connecting the world :) -I come in when I want and I leave when I want-I get to work on projects that I'm passionate about-Great benefits, free food, etc.-work from home on Wednesdays I enjoyed working there,  but the job was more of a prestigious title, unfortunately,  the pay did not increase to match my needs I Woke up everyday excited to go to work. Great environment to learn and grow, coworkers feel like family. Free lunch and alcohol is always a plus, gaming center to help wind down after work. My management is very supportive, have a friendly behaviour, always encourages the employees at work and fullfills all the needs of the employee.My co-workers are very compitative and sportive. I was hired with the intention of being trained on what items I was making. With time they continued to say I would be trained at some point but I was generally all by myself everynight with no instruction. My coworkers were pleasant though and they came out with a great product every day. Facebook is the most amazing company to work for with an amazing company culture. If I could stay forever I would. Free food, free snacks, free ice cream. Our own wood shop and spa. It truly is amazing. Being surrounded with the brightest and smartest people, its challenging and rewarding at the same time. In addition to free shuttle service, free food, and all the other perks -- it makes it easier to focus on the work. i love working for facebook great people great food all the employees are super sweet. everyone is verry caring nice and real there are many perks for working for this company aswell this job will always keep you smilling The best company to work for! The workspace is very collaborative and inviting so coming into the office every day is enjoyable. The people are great and the manager's are wonderful. Getting help on work is never an issue, and teams are great at working with each other. Is an exciting place to work for. While doing your day - to - day responsibilities you also have time to play and eat. The culture is very relaxing so you can work at your own past. The culture really makes this company and its work very enjoyable.I am currently at this company for an internship so I wouldn't know what to say about the benefits but from what I hear they are really good. Meet in the SPR room for the days tasks and to review the previous days production. As a team we are able to complete many of the customers tasks well before the scheduled due date, Started working on important projects from week one. There are lot of resources to learn from and great colleagues . Interns are respected  pretty well and part of their culture. Work feels hectic at times and higher expectations will be there from your mentor or management. Facebook was an amazing place to intern at. The culture is amazing and the people are amazing as well. It is a high pressure area but you still feel relaxed and able to do the work. I enjoyed every aspect of this job fully. It is such a fast moving environment, if you aren't quick on your feet, you can be left behind. Facebook is a great place to work.  The culture of innovation provides opportunities that many companies cannot.  This is especially true for security professionals.  The only downside is the lack of career path development for security professionals in this organization.Facebook kind of embodies the American Dream.  Once you're there, anyone can become anything they'd like if they really work at it.  Facebook holds high performance/product expectations, but they take care to provide everything you need to get the job done and more... I really enjoyed working with a great staff and Co-workers. My Boss was the Best! He went above and beyond for all of his staff. Working from home as a Contractor gave me the opportunity to plan my day. Great communication between all staff and management. Facebook is one of the best place to work out of all of my prior jobs and I love the people here. My position is great as well as the benefits. -Job growth was extremely limited-Broader impact beyond core role was never recognized-Witnessed performance reviews become highly political as the company grew from 4K to 16K employees -Nevertheless, all was manageable and generally happy until my manager and head of function was forceably replaced Weird horrible management and no room for growth. Great job to do while figuring out your career! Flexible enough and easy workload I do not have anything negative to say about working for Facebook. The people truly cared, they gave me the tools I needed to suceed and there was not a glass ceiling for growth. Love the culture, awesome coworkers and great opportunities to grow and learn and expand your career. I had a wonderful experience and made such great connections and friendships. Productive and fun workplace, we have restaurant on Campus, I love it. Transportation by Bus , it is great. It makes job very easy. sometimes I continue my work by VPN connection  in the bus on way home and at Home. Working at Facebook was an amazing experience. The culture there was great. The benefits were top tier as well. They fed us three meals a day. Supplied employees with their own personal computers for work. At Facebook, the culture is a very healthy and stress-free environment. We are expected to complete our share of the work load without being micro managed. Co-workers are allowed to help and collaborate if needed. Some challenges may include making sure clients are satisfied, and that their business is utilizing Facebook to its full potential. The work place is full of energy, it keeps you on your toes.  The personnel all well experienced and extremely capable.  The management is firm but helpful.  The team really wants to succeed and makes this understood from day 1.  It is also imperative to work together, teamwork is paramount.  Have truly enjoyed my time there and am looking to take what I have learned and accomplished and put it toward new challenges. Great to work for a great company. Hard but you succeed. Great opportunity for growth within the company. Top experience of my life. The opportunity to network within the company is amazing! They provided me with a monthly amount of advertising money to promote my business for free! Best company to work for! The environment overall is amazing! If you have a chance to work here, do not second guess it. Managers give you a task and it is up to you to make it happen. Don't want to go into too much detail about what happens at one of these offices, but to put it in a nutshell, words almost can't describe how much I appreciate the opportunity to work with this company. It is definitely an experience that I will never forget. The best company to work for! The workspace is very collaborative and inviting so coming into the office every day is enjoyable. The people are great and the manager's are wonderful. Getting help on work is never an issue, and teams are great at working with each other. This is place is exactly what you would expect from an established Silicon Valley company. The people are smart and helpful, the management is flat, and the atmosphere is amazing. It is a good place to be at. The work environment lets you to collaborate with the team more than often. I had a pleasant stay during my duration. The most fun part of the job would be the free food and complimentary shuttle service. I also enjoy their basketball court as I would partake during my free time. Hardest part is that you occasionally can lose track of your day by working so hard. Fun place to work for, definitely love working here! the food is awesome, the people are super nice. Pay is another thing that is really good here at Facebook! Breakfast, lunch, and dinner proved throughout the day with plenty of space to work, have meetings, and take a break from the computer screen. I've learned about both sides of the client and employee relationship and both sides of the customer experience and customer service. Management is very respectful and helpful when needed but definitely not overbearing. The co-workers and overall company team are really exquisite and diverse. The hardest part of the job is the monotony. The job could get mildly repetitive but also very fun. The days never go by slow. The most enjoyable part of my job is getting to know and interact with fascinating people that come from different walks of life. Good working place, my day went very fast. I'm learning new things and new recipe every day. I have a good teamwork, my executive chef, sou chef, kitchen manager, and co-workers are all really supporting. The hardest part of this job is the end of the day, we all felt tire and sored, but we still loving it every day. It was a great place to work because of the culture. The work becomes routine, and they don't promote much from within. It still tries to function like a startup instead of the tech juggernaut that it is. Facebook was a great place to work, I was very disappointed when my contract ended.  The Co-Workers and Managers were awesome, everyone got a long and everyone wanted what is best for the customers.  Helping customers place ads with Facebook was a true learning experience. Facebook is a great place to work. Great people, great perks and lots of fun. You are never bored and actually like coming to work. Great work culture. Plenty of opportunity to grow and develop.Excellent work ethics. Work-life balance is great.User Experience team is very skillful and has a lot of potential Working with customer presents new, unique, and fun challenges everyday. This is a great company to work for no matter what. Working for Facebook was interesting. The location was a plus but paying for parking was not. The client services department was not quite organized at all which made the job stressful. Oh yea, but you get free breakfast, lunch, dinner and snacks. Plus the fb 20 lbs. Besides the food, and the fact that you can pretty much wear whatever you want working at facebook is just a glorified boring office job. Pressing the enter button all day and constantly worrying about numbers. Was able to learn from a wide array of Chefs from different backgrounds and expand upon my culinary career in a large institutional kitchen setting.   Opportunities to create eight item menus based upon a theme or region and execute your personal menu for a large group of patrons.  It also forced you to be quick on your feet and adapt to changing environment.  For example, if you had a popular dish and it was running low, you had to be prepared to come up with a substitute dish on the fly.  Also very informative to learn how large scale kitchen production works. The culture and teams are world class. I've worked with some of the best on awesome projects that I'll treasure for life. Yep it was a job. While the job security could have been better and the management could have as well. It paid well and I liked the work great company to work for if you find the right group/leader.  the company has gotten so big that the culture is struggling to maintain itself. Lots of back stabbimg, a lot like being paid to be in highschool. Management didn't seem to know answers to questions they should have. Other employees seemed very incompetent while others seemed held back in their current position. Facebook is a young company and it shows. Google or apple would be a much better place to start out in the tech world. *fast-pace and productive*I learned how to work as a team player in an innovative way*management was empowering and fair*co-workers worked as a team and very friendly*the hardest part of the job was having to leave the company*the most enjoyable part of the job were the assigned task and meeting new people *Fast-paced, productive*I learned how to work as a team and how to lead a team innovative ways*management was empowering and personable*co-workers worked as a team and empowered one another*the hardest part of the job was actually leaving*the most enjoyable part of the job was the work I was assigned The company number one priority was to ensure all employee's needs were taken care of. They went above and beyond any expectation of a employer. Employees were also enthusiastic about their chance to work at an excellent company. The best company to work for! The workspace is very collaborative and inviting so coming into the office every day is enjoyable. The people are great and the manager's are wonderful. Getting help on work is never an issue, and teams are great at working with each other. Love the staff at Flagship/Facebook, but not the management.  They treat lower staff like idiots, the food is bad in taste and appearance, talent doesn't count for much but following blindly does. Great company culture with incredibly intelligent people looking to solve the next problem.Definitely recommend working here. Facebook is unlike a typical company. The culture is designed to bring out the best in you. You are encouraged to challenge the status-quo, take up new challenges. I learned a lot of things here in Facebook. So I think it is very good for new-grads. But I think the work/life balance it not that good in Facebook, people spend so much time building features but less time thinking before start. The tools to succeed are provided, and thinking outside of the box is encouraged. Thought leadership and accountability is valued. I learned HHVM, HIVE, React, Android development. Depends on what team you are working with, it was tough for new noobs. Best place I have ever worked, highly collaborative and productive environment. It was amazing, and for the most part intensely driven by corporate culture that values different thinking, and diversity. Neat place to work with majority of the benefits even made available to Contractors.  Free Shuttle, Free Food, amazing campus, open office culture with some of the smartest people in the Valley. it's a challenge working in this environment, a lot of discrimination and promotions are given to those who are in the 'circle' it doesn't matter if you're an outstanding employee with proven results. I have learned a ton at Facebook while I have been working there. Facebook offices a 6 week Bootcamp for new joiners with technical experience. - I review profiles of business running advertisements on Facebook to determine if they commit fraud or they are a victim.-I have learned how to sharpen my analytical skills to determine the possibility of fraud. -I have also learned the logistics of how fraud and user confidentiality are a high priority. -I learned the world of advertising on social media is very helpful and can benefit the user and consumer as well.-Management here at Facebook is great.  There are no complaints.  Everyone is nice and helpful including my team.-The hardest part of my job is going home.  I like to be at work especially doing something that I enjoy.-The most enjoyable part of my job is being able to learn about the new products and services Facebook is coming to offer. 1) Great place to learn2) Great benefits3) Immature managers4) Technology skills needed for any job5) Career advancement a challenge The office culture is fun and enjoyable while allowing for an engaging work experience and are apart of a dedicated team. Facebook is an awesome place to work but very easy to burn out. Lots of smart people and interesting technologies to work on. Awesome perks as well. Loved coming to work everyday.  The additional benefits such as catered breakfast, lunch, and dinner was fantastic.  Plenty of places to get away and clear your head. Great place to work,but a high turnover. The days are busy from the time you walk in the door until the time you leave, Clients are very demanding. The management team could be a bit more knowledgeable and up train the staff on products and processes instead of leaving it to each individual to take an effort to seek out the information. People should be trained equally to give the best possible customer experience. The best part of the day is when the customers are appreciative of the time you have spent with them and they have gained more knowledge to be successful. Facebook is a great place to work, although most people aren't aware that many positions are filled by contractors and not full-time employees. The good: endless food/snacks/drinks, casual and open office, ping-pong, young and tech-savvy environment. The not-so-good: benefits + compensation for contractors are much lower than full-time. Working at Facebook was a great opportunity. There are many perks such as free just about anything however, along with everything being accessible it is frowned upon to leave if you have not worked a 10-hour day. Good pay and benefits.Location can be an issue.Growing pains, including promoting the wrong people.My outlook about the company remains positive. A typical day at work consisted of arriving at work, following up on tasks (solving problems and documenting them) and receiving new tasks, to be prioritized and executed.Learned how to use ticketing systems, basic Active Directory management, Citrix, how to troubleshoot the Mac, and how large companies transitioning from start-ups struggle to grow.Management per se was virtually non existent. Facebook runs itself in a rather decentralized way, which is difficult to adjust to if one is used to a chain of command.Co-workers were kind and charismatic; Facebook does an excellent job of recruiting quality people. Everyone was very relaxed and easy to work with, while at the same time productive.Hardest part of the job was meeting the demands of the users, balanced against the need of leadership to get projects done. I never felt I had the time I needed to complete projects. The most enjoyable part of the job was connecting with the users and helping them resolve problems; in some cases providing them with instruction as to how to solve issues going forward. The best company to work for! The workspace is very collaborative and inviting so coming into the office every day is enjoyable. The people are great and the manager's are wonderful. Getting help on work is never an issue, and teams are great at working with each other. Really nice work environment, engineers always could find interesting area to workHowever I found some internal processes aren't transparent enough. Also culture in different parts of the company if very different. I love the company and the coworkers.. but there is not place to advance within the company, and all you do is press enter all day.. Great & welcoming environment; feels like a second home. Working here makes you proud to be apart of the Facebook family. With every 2 week release cycle the environment was still fun place to work at. I learned several skills like time management. How there is not differentiation between higher authorities and the engineers. Contractors are treated equally and with respect. I learned to meet deadlines with less stress and efficiently. Learned to distribute work with piers and take up additional work from piers if needed. Multi-tasking several projects efficiently. Knowledge transfer to the piers and grabbing good additional skills from leads and piers. So much of diversity and yet no differentiation. Challenging part is to keep up to the fast pace. Even a week of vacation will have lots to catch up. The most exciting part of the job was to go to work everyday. While we were able to accomplish a great deal the company culture is not focused on the physical security aspects and goals of the company.Still very much a start-up environment the focus is not asset protection but rather developing new products and rolling them out. Enjoyed the people, free food and flexibility. The job was just not the right fit and was not what I expected. Hardest part was that nothing was ever consistent, so it made it hard to provide good support. There are a lot of great things about being at Facebook. The work is rewarding, they give you lots of responsibility if you're driven, and you get to see your work change the platform.It's not for the faint of heart. You will work long hours and intensely. Typical day: coordinating and conducting phone screens, in person interviews with candidates all over the world. Working with Facebook management, to review candidates profile, and facilitate hiring decisions.Learned: Learned so much about roles I never had exposure toManagement: hecticCo-Workers: hard working and pleasantHardest part of Job: denying candidates employment Most Enjoyable: team members, management, and getting people jobs! The work is interesting, the pay is decent, but the hours could be very long depending on the group Flat organization fast paced and relies on proactive employees.  Management seems to favor cheaper contractor and focus on statistics and not essential daily work. Facebook was a very interesting place to work. The culture of communication and cooperation was like nothing I'd ever seen before. The level of enthusiasm among coworkers and bosses was infectious. A typical day at work consisted of having a plan for he 100 plus kids. i learned proper planning can take you a long way. My co workers were all energetic and positive. the hardest part of this job was cleaning up after lunch. The most enjoyable part of the job was watching the children grow up and they remember their experience at summer camp. I am under a contract of one year but in that time, a typical day at work involved 3 square meals for free, activities after work and a very relaxed feel of the company as a whole. I worked in the security department. Was not the most enjoyable, but working at the Facebook HQ was great! Facebook is a great company if you work in house. This is a company that does not value work life balance.  The amount of time required to put in each week would be impossible if your colleagues aren't like your family or best friends. Great place to work if you like to keep yourself updated and are highly data-driven. Loved it - intense, but rewarding. Highly collaborative environment; might or might not be your cup of tea, depending on the type of engineer you are. Definitely moving away from the 'small startup' feel though; it is making the transition, wholly, to a big company. Very fast paced and so much to learn! Very attentive hiring managers and humble staff. Facebook still functions like a start up. A typical day at work involved constantly and consistently learning new processes, technology, skills and lessons to help further my career. This experience changed my life.The management was great, so were my coworkers. The company culture was something I look for in every company. The best company to work for! The workspace is very collaborative and inviting so coming into the office every day is enjoyable. The people are great and the manager's are wonderful. Getting help on work is never an issue, and teams are great at working with each other. No probems with the tear on hand .they all pulled together in safety .the time in finishing the jod was saying good bye to great team and hard workes .the best part of my job was the guts always looked out for me as will . Great experience where you can learn in a lot in a global company. Walked building to building delivering fruits and  other products to keep Facebook employees happy. Maintained the kitchen area took out garbage,kept products well organized. Washed dishes, always took the initiative to do things before others. Helped out my other co-workers to accomplish there work. Was always trying to learn new things. enjoyable place to work nice people great chance for advancement At Facebook I would patrol the interior and exterior of the buildings that would constitute approximately half of the campus, providing access assistance and escorts when requested. I learned what it's like to be part of a large team that works together towards a common goal which is the safety of all present at the site. Management was rather generous with overtime, enabling me to support myself without requiring a second job while in school. My co-workers were all good people, quick to smile and assist anyone requesting it. The hardest part of the job were the first hour of every shift as you gauge the pace of the day and learn where you will be most effectively posted. The most enjoyable part of the job was the college like atmosphere as if it were a Disneyland for adults. I have been sent abroad twice by Facebook to train an international team of employees for Facebook's Law Enforcement Response Team, including training the current International Team Supervisor.I wrote and currently maintain the Legal Triage Runbook that is a detailed operationa manual for my department and provide expert knowledge and coaching for my direct reports.I am involved in policy and procedural development as well as overall department operations.I have 4 years of legal experience and over 14 years of customer service experience holding supervisory positions.I have extensive experience working in multiple law enforcement and legal compliance roles in social media focusing on compliance with U.S. laws regarding access and disclosure of user data under the rules of ECPA. Business driven results within a very relaxed and kind environment. Have learned to work within a team based environment focusing on how we contribute to the whole and the value of our brand. Very rewarding and analytical based position in which the reach and results develop an appreciation for the brand at large. Continually learning and being challenged by my peers to enhance our product and provide insight on how to evolve an entity with so many users, while maintaining and growing our user base. Working at Facebook is an amazing experience. It is a definitely a company that cares about its employees and is full of opportunities. I have had an honor to work with one the best team members. We have all worked on the latest project for talent acquisition and built a good pipeline of candidates for the recruiting/ HR department here at Facebook. I really enjoy working for a company that is filled with so many talents and is growing so rapidly.  One of the best companies I have had the pleasure of working for.  Fantastic environment.  You are able to use your talents in all areas.  You have room for promotion within the company.  You are always heard and your ideas matter.  a typical day consists of non-stop planning and decision making in order to build large scale infrastructure of data centers, networks and server farmsdecisions were made at the individual contributor level, which added sense of responsibility to help the business meets its goal Everyone is very bright and hardworking. Is a very positive place to work It is a fast paced work environment unlike any other.. Everyone works just as hard as they play, and there is always fun activities and outings to go to all year round. But its easy to get swept up and consumed there lol not always a bad thing :-) Facebook was a fascinating place to work as a line cook. It serves 3,000+ people with varying degrees of taste and food preferences. They have two large café s with eight item menus that change daily. Experienced line cooks are responsible as well as the Chefs to write daily menus usually four or more a month. This was a valuable training skill that I took full advantage of and tried to create delicious menus that can be executed by five people in under four hours time. Outstanding co-workers, i learned to work with in a timeley,orderly fashion. I think the hardest part of the day for me honestly. Had to be going home, so much fun. • Racks and stacks servers and network equipment into cabinets.• Reconnect/Replace power cables and network cables.• Performs installation of wiring, patch panel and network switch, hub, and console.* management was fair* co-workers was helpful* none was hard* learning new things Tons of smart people shipping products everyday. The IT department gives you whatever you need to get your job done. Many Managers are selected based on ability to manage a tool or program, and are clueless when dealing with real live humansDirection and expectations for too vague so it's a moving targetPlaced at a desk with a laptop and told to 'go' without any ramp up process or allowable timelineCliques The best company to work for! The workspace is very collaborative and inviting so coming into the office every day is enjoyable. The people are great and the manager's are wonderful. Getting help on work is never an issue, and teams are great at working with each other. great place to work fun enviroment.  benefits are good and salary is fair compensation.  The commute is long but it is worth the drive.  i reccommend working here to any local people. Starting at Facebook as a younger professional was great, it was a looser environment that was focused on the mission. As it became more corporate it lost that great culture. Fun company to work at. I was there as a contractor for two years. Once your two years are up you don't get to extend your contract anymore. I learned a lot of new skills and FB for sure wants you to keep growing and learning. Typical days at Facebook consist of meetings every so often and focused work the rest of the time. The workspace is very collaborative and inviting so coming into the office every day is enjoyable. The people are great and the manager's are wonderful. Getting help on work is never an issue, and teams are great at working with each other. - Provide Training for Contractor- Balance on Work and  Life Time- Good Management Lead- Communication with Team Member for the Special Project- Shuttle Bus High expectations, fast paced environment, great food. Great benefits, sign on bonuses, great work culture, good management, also fun place to work. Nice campus facilities. Facebook offers a good environment for the new grad SDE. The cultural of FB let me learn more and enhance the eyesight. It has a complete training plan for the interns. Great work life balance, vibrant  inclusive culture.Fast paced steep learning curve.Self motivated and constant adaptability is the key for consistent growth Great work experience, great team work. We had a lot of discipline and a very good Corporate management. I would have love to be part of this organisation again, if the pay was good. Great experience, great management style - employees feel valued and taken care. Highly reccommend this company. Interview process may drag on however. A Disneyland where you have to work a lot but also get all you can eat bacon. Everyone is happy, and you can talk to almost anyone in the company (Mark id busy) Great place to work for the motivated. I absolutely love working here. Tons of exciting projects are happening and you'll have the chance to work with some of the smartest people on the planet. I worked as a contractor at Facebook and I don't recommend that to anyone. The pay is below average and the management are terrible.It was a great experience though, where I learned a lot and met incredible people Overall it’s a start to making a little spending money every now and then when trying to find Yard work or and kind of Labor jobs on Facebook near me. I greatly enjoyed working at Facebook for the most part, but it definitely comes with its caveats. The people were overwhelmingly pleasant, the benefits are phenomenal, and the work is rewarding if you're able to get into a role that fits you. It's going through some growth pains as far as people allocation, and the helter-skelter management culture supports that, but that's a product of the pace with which they work. If it's a job for you, then it's The job for you. They have thought of everything.  The one thing I would say they struggle with is hiring remote workers.  I think that is slowly changing though.  Team players, work hard, but there is work life balance. Couldn't ask for much from this company. Amazing place to work, great people, great culture, great mission. A wonderful and enjoyable experience all around. Facebook is a very fast paced place to work, you are surrounded by extremely intelligent people, but the rate of change is overwhelming. The scale of people our products serve is staggering. worked there as a contractor, so some of the reviews are not relevant.  Overall, I worked for an excellent manager who care about the employees - contractor or FTE alike.Very fast pace and demand a lot of productivities One of the best companies I have ever worked at. I simply love going to work. I wish contracting didn't exist. That the only unlucky part on my end. It nearly impossible to get converted. The best company to work for! The workspace is very collaborative and inviting so coming into the office every day is enjoyable. The people are great and the manager's are wonderful. Getting help on work is never an issue, and teams are great at working with each other. great place to work fun enviroment.  benefits are good and salary is fair compensation.  The commute is long but it is worth the drive.  i reccommend working here to any local people. Starting at Facebook as a younger professional was great, it was a looser environment that was focused on the mission. As it became more corporate it lost that great culture. Fun company to work at. I was there as a contractor for two years. Once your two years are up you don't get to extend your contract anymore. I learned a lot of new skills and FB for sure wants you to keep growing and learning. Typical days at Facebook consist of meetings every so often and focused work the rest of the time. The workspace is very collaborative and inviting so coming into the office every day is enjoyable. The people are great and the manager's are wonderful. Getting help on work is never an issue, and teams are great at working with each other. - Provide Training for Contractor- Balance on Work and  Life Time- Good Management Lead- Communication with Team Member for the Special Project- Shuttle Bus High expectations, fast paced environment, great food. Great benefits, sign on bonuses, great work culture, good management, also fun place to work. Nice campus facilities. Facebook offers a good environment for the new grad SDE. The cultural of FB let me learn more and enhance the eyesight. It has a complete training plan for the interns. Great work life balance, vibrant  inclusive culture.Fast paced steep learning curve.Self motivated and constant adaptability is the key for consistent growth Great work experience, great team work. We had a lot of discipline and a very good Corporate management. I would have love to be part of this organisation again, if the pay was good. Great experience, great management style - employees feel valued and taken care. Highly reccommend this company. Interview process may drag on however. A Disneyland where you have to work a lot but also get all you can eat bacon. Everyone is happy, and you can talk to almost anyone in the company (Mark id busy) Great place to work for the motivated. I absolutely love working here. Tons of exciting projects are happening and you'll have the chance to work with some of the smartest people on the planet. I worked as a contractor at Facebook and I don't recommend that to anyone. The pay is below average and the management are terrible.It was a great experience though, where I learned a lot and met incredible people Overall it’s a start to making a little spending money every now and then when trying to find Yard work or and kind of Labor jobs on Facebook near me. I greatly enjoyed working at Facebook for the most part, but it definitely comes with its caveats. The people were overwhelmingly pleasant, the benefits are phenomenal, and the work is rewarding if you're able to get into a role that fits you. It's going through some growth pains as far as people allocation, and the helter-skelter management culture supports that, but that's a product of the pace with which they work. If it's a job for you, then it's The job for you. They have thought of everything.  The one thing I would say they struggle with is hiring remote workers.  I think that is slowly changing though.  Team players, work hard, but there is work life balance. Couldn't ask for much from this company. Amazing place to work, great people, great culture, great mission. A wonderful and enjoyable experience all around. Facebook is a very fast paced place to work, you are surrounded by extremely intelligent people, but the rate of change is overwhelming. The scale of people our products serve is staggering. worked there as a contractor, so some of the reviews are not relevant.  Overall, I worked for an excellent manager who care about the employees - contractor or FTE alike.Very fast pace and demand a lot of productivities One of the best companies I have ever worked at. I simply love going to work. I wish contracting didn't exist. That the only unlucky part on my end. It nearly impossible to get converted. The best company to work for! The workspace is very collaborative and inviting so coming into the office every day is enjoyable. The people are great and the manager's are wonderful. Getting help on work is never an issue, and teams are great at working with each other. great place to work fun enviroment.  benefits are good and salary is fair compensation.  The commute is long but it is worth the drive.  i reccommend working here to any local people. Starting at Facebook as a younger professional was great, it was a looser environment that was focused on the mission. As it became more corporate it lost that great culture. Fun company to work at. I was there as a contractor for two years. Once your two years are up you don't get to extend your contract anymore. I learned a lot of new skills and FB for sure wants you to keep growing and learning. Typical days at Facebook consist of meetings every so often and focused work the rest of the time. The workspace is very collaborative and inviting so coming into the office every day is enjoyable. The people are great and the manager's are wonderful. Getting help on work is never an issue, and teams are great at working with each other. - Provide Training for Contractor- Balance on Work and  Life Time- Good Management Lead- Communication with Team Member for the Special Project- Shuttle Bus High expectations, fast paced environment, great food. Great benefits, sign on bonuses, great work culture, good management, also fun place to work. Nice campus facilities. Facebook offers a good environment for the new grad SDE. The cultural of FB let me learn more and enhance the eyesight. It has a complete training plan for the interns. Great work life balance, vibrant  inclusive culture.Fast paced steep learning curve.Self motivated and constant adaptability is the key for consistent growth Great work experience, great team work. We had a lot of discipline and a very good Corporate management. I would have love to be part of this organisation again, if the pay was good. Great experience, great management style - employees feel valued and taken care. Highly reccommend this company. Interview process may drag on however. A Disneyland where you have to work a lot but also get all you can eat bacon. Everyone is happy, and you can talk to almost anyone in the company (Mark id busy) Great place to work for the motivated. I absolutely love working here. Tons of exciting projects are happening and you'll have the chance to work with some of the smartest people on the planet. I worked as a contractor at Facebook and I don't recommend that to anyone. The pay is below average and the management are terrible.It was a great experience though, where I learned a lot and met incredible people Overall it’s a start to making a little spending money every now and then when trying to find Yard work or and kind of Labor jobs on Facebook near me. I greatly enjoyed working at Facebook for the most part, but it definitely comes with its caveats. The people were overwhelmingly pleasant, the benefits are phenomenal, and the work is rewarding if you're able to get into a role that fits you. It's going through some growth pains as far as people allocation, and the helter-skelter management culture supports that, but that's a product of the pace with which they work. If it's a job for you, then it's The job for you. They have thought of everything.  The one thing I would say they struggle with is hiring remote workers.  I think that is slowly changing though.  Team players, work hard, but there is work life balance. Couldn't ask for much from this company. Amazing place to work, great people, great culture, great mission. A wonderful and enjoyable experience all around. Facebook is a very fast paced place to work, you are surrounded by extremely intelligent people, but the rate of change is overwhelming. The scale of people our products serve is staggering. worked there as a contractor, so some of the reviews are not relevant.  Overall, I worked for an excellent manager who care about the employees - contractor or FTE alike.Very fast pace and demand a lot of productivities One of the best companies I have ever worked at. I simply love going to work. I wish contracting didn't exist. That the only unlucky part on my end. It nearly impossible to get converted. The best company to work for! The workspace is very collaborative and inviting so coming into the office every day is enjoyable. The people are great and the manager's are wonderful. Getting help on work is never an issue, and teams are great at working with each other. great place to work fun enviroment.  benefits are good and salary is fair compensation.  The commute is long but it is worth the drive.  i reccommend working here to any local people. Starting at Facebook as a younger professional was great, it was a looser environment that was focused on the mission. As it became more corporate it lost that great culture. Fun company to work at. I was there as a contractor for two years. Once your two years are up you don't get to extend your contract anymore. I learned a lot of new skills and FB for sure wants you to keep growing and learning. Typical days at Facebook consist of meetings every so often and focused work the rest of the time. The workspace is very collaborative and inviting so coming into the office every day is enjoyable. The people are great and the manager's are wonderful. Getting help on work is never an issue, and teams are great at working with each other. - Provide Training for Contractor- Balance on Work and  Life Time- Good Management Lead- Communication with Team Member for the Special Project- Shuttle Bus High expectations, fast paced environment, great food. Great benefits, sign on bonuses, great work culture, good management, also fun place to work. Nice campus facilities. Facebook offers a good environment for the new grad SDE. The cultural of FB let me learn more and enhance the eyesight. It has a complete training plan for the interns. Great work life balance, vibrant  inclusive culture.Fast paced steep learning curve.Self motivated and constant adaptability is the key for consistent growth Great work experience, great team work. We had a lot of discipline and a very good Corporate management. I would have love to be part of this organisation again, if the pay was good. Great experience, great management style - employees feel valued and taken care. Highly reccommend this company. Interview process may drag on however. A Disneyland where you have to work a lot but also get all you can eat bacon. Everyone is happy, and you can talk to almost anyone in the company (Mark id busy) Great place to work for the motivated. I absolutely love working here. Tons of exciting projects are happening and you'll have the chance to work with some of the smartest people on the planet. I worked as a contractor at Facebook and I don't recommend that to anyone. The pay is below average and the management are terrible.It was a great experience though, where I learned a lot and met incredible people Overall it’s a start to making a little spending money every now and then when trying to find Yard work or and kind of Labor jobs on Facebook near me. I greatly enjoyed working at Facebook for the most part, but it definitely comes with its caveats. The people were overwhelmingly pleasant, the benefits are phenomenal, and the work is rewarding if you're able to get into a role that fits you. It's going through some growth pains as far as people allocation, and the helter-skelter management culture supports that, but that's a product of the pace with which they work. If it's a job for you, then it's The job for you. They have thought of everything.  The one thing I would say they struggle with is hiring remote workers.  I think that is slowly changing though.  Team players, work hard, but there is work life balance. Couldn't ask for much from this company. Amazing place to work, great people, great culture, great mission. A wonderful and enjoyable experience all around. Facebook is a very fast paced place to work, you are surrounded by extremely intelligent people, but the rate of change is overwhelming. The scale of people our products serve is staggering. worked there as a contractor, so some of the reviews are not relevant.  Overall, I worked for an excellent manager who care about the employees - contractor or FTE alike.Very fast pace and demand a lot of productivities One of the best companies I have ever worked at. I simply love going to work. I wish contracting didn't exist. That the only unlucky part on my end. It nearly impossible to get converted. The best company to work for! The workspace is very collaborative and inviting so coming into the office every day is enjoyable. The people are great and the manager's are wonderful. Getting help on work is never an issue, and teams are great at working with each other. great place to work fun enviroment.  benefits are good and salary is fair compensation.  The commute is long but it is worth the drive.  i reccommend working here to any local people. Starting at Facebook as a younger professional was great, it was a looser environment that was focused on the mission. As it became more corporate it lost that great culture. Fun company to work at. I was there as a contractor for two years. Once your two years are up you don't get to extend your contract anymore. I learned a lot of new skills and FB for sure wants you to keep growing and learning. Typical days at Facebook consist of meetings every so often and focused work the rest of the time. The workspace is very collaborative and inviting so coming into the office every day is enjoyable. The people are great and the manager's are wonderful. Getting help on work is never an issue, and teams are great at working with each other. - Provide Training for Contractor- Balance on Work and  Life Time- Good Management Lead- Communication with Team Member for the Special Project- Shuttle Bus High expectations, fast paced environment, great food. Great benefits, sign on bonuses, great work culture, good management, also fun place to work. Nice campus facilities. Facebook offers a good environment for the new grad SDE. The cultural of FB let me learn more and enhance the eyesight. It has a complete training plan for the interns. Great work life balance, vibrant  inclusive culture.Fast paced steep learning curve.Self motivated and constant adaptability is the key for consistent growth Great work experience, great team work. We had a lot of discipline and a very good Corporate management. I would have love to be part of this organisation again, if the pay was good. Great experience, great management style - employees feel valued and taken care. Highly reccommend this company. Interview process may drag on however. A Disneyland where you have to work a lot but also get all you can eat bacon. Everyone is happy, and you can talk to almost anyone in the company (Mark id busy) Great place to work for the motivated. I absolutely love working here. Tons of exciting projects are happening and you'll have the chance to work with some of the smartest people on the planet. I worked as a contractor at Facebook and I don't recommend that to anyone. The pay is below average and the management are terrible.It was a great experience though, where I learned a lot and met incredible people Overall it’s a start to making a little spending money every now and then when trying to find Yard work or and kind of Labor jobs on Facebook near me. I greatly enjoyed working at Facebook for the most part, but it definitely comes with its caveats. The people were overwhelmingly pleasant, the benefits are phenomenal, and the work is rewarding if you're able to get into a role that fits you. It's going through some growth pains as far as people allocation, and the helter-skelter management culture supports that, but that's a product of the pace with which they work. If it's a job for you, then it's The job for you. They have thought of everything.  The one thing I would say they struggle with is hiring remote workers.  I think that is slowly changing though.  Team players, work hard, but there is work life balance. Couldn't ask for much from this company. Amazing place to work, great people, great culture, great mission. A wonderful and enjoyable experience all around. Facebook is a very fast paced place to work, you are surrounded by extremely intelligent people, but the rate of change is overwhelming. The scale of people our products serve is staggering. worked there as a contractor, so some of the reviews are not relevant.  Overall, I worked for an excellent manager who care about the employees - contractor or FTE alike.Very fast pace and demand a lot of productivities One of the best companies I have ever worked at. I simply love going to work. I wish contracting didn't exist. That the only unlucky part on my end. It nearly impossible to get converted. The best company to work for! The workspace is very collaborative and inviting so coming into the office every day is enjoyable. The people are great and the manager's are wonderful. Getting help on work is never an issue, and teams are great at working with each other. great place to work fun enviroment.  benefits are good and salary is fair compensation.  The commute is long but it is worth the drive.  i reccommend working here to any local people. Starting at Facebook as a younger professional was great, it was a looser environment that was focused on the mission. As it became more corporate it lost that great culture. Fun company to work at. I was there as a contractor for two years. Once your two years are up you don't get to extend your contract anymore. I learned a lot of new skills and FB for sure wants you to keep growing and learning. Typical days at Facebook consist of meetings every so often and focused work the rest of the time. The workspace is very collaborative and inviting so coming into the office every day is enjoyable. The people are great and the manager's are wonderful. Getting help on work is never an issue, and teams are great at working with each other. - Provide Training for Contractor- Balance on Work and  Life Time- Good Management Lead- Communication with Team Member for the Special Project- Shuttle Bus High expectations, fast paced environment, great food. Great benefits, sign on bonuses, great work culture, good management, also fun place to work. Nice campus facilities. Facebook offers a good environment for the new grad SDE. The cultural of FB let me learn more and enhance the eyesight. It has a complete training plan for the interns. Great work life balance, vibrant  inclusive culture.Fast paced steep learning curve.Self motivated and constant adaptability is the key for consistent growth Great work experience, great team work. We had a lot of discipline and a very good Corporate management. I would have love to be part of this organisation again, if the pay was good. Great experience, great management style - employees feel valued and taken care. Highly reccommend this company. Interview process may drag on however. A Disneyland where you have to work a lot but also get all you can eat bacon. Everyone is happy, and you can talk to almost anyone in the company (Mark id busy) Great place to work for the motivated. I absolutely love working here. Tons of exciting projects are happening and you'll have the chance to work with some of the smartest people on the planet. I worked as a contractor at Facebook and I don't recommend that to anyone. The pay is below average and the management are terrible.It was a great experience though, where I learned a lot and met incredible people Overall it’s a start to making a little spending money every now and then when trying to find Yard work or and kind of Labor jobs on Facebook near me. I greatly enjoyed working at Facebook for the most part, but it definitely comes with its caveats. The people were overwhelmingly pleasant, the benefits are phenomenal, and the work is rewarding if you're able to get into a role that fits you. It's going through some growth pains as far as people allocation, and the helter-skelter management culture supports that, but that's a product of the pace with which they work. If it's a job for you, then it's The job for you. They have thought of everything.  The one thing I would say they struggle with is hiring remote workers.  I think that is slowly changing though.  Team players, work hard, but there is work life balance. Couldn't ask for much from this company. Amazing place to work, great people, great culture, great mission. A wonderful and enjoyable experience all around. Facebook is a very fast paced place to work, you are surrounded by extremely intelligent people, but the rate of change is overwhelming. The scale of people our products serve is staggering. worked there as a contractor, so some of the reviews are not relevant.  Overall, I worked for an excellent manager who care about the employees - contractor or FTE alike.Very fast pace and demand a lot of productivities One of the best companies I have ever worked at. I simply love going to work. I wish contracting didn't exist. That the only unlucky part on my end. It nearly impossible to get converted. "
                },
"encodingType":"UTF8"
}
