{
"document":{
"type":"PLAIN_TEXT",
"language": "EN",
"content":"Googlers work hard and play hard.  If you fit in with your team and your work, you'll do fine.  Don't be afraid to ask questions; everyone feels lost at first. I learned how to create videos and upload to YouTube, and distributed videos on Google+, FaceBook and Twitter. I worked the hours I wanted to work, and connect with others on social media. Our company was hired to provide a service for google. it was for their google express delivery service. we interacted with many of the employees and other companies that google hire to do this project. Lack of training and a 'Trainer' who only showed up a few times. Unfair 'scoring process' on calls; if both survey questions weren't answered at the end of the call, you didn't receive credit for positive feedback on first question. If a customer was upset because they hadn't had their Google Fiber installed yet, and they said they weren't happy with the company on the Survey, it counted as a 'FAIL' for me.The company had made unrealistic promises on install & built dates which in turn made several people very upset.  Most enjoyable were my co-workers, who were very helpful, and free food in the mini-kitchen. A great culture, fast-paced, great management and collaborative group of people that challenged me and my idea's, and in-turn made me better at my job. Our typical day is full of life. I didn't dread going to work and i was up lifting when co-workers were encouraging and friendly. It is a good environment to work and very exciting. The department I was brought in to work for was dysfunctional at best, I was there as an expert in my field, but the resource did not utilize nor leverage my skills.  The resource had insecurity issues and stress attacks about their job.  Not a good experience with my direct reporting manager; however the other departments in our area seem to run better.  I had excellent feedback from the departments I worked with when I was able to work without a micro-manager so constricted by their own stress brought on totally by themselves or corporate goal that was too aggressive for them - totally bad experience. I worked at Google short term as a QA Engineer testing Google Assistant mobile app on Android devices, both phones and tablets.  There weren't enough meetings and discussions about testing strategy, and following the test suite strictly was a requirement.  I think more creativity in terms of testing and more open lines of communication about changes to the product would help uncover more bugs. They offer a lot of room to learn and grow.  They truly care about their employees and offer amazing perks and benefits.  It's quite a large company now, but within each team is the ability to feel you're more part of the team. Google refuses to accept that it is now a very large, and corporate, company. As a result of this, their response to corporate politics and gaming of their peer review process is to (a) ignore it, and (b) punish those who report it.If you are on a good team at Google, it is undoubtedly one of the best companies in the industry to work for. Unfortunately, if a bad team lead decides to bid on you, for whatever reason, you're stuck, and the company does not handle this well. Worked for a contract agency Randstad. Very poor management. Unfair treatment to employees by entire management team.   Workplace culture was diverse and friendly with the exception of the leaders.  Typical day consisted of providing email support to customers.  Meetings to create workflow standards.   The most enjoyable part was being part of team that would create a standard flow to be used for future teams. Also enjoying all the wonderful perks at the google campus until one day we all got demoted to yellow badges by management.  When asked Management informed us that it  was brought to their attention that some of the employees were being greedy and taking advantage of the food.  Meanwhile management kept their perks.   The most shadiest job I ever had,   I know Google was not all fault but rather the greedy upper folks at Randstad. I was a contractor with Vaco at Google for 2 years. I was promised a long term contract, but never received that opportunity due to poor management. Our team lead was the worst person I ever had to deal with professionally. Typical day at work consisted of checking emails and correspondence from managers/coworkers and responding to tickets. Learned a great deal about team work as well as technical skills. The hardest part of the job was learning the proprietary work flows but it was also very enjoyable. High volume sourcing or reviewing of applicants. We would filter out the most qualified candidates based on their education and skill sets. Setup interviews for hiring managers Driving around beautiful Los Angeles, staying connected with management/dispatcher. Following the routes that adapt best to our schedule and vehicles. I delivered goodies to awesome people. Teaching classes were only tough for me regarding the fact that everyone was always so busy, or preoccupied with meetings, or, even having to 'make the bus' to get home... that it made attendance very random. great place to work. great creative outlets. minimal interference about menu planning. overall would do it again. engineers were kind of obnoxious so  yea. Every day I find an amazing work environment plus the latest technology to help in my tasks. There's constant team contribution and a very well organized management. Google is what everyone thinks it is. Very relaxed, very friendly. However, something no one thinks about is the contracting. Contractors are treated very poorly. They are released whenever they feel like it even if you are exceeding metrics. That is the only concerning area Fast pace working environment, productive and proactive. It could be stressful sometimes, however, by working as a team, we overcame a lot of difficulties and reached our goal. I was a contractor for Google Maps. There was no path to becoming a Google employee. I was paid in experience instead of money and had to leave because I couldn't afford to work there any longer. I hear direct employees do quite well. Googlers work hard and play hard.  If you fit in with your team and your work, you'll do fine.  Don't be afraid to ask questions; everyone feels lost at first. Excellent technical software engineering personnel.Excellent benefits and commitment to retain personnel with strong benefits.Struggle to hire or develop strong people managers. It was seasonal but a really nice experience.  I work for a start up company, called google shopping express.  Everybody was fairly new so it was energetic and fun for everybody. I have had many corporate jobs, and this is by far one of the better. But it is worth noting that Google in the Data Center is completely different than Google elsewhere.There is little to no room for advancement, and little support for you to grow in your technical knowledge. If you come in from a background as a Linux Admin, or Network Engineer, you will gain little in this job and your skills will not be put to use.Your role will be more of a Project Manager, but without the compensation. Can't say much since I'm new and hope to make the best of my contractor position to learn and grown withing the organization. Keep my fingers crossed to be a full time employee in the near future. I worked as a contractor on a team for a very specific project and I have to say that even though my role was minuscule, I was treated as any other employee who was there. It was a very fair environment and there was a lot of expectation for you to be self motivated which was a big change to the sometimes insulting levels of micro managing that I've experienced on other contracts. Overall I would definitely recommend for people that are strong minded and driven. I had a great time working for Google.  They provoyou with every tool you need to succeed at your job.  They also provide their employees with food and othe amenities. Busy days and nights reviewing online files. Postings were uploaded internationally, no translations provided. High volume, which often overloaded file servers While Google's culture is terrific, the predominance of temp workers, and the lower regard for them, makes the working environment less pleasant than their reputations suggests. Good company with great projects. Lots of interesting problems to work on.  Freedom to think out of the box, and work with very interesting people. Fast-paced culture - and work if always interesting. Most Google Managers do not have the experience in the field to provide leadership. They do not know what questions to ask or the challenges that face IDs. They need to have someone older than 30 in management positions who know the field and are emotionally mature. I did not have a good experience at Google because the manager was more interested in flirting that understanding her job or trying to understand the field. There isn't much room to fail and they will add work to your load even if it is outside of your job description. there are no medical benefits. The on campus perks are nice but they are only provided for those who work in Mountain View or Sunnyvale area. Creative environment, people help when you ask questions, flexible working hours, free lunches, easy parking, opportunity to expand the job responsibilities Dangles conversion promises in front of you to work you to the bone. Never follows through with conversion promise. A revolving door for temps, vendors and contractors. The work culture of Google was great. The people are friendly and like having fun. Excellent company with the possibility of career growth working here you will not stand still as a person. Parts of Google can be incredibly beneficial and new and exciting. You will meet intelligent, driven people who will truly open your mind and help you to push yourself forward. You will also meet plenty of ruthless, political types interested purely in their own ladder climbing. The culture must maintain the illusion of a utopia, so be prepared for lots of behind the back dealings, disingenuous words, and passive aggression. Use this company as a means towards an end. Get experience and build the resume, but never forget that Google is a giant corporation, just like ANY other in the world. Stay alert and grounded. Working at Google was the best time of my life. I am very pleased to have worked there! The people, Food, Games, Mirco Kicthens, Everything was so amazing it was really a pro worker place. I wish i could still work there! Far and away the best job I have had to date. Worked on leading edge projects with some seriously talented and fun people. The culture is outstanding, but being a contractor often left me on the outside looking in at all the fun and benefits, despite the team's efforts to include me as much as allowable. I would work here again in a heartbeat, but preferably as a direct hire. Contract ended earlier than expected with bcforward. But, it was a great place to work, with tons of training, and great people.  The free lunches was a plus If your not a Tech head or High End Management , there are jobs at Google for the average Joe in all Departments all over the country thats no lie, well compensated,  But they are all Contracted and Temporary with a third party for reinsurance... the company is highly efficient... I have applied and tried them all  and they only pick one out of.. hundreds to stay...... Google Express, Google Maps..Google X or Google Fiber so many ways to get your foot in the door But there I no Job Security  at all..... don't Kid yourself, Im not !!!! seriously... The google campus I worked at was a decent place to work with a good and friendly environment wherein I learned a number of useful job skills and had  had great co-workers and training. The management was easy to get along with and personable and the workload was fair and relatively un-stressful. The biggest issue I had with it was that contractors took on the huge majority of th work load and were offered very little in the way of proper compensation or potential chances to grow and find a more secure position within the company. Googlers work hard and play hard.  If you fit in with your team and your work, you'll do fine.  Don't be afraid to ask questions; everyone feels lost at first. Google is a great place to work, Very fun experience. A lot of growth opportunity and vibrant work environment. The support structure is second to none. I really enjoyed my time there. Every day i lean new things in this work. If we get starts then will get our incentives on time, that is the good part of work. Work is very easy if we get submissions but if we don't get the submissions for the day then that day is not great enough. I worked a contract for Google Maps and I had a great experience in my time being there. I plan on acquiring work with them again in my future. Using newly gained knowledge since my last time with them. Take a overview of the days goals, team, and work load.Meet with other Leads and discuss how the day is going or went.Hardest part of job is balancing time through out the day with breaks, goal times, and vendor times cause everyday changes. I liked the fast pace and problem solving on the fly aspect. It was alright. Was not 100% associated with google but more of an internal opportunity. They are very giving and willing to help you reach your goals. Culture and the talent level is amazing. Definitely a political atmosphere even though they believe it isn't. The commute is pretty bad from SF to Mountain View and ultimately why most people leave the company. Five stars! Couldn't ask for a better place to work.. Spent 7 years here in various offices. The people are great, the benefits are wonderful and the work is challenging. A great place to work with great culture. If you ever have an issue or problem, there's many people to reach out to for help and guidance. Great work life balance as well. I enjoyed my experience there. I met plenty of people that went on to do well I their careers. Morale was very high and the environment was very competitive. Google is a great company and I enjoyed my employment there.Unfortunately your employment is almost totally influenced by your manager.  Especially if you have an inexperienced autocratic micro-manager like I did.   It was a relationship destined to fail and it did.I loved the work when I was able to do it.I write this because Google provides no feedback loop whatsoever for there employees so this might help someone in the future. It was a lot of fun working a Google. The free food was amazing, the pay was great, and the perks were second-to-none. I thought they could have hired and promoted better managers though. There are incredible people and opportunities to make a large impact.  The perks and technical support are fantastic.  There is strong attention to users and opportunities to engage with professionals outside Google as well. Great place to work if your into the world tech. Engineers Definitely the place for you. Google has the greatest perks of any job i know of. Good culture mixed with Corporate America. its a good job , very quick paced and has good pay as well. Lots of time off (paid) , also has weekly pay. Located on 14th street so it is very convenient to get to. When I worked for Google under their contractor it was under  very intimidating  conditions. The pay was great but the local management was very selective to whom they shared information with.The job was great overall and each day was enjoyable working with the other people.The culture left something to be desired as the information was kept amongst certain people.Management was very intimidating as they only shared certain information with their favorites.The working culture was great with a mix of pleasant people of different backgrounds.The hardest part of the job was dealing with the climate at the time.The most pleasant part of the job was meeting the clients goal and the teamwork that made it happen. Shortly after starting at the company I was moved into a completely new department that had very little direction, structure or planning. This may have been a better match if I had been with the company for a year or two and knew how to navigate the company getter, but it was disastrous for my career at Google. Many many employees love Google for good reasons. My case was exceptional. You do not actually work for Google.  You work as a subcontractor of a contractor for Google.  You get bad pay, bad benefits, and Google definitely lets you know you are not one of them. It can be frustrating but the team is awesome and the people you work with are great. I'm sure working at Google as a full-time employee is a great experience (if you enjoy being a cog in the larger machine), but working a temp/contract/vendor role is a darker, unseen side of the business, one with incredibly capable people, but far-from-secure work environment. Great, fun place to work. The perks do wear off and does start to have that large corp feel and you are just a number. Can definitely see how some can thrive and others fall by the wayside As a contractor I worked at Mountain View and also on the YouTube Ads project in San Bruno.  The former was excellent, with an excellent supervisor.  The contract was supposed to last one year and went two.  Very happy.I learned much from the other programmers and engineers (both Google employees and fellow contractors).  The ergonomics of my desk and chair were excellent.  The lighting is a bit harsh and the air quality was terrible on the weekends.  I am used to an office and it was really weird sitting across from someone and when you looked up they might be staring back. Just weird!Now, that was the good one.  Following that, I worked in San Bruno on the YouTube Red project.  It was extremely annoying and we were treated poorly.  At YouTube our supervisor was terrible.  I can honestly say she was the worst manager I've ever worked for.  Blamed us for her lack of procedure and disorganization.  Instead of real coding (and Graphics as promised) we spent our days and sometimes nights trying to modify an often broken and bizarre script-based system.  We couldn't even get access to fix the broken parts!  Super annoying. I would work in Mountain View in a heartbeat.  San Bruno and YouTube - never again.  Stay away if you cherish your mental health.    Finally, a bit of a warning, for older engineers and contractors: expect to be left out of the culture.  If you have a thin skin this might bug you. I didn't bother me much though and now and again, at Mountain View, I was often invited to events by my supervisor that really weren't supposed to be for contractors.   Made me feel very welcome.  The same can't be said for the San Bruno office. Googlers work hard and play hard.  If you fit in with your team and your work, you'll do fine.  Don't be afraid to ask questions; everyone feels lost at first. a typical day at Google was stressful but fun I would have to go store to store to pick up the packages after I was done picking them up I would drop them off at the customer's house. 40 hour work week, contracted by HCL to work for Google maps. No room for advancement. Job requires focus and attention to detail. Pleasant atmosphere to work in. Great employee services. they put their employees first, they are very engaging in employee activity. They Re flexible with hours and employee are treated like family rather than just workers Enjoyed working here, met good people but no room for advancement. Environment was nice, and the benefits were good for how low-level the job was. Would recommend. Good place to work if you are looking for consistent hours and have a flexible schedule. This also a good situation for you if you are diligent and have a quick work pace The hardest part of working at google was working out in the sun all day, the only things I like while working there was spreading Gravel , but I enjoy working with other people Work culture is focused on the employee but only when the employee is in the same political environment as management. Downtown parking and traffic is difficult. Work with great people, and learn from the leaders in tech.  The workplace culture became the de facto standard for all of Silicon Valley, which in turn has become the model for all of corporate america Probably one of the best jobs I've had so far great upbeat staff and super management for relaxing with no stress. i would highly recommend people to apply to google if they have the chance too I really like working for Google.  Great company.  People are great.  Free food and bus from Santa Cruz leads to a more productive day.  The level of engineering expertise is awesome.  You can always learn from other engineers Great, best company ever!!!  Managers were great!  I would like to get this job back again!  Please Please.  Nice place.  It is great here. Enough said Load and Unload trucks. Organize orders set to go out for the day. Place all orders in appropriate waiting areas. Keep work stations clean and organized. I enjoyed working With at  this company. Very challenging job position but an easy task that no others wouldn’t be able to do. They work well with your schedule. Benefits. Good work enviorment and atmoesphere. lots of perks and possibilites.room for growth. google helps with the commute. Good people to network with and a safe wokplace Very relaxed environment. The work pace is slow. If you’re someone who thrives in a fast paced office this role would not be for you. The work is also easy. Some days could be busy but mostly not. The full time employees tend to test the contractors different. Lot of benefits Fast paced work life- lot of exposure - people from varied backgrounds and experience and good work life balance. Numerous project to advance your career. Working at google is very fun. but I am looking for other jobs because it is temporary, althouth that is my second year there, but my contract will be ended soon I had a fantastic experience at Google overall. Middle Management is notoriously incompetent but there are plenty of avenues to learn and grow one's career. I came on as a contractor to work a project. I didn't keep the job because I couldn't get through the training portion well enough. I was only there for about 1.5 weeks, not a long enough time to make a fair assessment of the company. Fast Paced Work. Organized and Well Managed.Everyone was very helpful and understanding. Workers needed more updated technology but was sufficient for job duties. Overall a great company. Googlers work hard and play hard.  If you fit in with your team and your work, you'll do fine.  Don't be afraid to ask questions; everyone feels lost at first. Google is a great company and the googler were awesome, knowledgeable and open to teaching. It was the company I was contacted with Bon Apeptit that was terrible the management was u professional much like being on highschool. Not much room for advancement unless you were related to someone that worked there. I worked there for a year only revived a 2% increase in my raise so after a year in a half I was at 15.30. I felt like I was treated poorly by management there. As well as my health and safety while working was put at risk Its a great company to work for and good customer service and they take good care of their employees and workers and they have great managers and its a great workplace Working in google is so good you meet many people and you in counter different kind of attitude how they use the restroom but it so challenging for us working as housekeeping. A day at google as a store operator was very consistent, not much changed, I learned to move at a very fast pace (timing was everything), how to work in the warehouse field, packaging and shipment. There wasn't much management due to the fact, we all pretty much did the same thing, there was no one higher up than you can go too besides a lead and they knew just as much as the store operators did, maybe a little more. The workplace varied depending on what store you were stationed at for the day or week, which could change at any given day/time. The hardest part of the job was trying to meet our delivery window when orders were flowing in, basically like a rush hour, and not being able to communicate with a boss or someone who should be over the whole store operators, not just leads. I enjoyed traveling to different places, different stores, meeting lots of new people, at Google you never really knew who you were going to be working with for the day or if things changed from the day before or not. I worked with a team of sysadmins on Google's CDN. The job was decent overall, but I had a hard time connecting with co-workers, and overall I feel like we were pigeonholed into a very small set of tasks that was kind of stifling in the long run. YMMV. One of the best places to work for an engineer. Lots of smart people to work with, tons of resources and loads of benefits. Only downside is that you may get lazy Typical day at work:  Analyzing spreadsheets; referencing client contracts/terms; collecting marketing data from systems; etc.What I learned:  Advanced sheets/excel; SQL interfacing; etc.Management:  Full autonomy; minimal training.Culture:  Progressive.Hardest Part: Lack of training; job was not hard, however.Most Enjoyable Part: Remote work; workplace flexibility. Great company to work for if you're proactive about seeking career development opportunities. Upper management is supportive of letting you take on '20%' side projects in different professional areas of interest. Great perks - free meals, gym classes, baristas, laundry, game rooms. Intelligent colleagues.Big con: advancement and/or product switch almost felt impossible. company prefers to hire external talent rather than promote from within. The people you work with are nice as well as the leads but the management in the office are quite inconsiderate towards their employees. Has potential to be better. Google was one of the best places I've ever worked. It's a fast-paced culture where you have autonomy, mentoring, and constant challenges to step into! Excellent work atmosphere. Collaborative effort. Verify the accuracy and quality of civic data in Google’s Civic Information API.. Perform manual QA checks. Compile, analyze, and report QA issues and trends. Triage errors. The most amazing place to work with, it spoils you and motivates you to work hard and smart.People are kind and helpful no matter at what level they are. They be patient with you, make you learn more and be there if you need anything. Each and every department is pretty quick in solving your problem no matter what it is, be it finance, IT etc Great experience. I enjoyed working in Google. It offers jobs through contractors. Contractors compete in offering their benefits. I think it offers good opportunity to get hired directly with google. A typical day at Google was relaxing. I learned a lot about processing online orders. Management was easy to get along with everyday. I would recommend Google as a place of employment. Google is a great place to work and start a career. Productive work place, healthy work place environment. I highly enjoyed the challenges of the job as well as my fellow co workers. The environment was always welcoming and multicultural which i appreciated. Work is ok ; but the pay is flexed; new people come in making more than the current employee; but The people and environment is great ; game room and free pop it was an experience i will never forget. Tough start but it all worked itself out within a month.  Hate to say it, but by far the best crew ive ever worked for and with. IT was a fun, collaberative, exciting place, where they made you feel at home, and they didn't let you forget that you are a person first.  It was a really dope experience I could almost consider google a luxury job. just for the simple fact that they always tried to make sure that you're are well oil and balanced to take on the task. This job was a great job the only problem was it was a one year contract. If it wasn’t for that I would probably still b working there. Fast paced environment. Great place to work for I spent one year as a contractor on a project. I made lifelong friendships and honed my management skills watching my managers. Googlers work hard and play hard.  If you fit in with your team and your work, you'll do fine.  Don't be afraid to ask questions; everyone feels lost at first. Great job for someone who likes photography and working outdoors. Photo assignments are pre-scheduled at local businesses in numerous neighborhoods in the Bay Area everyday. Excellent way to gain experience as a photographer. It was physically demanding especially with large orders. Management does not take into consideration the heavy lifting according to your capabilities Would love to work for Google again, the environment was great in terms of people, facilities (gym, restaurants, parks), letting you bring your dog, and having all the equipment to be productive and efficient. It was all around a great working environment. I can't complain about anything because I felt supported and my superiors promoted me in my duties and helped me really understand my position. Lots of opportunity to move up, lots of opportunity for training and learning new technologies.  Great benefits, working with smart people and solving complex problems. I worked as a Contractor so much of the job security and advancement does not apply to me.  Overall it was a great experience and I would love to work there again Wages and benefits are greatest perks. Culture bit stale, depends on your workgroup. Very smart coworkers can lead to a 'know it all culture', inhibiting new ideas. Think Twitter/Google or LinkedIn keywords or adwords here, and use the skills in tweeting/Google SEO to show unique qualities/skills/experience that you have that is needed by your interviewer, and that could set you apart from other applicants. With the ubiquity of Twitter/Snapchat, you gotta get to the point ASAP. Try to perfect your elevator pitch well before hand by gathering any feedback about you from others(qualities/skills/experience), and seeing if you can tweet them to someone who can give you honest feedback, as to whether your tweet can sell your uniqueness to prospective employers. The recruiter is looking for quick/creative/lateral thinking under pressure here in an interview situation. Worked there two years.  Two of the most miserable years I spent.  Job was boring, management was hostile and culture was very self absorbed and arrogant.  But hey they had great insurance and free lunches.  So, you are healthy and get 1 hour reprieve from the boredom. awesome benefits and the NYC office is in a great location, be sure to take advantage of the perks, they even have a brazilian jiu jitsu class that includes and instructor! Completely disrespectful environment, the management for my vendor company, HCL, was extremely lazy, non-communicative, underpaying, and lacked knowledge of how to run a successful office. Leaving this place was one of the best things I could have done. Don't waste your time in one of Google's off-site vendor offices, they are toxic and you will feel like a line on a spreadsheet. Lots of perks at Google, but your experience will vary significantly depending on your team, manager and role.  Choose very carefully before making the leap. Pay plans keep changing.  Most of the upper management has already left the organization.  Accounting department does not function well.  No communication. I love the work environment at Google. The atmosphere allows for growth and development. Everyone on my team enjoys sharing knowledge. The hardest part is feeling inadequate when you see boundaries pushed in your field daily. A typical day starts off with gym session and breakfast if you choose to indulge. Then meetings and checking various programs and metrics to ensure technical productivity. A typical work day would start at 7am - 4pm. Really checking programs, conducting meetings, and sitting through meetings. I can't even describe the work environment. The energy is unreal and everyone is so nice and driven. I would work for Google again if I was ever asked. The work culture of Google was great. The people are friendly and like having fun. The one problem I had with it was sometimes you would be dragged into it when you were trying to accomplish work and finding quiet places to get work accomplished could be difficult since the closed off office spaces were typically occupied by meetings and the desks were all in an open space. A good place to work.  Just be careful if you work in the data centers.  It can be rather difficult trying to find another position in the company if you are working in a data center Contractors and FTEs are separate and it depends on your agency whether you have access to benefits including sick time, PTO, health benefits, etc. Contractors are hired specifically to work on projects, so they are usually not included in long-term strategic planning. As a short term gig it’s a nice place to be, the free food, snacks, drinks, low-cost shuttles and ability to bring your dog to work are all pluses that you likely won’t get elsewhere. Working as a contractor has no influence on your ability to be converted to a full time employee— you still go through the same interview process as external candidates and are judged as any other candidate is. Learned being part of team . however, it was a very unsatisfying and a not enjoyable job. Supervisors and leads were very under-qualified and did not perform a good job Googlers work hard and play hard.  If you fit in with your team and your work, you'll do fine.  Don't be afraid to ask questions; everyone feels lost at first. Great experience but I was a temporary employee. I wish I had the opportunity to be converted but I got another job offer I couldn't refuse, it was a hard decision though. I didn't mind staying late there as long as I could catch the train (commuter) and getting in early was normal. Plus you can catch a really healthy and delicious breakfast.Other than a bit of posturing from teammates mostly from Ivy schools at the beginning, everyone is respectful and friendly.Engineering is a clear favorite in the company though management receive high compensation as well.Meetings are frequent but brief. People are expected to do more than the standard. That's what the perks are for I believe. The environment is comfortable so try to outperform and bring in more value for their cost (your compensation). If I had to be picky, the only cons I experienced were (coming from smaller companies) that even if you were proficient in another area, you often couldn't apply it because roles are more strictly defined at a large company such as Google. There are security and policy procedures that limit access.I read elsewhere that some people found some employees to be arrogant. I found that to be the rare minority. Even in those cases, if you prove yourself good at what you do, you win respect. When I started, I came from a state college and 80% of my team were Harvard grads. They did their clique-y thing on occasion. But they didn't realize I went to state university because my family wasn't well off, and I dropped my GPA at the end pursuing athletic and gaming competitions on a national level. My standardized exam scores were in the 99th percentile, I was studying multivariable calculus in 10th grade. So after awhile, they realized I was just as  bright, did my work well, and there was no longer a sense of exclusivity. A lot of employees are inexperienced, but talented. And that leads to promoting meritocracy. I've enjoyed every day there.  The culture, the group I work for, the overall experience was amazing.  There is a lot 'hype' about working at Google.  All of it was met! This google job is not something for a person who has a life and kids/family. Its so inconsistent and no benefits, management has favorites with the certain workers and no holidays or paid time off. Google Fiber was far removed from big Google, not just in business, but in culture, opportunity, and leadership.  It was a great learning opportunity, but go in with your eyes wide open and pragmatic expectations . Most of my typical day of work is talking to customers about the google's product, and how awesome is it to have at home.I learned about googles product and how it works and how you can fixed it.The management is awesome always pushing you to do better not just be happy with low results, but that you can do better.I love the culture in the google position,One of the hardest part of my job is the selling part sometimes we have been getting slow days at work where they are not that many customers to talk to about the product.The most enjoyable part is talking to all kind of all people all day. Good to have google on resume. Enjoyed my work at google, however the knowledge gained at google cannot easily be transferred out to other jobs. Google has a lot of proprietary hardware and software which makes it tougher to relate to the industry. However doing some self study and reading through docs/guides one can gain valuable information. Best thing about Google is the people, all of which are genuinely humble and there to help you. Free food and games are a nice bonus for a hard days work. I was a contractor, the full-timer experience can vary. My time at Google was very enjoyable. I worked as the Google Express Chicago/ Midwest Warehouse Team Lead. Google Express was created to be the competitor for Amazon Prime I learned a lot while I was here. Everyone was very welcoming and helped me get started so I could be productive to the teams efforts.  Interning here was the best decision I ever made. Management training is extremely poor. When Managers do not know what the next indicated step is, the work around is claiming 'ambiguous environment.' i am honored to work for google , every day i learn new things , management they are like a family members , i enjoy every moment i am at work , i love the ping pong table i wish there was more tables and Foosball table I was an Order Management contractor in Austin, TX. and I LOVED working here. We were provided with free snacks and drinks, but as a contractor had to pay for food and gym membership while Google employees ate for free and got to use the gym for free. It is pretty fast paced and guidance changes frequently. Pay is terrible  compared to what actual Google employees make, and there was not a lot of room for growth in my contract position. We basically got to wear what ever we wanted (within reason) and the atmosphere was super relaxed, not micromanaged. Absolutely no job security, after 1 year everyone on my team/contract had their jobs outsourced to the Philippines, including the contractors based in India. It's a fun project to be a part of. It's fast paced but fun. It challenges you and rewards you. I have  a great and supportive manager and my team is great to work with. I enjoyed every minute working at Google. They really promoted equality and work life balance. They really care about your career and offer so many classes for you to acquire the skills you are lacking to perform better in your current and future roles. Worked with a professional photographer who did the Google Street View Tour in Phoenix.I made appointments for him and worked part time from home.I had an above average success rate at setting the appointments.I enjoyed working with him and felt like a team player.Since my background is in communications and I work withmany companies, I learn fast and adapt easy.I have worked for major headquarter companies located inDallas, Texas.Some of these companies include: RCA, NIKON, VA, NY LIFE,HONEYWELL, VERISON - 7 divisions, Sprint, MCI, XEROX,Milwaukee Seasonings, AT&T - awarded the Circle ofExcellence.  The Associates - finance. etc Working at Google is facing new challenges every single day. Effective development tools, friendly and professional environment with a through testing and code review process. Google is a fantastic place to work. You are surrounded by really amazing people that you share a great camaraderie with. The perks are secondary for me but it has been a great journey. Very good benefits. Schedules are really good as well. I liked not working on the weekends too. You learn a lot in this company and also a lot of trainings to be completed. Working at Google was great. The people are very smart, the job was interesting, and I had a lot of freedom to do the work that I thought was best. Unfortunately, after I had been at Google about three months our VP decided that all of his team that worked in the United States outside of Mountain View had to move to Mountain View. I was one of seven people on the team outside of Mountain View and another of the seven was my manager. I suspect she knew the required move was coming well before it was announced because she left the group shortly before the move announcement. I chose not to move and found another local job about a month before I was going to be required to move to Mountain View. As a contractor I am unable to review the position accurately. I'm just typing the bare minimum required characters so that I can continue with this submission. Googlers work hard and play hard.  If you fit in with your team and your work, you'll do fine.  Don't be afraid to ask questions; everyone feels lost at first. There’s lots of time to learn new things and positions.The pay every week is great, there’s lots of people willing to help one another learn different tasks throughout the workday Great place to work.  Depending on your position, promotion options may be limited.  If you are young and starting there early in your career then no worries. A typical day with google included meeting or exceeding deadlines and being paid as such.Your ability to do your job well was directly reflected on paychecks with bonuses based on production. 2-12-2014Love it All the great times you will have All I need is to see what new ideas are wanting the new world to me its amazing to work in such a wonderful place This is the best company you can ever work with . They will help to improve your carrier a lot . You will be also paid a lot as salary . You can experience the freedom here . The workplace culture within the office has a very unique atmosphere. Not everyone there is preforming the same tasks. You have the software engineers that know various coding languages , the sales team that handles Googles advertisements and marketing strategies, and lastly the vendors and contractors that are employed for various projects and also work in Office Management.The most enjoyable part of the job are definitely the amenities that come with the office. There is a gym on site along with a trainer who teaches classes at different times and provides excellent advice for your personal fitness goals. Here is where things get a little complicated. As a contractor/vendor, you get office access just like the Google full time employees . However your upper management is normally outsourced through other companies,(Googles clients) and for that reason, it becomes difficult to insure yourself job security. I did a temporary assignment for Google and it was the best experience ever.   I had a great day everyday and made a lot of friends who had very similar interest. There is no better place to work! I have never worked anywhere that puts employees well being ahead of there bottom line like Google does, I look forward to any further opportunities to work with this company. Working remotely from 3000 miles away from the office can be both a blessing and a curse. I knew id never recieve emails in the middle of the night but, depending on who you 'Ops-Lead' is, They may either take forever to reply or not reply at all. However that aside, I love driving and i like being by myself. I was perfect for the job, but i can definitely see not everyone being able to handle it. Fun environment. Sucky attendance policy - don't be late or absent. Its all very serious. Great managers, for the most part, there's always one, ya know? Decent customers. Typical day at work. I learned how to use microscopic pictures to determine damaged optics. The work place was very friendly ans diverse. The hardest part was trying to not scratch the ootics during cleaning. Its something you have to be apart of to appreciate! Everything about this company has to do with you and your will/attitude.If you have the discipline to work in an environment that is comforting but fast paced then this is the place for you. This is somewhere where you'll grow constantly. Google is just about exactly what the oustide reputation is. An immensely successful company that has an outstanding culture. Great people working there, and you will not be thin on resources and educational opportunities. Awesome place to work. The greatest place to work hands down.  I felt like a valued member of the team and any idea, no matter how mundane was taken seriously.  Management really was looking out for the little guy. 1) Career growth opportunities can be significantly more given the opportunities company has in all emerging tech growth areas. 2) Opportunities for temps and consultants to be part of full time team is limited. 3) Opportunities for recognizing and supporting employee ideas and innovation for new products / platforms / apps can be significantly expanded to drive internal productivity and also overall Google offering in market place. 4I Leadership in new tech like Blockchain needs to be accelerated with higher risk aptitude. Very nice workplace. Able to learn how to use new systems. Staff is very polite and very helpful. Everyone communicates with one another very well. The pay was very fair. -I had the opportunity to work with the best Product Managers and collaborating with multiple cross-geo functional teams to drive a product from its internal release till market. -Working on multiple products was so much fun- Outstanding benefits, competitive compensation- Big focus on employee well-being and happiness- Great internal culture- Fantastic food and 3 meals a day offered in major offices- Beautifully designed and fun offices- A huge amount of trust is placed in employees Its a job. You go in and do your work and then go home. The commute is reallyt far. I dont know how i got baited into filling this out. Thanks indeed! I was a temp and am not qualified to answers these Qs -- they should be answered by an employee of Google. The company is driven AND expansive -- a nice combination. Working here has been a great opportunity for me.  I've enjoyed my coworkers positive and creative attitudes and have been inspired while here.  Management has challenges in consistency and follow through, though all are very nice people. Googlers work hard and play hard.  If you fit in with your team and your work, you'll do fine.  Don't be afraid to ask questions; everyone feels lost at first. Great place to work. Would love to work here again, interested in finding a similar work environment. Team and design of work was excellent and tools used were very helpful for the model of work we provided. Great experience and worked with alot of great people.Perfect jobn post military due to everyone was a vetaran for the most part and morale was a huge focus on the team. learned a lot also got to know a lot of cool people. On-site gym, food, juice bar are among great perks. I wouldn't have left if I didn't want to work for a hardware company. Everyday I get to learn new stuff. I am really happy to work for this company. It has a very diverse culture. I would love to continue working in the company. Pick your role carefully so that you don’t get bored. Otherwise the free lunches make you fat and unhappy. Love what you do and you’ll be OK. Most people are overqualified for their position. As a contractor, I did not have much structure around me. I was expected to be a go-getter and put my work out there. I was expected to push for visibility for my work. If you can do this, it's a great role. You can hang out with Googlers and enjoy most of the perks. I've been wanting to work at google. until now no chance! Buy hey, working in a big company such google take so much pride and fulfillment, i  wish they will call me one day, and tell me i got the Job. Lot of creative freedom. Always something to work on or improve.  Great place to grow and connect with others.  Work life balance has always been a key factor with jobs for me, and Google delivers. I only worked with google for about a week on a behind the scenes shoot for Google: Small World. It was a crew of myself and a cameraman. The guy I worked with was super cool and new exactly what he was doing which really helps workflow. I was a contractor at google so not an official googler and they make sure you remember that all the time. The contract had zero benefits and was honestly pretty terrible. A typical work day began by clocking in on a phone where they tracked your location. Then you would proceed to package boxes basically all day long and then clock out immediately at the prescribed time regardless of task. The pay was uneven and completely unfair. Not nearly enough to live off of.  The culture was corporate and micromanaging in the main office but satellite offices were pretty relaxed and conducive to good work. Most enjoyable part was clocking out each day or getting a schedule that included more that 30 hours. Hours were ridiculously tight. Loved working there. Great working environment and very open minded to people from all walks of life. They encourage employees to think outside the box. I like the culture as an employee, not the contractor.  As an contractor, we are not treated as the same as an employee.  There are great people overall and great food. I was a contracted worker, not a Google employee. So I can't discuss about salary, benefit, and other job advance/promotion. However, the part I like most when I was working here was it provided decent free foods. I didn't have to pack my lunch/ dinner when I worked here.Con: My contract was so short because Google outsourced the entire  project and department to India to reduce the labour cost. There's a reason why people say Google is where young people go to retire - great food, benefits, very reasonable hours.  But be prepared to do the same job for 10 years! Interesting place to play in. As a contractor, though, don't get settled. Use your time to grab all the skills development and tech awareness you can. Network through side activities - go on hikes! Above all, be cheery and ethical no matter what, to everyone. Probably good general practice anyway. Every day I had a chance to meet with exceptionally smart and interesting people, who were so inspiring.I wasn't able to make all the decisions for myself related to the projects I was working on, however I was able to initiate new, or supportive projects, and my direct manager was approving and supporting all of them, as he saw that these were resulting either faster delivery or easier workflow. When I reached out to other stakeholders when I was managing my own projects, they were always open to help. When I trained new hires, my training style and materials were designed by me. Lot of learning as an outsider and let everyone learn new tools to manage the work place. No end to learning and plenty of opportunities for growth in the organization. Complete Adwords Certified by Google Top SEO staff with over 10 years experience ranking keywords for all types of ON and OFF line businesses.Proficient in designing Re marketing retargeting ads. working is an interesting place to work at. everyday the company give out free lunch. always enjoying my work day never stressing out. its a great job My team was great. Smart, everyone got along, interested in finding solutions to issues. Hard to get back in to the organization once you hit 24 months, especially if you were remote, but I keep trying. Googlers work hard and play hard.  If you fit in with your team and your work, you'll do fine.  Don't be afraid to ask questions; everyone feels lost at first. Contractors are treated unprofessionally and disrespectfully.  Contracts cancelled in turf wars between FTE trying to stop teh top perfroming contractors from being converted because that makes competition for the next promotion.  Total bs. I am very comfortable working for Google.I have learned many things witch improve my skills and get great experience.I have great team working with them. Great place to work. Would love to work here again, interested in finding a similar work environment. Team and design of work was excellent and tools used were very helpful for the model of work we provided. Google fiber was a good opportunity to advance my career and transition into a management role in the sales industry.  MY contract ended and it will be a 6 month lay over before I am able to apply again Pay is good. I am able to work from home. Not a very mentally challenging position--the position has become a bit boring. There is no position to move into, so I'm looking for something else. It is amazing to me that a multi billion dollar company has zero control over its employees. They are rude, and act like they can treat consumers how ever they want - which is usually like a arrogant immature employee - or a hacker that could care less about others because they have never interacted with others in society - because they are so consumer with being on a computer, hacking, or playing video games. AKA no personality, no class, no soul. This is the world online and tech has grown. I cant imagine what will happen to the world in the years to come - when every employee that works at a tech company can treat consumers without respect. What's beautiful about this approach is that a great environment is a self-reinforcing one: All of these efforts support one another, and together create an organization that is creative, fun, hardworking, and highly productive You come in just to see that the devices are dead. They cut hours and give the hours to whoever they feel like. The operation is starting to be ran by people who are learning about the background as they go along which causes alot of trial and error. Managers and office team members are extremely rude. The employees dont matter only the leads. good place to work different events and its always a different day at the job. They provide free food, beverage, dry cleaning. Get to meet a lot of new people. I was contracted out through the company Vaco for Google. My job required a lot of travel throughout the state of Idaho. It was the best job I had ever had. I loved the indepency and structure of my position. Would be more than willing to work again through both Vaco and/or Google. I loved the Job. Very challenging and it was an assessment of the skills that I had. I felt like i was apart of the Google team and i was very interactive with the other workers. essentially you are a personal shopper located at whatever store the assign you across Brooklyn, queens, and Manhattan. You get orders through a phone they give you and you have to go to the main store floor, find the items, buy the items, bring them back to your station, pack them neatly, and wait for someone to come pick them up. there are 3 intervals of time when someone picks them up so all orders must be ready and organized before those times. culture of workplace depends on store and you have to work with your coworkers and the employees of the actual store (target, PetSmart, Northface, and many more). A typical work day is very well balanced with coding in solitude, meetings, meals, gym going and other fun stuff.Google provides you with the best gear money can buy.They take very good care of you, even in small things like CalTrain pass, onside doctor, massage, shower rooms and all sorts of food/snacks.Be careful you do not get sucked in and let Google/being a Googler become the entirety of your reality, which can easily happen here and it's not good for your overall wellbeing.One thing really bad is that it takes so long to release something that by the time your feature is released, you might not even remember what it is. It can get frustrating for some engineers. Productive and Work life balance.Lot to learn and explore.Open work culture and cool environment.Only thing projects have influence of people and politics. You can find anything on Google. Google has absolutely no internal organization. Structure and accountability are things not included in Google perks package.  You got ping pong tables and climbing walls instead. lots of great perks like free food, workout facility, great office but limited growth and challengessatellite offices are tough when headquarters are on the other coast Google is more than just a heavy hitter when it comes to the internet. Google has found alway to give people freedom to express themselves however they so choose. Google is a staple and and a monumental step in existence. Very well knowledgable company to work for. I really like their culture of running meetings and being on time. A 30 min. meeting defaults to 25 minutes, and 1 hour meetings default to 50 minutes on their calendar so you have time to prepare for your next meeting. I wish ALL companies adhered to a similar policy so that everyone can start and end on time and get things done within that time. Almost all the meeting at Google did that. Great company full of incredibly smart people. Culture feels like it's shoved down your throat a bit though. Other than that, not much to complain about. Great perks, great compensation, awesome people. I was able to work with a Management team to organize and create events to spread awareness and increase Campus educational interest in the Google Cloud Platform(GCP) applications by talking to students. Responsibilities include holding workshops to inform/demonstrate to peers and professors how to use the GCP and find other ways to promote GCP via social media and other means. Take phone calls from people interested and respond to their emails and engage in Video conferences Googlers work hard and play hard.  If you fit in with your team and your work, you'll do fine.  Don't be afraid to ask questions; everyone feels lost at first. Working for Google is an extremely rewarding experience, however, Google as a company does not accept anything less than full output. Your are rewarded wondrously for your hard-work, but you do work very hard and long. Loved learning.Had a terrible manager made it difficult for me 2 njoy all Google had to offer. Wish I had a different manager.He ruined my experience. Overall it was a learning experience. The flexibility of my schedule was one thing I enjoyed the most. All of my coworkers and peers were really friendly. I have truly enjoyed my time on the Google Express project as a fulfillment lead. I am given a lot of freedom to implement process improvements and work with the in store team to drive positive change. I have worked with a variety of people across multiple cross functional team that builds a strong culture at work. Google offers extremely flexible working schedule, and they definitely ensure employees are well taken care of. They also offer all kinds of trainings to ensure employees are advancing. As someone who was a contractor, and previously was a contractor at other tech enterprise companies, I felt that Google offered much more inclusiveness. I took a role in research infrastructure that was incredibly empowering, although management was extremely hands off. Overall, I had a blast working with my old team and would have stayed if I had an opportunity to convert. There are many internal google tools that is benefits to everyone. I learn a lot of from the colleague and other people.  The tools are very helpful and benefits to my projects. It's Google! All the hype and workplace culture is true, but it wears out. Lots of room for movement and improvement, and ability to switch departments if wanted. I was a contractor on two different teams at Google. I worked with some very passionate and brilliant people and was impressed with all the perks they have (even for temp employees). It was a great place to work. I drove around all day when the weather was nice. I pretty much got to set my own hours. However I wasn't able to work when the weather was bad Complete and utter bias, toxic, I would avoid, pays little, works you 60 hours a week with constant corporate propaganda. No respect for the individual, all about teh agenda. It’s a fast-paced, high-intensity work envirnoment without opportunity for advancement. They have fixed schedule without room for overtime or PTO. There’s no opportunitt for self- starter to work independently. I am great at working independently. On one hand , this guarantees autonomy, which is my dream to avoid micromanaging bosses like plague. I like to have an opportunity to take ownership of a project , run it and resolve unexpected problems. I try to make sure I don’t run into a situation I can’t fend for myself. Great for your resume, but not so great for your personal and family life. If you're in the right circles, career development can happen with hard work and strategic movement. It was Google Express and it was a great job to have. It teaches you how to move fast, think quickly and work with a team. It was also great and easy for clients to shop no matter where they was at or what time of day it was. Google is an amazing place to work with some amazing people.  They knowledge one can gain at google is mind blowing and unlimited. the workplace is very collaborative and goal oriented. don't care about the employees, only their numbers of reaching goals and what not. wouldn't recommend anyone to join google if you guys are interested. always something to do here at work just wished it was not a contracted job. I learned how to be a great team player. The hardest part of the job was being away from my family. the most enjoyable part of the job was getting to experience what google had to offer Excellent company to work for. Productive and friendly work force. Learn new technologies. Commute made easy with shuttle service to save time and money. The workplace isn't stressful, they're not hard on you about deadlines and it's a fun job with great opportunities to advance. You can start from the bottom and work your way up in 6 months. The company is technologically innovative but supports a very left wing liberal environment that does not allow people outside of that political spectrum to feel uncomfortable. Additionally, there are too many politically correct initiatives that often roadblock opportunities for persons not meeting the criteria. Googlers work hard and play hard.  If you fit in with your team and your work, you'll do fine.  Don't be afraid to ask questions; everyone feels lost at first. I've worked several vendor jobs at google. Last hiring was a contract job for GSX(google shopping) limited contact 2 years only.good short term job placement for me at the time. Very different from my earlier placements were they appreciated my back ground for the global infrastructure group. It was a collaborative environment. Benefits and pay were great. We saw the results of our input and were given much of the credit.I found that the vendor account your working fro determines a lot of your initial success. first one was very very good. We lost that account and i stayed on in the interim with the transition team for sevearl months. not as positive. the last placement was not a good contract. benefits were not good, pay was ok. we had a PM switch which changed a lot of the culture. As the project fell apart the started laying off and cutting hours. I found some PMs had little respect for world experience that would have helped the project succeed. They were too data driven and missed the real world problems that made the project fail to Amazon fresh & local grocery delivery. too many spokes in their hub model. Always new challenges, effective management, determined coworkers with great vision. Everyone works hard and take time to enjoy the work and time off. The best part about this job was I didn't have to be stuck in an office everyday. Because I worked in various stores, it was always something or someone new I was seeing. The shopping aspect made it fun. Very busy environment with lots of meetingsThe hardest part was waiting for decisionsManagement kept making last minute changesCo-workers were incredibly nice people. It was a contract and the best place i have ever worked. lots of intellectuals to learn from. Free lunches every day and free parking in site. Freedom to work on your own projects and grow your skills. can stay much more without giving details im not allowed to speak about. I'm not going to provide a review. I'm not providing a review. This isn't why I signed up for this site. Mandatory reviews are not a thing I'm going to do. Slow startup in Raleigh.  It will be a long while before higher positions open. Though they promote school and family.  allow you to take time to do the things you need. This review is for my role/situation only.Pros:-work/life balance-free food-free gym-free shuttle-low pressure-autonomyCons:-no growth/learning opportunities-no career path-grunt work It was a great experience working at Google in the Bay Area. The work environment is excellent. Management is very encouraging as well. Great development for self driven people. Staff is great company is amazing and their really is no down side to the job honestly. I truly enjoyed being part of the team and it honestly felt like one huge family. Great place to work. Great people to be challenged and an awesome environment to expand your network. Love my coworkers and love to be working in a fast paced environment. Google was in my experience one of the best places that I ever worked. They had very flexible hours and accommodated to their staffs needs. I enjoyed how sometimes the work environment was fast paced and other times it was laid back. great company to work for.  Great smart people, great benefits. Great work life balance. Company also has many shuttles for transportation throughout the sf bay area I really enjoyed working for Google. It was part time and contracted through an agency but i felt very included and apart of the company the short time I was there. Google is an incredible company to work for and has a strong culture that helps employees succeed in being their very best within their careers and beyond. I learned a lot from my managers on how to be a better sales person and team member through projects I designed. I learned so much from working here.  You can go beyond your job role if you are interested in new things and are producing great results.  There are so many opportunities to learn. Google adsense is a place to make money , but if you are enough good you can earn a lot of money . I was making campains and working on native advesiments I was working at Google Employment for 6 month as a part time employee.  No benefits and very low pay.  The job was repetition  and all you do is look at books and page books on title pages, table of contents, bookmark pages. index pages. Working at Google was an amazing experience however, there is not much room for growth. Mostly all employees are contracted through a 3rd party and transitioning into a full time Google employee is nearly impossible unless you know someone who can 'pull some strings.' As an intern at google I always felt like I had the support necessary to finish my projects. I learned a lot over the course of each summer and enjoyed working in a fun and laid back company culture. 8/10 would recommend. Googlers work hard and play hard.  If you fit in with your team and your work, you'll do fine.  Don't be afraid to ask questions; everyone feels lost at first. It is rating websites and how well they are done and you learn a lot going through the internet.  Some things very interesting and hard to do but i do enjoy it. Needs better management, overall good place to work would recommend to someone who wants to learn more about customer service and technical support with training Working at google is tiring. A typical day is busy. A lot of people get hired all of the time. There is not enough space for everyone to work. Costco workers are annoying. 1) Food, food, food. 15+ cafes on main campus (MTV) alone. Mini-kitchens, snacks, drinks, free breakfast/lunch/dinner, all day, errr'day.2) Benefits/perks. Free 24:7 gym access (on MTV campus). Free (self service) laundry (washer/dryer) available. Bowling alley. Volley ball pit. Custom-built and exclusive employee use only outdoor sport park (MTV). Free health/fitness assessments. Dog-friendly. I was only working at google via Apple one. Google was not my employer.  As a temp employee, I would say its great place to work. I gained many skills via working on the fiber Optics Projects. The benefits and compensation are unparalleled in the market. The competency, friendliness, willingness to collaborate among peers was exceptional. Most middle management was grossly ineffective, even impeding progress and hampering promotions for dedicated team members. There was also an underlying atmosphere of misogyny that wasn't present in every interaction, but would reveal itself as a 'boys club' when it came time for dolling out credit and ascending the ranks. I would work there again due to the high level of compensation. The company is SMX a staffing agency, not Google.  Not much room for growth because it's a contract job.  we did have access to the Google building and the food was free but if you didn't have a position within the building itself, they really didn't like you in the building My workplace at Google was in the Production kitchen. A typical day starts at 9 am and the kitchen is very busy and fast paced, I deliver foods to each building on the campus and at the end of the day I close the kitchen down and leave by 530 or 6pm. The job was awesome.  Wish there were more customers that new about the product, seemed to be something that was not marketed well in my region.  However, managed to sell each one I received.  Also loved the culture of the company, always willing take extra time for training and overall seemed to care about employees happiness. My experience at Google was extremely positive. I learned so much new technology as well as experiencing a new culture. Very easy to be creative as an ABP which makes the job fun. Unfortunately, there are only 4 positions for ABP at Google Pittsburgh, however, I am grateful to have experienced the role for 7 mos. My usual work day consisted of prepping signs for daily breakfast set up, making sure we were stocked with all tools needed to get the day started, and make sure work for all crews went as smoothly as possible. I learned how to work with various things at once and how to prioritize menu items as needed (hot/cold foods).The manager for our cafe and I worked closely throughout the day to ensure food quality and make any necessary changes as needed. I did not see any part of what I did on a daily basis as a challenge. I enjoyed what I did through out the day and liked interacting with all of our regular Googlers. As a contractor and not an employee, it was clear that becoming an employee depended in being able to fit with the clique - meaning having the right combination of education and alumni connections. Team members that were employees were sometimes snobbish, but there are jerks in all companies. Managers were generally helpful and clear with what they expected as work output. Only disappointment is feeling like a part of the team, but not really, because a handful of employees are immature. Everyday I mapped a new area of either my city or the surrounding counties. I learned the city like the back of my hand this way and with the guidance of management(who were awesome) I efficiently got my job done. The hardest part was simply getting used to working a job that didn't require me to do back breaking work. It was very odd just driving all day and getting paid for it but very enjoyable. I worked as a contractor for 2 years at Google, and overall it was a positive experience. The culture and benefits of being onsite were incredible, but being a contractor had a lot of downsides. I performed at a high level and they chose not to convert me (or many of my coworkers) to FT status because they preferred to hire people fresh out of Ivy League schools. With the culture of companies moving away from this model (and with how broken the university system is in general), I was surprised to see Google wasn't at the forefront of hiring people based on talent and not based on where they went to school. Google was a wonderful place to work at.  A typical day consisted of reviewing on going bugs and delivering ways to fix them, as well as committing change lists to improve any systems/applications that were launched in Borg.  I learned a lot on how Google executes business practices in fluid and collaborative ways without getting bogged down in paperwork.  The Management Team is highly technical, they could provide feedback for challenging solutions and guidance on how to wrangle them.  Google's workplace culture is collaborative but highly competitive, you always need to bring you 'A' game on a daily basis.  The hardest part of the job was trying to manage work life, as the demands for getting projects completed on time were paramount.  My fondest memories for working at Google were the SRE members in the flights team.  These members were a great bunch to work with. You can start mapping after sunrise and map until sunset, so as long as the sun is up (minus some dusk/dawn parameters) you can get out there when you want, stop when you need to, and not have any micromanaging. Very fun and freeing position, but can be a little boring at times in a car all day by yourself. Very fun summer job. Google/CDI was a great experience and I am eternally grateful for all the people I met and the exposure I got through this role. My contract ended and I'm currently looking for new opportunities! great place, was layed off along with ~800 due to owners having second thoughts regarding their initial investments in Google Fiber. During this transitional period they were very helpful & concerned for my well being. You will love to work with good and highly skilled people. People are nice, work culture is great, not much restriction. Easy to reach people, Lots of opportunities to explore, multiple skills you can developed The manger of the project didn't know what he was doing. the building was way too hot 90 degrees in the summer and 40 in the winter bad for electronics and working Googlers work hard and play hard.  If you fit in with your team and your work, you'll do fine.  Don't be afraid to ask questions; everyone feels lost at first. Working at Google has been a wonderful experience. Almost everyone who works at Waymo is hired through a temp agency. The temp agency I was hired through was Adecco and it seems to do the absolute bare minimum. Google is truly a fantastic place to work. The culture can't be beat and work/life balance is paramount. It is a big corporation, however and that's not to be forgotten, which can be cumbersome at times. Google as a company was incredible! The culture was great, job performance expectations were high but never overwhelming. Although this was a temporary job, I was never made to feel expendable. They cared about me, my wellbeing, and did all they could to make me feel like I was important! I LOVED this job and would hope to land this position again! It's Google!! In the Field Operations position, you will work independently as a part of a regional and national team, to improve functionality in Maps and related Google products. Each week you will travel to new locations and collect data to help shape the future of Google Maps. The number of site visits and distance traveled will vary from week to week. Great food at the on campus restaurants. Great exercise equipment. Google buses to work are a huge plus in the crowded, expensive bay area. Interesting technical problems to work on. Lots of opportunities for advancements and sharing ideas and exploring different options. Great atmosphere with wide range of diversity and networks. Everyone was very friendly and was willing to share knowledge. I enjoyed learning a lot from different departments. Google perks was a plus since they offered free lunch and activities. The experience here varies from team to team, however, a lot people are unhappy.  Poor leadership/management is seen across most of the sales organization. If you're a Googler, Mazel Tov.  If you're not, it's a great place to work for one year.  They give you broad latitude to do whatever you want, so you can do nothing, you can find a real job or you can do something truly amazing to put on your resume.  Then, you've essentially become an expert in that area and you can use it to find a real job.If you work there for more than a year, you're just waiting to die.  Your professional growth will not exceed beyond your own whim.  Your likelihood for advancement will be nothing because nobody every got promoted at Google for building a strong team. Contractors are definitely treated as second class citizens at Google, but that does not make it a poor place to work. I love the company culture and the way it values its employees as human beings. Management on my team was terrible, but everything else was great. Worked there under contract through Adecco. Pay was decent, good enough for a 19 year old to take care of oneself. The only really bad thing about working here is that you don’t want to make a simple mistake. They will let you go over it. And that’s with any employee, contract or full time. If you work there just always triple check yourself. Don’t let anything slip past you. Easily the best job I ever had in terms of creative fulfillment and work culture. It's too bad Google dissolved the Lab Chanels, because if they still existed I would still be there. -Post YouTube videos whenever you want-Compensation based on views received-Must be creative and original-Digital marketing recommended. -You must strive to be a best-seller I don't work at google but i wanna work in the same . So what can i do to get the job? I am just 18 years old and i just love all the google services they are providing . Great place to work:- Supportive environment with likable coworkers- Learned a lot about digital marketing- Great managers, easy to get along with- Loved to go to work every day Workload wasn't that much but was pushed on the shoulders of few coworkers and the others sat around and did nothing. All the work and ideas that were given were credited to the wrong people. I had a wonderful time while I was employed at Google. I might great people and saw amazing research that began to lead to even more incredible projects. I wish I had been paid more, but if given the chance I would have stayed for what I was making because it was definitely worth it I cannot say enough great things about working at Google. Team members were amazing. Collaboration was fantastic. Continuous learning was encouraged and always available in many ways.Hardest part was the commute from SF to mountain View. No complaints in any way about anything else. They took away all obstacles so that  all you had to focus on was your creative energy, approaches encouraging innovative approaches to challenges presented. Contract gig. Interesting projects that I cannot discuss in detail, but I got to work with smart people on products that might or might not be released. I do not want to construct a review of a company that I only worked at for a total of 4 months. This is unnecessary, stupid, and very boring. The mini Googlers work hard and play hard.  If you fit in with your team and your work, you'll do fine.  Don't be afraid to ask questions; everyone feels lost at first. Excellent place to work. There is quite a bit of learning curve as they use their proprietary tools. One will struggle initially to get used to it. There will be time when one gets stuck with technical aspects, won't get enough support. Everyone is expected to lead by example, become a leader in whatever they do. One will have to take decisions before presenting the idea(s) to management.Culture is great. I worked at Google for about six months. I had a great experience working at Google. There were many amenities while being employed  for this company. The environment and energy was great. Travail tres pointu ettres interessant. Environnement de travail tres positif. On apprend beacoup de chose et on progresse tres vite. Google was a great company it was my dream job. I really enjoyed working there the culture is perfect in every way possible. I would recommend anyone to work there. Working at Google was a dream. Everyone there is motivated to move forward with their career and there is a lot of opportunity to do that. I accepted the offer to Google through the Adometry acquisition and have no regrets. The culture and compensation is great for everyone. The management does changes a lot which was difficult as I went through 4 managers during my time there. The positive part though is the people and the company itself empowers everyone to make decisions based on their career paths. I learned that in a big company like Google someone should be dedicated to networking across the organization. My job at Google was the best job I have ever had. Both dynamic and energizing, I was blessed to work with a team of brilliant professionals helping Google+ get off the ground locally here in Colorado. The management was challenging (my direct manager only), but our national team was inspiring and collaborative. Work anywhere but Google;Total disconnected  environment;Totally cut throat;  Totally lowest pay in the Bay;Total lack of respect;   Peers are junior level and  incompetent; Very  toxic environment. No opportunity for advancement; Cool and secure work environmentBalanced work life environmentCareer GrowthGood Amenities Social CultureShort breaksHealthcareFree lunch and gym Google is a great place. I would recommend it to everyone, but the process is very selective. I was only an intern, so my experience may not be accurate to full-time employement. This was a fast-paced environment that was constantly changing. This is a good place to be, if you enjoy a competitive atmosphere. You have to be able to work well with others. Highly Satisfied with the work /life balance , the tech culture , people from various ethnicities, the multi-cultured groups, leisure activities in Google etc.  Excellent Time management. Great  Team Collaboration.  Workers are highly interactive and supportive. It was a book scanning job for few months and we had to scan 18000 pages a day. It was a little bit challenging but I could handle it. I like the work environment. A typical day at work     what we are learned    management   workplace discipline    the hardest full of the job the most enjoyable full or part of the job on day It was a place where work flowed in small amounts, but it got done rather quickly.  Diverse group of workers with a lot to offer.  Loved the team I work with. yes the company is a subset of the main company. they work three shifts and sometimes on saturdaymeetings and other thingsI prefer not to be made publicThe company is in GA Working at a site  that helped me grow with a team. I learned various ways of how to trouble shoot to find out different factors. Learned a lot of their in-house software and system. Loved the job, even though it often involved difficult physical work. The people I worked with and for were amazing. I was honored to work for such a place. Wish I didn't have to leave. It was always exciting working there. I was intrigued by thereculture and work ethic.Everyday there was challenging and rewarding.Meeting and working with different Engineers from all over the worldwas very interesting. Company has a great culture to nudge continuous learning in many area of the web. Need to understand that you have to develop your  own ladder in pursuit of advancement. I highly recommend Google for sellers. Great compensation, flexibility, and job stability. The manager you work with is key to your work/life balance and overall satisfaction at the company, so vet your potential direct managers well. Googlers work hard and play hard.  If you fit in with your team and your work, you'll do fine.  Don't be afraid to ask questions; everyone feels lost at first. I was hired on a contract for remote editing work. It was enjoyable with flexible hours and great compensation. I was given good guidelines and a reasonable deadline for the project. Great work for the little time we had. They paid very well for the work as well. The other employees were very friendly as well. I will definitely work with them in the future. It's great to work there. Culture is awesome and people are great.I highly appreciated for the working environment.Food is good and free coffee and tea. My summary has been:Working on contract is terrible, Working for Google is awesome, So working for Google on contract is a very interesting experience. The in office perks are very nice, your co-workers and manager are great in that they are both nice people and very good at their jobs and you have very interesting things to work on on a challenging timeline. Its a very good place to be.However, as a contractor, the company's actions make it clear they do not care about you at all. You don't have any job security, so you don't know if you'll be there in 6 months and you can only be there a maximum of 2 years regardless how much your team values you (unless there is budgetary miracle). There are regular meetings and  off-site events for team building that you are not invited to, which has rather the opposite effect. It doesn't matter how inclusive or devoted to psychological security your culture is if half the employees don't have job security.And the people on the ground know its is terrible but the practice persists for economic reasons (since contractors cost about half what full employees do). Like as a contractor I was not invited to the holiday party, but full time employees that couldn't go would give their invites to contractors; so the employees would work around company policies to mitigate that damage to morale and tea-mates. It was a weird disconnect.But like I said, Google is a great place to work, you'll meet great people, work on very interesting things, and have opportunities you don't have anywhere else. If you're  contractor just be prepared  to be a second-class citizen in an otherwise great place. enjoyable, busy, fast pace nice people very clean environment training is good parking is terrible  need more batteries for back on scanners more inspection on delivery cars Great company to work for; they issue bonus and rewards as long as you put forth the work effort.Learned a lot about sales. Already had a sales background. The position did not require a background. Work place culture is very laid back as long as you get your work done and your a performer you will have a job. The hardest part of the job is dealing with no sales. Culture is fun with office perks and competitive environment working with top Fortune 500 companies. Team is collaborative and diverse set of projects so each role is not independent. If you are lucky enough to get hired full time this is probably one of the best places to work in the US or maybe in the world. Nice corporate culture. Google was a great place to contribute and grow. The only reason my contract was ended was because my supervisor at that time and I piloted a new way to source at Google and it didn't allow me to hit the metrics that were expected as a Sourcer, I would return at a heartbeat and have no doubt I would be successful. The support system is great! The people are always there to help you, and they understand that it is normal for an employee to have a hard time sometimes. They are very open so you wouldn't feel intimidated to ask them a question.The job was home-based and it offered good pay for the work. It is unfortunate that I was not able to continue working here. But I will always value my experience with the company. The stigma of being a contract worker at Google is very apparent. The overall atmosphere contains a lot of superiority complex. People there are very stuck up. Working for Google was a great experience. I was able to meet a ton of new people and broaden my horizons while working for the company. And the management was kind and flexible. I like the flexibility, but not good for advancement.  The food is good. The management is good. There are opportunities to grow. You learn a lot. Role is tiring. Worked as a contract employee. The group that I was in is a sink of swim startup group. I didn't spend a lot of time with my manager. Ramp up was basically a bunch of decks given to me, and had to learn on my own. There wasn't much in set processes, but I helped put many of those in place. Everyone was very friendly and you have a lot of autonomy to do the work how you want to. Make sure you meet your team and you know how it functions before you start. All of the people I had the pleasure of working with were amazing. We had lots of fun on top of work which made it a great place to be. The perks like free pop/snacks and pool tables doesn’t hurt either. Work was good. Lot of things to learn. You can participate in many side projects. Special consideration on Work/Life Balance. Awesome work culture. Everyone is supportive and no politics I cannot give an accurate review of this particular employer due to the fact I was only there for one day, then had to resign due to an off the job injury It is a challenge describing a typical work day at google Fiber, the rewards were matched fairly with the cooperative efforts of all my team members. I am fortunate to have had the opportunity to share my practical work experience with my coworkers. A lot of fun to work for Google - as a contractor, however, there is little room for advancement and reaching a desirable salary.  It's a hard place to leave. Typical day at work is situated around your computer, or in a conference room. It is nice to have so many options for break time entertainment... to take a load off of staring into your computer all day. Free warm lunch is provided every day, and the mini kitchens allow you to store your lunch but also partake in cold drinks, hot coffee, and even toasted bagels if you choose. Googlers work hard and play hard.  If you fit in with your team and your work, you'll do fine.  Don't be afraid to ask questions; everyone feels lost at first. You learn a lot and the more you put into it the more you learn. You have your own goals but work as a team. Fun place to learn at. Learn alot about Adwords google is a great company to work for in itself but some of the contracted managers on campus in the culinary setting are a bit sexist and racist at times. I have seen during walk through as an intern how the kitchen staff is disrespected Its good if you need to work asap, but contract term is 6 months, so you don't get benefits. Might be changed now but I have not looked into it. Easy job, needs improvement. YOU DO NOT WORK FOR GOOGLE, you work for STAFF MANAGEMENT. You must communicate clearly to the location that you want to be placed, they will not bother to assist you immediately .You will be placed in different stores depending on what is needed, state that you do not care to be switched from store to store. If you don't have your own transportation or reliable transportation they might be able to work with you. Mention or just ask about it. Job is very easy with lots of free time on hand. Hired through a staffing agency. Little to none upward career mobility. Goals tend to be set too high for slower markets. Had to go to different buildings for desktop supportTroubleshooting users issues was funWorkplace culture was socialized and tech savyI really liked the technological aspect of work environment.They use to have concerts and events which i enjoyed the most It was amazing working for Google. Looks great on your resume. Got easily hired somewhere else when they know I came from Google. Also, it’s very challenging so be prepared to prove yourself. Cool,  I was completely independent.  I didn't get paid well enough for the work I did is the only bad thing.  I am sure the Photographer was paid more. Google hires a lot of contractors and few become employees. I wish they would hire most people as permanent employees and develop their people to grow. Over the course of the years, the company culture changed dramatically.If you are looking for a highly competitive workplace, where you are challenged and stretched every day, then this is the right place for you. Efficiency, scalability, automation, operational excellence and ambitious targets are the top business priorities. Instead, if you are looking for a start-up culture, where you can change the rules of the game, then Google (sales) is not the right place for you. I was brought in by an acquisition. Most of the employees left within a year.  I stayed longer but ultimately was offered a job to go with the head of product marketing to a nw company, Quantcast to head up Trade Marketing. It was a great opportunity to lead a new group there under a boss I respected, so I took it! I rated google search pages for relevancy to the search query.  The better it met the query the higher the rating.  Pages with multiple annoying ads or spam would be rated lower. I would review working with Google a good experience and was worth being there. All my employees were very nice and made me feel at home. I was really sad leaving Google because my contacts ended. The retail team was nice, smart, and dedicated. The project was fast-paced. There was room for even a contractor like me to make suggestions and affect the project positively (sometimes contractors are just expected to follow orders). The people are friendly and talented.The perks are nice.The software development environment is a mixed bag of very good and very poor tools/practices.The actual working environment is cramped and noisy.Managers and directors spend most time coding, very little time optimizing productivity.The learning/ramp-up curve is steep.Competitive periodic ranking based on code submissions. Very good environment. Google is such a big company and provides good benefit. The only thing that I dont like is that they have so many teams and you only focus on a small thing for a long time. If you're looking for a fun place to work, Google is the place for you. There is something for everyone, even if you get turned down for one job there will always be another! Had a great experience working  at the company. Very employee based company where they put the employee first. Excellent place to grow in the company. A lot of really good people working on very interesting projects. There is never a lack of something to do, quite the opposite. Much is expected of you. Google maps was a great growth experience and a wonderful place to work, even temporarily. There were lots of opportunities to work on different projects or to move to different teams. Lots of community and a wonderfully relaxed atmosphere. Google originally was managed properly. During my time there you have to know change it always occurring. I made a lot of money in profit for this company but the commission was always changing and monthly commission goals always increased. (Example: $33k - $68k) in my time with the company was expected each month. Our commission pay out was 1% at highest when I left. I loved my job and was good at it. I enjoyed helping customers and the businesswas well established where customers wanted help and wanted to buy. Googlers work hard and play hard.  If you fit in with your team and your work, you'll do fine.  Don't be afraid to ask questions; everyone feels lost at first. Lot to learn, culture is great. Workplace has a lot of benefits. Really enjoyed my time at Google. Hardest part of the job is that it is ever changing. I thoroughly enjoyed working at Google and was understandably disappointed when my contract was not extended (due to new hiring procedures within my department). Great company for work.  Greate culture and minded people around. All teams work in relax enviroment and work very hard to get recognization in company. great place to work, fast paced, had to adjust to a environment with process that can vary, Imaging and IT skills needed. Various IT hardware involved, knowledagble staff, growth and good management. Culture revolves around you and your work ethic. Hardest part of job was various elements with options to change day to day. Enjoyable part of job was benefits of gride and gbike commute, free food and fun exciting campus to enjoy and walk around in. While they do a great job at providing a ton of things to make employees happy. There is a lot of bureaucracy and office politics do play a large factor in advancing your roll. My cowokers started dating within the company to help ensure their contracts were converted to full time...I was on the outside looking in, despite helping a team hit all of our quarterly goals. Working with this company was one of the best things I have done  in the years i been alive, Pay rate is low, but still the fame is the greatest. and it gets better! Great Company! Great People! Great environment! The people are a breathe of fresh air.  Great environment for learning!  Great leadership and it's never a full moment! Something like 99% of contractors are not hired on in spite of completing the same tasks and labor of employees. Perks are great, environment and culture are great, but contracting is exploited by management. The best co-workers I've ever had. Smart, driven, helpful.Despite the work being challenging, all-in-all Google provides a great work-life balance. It's fun to be at the office. My job consisted of showing up on time, sorting, marking and packaging hard drives scheduled for decommission for about eight hours a day. There was free food and what was probably the most friendly working environment that I’ve ever had the pleasure of being a part of. While the work itself was a bit monotonous, the monotony, helped me find ways to pass the time and get through the day and still do the job as well as I could.The job did get cut short due to everyone finishing the work we were hired to do about a month before we were scheduled to finish so we basically lost a month of work because we did a good job, but them's the breaks. Overall it was a great place to work. Unfortunately management from other sites lost me my job. But they provided breakfast and lunch and a great atmosphere to work in. one of my best jobs. It’s so awesome to work here and I️ l or it so much . I️ just stared and it’s the best of my other jobs I️ have had . So great so much niceties and nice people Experienced in Project Management in different areas.Working on digital marketing projects.Tools used: MS Project, Open Project, Jira, Producteev, Zendesk, Wordpress, Google Analytics I had a great time working there great people great atmosphere just wish I had more time bosses where awesome money incredible just the job it self wasn’t long term wish I could go back Work had play harderAll expenses for travel, rental car, hotels, and food were covered.Good overtime pay when OT was available. Lots of travel. Got to see a lot of corners of America I would have otherwise never visited. Hardest part was being away from friends and family for long periods 3-4 weeks. Most enjoyable part was driving long distance on the open road with money to burn and a schedule completely set by myself. Weekly goals means I could manage my days how I wanted to and still reach my targets.Learned I love to travel and be outside in the sun. Learned I really want to live in Hawaii at some point. Best trip ever.I learned that I should probably be in management because I'm fair and honest and have the mindset for it. My experience working in the Google environment was inspiring.I worked with other Sourcers that were extremely motivated and took great pride in exceeding their goals, above and beyond. - Love the googlers- Friendly - Free Food - Lots of benefits - Love coworkers- Team work - Management was very poor - Getting product googlers wanted that we couldn't get- Love meeting new people -One of a kind experience. - Interesting project. - Ended too soon.- Laid-back management.- Amazing perks.- Very independent. - The diversity is incredible! Truly fun place to work. So many opportunities to learn. Great and varied team mates. Super team oriented. Autonomy is the word of the day. The choices you make are for your productivity. So refreshing. Specifically I manage my own personal YouTube account where I have flexibility to create content as often or as little as I want. I also have the liberty to work with various companies in exchange for promotional review for product or to agree to financial compensation by contract.  Pay from Google is based on advertisement views; and is mainly based on how much a creator uploads and how many views they receive.  I truly enjoy coming up with content, editing and marketing; which makes this job enjoyable, along with having the freedom to create what I want. Googlers work hard and play hard.  If you fit in with your team and your work, you'll do fine.  Don't be afraid to ask questions; everyone feels lost at first. I never worked at Google. I worked for a company that was contracted by Google. I apologize for any confusion this may cause to your review. Everything else is correct. I've never had a better experience in my entire life and I would've given anything to have been able to stay (as I was an independent contractor and my employment contract was up) Free food was only one of the MANY perks that Google offers throughout their building. They truly care about their employees, it was life-changing. Google LAX is an amazing place to work at. I've learn so much about Google Adsend and Adwords. Working with Google's engineers really open my eye on how Google do their business and behind the scene of how their products work. Mangers there are friendly and helpful. This was a new experience for me since it was my first exposure to a true sourcing role. This was great experience in sourcing but was limited to just that so was not the best long term fit for me. ** Vibrant workplace** enjoyed complimentary snacks  & meals** Respectful and diverse workplace** attentive to others** Meetings conducted in orderly fashion **others listened to your contribution** Management needs to provide better planning / road map to staff for strategy / outlook / long term guidance Google is a wonderful place to work, I wish I never left! As a TVC though, your experience is greatly dependent on what agency you are with. If your agency is timid about asking for more money so that in turn, YOU can continue to climb then you're out of luck. Everyone is pretty collaborative, easy going but hard working. My experience as a TVC was that they didn't care how or when you did something, as long as it was done and on time. You do have to get used to requests from FTE's that can seem frantic, I.E. 'I need this YESTERDAY HELP ME PLEASE!' but if you can communicate and ease fears of trusting a TVC to complete a task, then you'll do well. Engineers there, both software and hardware, tend to lack communication skills or emotional intelligence so if you can bring that to the role then you'll be greatly appreciated. You get almost all of the same perks like free gym access and food however you do have to pay $1.50 each way on the G Bus shuttles whereas this is free to FTEs. All FTE shopping perks, concerts and happy hours are not extended to TVCs but its not that big of a deal. Overall, great place to be with the RIGHT agency. Google is an amazing place to work.  However, there is a distinct caste system among employees.· Full-time employees are all treated great.· Full-time contractors are treated very well, with most of the same benefits as FTEs, but on fixed-term contracts.· Temp/Vendor/Contractors are treated well for non-monetary benefits - ie free shuttles, free food, free use of gym & laundry facilities; no insurance, stock options, bonuses, etc.This is fairly common practice in Silicon Valley.  However, it is the fact that the distinctions between these 3 categories are often blurred, but the TVCs are treated as disposable in a lot of ways.There is the obvious incentive to work hard as a TVC to earn a promotion to FTC or FTE, but often that path is not transparent and in fact it may be used as an incentive or motivation, when, in actuality, there is no actual path to promotion. People are extremely friendly and outgoing. I would definitely improve on helping others stay close to home. Life gets harder when you have to travel far from home. Great benefits/401k/sick time off. You can make your own schedule. and the time frame for shifts are flexble. Google campus is awesome!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Google is not a bad place to work if you get in; however, google has the worst hiring process of any company I have ever seen.  The absolute debilitating fear of accidentally hiring the wrong person creates an environment where there is a long winded hiring black box, with almost no feedback what so ever.  You might be in communication with a hiring manager one week getting ready for interviews, and the next week, you are no longer being considered, with no explanation, and having not even interviewed.  Once you have made it through the notoriously difficult 4 hour back to back interviews, there begins a long mysterious process of going through hiring committees and executive reviews, where there is no feedback.  This process took at least a month or more for me, with a solid month between phone and in person interviews,  There was also a delay of a couple months between resume submission and any contact from Google.Once in to Google, being awesome at your job is not quite good enough to get you promoted.  You need to demonstrate being awesome at the position two levels above you, to be considered for promo. Google is an amazing company with an incredible vision of the future.  Having only been exposed to a portion of it let's me believe the other divisions are just as impressive if not more. This review is based on my time as a contractor with Google.  If I w as permanent, I believe I would have been much more satisfied.Salary/Benefits/Perks are limited as a contractor. I was contracted through ranstad, had the perks of being able to eat in any cafeteria or use the gyms, as well as the bikes. The Rolle I was in was a new role a while back we were client support when google first took over the market place and launch the Asus tablet. Its really a good place to work. I have a good team here that supports with any problem. I have worked for two projects and both teams had good working culture. All in all a great company to work for but advancement beyond a certain point can be extremely difficult.  Benefits and perks are amazing just like you hear about. Great work culture, incentives for employees are not up to par. Would recommend for future applicants if you are looking for that staple job on your resume. Great Company to work with.. despite it is temporary position.. so I am looking for fulltime automation engineer position.. please do not call me for contract or out of area positions. a nice environment with amazing friendly people and you get to eat at any time of the day and eat as much as you want you get free food . you get to workout before your shift or after. Very fortunate to work here and co-worker are very good and stress is to low love working in this company. Wish any time get a full time oppurtunity .Thankyou The best part about the company is the people you work with.  Very helpful and constantly drive you to be better.  When you are working among the best of the best you tend to achieve the best.  Great work life balance with amazing benefits and facilities. Googlers work hard and play hard.  If you fit in with your team and your work, you'll do fine.  Don't be afraid to ask questions; everyone feels lost at first. Provided a small team of developers to Google. Remote weekly meetings were relaxed, but highly efficient.Project goals evolved, but keeping up with those changes and learning new things was part of the benefits of the contract. Free lunches, great team to work with, privileged to work on ground-breaking, world-changing project. Ping pong table to cut any stress. Allowed to listen to music. Good morale. Use of positive reinforcement made a great working environment. Management is not professional.Workplace culture is good if you get on the inside but not if you're a contract/temp role.The most enjoyable part of my job is my coworkers – they have become my friends. Great experience, had to relocate. Good hours and locations. Fun environment. Would recommend this to anyone looking for a onsite position.  You will love going to work i really enjoyed my time working at gsx and the experiences i had there. the organization,its leadership and the employees are just a few of the many things i enjoyed I was a contractor so the only thing I would complain about was the apparent distinction between full time employees and contractors. But its understandable. Full time employees enjoyed the best benefits and perks on earth it seemed. But as a contractor it wasnt bad at all. Obviously the best contract job I ever worked. Very exciting work. Great culture. Very nice people. The work was challenging and had the opportunity to learn many things. Great product to learn many things from. - exceptional management - career growth is not as easy as it seems... hugely competitive internal pool of candidates for emerging mid-career level jobs - great early career sales training & responsibility off the bat It was a really good company to work for and I enjoyed it. Awesome stuff at google if I had to rate it from 1 to 10 it would def be a 10 because of the great company culture!  I would love to work full time there right now! I appreciated my time at Google Fiber, however I did not apreciate the lack of Benefits that come with the job.Healthcare is very sparse, and does not include dental or vision benefits. The company does not offer any 401k matching and PTO is only accumulated after you have been with the company for a year or more.The company culture is very robust and strong.  Amenities are offered for employees and employee support is taken very seriously. Pros:In-office AmenitiesPossibilities for advancementLearning opportunitiesGreat company cultureCons:No matching 401KNo full tier benefitsLittle to no in-person managementExpensive health benifits This was a pleasant job where I realized that I enjoyed teaching, I continued doing it for some time after finding a teaching position, I would continue doing it but I am dedicating time to developing my experience in developing software. Great place in general to spend 40 hours a week.   Free Gym and food.  The layout is beautiful and the people are friendly.  I learned a lot and enjoyed building lasting relationships with the people I worked closely with.  The workplace culture is one of positivity.  Its going to be hard leaving this contracted position because I do enjoy working here but the current wages aren't competitive enough.  The best part of the job was management and the coworkers. Many great perks, workplace culture was fun but the contract was short and temporary. There are only Engineers for coding and not much QA was required in the role. This was one of those contracts that was very enjoyable.  Not because of the perks (which are great).  Because you feel empowered, energized.  Work hard, play hard.  Very Collaborative. Managers protect other managers and sometimes hire people just like themselves, this is against the idea of diversity.  I worked with vendor managers and vendors and was able to see a larger landscape of initiatives and the scope was tremendous. Best balance between work/life balance, compensation/perks and quality of colleagues.  As we are growing bigger, the typical pains of bureaucracy are cropping up. I enjoyed the satisfaction of working at my own pace and choosing how and when I got the job done. I was able to satisfy customer needs faster than expected. People at Google are very passionate and it's shown through their stella work ethic and dedication. Working for Google has been a rewarding experience. Googlers work hard and play hard.  If you fit in with your team and your work, you'll do fine.  Don't be afraid to ask questions; everyone feels lost at first. 95% of google employees are contractors so not alot of benefits for working with the company other than the pay and being able to put them on your resume. The offices are really great place to hang out and the staff are friendly and relaxed though. I've been to several offices and they all seemed amazing. I was mostly in the field however. The most enjoyable part was driving everywhere and seeing how software I use everyday is made. I enjoyed working at Google. Very fast paced and busy environment. My days would go by so quickly. There is always plenty to do. Everyone is so nice and will to help in any aspect. I learned alot about the Google culture and its expectations for the staff there. Work attire is very casual. It's more of what you can do not what you can wear.A typical day included meetings, lots of meetings. trouble shooting situations for my staff and a little time at the end for a fun activity with my team. The hardest part was keeping up with an intense calendar schedule. You are pulled in many different directions. High expectations for everyone. Working at google has been a quite a journey. The management really cares about their workers and provide a lot of benefits. Daily task is tough to understand at the beginning. Fun place to work at everyone is friendly like all the staff very cool people we had 30 minute break and 15 minute as well, had yearly 1 week off. I love it If you get in stay in! Great company to work in positive work environment that provides all the more motivation to get up everyday and not feel burdened by work Answered phones and worked on computer . Enjoyed job had to move so wasn’t a able to work late no . Called and talked to customers and edited there accounts on computer The work environment at Google is one of great partnership and everyone is willing to help you. If you have any questions you just have to ask and everyone helps you. I love work here and wish continue working with this excellent group of professional. Friendly working environment with lack of management. HUGE need of minorities: Black, Hispanic, Women, Elderly!!! You barely get to see people older than 40 years old :( Google Creative Lab was such a breath of fresh air. Really team-oriented and smart management made for a great experience. I'd recommend it to anyone who wants to go to grow and learn about tech problem-solving through advertising. I was a Google Summer of Code participant in the summers (2017).Pros* Friendly people* Lots of smart people.* Good stipendCons* Very large company. Working at Google gives you the opportunity to not only excel at your current role because of great management, but also gives you the opportunity to build on your resume and gain extensive knowledge that will help you in your future endeavours. I think working at Google was amazing. Everyone helped each other while maintaining a friendly relationship. Teams were encouraged to interact with each other so that we can build other skills outside of our main job description. Meetings were very frequent which also built strong relationships between team members. One thing I really loved was that everyone is treated as an equal. Fun place to work, challenging days, exciting to meet new faces, struggles include management styles and drama with the separation of teams. Enjoyed my role and kept to myself The company is productive and challenges your skills, it is very exciting if you are a go getter and you like to push yourself. You must be strong willed and not fall into to outside drama. I loved the people I worked with at Google, as well as the corporate culture. It takes time to get used to the day-to-day, but it's a great place to work if given the opportunity. Typical day included monitoring day to day test performance and investigating issues with those tests. It was enjoyable to code and do work. It involved working with very sociable and helpful coworkers. Very good especially if you work multiple jobs, this job is fulltime pay with part time hours work. M-F Weekends off, Very laid back especially if you come from customer service backgrounds. Loved working for the one and only google street view! I love all the opportunities they gave me and I’m so greatfull for them! Hopefully another door opens from them! Enjoyed my time at Google, nothing to repent, but managers are so-so for an otherwise great company. I didn't find them to take genuine interest in their employees and were mostly about growing their own career. The promo process also is weighted towards complexity and less about the impact you make, so it favors people who are about putting unnecessarily complexity into projects and/or people who are not very startup thinking in their mindset. Difficult for people who want to iterate fast and/or make maximum impact. Learnt a lot and moved around a lot working with varied sets of people, so cannot complain much! Googlers work hard and play hard.  If you fit in with your team and your work, you'll do fine.  Don't be afraid to ask questions; everyone feels lost at first. i don't know what to say, it's a contract job, i can't really say anything good or bad, because i was never a google employee. which was sad, i really wanted to work for google. It has a work hard play hard culture. It is a great place to build your career. I was here 6 months on an internship. It was a great opportunity to grow as a professional. Overall Great experience working with wonderful, intelligent people.Compensation could be better and advancement within specific roles is minimum..... Google is a great company to work for. I was a contract employee so my time there was for a short period. I enjoyed the benefits from working at Google. The food is excellent and I loved there gym Great company and great co workers. Every day there is something that would make you laugh or think about different ways to solve an issue you could come across. No room to advance. Travel is fun but excessive. The program could have been made better but it ended due to poor management. Outsource project with google. Love working for Google!  Plenty of autonomy, correlation between effort and reward, and sufficient challenge.  Great management and very supportive of career advancement. Learned a great deal about change management, people management , project management, leadership, diplomacy, tact and professionalism and the type of leader I want to be I like the job very much. I did what was ask of me. I learn a lot. but the management have a problem keep good workers.I am a eager family working man. I am a fast worker. I enjoy working for Google. So far it has been the best job I have every had. If you ever join Google, BE VERY CAREFUL OF WHICH TEAM YOU JOIN. I was a part of the Android team and it was the worst. Culture was awful. Management was poor. Communication was the biggest problem with all the Indian people. I have loved my internship since the day I started. This place has helped me start paving the road in my professional career in a positive way. Im extremely grateful for this opportunity to intern at this company. I defiantly would consider reapplying if there was a position open with in the line of work and experience I currently have. Work with the Field Operations Lead to manage hardware assets used for in-store processesWork directly with retail store managers to integrate operations processes, troubleshoot issues, and reportfeedback to the Store Operations LeadWork closely with Store Managers/Employees, Store Leads for ongoing product/process feedbackWork with the design team to test new operational processes and provide key insights and quality feedbackExecute daily shopping tasks and inventory validation checks, using a range of mobile devicesOff-site: occasionally with meetings at the head office This was a great place to work even as a contractor, however, you don't experience all of the same privileges as FTE. The company offers a wonderful opportunity to grow and advance. Many cool events to know more people. Micro-kitchen is a great place to know people from your floor (or anyone who has meeting in that floor). Amazing work culture. You can bring dog to work (that's not a secret anymore). Google summer of code is an awesome opportunity provided by  Google wherein you are paired with a mentor from an open source org and you get paid to work on their project. It's a wonderful experience overall do go for it. It's a 3-month programme over the summer. It was a cool place to work the pay was not great but it was nice not being micromanaged . The company closed with giving employees a two week notice and it was right before the holidays. They offered 100$ for inconvenience which didn't help at all. The manager was very cool and helpful Google was a great place to work in every way. I wouldn't trade that  experience for anything. From my manager to the culture, everything was top-notch, There is no work life balance. The benefits were good, free food and insurance. They have shuttle buses and free  food. Managers show favoritism and co workers gossip and backstab All days are typical how to be humble and free giving Don't know good internet coding 10 hours job good happy joyful no sadness always good no peeping Great company to work for just ready to spread my wings and have career advancement.  I enjoyed my time working here and had a great work/home life balance. Googlers work hard and play hard.  If you fit in with your team and your work, you'll do fine.  Don't be afraid to ask questions; everyone feels lost at first. If you want a workplace where you can take vacation whenever you want, and nobody cares how you dress to work, this is it.It's such a big company tho, that it's very easy to get lost in the crowd in regards to your work standing out and advancement opportunities. I liked working for ITC Broadband. But promises were made and broken. Pay was slow to advance. It was great to push a new product that people were excited to receive. Everyday I work on groundbreaking technologies with a team ready to change the future! Incredibly rewarding work environment with amazing perks everyone is familiar with. Poor management and leadership.  Little to no advancement possibilities.  Juvenile work environment with favoritism and cliques.  Good place to build agency, but not a job for a professional sales person looking for a career. i worked there for as temporary the problem there its only temporary, not for family needs, this job is only for singles, I was not totally 100% happy work there because thers alot of gossip, all i know was work,& wait for my pay check google gave me a perfect working environment. However, my leader seemed lacking of management skill. He is not strong at solving conflict  between team member. If we  take this issue as a minor, google can be known as a perfect work place. Unlimited potential to learn, many intelligent people to network with, and so many perks. Google treats their employees right, and encourages individuals to take on their own projects, give feedback to everyone, and make Google better for all. Great job for someone that loves computers and driving. This job gave me a chance to travel and meet new people along with making a great paycheck. My team was top notch and there was nothing i would change or ask for. I loved my experience there. The environment can be very demotivating. There is a lot of drama that goes on and limitations to advance in your career.  Training could be greatly enhanced. Google is one of those places that makes you feel at home. with their gyms and unlimited food resources google is a place i would go back to. sadly i move from the bay area. Great company and fun product to sell.  Excellent management and support.  Corporate decided to shut down the division I was in.  Unfortunately.  Would recommend. Since I would only have my internships on Friday evenings, I never really got to spend a whole ton of time in the building. What I did learn at my internship at Google was working with money, like being a sales person and how to attract customers. Nice environment. They care about keeping the employees healthy and happy. Good environment for people with diverse cultural and language backgrounds. I love that snacks and coffee are always available when the day gets stressful and there is no time to leave. The break room is not far from any work space. People are the smartest people you will meet. Everyone is so laid back and the culture is fantastic. You can choose to work remotely from home if you choose to. Also, you have the freedom to do any 20% project you would like. Come in and work with others on a daily basics. Fun to communicate with others. Can learn a lot from each and other. Nice snacks and Food to keep your self energized. By far the worst company i ever worked for. I was employed through a sub contractor who just one night packed up and left state with all the money. They left 15 employees stranded in texas with no money no way home and without any reason. Great team work and get paced job. Work environment is safe filled with people who want to work. Definitely would like to grow with this job and seek all opportunity Google is a great place to work. Friendly accepting environment. The culture of Google is ever changing which makes it very diverse in everything that they do. working here was alright. it was a contract position. you got free lunch and parking. the google full time employees were all condescending towards contractors. typical stuff. Googlers work hard and play hard.  If you fit in with your team and your work, you'll do fine.  Don't be afraid to ask questions; everyone feels lost at first. Overall the place was great. Managers were awsome. Everyone got along well. It was very competitive but it was fun. My time there was short but I enjoyed it. Make sure youre logged i on time ad prepare to assist customersInbound ad outbound callsCustomer service handled in professional mannerSup escalation only if needed This is a fun place to work and is a small company so you will have a chance to learn about a lot of different aspects of business and will need to open to change through out the day. wish it was full time.   I was a contract employee so no benefits or perks.    loved the job travel to and from my home was quite far but the people and atmosphere were amazing .  I would recommend working at google for anyone even a chef I loved everything about working for them I was only a event coordinator for a side company but the perks of the job was pretty awesome to myself I would love to go back. Excellent work environment and amazing people to work with. The ability to to travel with in the southeastern region of the United States really taught me a lot. Great job great environment the people are very nice they offer free lunch and dinner the mangers are excellent it's just an overall great place to work I got to be a part of an incredible opportunity working with the virtual head gear technology being introduced into schools. I wish I could have stayed on the project longer, and am always looking for openings at Google to rejoin the team as an employee or contractor. New management has come in and the management has turned over  every year with no clear direction.  Benefits and elimination of 401K was not well recived. Enjoyed the year I spent there. No real structure.  As long as the minimum amount of hours were put in by the end of the week, you could work whenever you wanted. Flexible hours making my own schedule any day of the week. I learned a lot about the area of New York City and New Jersey. I would certainly recommend working for Google to anyone. This was a fun place to work and got to travel to CA and PA to see the offices and meet some really smart people. Google is a great place to work.... if you're hired directly, but if you came in by an acquisition, you were doomed from the start! Never got a real shot to shine, just immediately cross trained your replacement and that really brought down the morale of the team. Google is an incredible place to work.  They have every perk you could imagine.  However, it is a huge company and that's definitely not for everyone. Google is a great place to learn and start your career. There are amazing opportunities for skill and career development. People are friendly and the company cares about its employees. Great benefits, great people, innovative projects. A self-starting culture that runs like a large startup. Hardest part of the job is getting overwhelmed with multiple projects in a core role while juggling passionate side projects. Like the social culture. People are friendly with open minded on any subject. They are very cheerful at most of the time and a willingness to give hands up to new workers. My contract was terminated with no notice and a vague message was left for my agency saying it was due to performance. I was 2 months in and never had any inclination I was not performing well. Google was a great place to work.  I made a lot of life long friends as a result while learning new skills to propel me forward in my career.  I learned process improvement, lean management, and operational efficiency. it was a good job at the beginning and at the end it was to boring for me because you would do the same thing everyday for the time you were working. but google do treat the employees good Worked as a Software Developer during Google's 2017 Summer of Code program. Fast-paced, highly educational opportunity for beginning software developers and the open source community. Highly recommended. Googlers work hard and play hard.  If you fit in with your team and your work, you'll do fine.  Don't be afraid to ask questions; everyone feels lost at first. Lots and lots of digging for information and conveying that to sales reps. Can be difficult sometimes as they fight over account ownership and commision. This is a great place for making amazing advancements in career. People are full of energy. There is opportunity to learn new technologies. Job is well paid. As a software engineer intern, I learnt a lot during the internship, and get the chance of experiencing large scale project. The culture, the people and the benefit there are all great. Responsible for troubleshooting technical issues with the Google Play Books UI● Use technical skills to establish ways to push content out to the Public in a timely matter● Established a lead role that involves making sure Partner’s / Stakeholders request are made A top notch company that provides you plenty of opportunities to break into the technology/internet industry. An amazing place to work for new grads and anyone looking for a way into the world's greatest internet company. The environment is innovative and everyone has a voice. If the area in which you are involved is not an area of extreme expertise or knowledge, each person still has a voice. This leads to creative solutions AND sometimes drives the business a direction that won't work now and will work later. Course correcting happens a lot. We are a very young (1 yr old) hardware operations organization. Exciting times - it's just in the wrong geographic location for me. You are in charge of your career and are given tools and opportunities to advance yourself.  Software engineering is the main focus so may not be a place for non-technical oriented people. working for google was interesting, i've learned alot,. i work on the fiber side, therefore its more construction, project managment based. over all it is a great place to work Google takes care of its employees, I have nothing to but good things to say about my experience there. If given the opportunity I would work for Google again. my experience with Google has been nothing but positivethe working environment is always changing and so is the location in which I am working. the managers are well qualified the job at hand Best place to work ever. People are very passionate about their job and they want to put you in the game since the first moment. Very attractive and full of joy. Fast paced and fun but feels like a big company. There is no culture quite like this one in terms of people you can meet and mesen from and it’s truly a good challenge Company has exciting vision and many growth opportunities.Many people work long hours.Team/group may have its own culture.Company is experiencing rapid growth expansion in some areas while other business reaches mature stages. Little to no benefits, treated as disposable, No autonomy, no room for advancement, no recognition for good work, management will throw you under the bus to spare their own ego It was a summer coding internship/job for students.  Google pays you to work for an open source organization. I worked for KDE. Got to learn a lot. It was fun. Working for Google you were on your own a lot . You were given the opportunity to reach your peak potential, the only way you could fail is if you did not want to succeed. Google is wonderful place to work, it is like dream come true. Best place to work, Fun, Facilities are awesome. really really good place.Food is good. Oh yeah, Google is nicest place to work for. Many things most people benefit because Google spent for good entertainment for their employee, such as, Gym, pool, bikes, parks, and good foods. I enjoy working at Google as a research coordinator because we are in a team-oriented environment but also we know what each individual needs to do to be successful. The work is different everyday and we get many new projects weekly. I love the culture at google, because it is very relaxed but people know when to work hard and when to have fun. Google has taught me a lot of different skill sets that I can take with me into my new career. The only thing that I would say that's negative is job security, and employee benefits. Overall job was wonderful.  Someday a little crazier than other, but day always brought new challenges.  Wonderful supervision willing to teach me the ins and outs of servicing our clients Googlers work hard and play hard.  If you fit in with your team and your work, you'll do fine.  Don't be afraid to ask questions; everyone feels lost at first. The company was decent. It was not too stressful, reviewed scanned images of books on a daily. Management and HR were great. Wish the pay was a bit better. If you can turn a blind eye to all of the dishonesty around you and focus on your job you will be very happy. Typical with large sales organizations, they look away from those that lack integrity as long as they produce numbers. It can be very cut throat but also the best training and learning experience you will get at any job. Treat it as a privilege to learn and go 'all-in' and you will have a long and prosperous career. Not the culture for an honest contrarian. Long hours but excellent payout. Google is known for being the best place to work at and it truly lived up to that. The clinical part of the company was always grown just like the company it'self. Work was always consistent and very enjoyable. I worked for Google Ad Words where the environment is very competitive which is fine with me all sales environments are competitive. The job was going well until we found out we were going to a quarterly commission base pay from a monthly. We were told that we were getting a raise to compensate for the change in pay but we were not given the raise. I understand the reason behind the team not getting the raise. As a unit we failed to meet certain goals so in turn our pay was cut short. I love the job overall though, working with clients to maximize account performance is fun and I've learned a lot working for Google Ad Words. I enjoyed working at Google and formed great friendships. It was very fast-paced as I started there pre-IPO and left a few years after the IPO. I understand it is a very different company but I learned a lot during my tenure there. I am very happy and fortunate to have had the opportunity to have had work for this great and most wonderful business. I had learned a lot. Every coworker in which I had contact with was very nice, respectful, & professional. I worked in the Paid Search division which at the time was owned by DoubleClick/Performics. A lot of attention is given to employees to support them in developing a strong career path. Working at Google is great and there are not a lot of issues working there.  However, the one area at Google that could have been improved upon was the work life balance.  As I grew older, working long hours was not what I wanted to do.  As I progressed through my career at Google, I struggled to maintain a great work/life balance and found it difficult to disconnect from work due to the fact that I was working on many high pressure, high visibility projects.  Other than that, Google is a great place to work and it is what you make out of it. Working for Google is wonderful, but when you have a middle man such as Adecco it makes things very difficult in your work. Google is a great company and this opportunity is one to always remember. I liked the culture, the projects, and the opportunity to work with stellar colleagues who taught me a lot about how to be a top rate professional. Project deadlines could be challenging. You have to be prepared to learn rapidly. Typical Day: Working different tasks depending on demandManagement: Self Managed for the most PartHardest Part: Deciding on what to EatMost Enjoyable part: Playing Ping Pong on Break with Colleges Typical day with Google starts at 8:30am and ends around 4-5pm depending on the job. Really great company and really great co-workers. Few things could be done differently but its currently being changed. Great place to work, amazing co-workers and job atmosphere, easy going people, free breakfast, lunch and dinner, only down fall about the job is that you have to go thru an temp agency, not a temp to perm position. I worked at Google as a contractor for a year and a half. After couple months on the job I have realized that a lot of things that have been advised prior to the start date appeared to be different in reality, i.e. micromanagement, different job tasks, manager changed, lack of leadership or lack of clear goals to follow. On top of that I could feel that I was being left out on many occasions since I was a contractor. Also I felt mistreated, I could get a random text or a phone call late in the evening from a PM asking why I did this or why I did not do this even though everything has been discussed and followed per provided instructions.At the end of my contract I felt miserable and underestimated.I am glad that my project ended. productive and fun work place. very social work place with lots of friendly vibes. meeting lots of people. learning and educating others. being apart of google history. Working at major tech companies through contract positions is a very effective and efficient way to get a head start  on one's professional career. The management and team on-site is very communicative and looks to help you grow as both an individual and working professional. Networking is a key aspect of positions such as this and a lot of what you get from the role is what you make of it. My advice is to be outgoing, communicative, and always looking for ways to prove yourself. I would definitely work here again if the opportunity arose. I was on the Google Play contract with Xerox for two years. The pay was less than stellar, the benefits were below par, and the work environment was a few card tables in a poorly ventilated room for the first few months I worked there.Xerox lost the contract eventually, so there is no real reason to utilize this review to judge any other Google contracts against my own experiences. Get to see the world and eat for free. Weekly pay was decent especially with overtime. Going from one state to another was nice. Having $65 dollars per day for per diem was more than enough to eat daily. Paid five star hotels and new rental car vehicles. Hotel and rental car reward points was great!!!☺ Its a easy job. You just go from place to place and make sure that Google's products are advertised right and that the employees know everything about the products they sale. I did not work for Google but did installs for Google Fiber, which ITC managed. I am required to have 150 minimum characters for this review. This is lame Googlers work hard and play hard.  If you fit in with your team and your work, you'll do fine.  Don't be afraid to ask questions; everyone feels lost at first. Professional & friendly environment, free food/gym/perks/snacks etc. As a contractor - not a lot of room for growth. Its good for a family person (35y.o. and above). For young person - better to work in fast-paced competitive start-up work in google merchandising through a third party had lot of fun meeting people who loved their goggle products, area mangers and google direct office was a great help when needed any help on projects Overall, Google is an amazing place to work. Your day-to-day can be vastly different depending on what team you're on and what your role is. The one thing that's consistent for all teams is that innovators and those with a motivated work ethic will excel, no matter where you are on the corporate ladder. A typical day of work and checking the work load and request sent in the morning.Complete the task that  require immediate attention. Occasionally an urgent request will appear.There are daily up keep task that are done in the morning. While the rest of the day is spent working on various projects.Time management is largely necessary to stay on top of things.The work environment is very friendly and relaxing. Hardest part of the job and influx of work can appear at a moments notices.I have learn new skills in SFDC and analytic insights. Cool job and team.Great food and perksCool gym and swimming poolCool travel and buildingsNot much space for creativity and advancement, wishing for more It's a nice place to work.  The people are pleasant and positive. The work is not overbearing, but just enough to keep a person motivated on the daily basis. typical day at work is always busy,witch is good by me. because by me staying busy? IT SEEMS TO make the time go by much faster.AND THE more i work? The more i learn, because each day is a learning exprience . which makes the job more exciting. The hardest part is when some people slack in their work assigment. But thats when i have to work extra hard. just to make sure that the job is done correct. The fun part of the job is getting may pay check . I never worked at google never ever evr evr ever worked at google i dont kknpw why you think i worked at google but i never worked at google ever ever This was a very fun place to work, they did lots of activities to keep people fresh and engaged. I really enjoyed it, unfortunately my position was a contract with an end date. So unless you could figure out something else to do that was needed to further the project then you were done. Made to believe that music experience would be relevant, but whenever it came up, was shut down in favor of 'following the guidelines.' Was made to believe that there would be health benefits: NOPE. The prices are identical to the marketplace.The amount of research is minimal. Most of the research has to go through designated sources, so the majority of this job is data entry. The only reason I'm keeping this job right now is as supplemental income. If you're looking for a real job, look elsewhere. Google was amazing to work for. Fun times. Great people. Facilities were amazing. Long hours but the perks made up for it. Loved every minute of the experience. You will work hardYou will work togetherYou will have funYou will learn new thingsYou will get stressed outIn my experience everyone is treated as a responsible adult. The culture is fantastic and collaborative. The only gripe I have is that often there are high level direction changes that require you to refocus on a new area without notice and the can be a problem when in an external facing role as you will have to redirect partners who are not privy to that direction change. Great job, meet tons of people. Travel is great. Visible job. You will encounter tons of people wanting to talk about your job daily.Software experience needed Its a greta place to work. The work culture is nice, relaxing, and fun. You will enjoy your projects if you stay up to speed on relevant skills needed. Very cost driven which is typical at any company. Great place to learn how to work with international cross-functional teams. Always leverage data to align stakeholders. Fun place to work. Lots of perks. Smart people.But, lack of direction, focus and 'discipline'.The hiring process brings in (or used to hire) some smart, but opinionated primadonnas that can overwhelm meetings and discussions. Google creates an environment for creativity to thrive. The difference being the people they hire. Each team member is an expert at their field and it's through these people that relationships are built. Very relaxed yet competitive work culture. Learned to work in diverse environment, improved management and technical skills. Never thought working would be fun before working in Google! This company is very standersRule regulation better than other company I learnt lot of things from this company, they did train us for fourteen daysNo hardest part for the company but need to be carefulIt's really enjoyable place to work. best everrrrDays were Hectic but i felt occipiedit was as any other GA work but was worth it  and would love to work in a space like pace where i can be the person i am and can do what im best at Googlers work hard and play hard.  If you fit in with your team and your work, you'll do fine.  Don't be afraid to ask questions; everyone feels lost at first. It's nice to go to work where you see squirrels and birds in the tree and get free food. The culture is young, but innovative with many smart people. It was a comfortably challenging job. Worked there on a contract basis, enjoyed the way they handled the paperwork, the paycheck came on time, support was just a call or email away. I could work from home and take care of my family. Fun and enjoyable atmosphere. No complaints at all on my part. I was a contract position so my expectations were not high but I was surprised by the warm welcome. not bad, could be better. Learned a lot and would reccomend starting here to get a foot in the door and learn valuable skills. But would want the company to be more open about why they provide compensation and actual work. This job was very rewarding because i was given the opportunity to help, low income, minority students brushen up their skills before they went on to the next grade. This job has very poor working conditions, unrealistic expectations, very poor salary and benefits, lack of advancement, poor managers and I could not recommend it to anyone. Great place to work. Free food. Fascinating work. Pay is really great, people nice. Would recommend working there any time. I would go back again if I wasn't on a contract that expired. I was a contractor so my experience was different than employees. but, it was a great gig for me. Team was supportive, manager was great, and the perks awesome! the food alone was enough to make me love working there. I learned a lot, contributed to the team in big ways, and worked with amazing people! It may sound good working for Google but it is not. Working for Google is more of who you know than what you know. A very political place of employment. From the first day of training, the experience of being there is very euphoric. The training was very fun and interactive with the other trainees and trainer. The first day of work was just how the trainer told us it would be; very fast pace, interactive with other co workers from Google, and laid back as well.  Every day was the same but different, either pick customer order, pay for it with with Google credit card, or pack the orders' after they've been paid for. I learned how to keep that process moving fast and steady to where the customers get their orders fast and in one piece. It helped a lot, that that the leads, supervisors, and management from the main office were very kind and always willing to help. The hardest part for me, was the commute to work. I lived in Oakland and the job was in Hayward, which was three cities away. All the together the job was fun nd the people were some of the best of the co workers I've ever had. This was a boiler room of sales reps that were petty and used scripted pitcheds to sell services to the public that were shady at best. I have to type in something to fill the balnk space so this is all i want to say. Great Job that i gained great experience but unforonately it was a contract job so my time there ended. Overall The company treated me equal and i had a great working experience . Coming to work for a company that really wants you to have fun and excel while working was a dream for me. They really taught me about work ethics and enjoying your job while earning a decent pay check. It was always fun to work there. Smiling faces around, helpful co-workers make your life better. I loved the culture, and learned many new things there. You need to be on your toes and sharp to work there.  There's a lot of smart and competitive people.  lots of great lifestyle perks, but expect the hours to be typically longer than most companies. Google isn't perfect but it almost certainly comes the closest of any company  with dozens of thousands of employees.A typical day as an Eng. Mgr. is filled with meetings, most of which are actually productive and interesting. The balance is usually spent reading and responding to email or looking through artifacts created by the team you manage.I've learned how to organize and empower people to be productive and happy engineers. Upper management can often be ignorant of how things are in the trenches but there are excellent tools for bubbling up widespread discontent so it does generally get addressed.The hardest part of the job tends to be staying abreast of all the change happening across such a gigantic organization, since you never know when something will impact you.The most enjoyable part of the job is talking to the great coworkers, especially over daily free lunch. I liked to start work early. This was not a problem with my managers. I was a tester for Android Hangouts. We had sufficient equipment to do our jobs and very good supervision. Google's tools are easy to learn and use, for the most part and issues seem to get fixed in a reasonable amount of time.I enjoyed working with our leads and Manager. They worked extremely hard getting us up to speed on changing features. Google's facilities are first rate! I would be very happy to go back on another Vendor job if the opportunity arises. This review does not accurately represent Google since I am a vendor. I work under Accenture/VACO. As a vendor, you are not a 'real' Googler and you are treated like an afterthought and the real Googlers are embarrassed by you. Google in New York was a decent working place with full of creative and skillful people. My manager always supported me during the difficult projects. It was great to had a lot of experience in marketing and SEO fields. Work environment is awesome.  You get many perks working here.  Free meals, gym, snacks, coffee, and etc.  Although depending on what program you are in, it can be hard to move up. Googlers work hard and play hard.  If you fit in with your team and your work, you'll do fine.  Don't be afraid to ask questions; everyone feels lost at first. I was a Contractor at X for about a year. You almost get all the benefits as a full time employee, but not the normal status of a FTE. You will be looked down upon due to this reason. I enjoy working at Google, it's a very team oriented company where you feel that you are all working for the same goal.  Everyone I have worked with has been exceptional! Great place to work at, lots of benefits, free food, gym, massage etc. Employee feel so relaxing to work at Google which is way too good for employee. it was a very productive experience for me. i got to interact with a lot of customers and employees on a very professional level. i learned a lot while using electronic devices as well to help assist us in our daily tasks. working for them was really nice and easy. very peaceful and friendly. Wish there were many more places like this one. As long as you do what your suppose to do as any other place your good! especially at Google Being a contractor at Google has it's downside for sure.  Management views you as disposable, you're not afforded the obvious benefits of full time employees and you can't remain at the company for longer than 2 years.  Google is a fast moving machine and I was afforded the opportunity to work on a huge variety of projects with a LOT of autonomy. Typical day of work - admin, emails, client service, team meeting, cross functional team work, best practice sharing, travel to client meetings, quarterly planningExcellent work culture Good management team Excellent perks and benefitsGood cross functional collaboration Great perks and benefits. Terrible people management.I never felt comfortable at Google. Everything you do is logged and closely monitored leaving the management team with the ability to use any negative performance metric against you for your performance review. Google certainly plays favorites. Management is incredibly flexible with work hours and starting/leaving time. Working from home happens often. Parking and commute can be a pain due to congested roads. Workplace is open environment, so it can get loud. Lots of interesting, challenging problems you're likely to never see anywhere else. Security has the benefit of having the support of upper management tiers, making it less cumbersome to get your work done. Friendly working environment, albeit the job itself can be very, very stressful if you're bad about work/life balance. Probably great place to work if you are not a contractor! As a contractor, your access is very restricted. Management style is ok, not mircor management. Communication is relaxed. Had a really good time at Google. One of the biggest perk for working here is there are always fun problems to solve. The amenities are great and the food awesome. Full time employees and contractors are two different kinds of people and are treated as such here. It made working here really stressful, difficult, and caused a lot of tension amongst our team. Google was an awesome job, I worked independent based on my assignment for the week.  Management was available if needed.  Traveled to various cities. My six-month stint at this location was workplace Heaven!...Free lunch (gourmet or ala-carte), employee lounges with games, scooter for travel in the massive office space.   The number of interviews just to consult were five or six in number (for employees - something like nine to eleven interviews). Poorly ran both from Google and Adecco.  Treated horribly by higher level Google management.  The simple but unfortunate reality is you're a number.  That's it.  Period. There are really great perks and you feel like you are part of a large company but I found that the full-time employees treat you differently. Like you are less. It makes it hard to feel like you are valued. Google is all about the bottom line and you feel it in the culture. It is a high-pressure company with a high expectation of results. They provide a lot but they expect a lot It was a temp job, I was always worried to lose my job the same day. I had to work I wouldn't tecommendand stayed focus for 10 hours straight if I wanted to keep my job. Although working at Google might be great, as a TVC you aren't a true employee and you truly feel it.Although I was promised a chance at conversion, it became painfully clear that there is less than 1% of a chance to convert in TVC roles. day should start with a good attitude ready to work and keep and a fast pace to hit a qoata and control scanning for a focused clean picture for online customers Googlers work hard and play hard.  If you fit in with your team and your work, you'll do fine.  Don't be afraid to ask questions; everyone feels lost at first. It was an experience and i learned a lot about leadership and creating a positive work environment. I got to manage 30-40 for the southeast region and travel all over and work for one of the biggest companies in the world. I loved it. And will miss it Supportive culture and nice people. Makes it fun to work there. Impactful projects. Good food. Depending on how high up your position is affects your work life balance. Coordinate events that took place in building.Managed fluid work environment for software engineers.Free Food!Hardest part about the job was staying busy because sometimes there really was nothing to do. I have never been comfortable with sitting around doing nothing.Management was great. Bad structure and poor management. Nothing ever makes any sense. They have lied about its compensation in the beginning and snese then the pay structure still doenst add up. Even though they mentioned in the interview that they were a family oriented company, it was not true. The perks are really only for the single Engineers. The carpool buses hour do not accommodate parents who have to pick kids up from school. Google appeals to all of the different types of learners and teammates. People are generally very accepting of different ideas and the innovative nature of the tech world drives us forward. If your political views aren't in agreement with management, you'll be treated badly.  They will not let up until you leave.  It's all about politics. Working at Google Express has been challenging and allowed me the opportunity to grow as a person and as a worker. I was privileged to work with an array of talented and driven individuals while providing an excellent service. Communications among the teams and levels of management was excellent and ongoing. The only unpleasant aspect of the job was that the volume was work could be inconsistent. Google is a fast paced company with many new projects, programs, and challenges popping up everyday. It can be difficult to keep up with the all of the changes and work/life balance is always an issue. Management is flexible and accommodating which makes dealing with the sheer volume of issues a bit easier. Learnt a lot, worked a lot harder than I imagined and it was fulfilling. The co-workers are who make your life so much easier. The technical expertise is tremendous. As a store operator, I drove my own car to a large chain store that Google was partnered with and stayed in a back stock room with the rest of the team. We would get specialized smartphones that received incoming shopping orders that we would then purchase from the store with a Google credit card, neatly package, and place them in a convenient location at the store and wait for the courier drivers to pick up the packages. Some days were busy all day, some days only had one or two orders. The people who worked alongside me were great people. Very friendly and fun to work with, The manager took her job a little too seriously, and didn't interact with the rest of us unless it was to give orders or tell us we did something wrong. The hardest part of the job was finding some of the items, as stores like Target or Toys-R-Us have huge amounts of products. The most enjoyable part of the job was having fun with your co-workers and making work into something of a game or competition that would give us motivation, increase our productivity, and keep our spirits up. Worked on quality control of scanned documents using a computer programs through google. Not much supervision, quick turnover requested, didn't listen to employees, supervisor listened to music all day and didn't assist colleagues Loved my position. However, the project wasn't forever. Great place to work with great people. Super fast paced work day. So many cool projects to be apart of. There really is, Not a Typical Day.  It's always changing, and it keeps you on your toes.  Very exciting and collaborative.  I learned that the Google culture is very inviting and collaborative, which was a huge change from my previous places of employment.  My Peers actually invited my ideas and respected my knowledge.My Managers were top notch.  I could not ask for better.The Culture at at Google is Great.  Lots of diversity, a very lean dress code, and you can bring your dog to work with you if you wish.  Bow Wow.The hardest part of my job was leaving, after being such an integral person of the development of the Operations Dept. of the Carolina's.The most enjoyable part of my job, was seeing success.  The contracts taking hold and being executed.  The Network being built, accepted and customers signing up.  To be point blank, Watching Growth that I had been personally responsible for.  To be a part of a start up, in the already saturated Telco and ISP industry, making waves with the incumbents and making history at the same time.  This is definitely a part of telecom history that will never be forgotten, and I am very proud to have been a part of that. I loved how fun and easy it was. Everything was made very simple and the work load was beyond a breeze. I loved working with the children and the team of coworkers. Fun Place To Work and Learn in small teams. Great food and great preks. Flexible work hours and holidays Good benefits including massages at work. Good job stability. working in Goggle is very secretive company not to expose they product once the project finished they let you go.  I enjoy working in  even in short time. The people are smart and they care about each other. But, sometimes I wished the company did not put so much emphasis just in coders vs other employees. Good place to work for, People are very helpful. I loved working for the company. Very competitive, embrace all different culture of different world. food is good and free. Driving a Google Map Street car was a great experience. Would be great if a full time position but the positions are seasonal. Great tech support and managerial support for any issues that arose. Googlers work hard and play hard.  If you fit in with your team and your work, you'll do fine.  Don't be afraid to ask questions; everyone feels lost at first. open culture, big company with some bureaucracy, business roles usually revolve around ads, perks are great (food, massages, work space), usually only hire for functions you have experience in, internal mobility is possible around 1-2 years. Choose management that are creative, yet responsible. So many of my managers were fun and creative, yet immature. Either that, or they were too strict/ bossy with little creativity, and it makes a huge difference for the sales associates. Great place to start out. They train you for everything you need to know. Good free food everyday. Nice break rooms with lots to do, and a one year contact that can turn into a second year one as long as your a good employee. Company is full of know it alls that know nothing. Like working in a high school cliche situation. If you are friends then you advance. If you have a brain you are shamed. As a consultant it is a very Strange culture.  Often overwhelming feeling  of being 'on the outside, looking in' and treatment of contractors is very different than other companies.  They try very hard to keep them separate from the employee culture (putting them in their own areas or not integrating them with employees etc)  Google has a pool of great brains, graduated from best universities.  However their lacking in expertise in the field they are employed leaves them miles behind other tech companies in finding a solution or curing the 'bleeding' - so back office operations are very primitive, and use of BPO's high.  Still very manual considering they are a tech giant.Company needs more diversity in seasoned and experienced employees.  People are reclusive here, like there is no other world outside of the company, and entitlement is prevalent.Benefits culture is good, with free food and activities, however teams still lack cohesion - the kind that other companies have mastered.  It seems all the perks won't build a great team, unless you have a good manager that has people skills.  Which is something that is lacking here.  Overall, they have good pay, and good work life balance, since no one really is burning the midnight oil here. Great place to work on a lot of new technologies, challenging projects in a dynamic environment, work with talented, friendly co-workers and plenty of fun events and activities. This position allows you to travel and have more interests but each project might terminate unexpectedly.Still, this is a great experience in Marketing, SEM and general web development. Remarkable company with incredible transparency from leadership. Exciting to be involved with so many cutting edge products and working with very talented people. Supportive, collaborative, fast paced company with a lot of exciting products and projects in the pipeline. A great place to work and always surrounded by intelligent people. There is something about working for a big name like google and what it could do for you in your future. There weren't too many cons if any, I had nothing but great experiences and met great people. I never worked for this company so I do not have an opinion about the working conditions. Google seems to be a very progressive company and will likely continue to thrive. A quickly moving machine that uses a tight knit team to accomplish daily goals simple or burdening. The growth and development of the culture offered at Google Express was par none. Google is a phenomenal place to work, there is no doubt about it. The management is nothing but supportive, but due to the caliber of folks they bring on for non-mangement roles, be ready to compete as a small fish in a big pond. Google shopping express was a great job. I enjoyed it. The customers were very friendly, I use gps the guide my driver to our destinations. I would refer a friend to work there I would work at Google forever if I could. A typical day at work is fun and full of challenges. I learn a lot about what a positive culture looks like. Working at google is wonderful. I enjoy working at here and want to stay longer if I can. There are enough parking spots. Also, I can join free gym classes. I had the chance to help build out a feature for an Android application, and I found the team structures and the overall atmosphere to be very positive for my internship. Love this job and benefits. Management is great. I would recommed this job to anyone. Its easy and fun. Its a great start to a career. I am blessed to have great job. rebuilt motherboards and also put and adjust chips for every computers we made or had rebuilt, fast paced, also had to rebuilt or take apart system units for desktop computers and change or replace chips. •	Follow established reliability test procedures and perform various environmental and mechanical reliability testing, photography of failures for documentation, and report generation. •	Set up and run test equipment (Environmental Chambers, UV Chamber, Thermal Cycling Chamber)•	Perform Chemical test, Drop test with high speed camera tumble test II Heina’s, RCA Abrasion test, Auto force test, Force gauge test (Nidec Shimpo FGV-200xy), Cross hatch test, Engagement cycle test.•	Record, analyze, and report test results using spreadsheets and charts. •	Update/upload the firmware•	Build fixtures to set up the units for final testing•	Maintain and operate the 3D printer•	Perform soldering of small component (0402 or smaller) under microscope. Googlers work hard and play hard.  If you fit in with your team and your work, you'll do fine.  Don't be afraid to ask questions; everyone feels lost at first. in this job i was a mentor to high school students in where they learned to create basic HTML code with CSS code, in the end of the courses the student had functioning web pages with Java scripts. While I was working at google, 19 members of my team were laid off to be replaced by working in the Philippines. Clearly contractors are not valued and neither is good work. A typical day would involve greeting new employees and demonstrating the most effective way to execute standard operating procedures. Great place! Team-oriented environment! Great company with great benefits.  Will challenge you to learn a new and productive skill as well as understand how hard you can push yourself to do good work . Team atmosphere that I really enjoyed . I enjoyed working with SMX and google express was fun. Every day was a different day and I had lot of fun helping training people. I also liked our meeting and working with everyone was cool. Provides flexible working hours to spend time with family, as well as Summer Fridays. The salary is good too, but the health benefits could be better. Great place to work at as a contractor, even better if you're fulltime. There's game room, yoga balls/mats, shower rooms, etc. Meals are provided which is nice. Google takes care of their employees, too bad for contractors, the work is only for a limited duration. As a contractor you don't reap full compensation and benefits as full-time, but you work with amazing people and enjoy considerate work life balance. Opportunities to network and explore within the company are present. Great place to have a family but if you are ambitious...it is  not the right company. It is very difficult to be promoted because it it very corporative Let me start by saying Google has been good to me, even though I am a contractor. I've met many wonderful people and you certainly can't argue with the perks. If I were a fullitme employee I'm almost certain I'd be writing a stellar review, but as a contractor espite all the wonderful benefits and exciting work environment it is simply hard to shake the feeling of being undervalued. It varries from team to team, but unless your team has a high budget and less need (which is never the case) your wage is going to be just enough to live off of. The freedom to stay late and work overtime is sometimes given, and ultimately that is what one must do to even have a shot at a full time role. I have seen several good friends simply leave however once they were able to get the Google name on their resume and it is hard not to notice that one's talents are in demand and more valued elsewhere. I hope that the internal machinery of the company will catch up to the problem of top talen leaving the company, but I recognize there are resource constraints. Overall I have enjoyed working at Google and there is certainly nothing I'd rate as negative in terms of company culture. management was terrible. they cared not for the individual and only numbers. sales sales sales. try selling Chromebooks like apple and Microsoft computers. try and hit these crazy high numbers that are unattainable for the market you are in. over a terrible experience. Temporary type of job, not long term. The company was pretty new so there where lots of differnt types of changes, some that I liked and others that I did not. Lots of peope came in and out of the job. The day Starts With lots of emailsService starts its crazy busy and Customer's want customized food vegan gluten free E.T.C... They want it now.lots of inexperienced hourly employe's and no time to train them. meeting's.so on and another service with no break in service. The Great things are paid holiday's PTO and Weekends off I felt welcomed as a tech Writer by a very technical group of engineers . The manager was hilarious and juggled to reduce the team's stress . It was a great contract. Relaxed and fun culture, diverse projects with opportunity to explore new opportunities. Feels like a family, rather than being just another employee number in a larger corporation. A productive and educational place to work, great team I had the pleasure to be part of. they make you feel that you are part of something good. the best of my day is to wake up and go to work -  (Typical day)Fun and energetic.- (I've learned) That culture is vital to success in this industry-  (Other than the utmost best technology (Proven) the most thing is your team mates and the ability to lead with  complete autonomy. - Google is a great company, super clever people, great working environment, extensive career growth opportunities. Google is a great place to work if you're here full-time. As a contractor there is way too much work instability. Sometimes you're lucky to find great managers who are willing to sponsor you for a full time role. Other times, the management you're working with only sees you as a means to a result and you're left with just the name on your resume, looking for another job outside of Google. Loved my role here as a broadband tech. Great people great training just overall great experience. The fiber project loss alot of steam and techs were laid off. But i love google Googlers work hard and play hard.  If you fit in with your team and your work, you'll do fine.  Don't be afraid to ask questions; everyone feels lost at first. 'Google was not a start-up environment by the time I left. The same office politics. It was easy to get promoted if you worked on the right projects and projected your work in the right way.' Working here was fun depending on who I was working with. If given the opportunity I would definitely work here again. Their point system sucks....... Top 12 things I like Work cultureTechnologySalaryGooglinessInnovationGrowthTeamsStabilityNew Ideas GroupsMeetings with purpose, action item and goal Global Securing data.Good Management.Rich in culture.Good food.Loved mostly being able to be around friendly people who wanted to help everyone succeed in what they do. Productive workplace fast always busy. Need to finish orders in a timely order. It was like shopping for a customer making sure you had all orders complete and correct. You where timed on how fast you shop pack and ship all the items and how many mistakes you had I can say that it was a true blessing to work there for the short time that I did as an intern. Although sometimes it felt like I couldn't keep up (due to change in policy locking me out of essential documentation) I still greatly enjoyed doing my job. The people were friendly, compassionate and very hard workers. Not everything is rainbows however. The job culture is on the cutting edge of the progressive left ideology and the office was cluttered with pride propaganda and other sorts of images, not really caring if it made others uncomfortable or not. This job keeps you on your toes and laughs in your belly! Typically a day of work involved meeting deadlines selected by customers and keeping up communication between store managers and leads. Fun times Great company and benefits that makes it a priority to provide a comfortable work environment.  There are many perks and great benefits that create incentives to be a part of the company long term. Working in Same Day Delivery/Google Express was a nightmare. Employees and Managers were too rowdy, Too much independent work for 1 person, Not enough lunch breaks & the payroll will cut weekly pay most of the time. Very helpful. Options to grow. I learned how to create my brand and expand my media services with the knowledge and help of amazing co workers. Highly recommended. Working for Vaco was my first real job out of college. They recruited me two months after I graduated and I wasn't going to pass up on an opportunity to to work for Google. Been here for 3 years and its been a wonderful 3 years. The people, culture, and experience was like no other and I wouldn't have traded my experience for anything. Looking forward to taking what I've learned here to the next step and put myself on the job market again. Awesome love. Need curriculum and study material. Great lovely people and free foods served. Awesome name and great snacks and break rooms. Always cared for Best Search Engine in the world , Always help me a lot  . i learn a lot from google  . It also manage each websites & webpages  in a proper way that make my work easy . I contracted at Google for a year and it was a great experience. I learned a lot, had great colleagues, great perks (especially food). I will definitely recommend it to all my friends. 5 Stars. My position requires 100% travel time. You will travel the country collecting images for Google Maps, paid hotels, food expense account and the opportunity to work with growing companies nationwide. A typical day is summed up by saying; its cool place to work, the Google busses help with the commute, and the free food helps you focus on doing your job, but don't expect this to become your permanent gig unless you are extremely bent on becoming a Google Employee.Management is spotty, sometimes you'll get what your asking/looking for, sometimes you wont.Teams change frequently and so does your job description. A decent place to acquire skills, but not a easy place to develop those skills. The job is good its a contracted job so it only lasts 2 yrs, its fast paced at times and really slow at times..ice learned a lot about time management and how to multitask better...It also helps me be a better self starter..make crucial time decisions and listen. Excellent company, very smart people, many resources to do our jobs. Excellent food, beautiful campus, great environment, everybody is happy and proud working for Google. The system picked up Google thinking I worked for google but I didn't. I worked at a marketing company that used Google My Business. Just for the record. Google is a great company to work at for contractors. You get to work with some of the most talented people in the industry on some cool projects. Contractors get to enjoy most of the perks as well. Googlers work hard and play hard.  If you fit in with your team and your work, you'll do fine.  Don't be afraid to ask questions; everyone feels lost at first. Best place I have ever worked for having a fun and productive work day. Great attitudes, great collaboration, and most importantly everyone has a great work ethic. I started as a dishwasher got promoted to and porter and then a Reciever there's a lot of room for growth. As a Reciever I check all food that comes into the building for my floor by temping and making sure it's 40 or below. Check to make sure the quality looks good. Typical day at work:Come in, log into system, get right to work gathering products to fulfill customer orders. Help coworkers with hard-to-find items or missing/damaged items. What I learned:Work as hard as I can, always be ready to assist the team, keep open communication with management. Don't let any of them abuse their position to make your job harder than it should be.Management:The two direct supervisors I worked closest with during my time at Google Express were both very easy-going and hands-off. As long as I got my work done and kept an open line of communication to assist with any complications that might come up, they just left me to my work. Now the other managers and district managers were an entirely different story. They were entirely unwilling to help with anything--whether it be scheduling, points on our records, or just being generally civil, they consistently talked down to and looked down on us.  They would ask for our input on streamlining parts of the work process, and proceed not to listen to any of our ideas, until parts of the work programs malfunctioned, or our order queue skyrocketed for weeks at a time.Workplace culture:Aside from the aforementioned management problems, coworkers were, for the most part, easy to get along with, and reliable to work with.  However, as is the case in most work environments, there were a handful of extremely lazy people. This would not be a problem if it weren't for the fact that the team as a whole works towards fulfilling a total quota for the day.  Laziness or carelessness in certain parts of the  workflow would slow the entire process down. And not only were these people lazy, but often vocally offensive. And upper management, once again, did nothing to rectify these issues most of the time. Great certification to get if you work with Google Suite. The tests are long and require some concentration, but overall do a good job of evaluating who is a good google certified teacher A typical day at work would be looking at tasks and analyzing them and assigning them to particular resources. Meet with users for gathering requirements and create BRDs. I learnt a lot while I was at Google of how to manage individual and team resources. Great place to work. Tons of amazing things to do and see. Work can be demanding. In many ways it feels and act like a start up. Great experience working here It was great! I got to travel. I worked with amazing people and most importantly I got to work on good things for the community. It was a contract position. Hopefully the opportunity opens up again! During my time at Google I have learned how to use new software that is exclusive to that company. I have received a fair workload, I normally prepare daily and weekly reports about the business unit I work for.I have not received much guidance or coaching and it has been complicated for me to understand the culture, in the sense that contractors have access to limited information.It has been difficult for me to interpret some information, since there is no full disclosure towards contractors.People are respectful and polite at all times Google is a company that trust their employee and they provide extremely kind and convenient environment for their worker. However, this kind of environment sometime does not give their worker enough challenge compared to the startup companies. The job itself is fine, but the upper management don't necessarily appreciate their employees. They don't replace workers after turnover so work just builds on existing staff. I was a YouTube partner getting compensated for monetizing my videos. For any YouTube partner, you can make you own hours. you get into it what you put out of it. There is a good degree of luck involved in the popularity of your videos. a typical day would be thursday-sunday 11:30-pm. not too bad.  I learned who to work in tandem with different representatives as well as different types of people. MY regional manager was amazing, she went above and beyond.  The most enjoyable part of my job was getting to know everyone on the team and learning about these new products. The Google CS with android provided students with wonderful experience of working with peers to learn android development. It was a great learning opportunity under the supervision of Google's software engineers. Working with highly intelligent and creative peopleEvery day I takes advantage of my opportunity and tries to learn something new from his co-workers. Google lives up to its reputation and even over delivers.  They have found a way to balance fun and work, which keeps stress levels low, allowing employees to feel comfortable and exceed the kind of work you might find in a micro-managed environment Working as a contractor at Google, the demands were high and the pay was mediocre.  They did have free food which was nice.  I made about half of what the non-contractors were making.  Maybe less. working with many people that form from different places, and different cultures. The hardest part of the job was when we had to deal with some mean managers. Great place to work. I've had the pleasure of meeting smart minds from all walks of life while working on projects that potentially will have a huge impact for the future. Google is rife with corporate politics.  It's truly sad and disgusting that people with Napoleon complex are allowed and enabled to make other people's lives miserable simply because their managers are sick and twisted.  Google is very bad about exiting these types of people.  It's a true shame. Work to live, not live to work. Great people. Great culture.  Google is a great company to work for.  Everyone is very inviting and willing to help you learn and advance with your personal skill sets. Googlers work hard and play hard.  If you fit in with your team and your work, you'll do fine.  Don't be afraid to ask questions; everyone feels lost at first. best job i ever had.but,  they fired me for tearing my ACL because i missed work. i even had a doctors note too. workplace culture was great though. lots of friendly people with great work ethic! It's a fun place to work with a lot of young excited people wanting to drink from the Google kool-aid if you will. The problem is the contractor vs Full Time Employee (FTE) discrimination. As a contractor, I was over worked with little to no recognition and the management takes credit for all the work the contractors do. i was holding the title of google sales manager and working in best buy as a google representative. a third party vendor prs(premium retail service)........................................................................... I worked as a Contractor at Google and the experience was not good at all. Management discriminate Contractors you feel like a second class citizen. I do not recommend  to anybody to work as a contractor. This was in 2006, they may have changed since then. Very poor vision from management (at least the ones I saw) for the bad treatment of contractors. Lots of freedom and flexibility. Workplace culture is excellent. Everyone help each other out. When you want to take a break, you can go nap or play ping pong or volleyball or go to the gym, etc. I love being at this place and helping people that needed my help. It felt good to see people leave with smiles on there faces. This made my job fun. I had fun. I was a TVC (Temp) for 2 years, which is the max.  I was amazed at what benefits I got for not being an employee. The culture is unmatched by any company I have worked for. My team hours were crazy 7am-5pm, but wasn't an employee.If you become an employee you are set for life, which was my goal. I couldn't attend company events, get extra perks, and I constantly went above and beyond to prove to my boss and team I could be hired as an employee, which never happened in the end. I was promised 4x in 2 years I would be converted.Everyday I'm trying so hard to be a Googler again! The most amazing workplace ever.  Great food, workout room, laundry facilities, arcades, unlimited food and snacks.  Great people, a truly unique work experience. Adecco doesn't look out for their employees. They don't treat their employees good. They don't care if you do a good job, but if you make one mistake they give you a warning. Great Benefits, Work life balance is good. Lots of opportunity to work on different projects with different teams of people.  Great advancement potential. •	Conducted market research in South Florida by analyzing zip codes and demographics.•	Provided first hand reviews of restaurants, shopping, activities, and events. Reviewed functional specifications with business analyst	Developed test cases as per the functional specification  requirements	Reviewed test plan and test cases with developers	Executed the test cases and document results Worked for Google through ITC service group. Working with google products was really innovating.Install fiber-optic service in residential and commercial settings, set up customers wifi systems and also television service. Preform neat and clean installation, fill out and complete all paper work via company data base. Preform all tests to assure installation was complete and functional. At my position with Google Express I managed a team to fulfill  customers online orders to assure their delivery in a timely manner by picking, paying , packing  and problem solving. Google is truly amazing - like any job it has its pain points and it can be difficult to not feel lost at times in such a large company but the people are spectacular and provide an incredibly motivating atmosphere. One of the best companies out there. Although I was there a short period of time, I feel I advanced my knowledge in  my field tremendously. Everyone was friendly and willing to help. My mind was constantly being challenged and continuously looking to learn, grow, and take in all I could in a fast paste environment. Recommend for anyone that wants to see a fully functional company that regards its employees as family.  It was only a contract job, but well worth all the travel and greeting of people to do the job I was tasked.  Would do the job again if it was offered. You know it's a great place to work when people voluntarily return to stay at the office until 9pm every day. People love Google so they put in 100% effort into doing their best. The hardest part would have been standing on my feet with my 2 inch heels on. I learned really quick to get comfortable shoes that I could wear 10 hrs out of the day. Working for Google was an amazing experience. The environment was very relaxed, friendly and fun. The environment there felt more like a summer camp than an office. They definitely know how to take care of their people. Googlers work hard and play hard.  If you fit in with your team and your work, you'll do fine.  Don't be afraid to ask questions; everyone feels lost at first. I love the workplace culture there are many convenient provided such as drink, snack, lunch. So far I learn many things new to work at Google. It's a big company which I dream to work. I wish one day I will get a permanent to job at here. google express is a very good work environment. the only thing  is communication is strictly thru email. so if you aren't a frequent emailing type of person. this company Is for you . the way you process changes frequently so if you can adapt to change quicly this is the job for u Training employees and the public on Google product was as fun as it gets.I loved the satisfaction on ones face when they realize how the product worked. Este trabajo me ha ayudado a expandir me vocabulario en Ingles y en Español. Las traducciones me hacían cuestionar y aprender muchas cosas en los dos idiomas. This position is incredibly simple, it's essentially shopping... Well, it is shopping. The caveat comes in when you consider just how many bosses you have to answer to regularly and all of the bureaucracy involved in having a single thing approved. Working for one of the lead search engines, my engagement at this organization was limited to remote work. It was exciting to see the tools which were utilized to assess the technology in the early stages of the company's life. The typical job was filing paperwork, reviewing the daily deliveries and ensuring all goals were met. It was a good first job for my first one out of school. It was amazing to work there. Pleasant lifestyle and excellent work life balance. Handsome perks and stipends and opportunity to work for some real life projects Working in the warehouse was fast paced because your trying to fill customers orders by locating each item in the warehouse. It demand that you come to work ready to move around looking for items, and with another associate working together to take care of the customer. Most money I ever made through a job, weekly. I found working at Google to be very challenging and rewarding. It wasn't perfect, but the pros outweighed the cons. I appreciated working with a stellar group of people from wide-ranging backgrounds. Google's dedication to users and scientific principles helped changed the way I do my job significantly. If you are ambitious I highly recommend it. I found it both hard and fun. I have no complaints about Google. It lives up to the hype. The benefits are like no other I've had at any other company. Free Food, great healthcare, awesome environment, etc. Google by far has the best benefits if you are a perm employee.  They hire a lot a contractors to do the grunt work and hire college grads to manage people who has no experience doing it.  This makes it very uncomfortable for everyone.  Professionalism is lacking by the college grades which is expected since they are managing people when they had no prior work experience doing it.  They give you a lot of perks but it comes with a price.  But overall, the benefits are great so I can't complain to much.  =) Drove from SF to Mountain View, 1.5 hours each way, to avoid travel sickness on the shuttle (which costs $1.50 for contractors). Lots of free food everywhere and lots of nice places to hang out outdoors or in a cafe or in a nook. Generally quiet atmosphere indoors. Everyone looks happy. Very casual and diverse. Benefits were good and it felt nice to say, 'I work for Google.' But outside of that, I didn't really like my time there. The problem was mainly management. I had a good manager at first, but as per usual, that changed and I had to deal with the team lead directly. We didn't get along too well, so I only worked there a year and I'm not really sure what I have to show for it. Excellent company. the best in the industry. I have learned many new things during this period, very fun and enjoyable and management  and employees are very kind. I worked at Google as a contract employee for 18 months. The work environment is fantastic, the benefits (free food and drink) are unbelievable, you get to work with some of the smartest people on the planet. its a blessing to wake up and enjoy working for Google. benefits are amazing and the Google culture is wonderful. you feel at home working and its also like a second home with all the different things you can do. *When taking a contract position, you are hired as a second class citizen and will be treated as such. This is a way for Google to avoid headcount issues and still get people to do the work.*Contract workers work more than the FTE employees without the benefits. *The Google performance reviews are a popularity contest. Yes, the culture at Google is googley!  Great place to work, and in today's environment, it's the ideal place to work.  There is nothing to rant about expect that hopefully Google will keep growing so that others may have an opportunity to work here. Great benefits, great pay, incredibly smart coworkers, but lacking in direction. Many similar products overlapping, no clear focus. Great opportunities for movement and/or advancement. Googlers work hard and play hard.  If you fit in with your team and your work, you'll do fine.  Don't be afraid to ask questions; everyone feels lost at first. The company attracts top talent and truly the possibilities are endless. The highering process is a nightmare and costs them talent. Employees review each other, which is great, until you have no one to review you bc temps/contract workers aren't allowed to participate in the reviews, and yet over half the workforce seems to be a temp or contract worker. When going through the hiring process you may be asked to interview up to five times with 5 different interviewers, or not at all. It's inconsistent. You must be approved by a hiring committee, most of whom you've never met and who may not fully understand your job role. They will hired more than 100 employees during holidays for permanent positions but after the holidays they will only give you 8 hours a week not worth it. The people who worked with me were all amazing, the only thing is that there was no real job security and no benefits. They keep changing their processes so as soon as you get used to something they seem to change it for the sake of change. there really isn't anything bad i can say about working here. I loved every minute. The only bad part is the promotion process. It's not very good or does it go off the best qualified and hardest working. Very fast moving environment where you are surrounded by fabulous, smart people. Great location to work, free lunches, loads of activities to try and lots of perks. Google shopping express was an interesting more independent job then I assumed. I was hired through temp agency but had most access to Google home campus and was welcomed like any other. I had to drive to different various locations throughout a couple cities around me but at the time the pay was very well worth it. A great place to work in one of the most innovative companies in the world!!! All 5 starts to work place and culture, working with very talented people from all over the globe! Engineers get a chance to work on any product based on their interests. Great benefits(free food, shuttle for work). Engineering driven culture makes it the best place to work. Productive and fun workplace with ping pong tableTypical day includes coding and literature learning/readinggood managementspecial culturelearning, coding Confidential and several NDA's signed. It was an excellent opportunity and I learned an incredible amount of information in the mapping and engineering department. I look forward to learning more in my next opportunity, This program is an initiative to teach elementary school students with basic robotics and programming tutorials. This includes teaching with toys and basic robots. Enjoyed my time at Google. I'd love to come back some day!The benefits are very well known and I was able to set my own hours and I felt like I had the support of my managers at all times. Was awful. Lot of bigshots playing pretend and acting as if the company were god. Always low pay, horrible hours, overworked, and bad management, would not recommend to anyone worth their salt as a coder. I worked on the Google Express project during its initial inception in the East Coast cities such as DC, Boston, NY and Chicago. While on the project I was stationed in the brand new Google office in Pittsburgh. I loved it. The culture is fun, the company is flexible and cool. Most importantly the people are smart and a joy to work with. I love working for google! The environment and atmosphere is completely non-comparison to any place that I have worked at before. If you ever get that chance to work for this company, do it! Beyond (at Google) was a great home for me for the year I was there. Wonderful people, great benefits, and respect for work, life balance. Management was the best I'd ever worked with. Google is an outstanding place to grow in your career. I was lucky enough to have the opportunity to work on the Ugrad team as well as Google Brain. Management is very hands off- but helpful; allowing recruiters to learn quickly without feeling micromanaged.If it were not for my contract ending, I would forever stay with this team. I was in charge of assisting customers with their online businesses, marketing, and visibility. Extremely customer service oriented. I was on a sales team responsible for finding, vetting, and reaching out to new sales leads to grow our business. The workday is nice and simple once you get the hang of it. Most people are really nice. The work was never too stressful unless deadlines were coming up. Lo mas importante en un trabajo, es el rol te levantas tempano para llegar a la empresa si dificultad, aprendí relacionarme con los compañeros, y conocer el ambiente, l Googlers work hard and play hard.  If you fit in with your team and your work, you'll do fine.  Don't be afraid to ask questions; everyone feels lost at first. One of the most understanding companies I've had the pleasure of being a part of. It allowed me to be myself while learn how to work within a group to reach the same goal. Google was a very good place to work the best place I ever worked out. They treated you like you were part of the company and not just some worker. There is no micro management and everyone is very nice. - A typical day would would be to start by checking in to my work station by logging on to phone. answer calls to support fiber install techs in there needs. analyze calls (call volumes & reasons for calls) to sreamline and understand call flow. -I learned more more inquisitive tech support questions-managed dashboards to display findings on call volume and reason break. use this data to create call flow trouble shooting needs and streamline call response time-job culture is creative, fair, non-restrictive or judge mental-job is not difficult, some areas are tedious-most enjoyable par for me is data analysis I worked with customers of Google Earth Enterprise servers, provided training for ingest and operations, and lobbied customer requirements with the development team. I supported pre-sales customer briefings, and explored global super overlays and surveillance video overlays. Working here is ok, the benefits like 'free' food or the MK staff, who are fantastic. However, be assured you run the risk of becoming so sucked into this Google world that you forget what it was like to be on the outside. Some Googlers become over-privileged and some are great people. The company is huge now and feels as such. working here had its ups and downs but overall, the time i put in was not bad at all. i got to learn a new things and met amazing people along the way. As far as management goes i dont want to speak to much of them seeing as i have nothing nice to say, but i will say communication with your employees should always be key when running a business google securityNice coworkers. Nice people. free food. fun company parties. a lot of standing mostly relaxed low-risk job good pay good benefits Excellent company to work for. Feedback driven environment. Very young company (majority of colleagues in their twenties). California is where the bulk of opportunities are. Management genuinely cares about the advancement of it's employees. Free lunches and open PTO make it for a excellent place of employment. Salary is quite cool though. Management genuinely cares about the advancement of it's employees. Free lunches and open PTO make it for a excellent place of employment. Salary is quitecool though Google Customer Service representative for customer needs in Google.com network and technical issues and made certain troubleshooting for customers. I google is the best company that I worked, and I had nice days in there. google is a very fun place and I could work with professional peoples. It's so good for me that want to get self-development and a great resume. Google fiber is an amazing place to work.  While working at Google Fiber they provided breakfasts, lunches, snacks and drinks, this helped to maintain a healthy lifestyle.  Additionally, there was access to a gym for work outs. Google will provide you an opportunity to work with some of the brightest in the industry. They also foster an inclusive work space and encourage everyone to have their voice heard. Google great company....Adecco not so much a good company. Work/ Life balance is not the best, adecco could treat its employees a little better and not as robots. Lots of perks, great pay but designed to keep you working 24/7.   The culture varies by department.  If you are lucky enough to get a great boss, you will be happy as can be. Very different and startup like environment with very talented people. Learned a lot with respect to open source technology. Free lunches were definitely a bonus. Learnt a grate deal of work here. Enhancement to my career and goals. Involved with best skilled work force.  Enjoyed being mentored with best management and engineering people. I spent my time at Google coxing their corporate rowing team. Everyone was fantastically nice and motivated. I haven't spent much time physically at the Pittsburgh branch, but I believe it adheres to Google's work model fairly well. It was great to work with other individuals and problem solve and issues we were having. The best part was just seeing the smile of a satisfied customer once the issue was resolved. Googlers work hard and play hard.  If you fit in with your team and your work, you'll do fine.  Don't be afraid to ask questions; everyone feels lost at first. Management is very unorganized with no potential for growth. Co-workers are nice generally. Processes change almost weekly, but it's nothing too bad. The job is fairly easy overall. This job was a great opportunity. Never seen my boss everything was via email and google hangouts. Training was quick and very understanding. Staff was equal and fun. Been a contractor here for 4 years.  It's been a great 4 years.  Learned a lot and work culture is phenomenal.  Even though this is a great place to work there comes a time when one needs to move on to pursue additional work experience and to see what else is out there in the world. Pros:Great place to work for entry level cooks. Casual and trendy food program. Good perks and pay.Cons: Skill refinement limited. Not ideal for cooks looking for fine dining experience. Strict sanitation and food safety practices. A typical day at work was great, great hours and always overtime when needed. The work wasn't hard but always keep you movie and busy with something to do. I worked from 7:30am to 4pm to avoid a traffic time. I learned a lot of new things such as IOS and Android devices and how to test them. I had meeting with manager every day. Thus he had always been informed of what I was doing. Workplace culture is very nice because the company is very small. The job was not hard at all because everything was strait forward. The most enjoyable part of the job was meeting with new people from different countries. Fun workplace and safe environment although I was only a consultant. Employees were pleasant and easy to work with. I would definitely recommend employment to others. I enjoy working for google Express it's fast and really helps you get hands on training and helps learn more about the company. It makes me a better person because I love helping customers We as a team get to work in different stores and are able to provide different customer service to different kinds of customers. Since we get to work in different store they job is always exciting and everyday there is a new experience. Since I am a rover i move from store to store more often then most but its always nice to meet new people. loved woking there just didn't see a future in security. and the dive was to long for me to do anymore. would love to move closer but just can't afford it. Favortism for full time employees...great perksGoes out of way to show difference between contractors and full time employeesMeals are great, but there is also a huge workload with no care of work life balance I did some  event photoaraphy for google its a warm and fuzzy place i really like it .Great people made my job easy ,they mede it fun to work there and the food was awesome. Great place to learn and absorb the cutting edge. Free lunch, great spaces to thing creatively, and the people are the some of the smartest you'll ever get to know. Great place to work at. Loved every second of it and the people that work there really are some great minded individuals. Wish nothing but the most success to this company. Employees are fun to work with. Management isn't that great. Managers aren't as professional as they should be. A very physical job, the hardest part was lifting 50 pound boxes. This place was amazing. From the project of self driving cars to the culture they promoted. The work environment was clean and organized, all amenities were provided and the atmosphere was welcoming. As a TVC you are not treated differently than a googler and are pushed to succeed and earn a place as a permanent employee though it is not a guarantee. You have to work extremly hard and you accomplish great things. I only left because of my health and the need for benefits. I will save all the world, becouse Im superman. Im very stronger, i have a big power. I am very kind, sympathetic, cool, creative, energetic,communicative You are given complete autonomy as long as you can deliver on your OKRs. Perks are the best in industry. You also have all the tools given to you (internal courses and mentors) if you want to learn some new stuff or experiment You write code that goes into production ( The product I worked on ended up getting used by internal sales team ). Large-scale events for interns like a 4 hour cruise in SF Bay. I learnt more about on line advertising, how the people focus their attention and interest on specific messages. Google was the client I worked for even though I was not directly hired by them. Googlers work hard and play hard.  If you fit in with your team and your work, you'll do fine.  Don't be afraid to ask questions; everyone feels lost at first. It was a fair and ok job to have. the culture is nice the job was very doable. It paid well .Not very much room for growth but you do what you can. It was a pleasent experience. Tout etait bien, l'équipe, l'environnement, les projets, le cadre de vie, les transport depuis san francisco. Rien a redire sur l'experience. Compensation is low relative to market value but everything else is beyond comparison.  Love the ability to give back to the community and to make a difference. I worked under google for a few short months but they had great benefits for us. Too bad they bought us out and decided not to keep us to continue to work for them Being a TVC is financially rewarding but that is about it.  If you are used to and want feedback and guidance this is not the job for you. very wonderful place to work. learnt how to do the job with a team work and professional skills , how to maintain and represent a team, the workplace is very secured. Cooking for the people at Google on a daily basis was awesome.they are all so kind and fun to be around, I got invited to wedding's and other personal event's of there's. there is virtually no human interaction even though there are about 25 people in our department. Can't talk at all, must meet accuracy and productivity numbers of 97.5%, and when break or lunchtime come, everyone runs outside (no phones allowed in the building) to use their phones. Few stay for the 2-year assignment. I am not a young person so maybe those 25 years old would be ok. They seem to like the free snacks and cereal A Fantastic group to work with.  Even though separated by half of the country, the Digital Strata team treated employees with respect and expressed expectations for personal growth. Google is amazing. Great work. Great Google managers - super intelligent and know what they want.Google actually is the best place to work at - allows one to 'work' without any other issues. I was contracted on a project at Google by Adecco.  I was a remote worker and travelled 75% of the time.  Its only a two year contract so it doesn't leave a lot of room to grow.  The project I was under seemed very disorganized and not at a level I would have expected from a company like Google.  This may be due to the fact that many of the moving parts are contracted but I witnessed a lot of issues due to poor communication and management.  I enjoyed my time there for the most part.  The job was very basic and monotonous but the pay was decent plus extras. Great place to learn and grow as  a professional. Facilities are very accommodating and the resources available create a very productive and healthy work place experience. If you're a software engineer, you're among the kings of the hill at Google. It's an engineer-driven company without a doubt (that *is* changing, but it's still very engineer-focused).The perks are amazing. Yes, free breakfast, lunch, an dinner every weekday. Aaaaaamazing holiday parties (at Waldorf Astoria, NY Public Library, MoMA, etc.); overnight ski trips to Vermont; overnight nature trips to the Poconos … Working in a fast paced work environment that constantly keeps you on your toes and having to adapt to constant changes within the company and Google ecosystem. A good place to work if you are an overachiever and a self starter. There is not a lot of training available so you need to find the way yourself. The company does support good employees and will help out if your project ends. Challenging, but boring every days work. I learned the courteous way of serving employees through valet parking. Pro Park company manages well with the customers' parking organization. I found Google employees are very courteous people. Valet parking is a tough job whenever there is a big company events. The best enjoyable part of the job of taking care of other people's car in the parking area is when they are satisfied and appreciated the services of valet parking and driving them from every buildings in the campus for free. I love Google's all-free food perks. A good job while getting through school. Contracted. No guarantee you will be rehired once contract is up. Good pay. Good hours. Steady schedule. Cool people working at google is a great and powerful experience, the skills you learn there will follow you the rest of your career. free food and countless perks, overall awesome place to work Smart, Energized Workforce; Lots going on. Agile environment...not much, if any analysis...just jump in the deep end and see if you live. I wish I had a second chance to come back and work for Google, Inc. It was the magical place to work and the people were extremely kind. My manager gave me an opportunity to train newly hired employees after I started there. Outstanding employees, as myself, would receive 'Awards' every month. I had a lot of respect as an employee with my boss and colleague. Googlers work hard and play hard.  If you fit in with your team and your work, you'll do fine.  Don't be afraid to ask questions; everyone feels lost at first. Always new challenges to work as the company is growing and there is a culture of doing things that are important to the company. Very fulfilling and challenging place to work. Tasks change daily, adaptability is a must. Enjoyable work culture, it's one big family. Work closely with a team and also independently. no type of management whatsoever, so you may be confused as to who to call your superior. pretty simple and straightforward. you can request help whenever you feel like a job is too hard. good workout because sometimes you have huge packages and deliveries that require a lot of muscle strength. if you finish your job early, you have a lot of downtime. Excellent place to work at but its very hard to advance. It's extremely competitive. This is coming from someone who loves competition. You learn a whole lot though which is always good thing! I'm Google Certified and manage a MCC account because my company is a Google Partner. Not sure why it looks as though I work for Google. It's a Japanese brand company Good work environment meet a lot of people good staff learn a lot about sneakers great party's good shift times located in Harlem NYC very cultured You get lot of freedom for work. You have flexible work  hours.Always provide a continous learning experience. Its a fun place to work. It is doubtful if there will be any workplace better than Google in a long time. Google takes care of her employees jealously, and creates an environment where the employees hhighest potentials are achieved. It's definitely a great place to work I love working for google the team I worked with was absolutely amazing. Along with that the work place felt like I was right at home. I would refer the company to anyone. Google is a terrific place to work.  The wok place culture is enjoyable with many different characters and personalities that fosters a diverse atmosphere to embrace. it was true they do feed you lunch and dinner and the management staff is phenomenally nice.  I wish this hadn't been just a seasonal job. Youtube give the best creative freedom to make original content while  helping a big community of viewers, there is a lot of new techniques that I learned from trying to be competitive to get more views. Working at Google was great. Everyone wants to work there and be apart of the organization. The job itself wasnt great and I would not recommend working with Telenetwork unless you love customer service roles. The work is extremely easy intellectually for I have learned the main primary SOP (standard operating procedures) but it is tiresome on the body after consecutively lifting bulks of items. I think the best part of this position is getting to see customers and communicating with them. A typical day at work was completing orders and shopping on the salesfloor. spent a lot of time traveling from store to store to help. hardest part of the job was trying to get time off from work and starting early. It was a great company who was the delivery service in a lot of people got what they needed without having to go to the store to buy it it was same day delivery some of the managers were a little racist but besides that it was a pretty good experience Spending around 7 hours in car. Need to learn different software programs before able to drive autonomous. The workplace culture is relaxed. Hardest part of the job is being in a car the only goes 25mph. A rewarding challenge every day.  There were many new ideas and views on how to tackle the challenges of building a fiber network.  I am glad I took on the challenge.  It helped me to grow professionally. Very fun to work here, the people are very nice and always get our work done but there was times we had fun. We were like a family and we would all eat together on our breaks. Downside is the contract that was limited to only 1 year then 6 months off then you could reapply. Watch the ticket queue and respond according to priority of the issues that were presented.management was off site and did not communicate much.Co-workers were friendly.Most enjoyable part of the job was the free food Googlers work hard and play hard.  If you fit in with your team and your work, you'll do fine.  Don't be afraid to ask questions; everyone feels lost at first. Get to your location, clock in and wait to be assigned your pick up by dispatch. Go pick from locations, Walmart, target etc. Then deliver according to time of delivery directed by dispatch. Technology is wonderful when it works and a productivity-sucking-piece-of-junk-headache when it doesn’tWhether it’s proactive network maintenance, virus protection or firewall services, WTC has you covered. If it wasn't for the incredible opportunity to go back to school at Harvard I would not have left, but I would have looked to transfer internally to a role that I could grow more in. My work experience is great, I love working here and the culture is wonderful.  I learned a lot working in this place, unfortunately this is a contract job. Not always the fun loving, awesome place you read about in media. Things have changed with size. Your career depends on your project and your team. Peer reviews and ratings are often gamed. Fun place to work. Good pay and befits. Most positions are for contract only for 2 years then required 6 months before being able to return. Would work for them again. A typical day at work started at 8am and was complete at 4pm. My team gathered in a conference room for dispatching duties and coordinated the daily activities via email and face to face interaction with fellow employees. I learned how to work well in a team environment. Management directives were coordinated well and the supervisors were very accessible. A typical work day is very predictable, the work is mostly the same throughout the day. I have learned how to work with current policy for workflows and also how to make the policy better.  I cannot disclose what I do specifically during the day because of the sensitive material I work with day to day.  The management for the entire office is fantastic, very helpful and always positive.  The pod leads for my specific group are also very helpful, informative, and always willing to answer questions.  Most of my coworkers are rather pleasant, it can be hard for some to stay on task due to the monotony of the job.  The hardest part of the job is to not get bored with workflow during the day since it is extremely repetitive. I enjoy having a job that I am continuously editing and working with maps, I did go to school for mapping and geography. Many of the perks you will hear about are only in Mountainview. San Francisco is growing but has limited perks and opportunities in comparison. Recruiters may not even mention the San Francisco office even if working in the city is important to you. You may have to ask about it. Quarterly bonuses given. Could listen to music and the hours were very versatile. The company even bought lunch every month for all its employees. Very sad it was only a 24 month assignment.😞 Outstanding work environment with open minded co-workers. You are free to prioritize your daily tasks. Limited supervision as long as you respect projects' deadlines.You have to be self disciplined because of various distractions onsite.If you are a contractor or vendor, it is very hard to switch to a permanent position within the company. At SDI I really enjoyed being an employee there and learned so much about payer, prescriber, and patients.  I worked there when applications became live online and my coworkers were easy to get along with and very nice it was a great place to work at. Google is full of smart people, and they know it. The compensation and the perks (on-site meals, gym, etc) are amazing, but I think it's the only thing keeping people here because most of your coworkers are jerks. You will not be disappointed. Google is one the top company's to work for and they will take care of you. You will be flexible with the schedule and much more. I can only speak for working in Google X, but it was hands down one of the best experiences of my life. It was an unforgettable time with the most inspiring people and projects. Extremely challenging at times, but very rewarding knowing you're contributing to really great products/experiences. Great place to work at. Great work life balance and challenging work. I learned how to operate in a very large code base, and learned how to test code and write readable code. Everyone were hard workers and the typical day was very busy. The hardest part of the job was working within a daily time-frame. I learned how to work warehouse. Wasn't really a good life balance between work school and family life. I wish I could of gotten more out of working for google, and put more importance into my family life. Very hectic and high paced environment. Lots of perks to keep in in the office as long as possible. Work/life balance could use improvement. Corporate culture is great, but office culture is very entitled and fraternity-like. People create a lot of distractions and don't seem very career focused. While I highly recommend taking a job at Google if one is offered to you, I would proceed with caution if you are a contract worker (or 'TVC'). There are certain perks and company functions you're not allowed to enjoy, but the biggest caution is that Google is only allowed to keep a temp on for two years. If your contract is renewed after the first year, great. But if they don't hire you on as permanent by the time the second year comes around, start looking for a new gig. In theory, you can be re-hired as a TVC if you are out of the company for a minimum of three months, but I've never seen that happen. Again, great job (and free food), but don't expect it to last longer than two years if you are hired as a contract worker. Googlers work hard and play hard.  If you fit in with your team and your work, you'll do fine.  Don't be afraid to ask questions; everyone feels lost at first. As a contractor, you see almost as many benefits as an FTE, as long as your willing to work for them. Your job is not as secure as a contractor, however its because so many people would love to have the position. If you're willing to work hards, correctly and as a team then you will absolutely succeed within this company. Worked here for a few months and enjoyed the people I met and worked with, really happy they opened their arms to me. Everyone was willing to teach me and I hope to learn and work more with them in the future. I'm so grateful to be working at Google. The team I work on is scrappy, entrepreneurial and has the freedom to take risks and fail. People managers at Google take immense pride in developing their teams both professionally and personally. My manager constantly reminds us that family comes first and the company backs this sentiment with plenty of creative benefits geared towards women, and family alike. My teammates are not only some of the most intelligent people I have worked with, but they are caring and have become lifelong friends. I loved being able to work with Google as well as a local business within Philadelphia. I learned a lot about Google and how it works as well as interesting facts about Philadelphia. The best part of the company is the teams you'll have the opportunity to work for. My team was among the greatest group of individuals I've ever met and I feel immensely fortunate to have been able to get to know them. The company as a whole is also ripe with opportunities and is just a joy to be able to be a part of. From the good that is done in the world, to the amazing products you get to be a part of - it's hard not to be impressed. Departmental politics would be Google's Achilles heal. I felt that often times great products or teams felt the arbitrary wrath that is department leads fighting for resources. On the whole, the day to day and the long term are really great, but some years can be a bit of a grind. The biggest concern would be trying to carve out enough time for life with your family while also trying to work enough to stand out. Pretty good company to get started things are always changing so be prepared for that. Do you like change? if the answer is yes this is the place for you. I enjoy the challenges that my management offers me and the freedom in how I get my work done. Co-workers are collaborative and great to work with. Benefits are terrific and food is awesome. Very good experience. Good stipend, good work satisfaction, you can work on the projects you are passionate about. Very good mentorship and direction. All the crazy things you read about google, like having put put in their offices etc are true, if you can get in do it, because you will never ever again enjoy and experience a job like this in your life. Great place to work fun people no job security poor management free food all day juice bar food trucks come sometimes team oriented somewhat great fruit Great place where to balance work and personal life. Commute is an issue to deal with if you don't live in Mountain View.Great team, but management through agency is not the best thing you can hope for, as they do not respect the company's values. I t is a really fun environment. I enjoy being around the people and seeing all the cool products. All the cafe are amazing. So many different variaties of food. very boring cant really do much but sit their. Its just like taking a test you have to sit their to the job complete and cant talk to no one. The pay was good. Fast-paced everyday. Great collaboration with very, very smart people. Everyone has fun but they get the job done.  Relaxed environment but that doesn't mean to take it easy. As a store operations lead, there is a lot of busy work to be done, but our voice is not heard. We are looking through a glass ceiling, never able to really advance, but still have exposure to what the higher ups in the company do on a daily basis. The hardest part of the job is managing the team, who is hired by recruiters through an easy hiring process. Most of our peers (co store leads) are amazing, and access to the Google campus is a huge plus as well. I love this job because it gives me the flexibility I want, with a good pay. I can work when my kids are sleeping or just playing in the living room. It is easy and yet interesting. Responded to inquires for clients in travel and post travel.  This job allowed me to travel to great destinations.Being able to travel for work was a great opportunity to visit new places and learn new cultures. i love the people over at google, every one is so nice and caring the environment is amazing,my time at Google was so fun  everything from the people to the job was great. Google is a great place to work, hard deadlines but manageable, overall very nice atmosphere. Great people to work with. It's a magical place to work at everyone is very awesome and understanding. There's also a lot of food! There's a lot of activities that employees can participate in on campus. Googlers work hard and play hard.  If you fit in with your team and your work, you'll do fine.  Don't be afraid to ask questions; everyone feels lost at first. It is an enjoyable work environment, mainly because of the employees. The day can become tedious but the good company makes time go by quickly. The field (main) operators are also attentive and understanding. As long as the workflow is running smoothly, they are open to suggestions and willing to solve any issues. The least favorite thing about the job are the weather conditions. Being that transport is a vital part of the operation, it is a constant battle with the forces of nature depending on the season. Not much interaction with the contracting agency as the position is managed by Google.The role at Google is fast paced and enjoyable. Good onsite perks as well. Although my internship is unpaid, I strongly support the mission of the program that I volunteer with on behalf of Google. knowledge high tech and community with co-workers. Google glass.for sample: when I Coat. I just use 2 my fingers in the font of Coating machine, and the machine automatic they Coat the OPTIC themsefl. I would open the warehouse through the security door with my security code me and another work associate.We would then proceed to make equiptment bags for the workers to make sure the had all the tools they needed, For there assignment for the day. Working with alot of different personalities give you understanding.Management was excellant,Working with co-worker to make sure we understood the changes that were made in the system for the months coming.There were some difficulties with computer system,But nothing that couldnt be fixed.What I enjoyed about the job is come in with my co-workers and putting forth the effort to work as a team, To make sure me meet our goals at the end of the quarter. Fun working environment for young people. Good benefits, compensation and company perks. Encourages creativity and team work although most of daily communication is via computers and chat. Gave opportunity to work with experienced team members, Learned many things from their expertise likehow to meet ETA on timehow to handle multiple projectshow to meet client requirementshow to work with Tools and services like SIS, SSAS, SSRSperformed anomaly and cluster detectionlearned how to find the hidden information from large data sets. A lot of very smart people, with great ideas and the drive to innovate and make an impact.Many top performers advance to manager but often don't have people skills, nor the vocation to manage people. This is a problem management should address. No clear, focused direction from management (on my specific project).  Revolving door of Technical Project Managers...5 TPMs in 12 months.  With such a large and very talented staff on hand, the analogy of the US Marines being lead by the Keystone Cops comes to mind.  In the defense of the TPMs -- there most definitely ARE some great ones -- unfortunately, they're so over-burdened and spread so thin that I can't imagine how they're able to keep much of anything focused and on-track. The job has many great perks and personal development opportunity. The challenge keeps me interested and I love all the people I work with. Great benefits, great place to explore ideas and work with some of the brightest and kind people on earth. Transfers encouraged which creates a lot of opportunities, etc. A regular day for me is mostly busy ... receiving putting accessories into camp and Guts tickets . I'm on my feet 80% of the day due to Inventory as well as prepping task tickets. Management is pretty good no one over your back to micro manage. I have a hard working team . We work together and get the job done. The hardest part of my day i would say would be receiving pallets and putting them into google camp at the same time.. Google helps you find any and everything you need that you search up, I use it myself when im looking for books, music, games, jobs, clothes, shoes, electronics, and more. Enjoyable work space. People seems very nice. Good perks.They're take care of their people with respect. Facilities are amazing. It deserve its reputation as one of the best company you could work for. A company with great culture, ability to constantly learn and develop, and add value to the business. World class perks and benefits, and  top rated talent. I have worked there over  a year and the leadership, environment and atmosphere is open, fun, attentive and they treat their people with respect and admiration. Managers have full reign to steer you in one direction, then turn around and criticize you when they change course. Co-workers are competitive and cut throat and will also try to manipulate situations.  HR does not help you.  Managers are able to tell their employees to threaten their staff and HR and Senior managers do nothing. The company hires under work permits so they don't have to pay double tax. This means you're not entitled to unemployment and cobra health care.  Google is the new Microsoft and the technology is dead. Working here is link dream come true. I got many things to learn and the work environment is amazing. If offered a full time I would certainly join it again Wish there was no 2 year contract,probably would still be working there. Always kept us busy and had time limits to get things done by the end of the day. Good culture, environment,people, innovation,. And so many things to learn with..Need to give more respect with TVC as same as FTE Googlers work hard and play hard.  If you fit in with your team and your work, you'll do fine.  Don't be afraid to ask questions; everyone feels lost at first. The people i worked with were very friendly and informative, especially when i was first starting out. It's not a difficult job, it doesn't require much besides punctuality and care. Rapid learning of technology based information. I feel I learned an amazing amount of information in a very short time. It was a brand new call center and we were not allowed to tell our phone customers where we were located. The best part of my job was speaking to customers from all over the world. The project itself is still fairly new and with anything new there are a few kinks. Such as scheduling problems, issues clocking in and out, and the constant new faces due to a high turn over rate. Those things aside its a great company and a fun project to be apart of. On top of learning about new and interesting technologies essentially on a daily basis, co-workers and supervisors were amazing to work with. Everyone seemed to be happy to be at work as well. Furthermore, the work schedules were flexible, and the company provided a lunch buffet at no cost. Several times the company allowed for fun team building activities at their own expense as well. This is a great company to work for compared to any other I have experienced. There is certainly a lot of work to be done, but you are provided a positive atmosphere to accomplish your goals. For a company this size to still treat employees so well, is impressive. The best part is the co-workers; so many determined and amazing people with which to work! Typical day at work was fast PacedManagement was AwsomeNice Supportive Co-workersMost enjoyable part of working at Google Express was Shopping for the Customer's google is a good company they may have been a few rotten eggs in the basket but still the company policy is very good and they take good care of their employee The aspects of the job was fine but management was horrible. They did not know what they was doing. co workers were great. hardest part was being able to keep in contact with management and trying to talk to them about things about the job we didnt like Got to learn more about the digital advertising space which was enjoyable and interesting. A lot of your experience here will depend on the team and the functional group that you are in. Provided with evrything you need to succedd. Geat value places on teamwork. Management trust you to work on your own and place a great deal of responsibitity in you. Easy to reach out and connect witj multiple departments and different aspects of business. My past experience has been wonderful both emotionally and technically.I have gained a lot of knowledge with respect technical skill set and the corporate world.I have also learnt from  my mistakes and now I am in position who can work with high efficiency. I got to learn a lot while my internship at Google. I worked with one of the brightest engineers in the world and they helped me develop personally and professionally. The hardest part of the job was to learn their internal framework on which I worked at Google. Great company. Great culture. Great benefits. Free food. Great People. Great Training. Nap Pods. Great coworkers. Productive and fun workplace! I was on contract that got extended. worked almost 2 years there.  great place to strech my legs after working for myself. Great project just was managed poorly. Excellent culture with fast pace environment and great company perks.  People are great at inspiring and motivating each other while giving enough space to allow work efficiency. For those who are still trying to determine what to do with their careers, this would be a beneficial position to keep you financially afloat until that is figured out. A typical day consists of being very slow in the early morning and picking up the pace during the lunch period. The focus is to ensure the satisfaction and comfort of Google employees, whether it is giving them medical attention, helping them find a lost item, or doing activities more behind the scenes that they are unaware of. There really is no difficult part of the job, the coworkers and supervisors are wonderful, and human interaction is the best part, as well as being a part of a lively culture. The greatest job you will have is at Google. There might be thousands of people working there;however, you have a voice and you will be heard. They do their best to ensure that their employees at all levels, from CEO to Interns, have the best experience while working with them. They care about our work-life balance. They know that a happy employee is a productive employee. The co-workers are fun and very helpful.  I can honestly say that the worst part of the job is actually leaving. Google is by far one of the best companies to work for. It was good because I could work from home and I could choose my schedule with a minimum of 10 hours and maximum of 30 hours a week. Great if you enjoy complex social systems and processes.  A lot of perks and flexibility.  Many touch points across big teams internationally too.  Suggest for anyone curious about working in a multinational corporation. Solved exciting, challenging problems. Co-workers were intelligent, and intellectually curious people continuing to educate and expand their minds each day at work. A thoroughly enjoyable experience. Googlers work hard and play hard.  If you fit in with your team and your work, you'll do fine.  Don't be afraid to ask questions; everyone feels lost at first. I love getting up and going to work everyday. The environment is what a job site should feel like. The people and the clients make working for Google the best place to have a career. Free food, games, rides, everything!  Exciting atmosphere.  Surrounded by other really smart people.  Lots of opportunity/budget to experiment.  Very much feels like a start-up with all good and bad associated with that type of situation. work life balance is good. it is great to work at Google. Teammates and people here are talent and friendly. I can learn from them everyday. Enjoy to work! Everything was well.It was a good site and helpful.I do enjoyed it.I will highly recommend for this.Thanks all.determination administrative problems by coordinating preparation of reports, analyzing data, and identifying accomplishment. Google express is a place where there is majority set operation work. My duty was to monitor almost 20 staff on a daily basis. I build great relationship with my employees. Where they were comfortable and enjoyed getting the work done on a daily. Unfortunately google is a temporary position, and in due time we all would have to seek further employment. I had 5 conversations with my manager in a year. never personal and very short. I learned everything from my coworkers. Google hires some of the most intelligent people I have ever had the pleasure to work with. The food is great and Google takes care of coworkers with excellent benefits and fun employee functions. The down fall is that job security is a big issue. Google is always looking for someone better and will have no concern with letting you go in a heartbeat. On a regular day I would be in charge of shopping operations for our customers at designated locations for same day delivery. This job has taught me to be very diligent in my work and doing efficiently. I have had the pleasure to work with a great team, from our management to co workers we have been able to all work together easily to accomplish our daily duties. I have truly enjoyed being part of the Google express team. Great culture overall. Casual. Fun. Collaborative. Open communication. Intelligent. Forward Thinking. Innovative. Pushing the limits of engineering the in the VR We worked hard, but the culture created by Google owners and management is one that should be replicated everywhere. It's amazingly relaxed and open to creativity Google is a great place to work in. We can come in any time we like and as long as we deliver on what was discussed in the last project meeting we are evaluated positively. My initial role involved geospatial data collection. It was contract position and 80% travel. I was promoted multiple times there within my time there to Operations Lead. In this role I was in charge of the admin process and management of associates administering data collection throughout the United States, Australia, and some parts of Canada.The project was fairly new and underwent a major operational infrastructure change. The most enjoyable aspect of the position were my team members and the travel opportunities early on. Most of the team members I managed were great people with great work ethic. I was also able to exercise my creativity and leadership abilities to grow myself into a better person.The hardest part of job were the increasing demands of project performance with zero opportunity of incentive based compensation. There was very little work life balance, no bonuses, and it was often expressed to me no growth outside of the project. Google is a wonderful place to work for because they really know how to take care of their employees.  Google offers lots of work benefits such as free meals, shuttle, health and fitness activities, etc.Google is also very active in the community sponsoring all sorts of community functions and causes.  It is a model corporate citizen which promote global awareness and is very visible and sought after worldwide.  The products and services are outstanding and the standards are very high.  Very high caliber of talents. working for google express was a wonderful experience its a good job to have with wonderful compensation an d benefits the advancement opportunities  is phenomenal but job security is not as good as everything else Awesome work environment with great people.   Flexible work schedule with opportunity to get out of the office and work with businesses directly through networking events. I worked on a contract at Google for 1.5 years and it was better than I could have imagined. Free food, free gym, great facilities, and amazing people. I would go back in a heart beat if there was a Philadelphia location. Wish I was an actual Googler as they do not treat their vendors with much respect.High expectations with no reasoning.Really enjoyed the work, would love to actually work with Google, as they seemed pretty happy. Usually the name Google is synonymous with a fun, creative work environment. That is not the case when it comes to my time at Google Nest. As a trainer in a Google facility, we could not rearrange classroom seating as we saw fit without corporate approval. We could not even change the clocks to account for daylight savings time or even for better time accuracy without corporate approval. Google has their own security staff which is nice to an extent, however, should you dim the lights or bring in a visitor, you will be on their bad side. The pay was decent, but not decent enough to stay. The regulations of this facility really inhibited work flow. Great job for going back to school and working from home whenever I had the time. Very convenient and the pay was not bad. Recommend it to anyone who needs a part time job. Nice work from home job....Great compensation and paid weekly. My only issue is that some weeks there are not enough assignments or tasks to complete. Good working environment and work-life balance, very nice and helpful colleges, challenging position of an exiting project. Googlers work hard and play hard.  If you fit in with your team and your work, you'll do fine.  Don't be afraid to ask questions; everyone feels lost at first. I was a part of a hardworking fulfillment team that was responsible for creating and implementation of operational changes to help streamline our supply chain. A typical day also consisted of monitoring all stores and operators to make sure each of our customers orders was fulfillment correctly and on time. Working with these group of guys helped me understand how important it is to have a staff that are reliable and consistent.They always showed up ready to work and they never would turn down anyone that needed help. Great company to work for.  Yes they ask a lot but they also give a lot.  Managers make sure there is always a balance between work and life.  You are constantly reminded that working long hours does not always mean you are doing a great job We are usually always ahead of the time when it comes to consumer data, but commerce we only have access to 10% which is online, the other 90% is in store from the point of sale. Other companies like IBM are taking an aggressive approach to retrieving this data and we need to stay up to speed. Its good to hear we are in talks with point of sale companies. With access to the other 90% of missing data we can finally close the loop and 9x our revenue in advertising. I really enjoyed my time at this company. I was able to create different videos and maintain a highly specialized channel with over 170 subscribers. This allowed me to grow and creatively and learn new processes. Really big really easy really fun. Waant here for to long but from what i seen from being there, alot of different people to interact and learn from. Work isnt as harsh and fast pace as a regular kitchen I was highly disappointed by the Revana system They were an Outsource system for Google. They would steal clients in  my opinion and send them over to other divisions they outsourced for or the reps would take Google account. Very poor module for Google. Great Work Flow. Competent Managers. Nice Employees. Nice Pay at the time I was working there. I can't go into detail about this, I signed an agreement form. great people; you can meet a lot of smart peoplegreat paymentfree food and gym: the gym is pretty goodopen access to the whole code repo I would go back to Google in a heartbeat , amazing people, benefits and overall a wonderful experience. I'm so grateful that I was able to participate in such a thriving company. From what I've learned about the full-timers at Google, the benefits and perks are amazing.  My work with Adecco was ok.  Adecco itself could use some work but being at Google is fun at least. -led people in projects and maintenance-plenty of work to stay busy-constant change-management utilities for tracking all work to within 15 minutes-finishing projects on time a plus-repetitiveness of work a challenge-understaffing for certain tasks problematic-far too much content to learn; not enough time to learn it all you had  to pay attention to detail in or to have the best quality of part and also best fast enough to reach the daily goal even while sometime having multiple parts Great place to work. Very competitive place which brings a great atmosphere. The job is self is difficult but you are given many resources that will allow you to succeed. Job security was based on projects success. 100% travel for some, 75% travel for most. Too many positions that put people in power, very little people willing to do regular tasks day to day. Everything was amazing from campus to cool co-workers. Only smart people with degrees can stay as full time employees. They hire a lot of contracts. Provided insights in reporting analysis for real estate space planning Google office Real Estate, performed advanced data analysis activities, defined, measured and communicated core metrics.   End-to-end works included data gathering, analysis, ongoing scaled deliverables and final presentation slides A very great place to work with. The working environment brought employee to a creative mind set. Feel fresh each and very day. I enjoyed working there. Pay is good, paid weekly, make your own hours. Benefits aren't great due to expense of them. Easy job, don't really see supervisors or coworkers. All in all great job The StreetView project is a very wonderful and unique position.  On a daily basis I drove the StreetView car and updated Google maps.  I had the privilege to meet many wonderful people. Googlers work hard and play hard.  If you fit in with your team and your work, you'll do fine.  Don't be afraid to ask questions; everyone feels lost at first. I enjoyed the overall experience at Google and was very sad to leave this position.   Benifits were good as was the working environment.    Great team to be a part of great people , great management. Very laid back environment but also very competitive . a lot of training , constantly changing fast paced environment The 'Doodle' dept. at Google HQ is filled with talented and VERY sharp characters. I would jump at the chance to create another 'Doodle' for the team. I love google, nice place to work and grow, following up on cool projects, strong team, smart people online on a computerI learned a lotmy coworkers just computerI am very happy with my jobI just wanted to try something new I had a very nice experience  with google advertisement so far. They deliver. It's easy to manage your account and track your work. Working for big companies such as Google, teaches you best practices that makes work stream lined.   Due to code reviews, it forces you to be more conscious on how to code and follow best practices. My time at Google was a true experience. I enjoyed working with a lot of creative minds and learning the Googley way:-)  I hope everyone get's to experience working for Google someday. Super smart people, fast-paced strategic decisions, team-based environment. Would recommend the company to entrepreneurial-minded individuals who are comfortable with frequent change in unchartered territory. Google is a fun place to work with a great atmosphere. The perks and benefits are great. Roles are very singularly task oriented since it is such a huge company, and though it is a 'friendly' company, it is big, so it can be corporate at times.Tons of huge opportunities for growth here, though moving upward internally is very difficult. I indirectly work for Google, my videos on Youtube make enough views that advertisements are able to pop up on my videos. The Advertisements make 'Ad-Revenue', I don't know much else about it, I just know that Google makes money, and I end up making money. I don't make much because I'm not a HUGE youtuber. But at the end of the day, the money isn't what I care about, it's the fun. I'd say Youtube is more as an internship as I learn more about other people and connect in a way that I never would've thought I could. Google is as great to work for as everyone thinks. It is a very relaxed and collaborative work culture. Lost of free time to do what you need to in your personal life, able to bring your dog(s) into work and everyone is extremely friendly. This has probably the greatest company I have worked for because of the overall culture of the company. The only problem I have would be the fact that some teams give you very short notice on whether or not you will stay with the next every quarter. I am always in a panic when it comes close to the end of the quarter. Had the opportunity to be selected twice as a Google Student Ambassador. I was invited on an all-expenses-paid trip out to Google's HQ in Mountain View, CA along with ~ 200 other ambassadors from schools all across the nation and the world. Got to hear from representatives from different teams across Google and went back to my campus to spread Google awareness to fellow students and faculty. Google is a stellar company to work for! I spent my days researching digital marketing, curating content, creating/managing social media ad campaigns, and building social media fan base. It was my first position in the field and the owner was very understanding of this. I had the freedom to research and explore, but the opportunity for advancement was limited due to being a remote position. BOA was very cool. Learning how to process checks and working the machines was pretty cool. I would not mind going back. Bank of America was a fun work environment. This job was a unique opportunity to learn in a start up within a start up environment. There is no typical day on the job. Every day brings new challenges and tests your ability to roll with the punches. I learned a lot from the amazing people who work on the project and from our merchant partners who have so much experience in retail operations. This project is powered by a significant number of temps/contractors (as opposed to full staffed with Googlers) and would benefit from increasing their focus on retaining their talent/tribal knowledge by promoting within. work life was amazing! the environment was prime. there was always a buzz of excitement and a go get it attitude. co workers are very fun and nice. and overall an extreamely productive workplace. Google is a great company. Their products work very welll and they train you to them. Customer interactions are always pleasant and you get to work with new tech.  I loved this job while I had it and I loved it the second year when they invited me back.  I would have gone for a 3rd year but I had just started my new engineering job when the call came in. Google is a great place to work.  Its culture has changed over the years -- it has more bureaucracy than it did -- but as large corporations go, it does a fantastic job of empowering its individual contributors. Aside from working on a project with over 100 new graduates, this was a fantastic environment and a one of a kind project. Management for operations desperately needs to develop people management skills to add to their project management environment. Googlers work hard and play hard.  If you fit in with your team and your work, you'll do fine.  Don't be afraid to ask questions; everyone feels lost at first. Worked with 4 creative people. Managed team and the workplace functioned in a very organized and effective way. Very functional and developed environment. Great work experience overall. Very enjoyable work environment. Learned a lot about the industry. Gained valuable knowledge and skills for the field. Google is as great to work for as everyone thinks. It is a very relaxed and collaborative work culture. Lost of free time to do what you need to in your personal life, able to bring your dog(s) into work and everyone is extremely friendly. This has probably the greatest company I have worked for because of the overall culture of the company. The only problem I have would be the fact that some teams give you very short notice on whether or not you will stay with the next every quarter. I am always in a panic when it comes close to the end of the quarter. Overall great place to work. Management listens to your ideas and you're surrounded by creative thinkers. Room for career advancement and they encourage you to develop your skills. My contract at Google for their self driving car project has been a truly fun and unique experience. Every day we come in to work and test their self driving cars on the streets of Mountain View. Through this job I've learned how to troubleshoot software bugs and learned ways to communicate with a cross functional team of developers of various backgrounds. Worked at the company for several years on a team with a high turnover rate. There's always work coming in, and management was often in flux. There was a lot of emphasis on team bonding and power hours. Fun coworkers and interesting work. Overall had a great experience. A typical day at work consist of a staff ranged from 1-20 depending on the site assigned. co workers for the most part are welcoming and the leads are knowledgable.There are some leads who require further examination within their led position but that can also be said about management. Management try to maintain punctuality even though there are many who may not be able to grab the necessary attention needed to completely handle a situation that only management can touch on such as availability, Pay stub's and Sick Hour adjustments.The hardest part of the Job depends on the associates ability to handle different positions within one work day. The best part about the job is the co workers and compensation and the only thing I've learned is that there are jobs out there with leadership that completely understands those they oversee while at the same time equally respecting them as an adult and a human being. other jobs can learn from this one. 85% of meetings are via Google Hangout, very flexible and fun environment but easy to get distracted and  has a LOTTTT of re-org. So prepare to change roles, teams, management every quarter! terrible,its like going back to highschool. and management is the worst ,rude......the workers are rude young disrespectful and management doesnt say anything to anyone .............................................................................. mapping varioius cities in a fast paced environment. you will enjoy this job if you can handle a lot of driving and work well without on your own. A commercial architectural and landscape photographer, specializing in Google Street Views, photo spheres, portraiture and point of interest photographs. Creative images that are imaginative and vibrant.My photography style is built around High-dynamic-range imaging (HDR). Encompassing a set of techniques used in imaging and photography that reproduces a greater dynamic range of luminosity than possible using standard digital imaging or photographic techniques. Whether photographing a fine art gallery, a hotel lobby, landscape or a client I take the same care and approach in developing the finest image possible.“For the love of photography, the seed of imagination!” Cons:- At times, it gets difficult to maintain work/life balance- The resources were limited and the pressure was high.Pros:- Great team synergy. - Good compensation Productive and fun environment, best place to work. Free food, gym and many sports activities and employee activity groups. Awesome and friendly place to work.  Great working environment and perks.  Always supportive of new ideas and encourages  initiatives. Google is great, but they need to hire a better staffing agency who respects their employees! You learn to work with good quality to make a deadline to get all packages out to the customers on time. My co-workers and the employees from the different stores we went to were great and friendly. great company!! They take really good care of employees and listen to concern's and fix problems quickly. great people and work atmosphere. I loved working for Adecco at google. contractor's not treated as same as employee, no chance of hireexperience not realy qualification to get hired its who you know I haven't worked directly in the Google office, but in being partnered with them from YouTube the freedom in producing video content is awesome. Ample opportunity for advancement.  Great learning experience for future managers and supervisors.  Learn how to work in a fast paced, deadline oriented environment. You learn how to work the system, majority of the work is looking up information. Pertaining to mobile phones, tablets, and computers. Some eyeglass wear, the calls for that are far and in between. They have a system with step by step ways to solve issues with the equipment. Googlers work hard and play hard.  If you fit in with your team and your work, you'll do fine.  Don't be afraid to ask questions; everyone feels lost at first. In store lead at Google Shopping Express. Learned the importance of managing a team for an e-commerce logisitics retail company. Great people, great management, very easy going laid back experience.  Working at Google, I learned better management skills, and how to facilitate directions to co-workers. Work day was very flexible, also had a work at home option, but that was not something I used often because I could not access all of the systems I needed due to security issues.  Had some long days but did not mind due to the interesting nature of the work and the fact that the company gave me the freedom to manage the 'when' as far as getting the work done. I learned a lot of Advanced Analytics from peers and formal training that was offered.  Management was outstanding with the boss being in the top 4 of over 35 bosses I have had in my career.  Had the flexibility to work on projects that were not formally sponsored by the company but worked out and used by the company.  That level of freedom is rare in business.  Boss was very good, no micromanagement what so ever but was generally available if you needed him.  I felt comfortable suggesting crazy ideas without the fear of it destroying my career. Easy work, great schedule, fun environment. Daily activities with new guest and clients kept things fun. Management easy to work with and more than happy to help on any needs, Some time spent staging without any delivery orders.  Assignments and work schedule not very efficient.  Overall, reasonable amount of work each shift. A great company to work for with extremely competent coworkers and a great vision. Great place to work for to get a feel of startup environment with a vision of a corporate structure. Google Express was my first introduction into the tech world and I wouldn't have wanted to start any other place. A typical day at work is you get into the office, get a free breakfast, and then get to work. We are usually working on multiple side projects at one time while scheduling upcoming trainings or new stores to onboard. I am usually in and out of meetings throughout the day depending on the day and how busy we are at the time. My co-workers are all awesome and we do a lot of collaborative work together. Our team started out small when I first joined and we have now grown to a 18 man team and taken over the Google Express Merchant Owned and Operated world. It's been a great ride. Great place to work, however not garunteed that you will keep your job for long. Sometimes you may see a bunch of people leaving and being fired, and wonder whats going on. The job is simple, the expectations are set well, however if you don't perform, consider your self on the line all the time. I don't agree with Google's hiring practices of hiring many contractors and letting go many. I don't agree with the method of development of their people while at Google. I believe they should have more faith in their contractors to allow them to not only setup the equipment physically but to also set up the equipment using software. Hardware will not work without software. Obviously working at Google has perks such as free food, shuttles to and from work, etc..  For the typical contractor however very few opportunities arise to convert to a permanent Google employee, especially without a college degree.  There are times you feel like the hired help while wearing your 'red' badge which I personally don't enjoy. I've heard and seen many companies use the term work/life balance but only have I witnessed it here at Google. With the proper design and flexibility, they have managed to create an atmosphere of higher learning and constant evolution in the DRIVE to come to work. It's not the benefits and pay (although that always helps) that make working here so great, its the feeling of wanting to come to work to achieve more. I've yet to encounter a single person who grips or complains about management or peers here. The collaboration and effort I see in the faces of co-workers and peers is unlike any place I've seen to date.I'd have to say that my most challenging and fulfilling part of my job as a Hardware Test Technician, is that fact that there is ALWAYS something for me to improve on and I have the freedom and flexibility to choose. You always need to watch out and schedule work since there is more work that needs to get done then there are resources (people). I enjoy meeting the Google clients around the Kansas City area and the ability to work outdoors makes the work pleasant . Great place to work, unbelievable amenities, great salary and benefits better than ever expected.  Co-workers were for the most part a lot of fun and very bright.  Middle level managers many times were looking up instead of helping to push their employees along to further their careers.  But still a great place to work. Great Company to work for with good work/ life balance, fun and exciting atmosphere with friendly people. contract expired so it was timer to move on. It is exhilarating to walk into the Google X building everyday and do what we do.  The self-driving car project is truly one of a kind and I would not trade the experience for anything.  Although day to day duties and responsibilities are constantly shifting, management does a fantastic job of keeping our team together.  The hardest part of our job is to face these constant changes and be able to adapt quickly to them.  It is quite amazing how everyone on the team is able to learn on the go.  I am proud to be a worker here. working with great and fun co-workers, i have learn so much in this company and learned using google's software to troubleshoot the customer's issue. It is a renowned company with great culture. In recent years, google has grown too much in size which makes management less efficient and low. Still a top place to work for. Dynamic work environment with great coworkers, and excellent at providing help and hands-on experience. I actively seek working there again. Worked at Google for Google Wallet's AML team. The work was critical but it was great to work with. The people there were very helpful. Googlers work hard and play hard.  If you fit in with your team and your work, you'll do fine.  Don't be afraid to ask questions; everyone feels lost at first. Google can still be the best place to work.  Some departments are heavy in ex-consulting backgrounds which can be challenging for those that are looking for the 'open innovation' feel of yestergoogle. Unfortunately Google works with Staffing Companies that don't have the best benefits. They have temporary jobs with a max of 2 years contract. A typical day at work for me is accomplishing all tasks designed to me, enjoying and having fun at what I do, getting along with and enjoying the company of work associates, and coming in the days to follow and doing it all over again I'll just say that the glass is half full. Many products are successful and great. All the perks are wonderful. Too much of the management is incompetent. It's a volunteer work so I'm not getting paid for doing everything. However, the idea about igniting young minds and getting more people into computer science really thrilled me. It's also a great thing to have some connection with Google and have our name recorded. It's an on going program now. It has been a great experience so far A typical day involves me processing customers' orders on a company phone. I make sure to provide quality and efficient processes. I also provide feedback to the customer if their desired item is unavailable. I work with other store operators to make sure the item is properly picked, paid, packed, and delivered to their desired shipping address. I work any hours I want since I am the owner. I try to learn new things on google everyday so I can become better at ranking websites and videos. Very nice and friendly workplace with almost everything you need there for you. Hard to grow and advance in certain departments but overall a great experience. You play the game you keep your job!  Overall a decent company to work for if you are single.  Very little work life balance.  You can advance if you know how to say the right things and build the right relationships. we work alone in the driving process but we always now we have people to back us up in problems or any issues we have. i like the company it is amazing with everything. Desks were taken away after the team was there for four days and manager was fired, we were told he was sick.  bad company. not worth working at. Good place to work if your looking for a quick job out of college. Good food, good in office rest locations. Management is approachable and friendly if a little unfocused. Google has been an okay employer so far. Some people can take themselves a bit too seriously but others are nice. The commute to work from the city is vert jarring and gets old really quickly. its the company number one in the world and it was founded in 1989 and grown to serve millions of people around the world and the ever wonderful life at google A reliable company to work for. Great experience to gain. Also a great way to connect with different experienced challenges. Believe me when I say this. There has not been one day from the years that I have worked at Google to where I would dread going to work. I loved working here and I really hope to work with Google again and work there for the rest of my career!What's not to love about this place? Great area, awesome people, it's fun, you meet great people everyday. It's my ideal place to work. I should of had never left. I've learned a better connection with the customer. Placing myself in there shoes building a relationship. Google is as and amazing company with amazing employees. Fun place but work life balance is missing. Need to improve more on the openness and culture. Need to have a good onboarding program. I would stay if the project was guaranteed.  But like any contract in California, it only last 2 years if not brought on permanent. Fun, casual, fast paced working environment that teaches self discipline while learning new software. Learn proprietary GIS with decent oversight on workflow as well as experimental workflow. "
                },
"encodingType":"UTF8"
}
