{
"document":{
"type":"PLAIN_TEXT",
"language": "EN",
"content":"Collaborative environment, with work life balance.  Growth potential, co workers focused and ready to help you navigate the upper management demands and culture. Opportunities to redirect or reinvent HP.  Ongoing process.  HP has found new ways to grow and some great new technology to keep people printing in the SMB and home office. Generally, a very positive atmosphere but ran as a slower pace.  Deliverables were slower than most companies but fair overall.  Strong culture and willingness to complete work with strong individual contributors. My manager was available when he was needed.  True open door policy.  Enjoyed working with coworkers.  Benefits could have been better.  Some meetings were at difficult hours. Perform contracted duties for HP at Best Buy/Market Source of Pacoima, CA. Provide key sales and business support; train and develop staff on all HP products and services with a specialized focus on printers and computers. Create, update, and disburse training materials that serve as an on-going reference for staff to retain and apply HP knowledge.* Conducted interactive training seminars for Best Buy staff on sales of all HP products that improved performance measures.* Attained a 99% secret shopper rating for sales presentations and product knowledge.* Recognized as an outstanding instructor per student feedback; continuously acknowledge for ability to professionally instruct adults through well-developed communication and teaching skills Typical day at work:Come in do your job go homeWhat I learnedWatch your back, always be looking for another position just in case.Hardest part of the jobWondering if it is going to be shipped off to India Great management team and competitive pay. Learned alot about computers and warehousing. Processed and shipped big money items like servers. Only con is that it is temp/contracted work Management was over-assertive, boarder lining intimidation in connotation and you could tell they enjoyed doing. This inadvertently demoralized the sense of team spirit, which in turn gradually eroded at our sense of confidence and belonging as employees. It's been so long since I've worked there, I can't give an opinion. I've heard that the threat of layoffs are still always imminent so it's still a stressful environment high anxiety cutthroat work environment with everyone, including bosses, waiting to be told to clear out their desks and turn in their id badge. Difficult work environment for American workers because of language/culture gap with Indians I was a temp with a light workload. Only two others sat in the same room with me, both very friendly, smart, fun to be around. When my contract was over, everything was handled very professionally. Management is great and always provided opportunities for professional growth.  The downs side is the pay and working with Sales Managers.  Management does a great job in promoting team building. Actually the people who is a technician with an experiences can not have a good position to work with because the management will make a decision to pick the one they like.More things you need to know, I hope you will find out from some previous employees who worked for HP before. Does not understand any business offering that is not a part of it's core offering, if it doesn't move equipment it seems to be relegated to a very much second class status no matter how profitable it may be. HP was filled with ppl lamenting the glory days of the past while being miserable in the present. Endless bureaucracy, poor communication, ever-changing direction, and a general sense of misery all pervaded this workplace. great benefits  and great company to work for  healh 401 k and the products that is produced within the company and training is good. Great people to work with It is a good company to have on your resume. That is all I have to say. All other data does not matter it depends on what kind of work you qualify for A typical work day is extremely Fast Past. Must be able to muli-task and know problem resolution. Knowing different work areas is a plus in the Print Operations environment. I had worked with a few companies after I retired from the Air Force and the time I spent with HP was the absolute best I experienced after retiring from the US Air Force.  HP's corporate culture, the compensation and benefits, the training made available (both from within and from external vendors) -- everything was top notch.  I truly miss the old HP and I thoroughly enjoyed my time there.  I've never been prouder than to have that 'HP' logo on my business cards, and to be a part of over 75 years of HP Excellence. the managers i worked with the most were great teachers and motivators.  The manager i worked with the least amount of time was not a fair person and spent too much time on the internet. hmm Great job to kill time, but it was like boring you always had to figure out what to do in down time you couldnt like check your phone or chill in your down time Collaborative environment, with work life balance.  Growth potential, co workers focused and ready to help you navigate the upper management demands and culture. Decisions still made by the old guard of Hardware people despite what they say about the importance of SW.There could be pockets of exciting projects but they are hard to find. My time spent contracting with HP was a great experience. I acquired many skills and learned many new things. I was always respected and praised for my work. It was great as their equipment we used on the road was superb as we travelled a lot.There were many opportunities to learn in all business sectors to apply Information Security. Great place to work, but just got too big and bogged down.  Size and structure of company made it near impossible to get things done.People are good to work with and generally collaborative. HP was better than average in pay and benefits.  Flexibility in scheduling and work life was great, until....Nearing the end of my tenure, HP became a terrible place to work, ridiculous rules for USA workers. constant threat and real layoffs.  Impossible work assignments and lack of resources.  The hardest part of the job, for me, was to continue to produce quality output knowing your job would be over the next week, the hour, or the next minute.  It was knowing that quality of work ability to produce, and vastness of knowledge were insignificant in job retention.I worked for HP for 17 years before I got the Monday morning call. Good working environment , great co workers. Benefits are good educational assistance is available. easy to advance in you job role..Great 401k and good health benefits HP bought EDS while I was out on sick leave following surgery.  I retired and never went back to work. I cannot honestly rate HP on anything.  Other employees seemed to be happy at HP though. If you take a contractor position they will tell you there's a big chance you will become a full time employee but it will never happen. As a contractor you work as much as anyone else, but with no benefits and no growth opportunities. Left due to family illness.   The PMO orgainzation was very structured and well managed.   At the time, there was an effort to expand PMO control across all divisions but the recent re-organization has significanlty altered this direction. Learned from employees and educated employees as well as possible buyers of HP. Monthly meetings kept us informed of the latest technology biweekly give aways helped keep us prominent. I loved this job and the people i worked with . they worked as a team my daughter had health issues. they let me side my schedule to help she has now gone on to college to be an nurse Spearhead projects fast pace data center to resolve time-sensitive issues and improve network, system, hardware and operational performance in data center environments. Analyze business/user needs, prepare service requests and manage all phases of technology projects utilizing waterfall and Agile methodologies. Document progress, changes and financial data. Establish open lines of communication with cross-functional teams and ensure seamless execution of all deliverables.Provided consultant services to several governmental and state specific agencies by coordinating agency “on-boarding” process, establishing client specific requirements, host configurations, and signal point of contact for day-to-day operational issues and system upgrades.  Maintains a face-to-face working relationship with all primary and secondary customer representatives.  Oversees and coordinates system activities, reports systems activities to the customer and data center departments. Hewlett Packard was a great place to work.  Employees were taken care of very well.  Atmosphere was very pleasant and everyone got along well.  Plenty of room for growth. Ok place to work but outsourced jobs. Needed to think about American worker and not bottom line lost on job for ten dollars a unit..................... I haven't worked for HP since Novemeber 2006.  My Managers have retired at this time and/or have moved onto other positions inside and out of the company. Great work place to work.This was one job I truly enjoyed just needed better pay would love to go back with a higher salary and advancement if at all possible It's been more than a decade since I worked there but it was a great company that just did too much outsourcing and off shoring. That greatly impacted the stability of the business HP, Inc refocused on hardware and service solutions.  Still seen as the premier printer provider in the industry. new markets in 3D, graphics, and online services proves to be a good position moving forward.  Management team is good, some transitioning has occurred. Corporate leadership changes indicates some uncertainty for the company moving forward. Good management interaction.  Opportunity for advancement, with great benefits and just ok pay.  A lot of interaction between departments and lots of travel opportunity. It was great working at hp bassicaly a good team we always had all the goals cleared also on top of that we did the whole process of mounting the ink system Collaborative environment, with work life balance.  Growth potential, co workers focused and ready to help you navigate the upper management demands and culture. Try it , I did a work from home for HP and was very satisfied with my intern after that i learned alot and i would like to recommend this to you !Have a nice day ! The company I worked for is no longer in business.  I was laid off with lack of work.  The owner wasn't much of a go getter.  We needed more business and leads! In Hewlett-Packard, you will learn how to work with clients.Focus in project deliverables is challenging and can learn a lot from it.Collaboration with teammates is one of the key in resolving issues. The HP Culture could be different instead of the same, depending upon the account that you are on within HP Enterprise.  I was on a start-up account which was very challenging and exciting in the beginning.  I had about 4 different Managers during my 4 year tenure with the last one being a micro-manager on a small but popular account.  There was very high turnover among IT Engineers and mature workers were replaced with the younger workforce to increase P&L, unless your skill was in high demand.  It was a good life learning experience! Work was sometimes slow no advancement built nodes tested machines. When work was low or slow was asked to go home no time for advancement or work using certifications. HP is a great place to work if you are always ready to be be pushed to your greatest potential.   The ability to blow out our sales quotas was an incentive to me and something I found very rewarding. Wonderful pace to work. many opportunities, working with cutting edge technology was amazing.  flexible working hours. fantastic leads and managers.  overall a great place to work Toxic work environment. Your opinion or suggestions are not taking in consideration. No incentives, no bonus, no 401K, no vacations, no benefits, no GYM,etc. Its a great company to work for, managers are friendly and good working atmosphere. Salary meets industry standards so no worries there. Good HR and comfortable working atmosphere. Being out in the Field and helping customers with their computer and printer issues is self satisfying.  knowing that i am able to get the customer back up and in production so they are not to loose anymore time of their day. Company was in its infancy, but they did not seem to care for employees as much as they should. The bottom dollar was always more important. Customer satisfaction was a point they were good with. People are mostly great. Job  satisfaction depends on your manager, but there are executives who preach the importance or culture or empowerment, and then micro-manage and 'mean girl' there way through the day.   Most of my memories are good, but my exit and all the stress that goes with it--are directly responsible to one VP. Work hard and promote your successes.  Make sure you are acknowledged for your success.  If you can integrate yourself with people in power and show that you can be social during work and after hours, you can do well here. HP has a last of culture to the extent that this can be the same company as 100s of others.  When I was with EDS, the culture was part of the company's history. Hewlett Packard has been in the innovation business for more than 75 years. Our vast intellectual property portfolio and global research and development capabilities are part of an innovation roadmap designed to help organizations of all sizes – from global enterprises to local startups – transition from traditional technology platforms to the IT systems of the future. The job wasn't exactly hard the only thing was i was laid off because i missed 3 days before my 90 days were up but i had a doctors note from where i took my child to the hospital and was still fired. No understanding and no compassion strict . HP was a wonderful place to work for more than 28 years. I worked from home with a flexible schedule with a strong work-life balance. I enjoyed working with CEOs and other Executives to impact customer satisfaction and partnership loyalty, HP was a great place to work and he environment was fun. Challenging and learned a lot in the printing world that I never knew of all the HP products. Used to be good.  A lot of negative organizational changes.  Too many silos.  Work life balance is decent enough.  This is not a forever home.  The only way to get new skills is to go to a different company.  Training budget is very very low. Management lacks leadership abilities. No sense of leadership or career development . Politics and very clique like atmosphere. No idea who HR is or where they sit. Just not a good place in my opinion Collaborative environment, with work life balance.  Growth potential, co workers focused and ready to help you navigate the upper management demands and culture. Enjoyed working at HP.  The environment was collaborative and gave you many opportunities for advancement.  Management was there to help you if needed but provided the freedom for you to learn without pounding you if you made a mistake. In all of my working career HP was far and above the best place I had the opportunity to work. Even though my job disappeared and was out sourced over seas I to this day hold HP in very high regards.My separation package was very generous and I would return if the opportunity presented itself. I was a okay, wish they told me when I was can. It was not always easy to send the costumers to the right department. I also think that I was more educated on computers HP is an ok company to work for. As usual it depends on the team and it's leadership you are working with. The pay and benefits are on par with the IT industry. Most jobs in mid to senior management is high volume, high caliber, high stress work.  Depending on the team one is with, this can be easy with a well oiled team. However some teams have much in-fighting that puts good work into a tail-spin.There were very rewarding times when all involved worked together as a synergistic team. But with constant cost cutting being driven through all organizations, headcount reduction exercises are cutting into the bone, and many extremely valuable resources are getting cut out.  Welcome to the large corporate world.Note: This is not the last company I worked for in my career.  HP is a company I worked for and Indeed has asked for input on. I enjoyed my time at HP and met amazing people globally.  Having the ability to change job functions, work cross functionally and transition into new business units for growth was a great perk of being at HP. The focus on services over product development have meant that the complexion of the company has changed a great deal from the HP of old.   Since they have been challenged to find new ways to reinvigorate the company by a string of dissimilar CEO's, the sense of security and commitment that was once there is lacking.  However, HP remains a solid company in those areas where they are still competing, and should continue to be an effective player in the global information technology marketplace. HP is a good company to work for. Salaries are competitive and management is helpfulOver all it was a positive. work experience.My peers were all professionals who who were committed to the success of the product Most employees were stressed, very competitive and employees were overloaded with assignments.Employees were nice to each other and helpful when time allowed. HP was a great learning experience a great pace to work Home work Life balance was ok the management was great work place culture the hardest at about my job sometime the hours they wanted us to work My typical work day would begin between 9 AM and 9:30 AM and most of the team would leave work between 3-4 PM every day.  Many people would work from home when they were allowed. Job training (to some degree) should be expected for anyone starting a new job.However, at HP, job training may or may not occur. High-level classroom or conference call training occurred frequently.  However, one-on-one low-level training occurred rarely or not at all.  Communication between managers and employee leaves a lot to be desired. In my nearly-5 years at HP, I had two managers, both of whom spent 75%-80% of their days (every day) on conference calls or in meetings. I had a very decent relationship with my first manager, but I rarely (if ever) saw her in the office.  My second manager was very bad about playing favorites. Those with whom he clicked were given preferential treatment and often provided with additional training or opportunities for special projects that allowed them to advance their careers. I was laid off/let go from HP in February of 2017, I was a mere 3 months shy of 5 years. My termination came as a complete shock and I had no indication whatsover that it was coming. My manager had set up a one-on-one meeting, which happened regularly, so it didn't seem out of the ordinary. While we were walking to a conference room for our one-on-one, my manager was making friendly small talk, as if nothing unusual was happening. It appeared as if it were just a regular meeting.  Then...BOOM...my world came crashing down. When I asked why I was being let go, my manager gave me  a bogus reason. When I challenged on it, he picked a different bogus reason. It was only when he mentioned that I was receiving a two-week severance package, that I realized I was being laid off.  I also realized that my termination was not his choice, as he offered to allow me to collect my own things from my desk and say goodbye to my team. However, I was too humiliated at that point to want to face my team to tell them I had been let go; a move that goes against typical HP policy. Even though I was given a severance package, my termination from HP was the most humiliating experience of my life. An experience that has set me back both professionally and financially by several years.My overall takeaway from working at HP is that if you like an interactive work environment that provides you with the opportunity to enhance your skills to make you better at your job; therefore allowing you to advance your career, then HP is NOT FOR YOU.  Overall, HP's culture is toxic. Unless you're in management, you're just another cog in the massive HP machine. I haven't worked there for many many many years but it was a very nice environment with a lot of options to grow.  The people and management were great as was the work. Excelente en el campo de tecnologia de servidores y sus aplicativos Great benefits including vision health dental, and vacation, sick and personal time. Worked as a team, really enjoyed that comradery. I left because I moved out of state and I really wish I would've thought twice when I did that! no employee loyalty.  Focus on staff reduction at all costs.  I would not recommend HP as the work life is high stress on big layoffs all the time.  Everyone is thinking when will they be next.  Leadership does not shield the team. Cut throat environment....was never trained thoroughly....14 hr shifts 6 days a week very tiresome job stressful no home life very lazy management unfriendly good food and plenty of choices for a good price, but not nearly enough people or time to clean the place up. Containers often return moldy, and food is wasted. Its a good job with good pay. Travel pay per diem and lodging.  Good supervision staff. All around good company to work for.  With time off between jobs HP provided the equipment, training and mentors that enabled me to grow technically and help me to develop my soft skills. I participated in many projects and became technical lead in a very short period of time. Was part of workforce reduction.  Landed at another company and realized that HP was working me to death.  Zero work life balance.  I doubt I would ever consider that place again Collaborative environment, with work life balance.  Growth potential, co workers focused and ready to help you navigate the upper management demands and culture. I loved the fact that the harder you worked the bigger your paycheck was. The positive atmosphere when I first started and the company events and games we would play. Also the fact that I enjoyed the products and the innovative idea's hp created. I loved that they gave me my space to work independently directly over the phone with customers. There were a lot of advancement opportunities available to anybody that wanted to work for them.  They provided an environment that encouraged employees to improve their skills Great company to work for. Leaders in the field of technology.A+ Certified Technician                                     Nevada teaching license in Computer Science and Electronic Technology. K-Adult. hours were the best 6-2:30, people were nice and helpful.  it is hard to get a full time permanent position in this company, unless you know someone.  manager was very open and honest. A typical work day would have been email and contacting customers to drive completion in projects or project managed tasks.A note on management is there is apparent needs to motivate manager to spend less time discussing and promote trusting and transparent team building relationships, and take time to personally and individually develop their employees with relevant and strength/weakness focused tactfulness. My job experience at HP was often frustrating and, at the end, my contract ended due to my position being off-shored. I would not recommend anyone with serious career objectives to apply at HP. Relaxed environment, with great opportunities for advancement, nice cafe for lunch and dinner. Nice people, its in Alpharetta and the traffic is terrible trying to get there. The management would work with you on your schedule if you needed time for things outside of work. It appeared that HP didn't have much organizational learning.  The same problems were solved over and over.  I would attribute much of this to the churn at the Management level. Responsible for the sale and product design of high end commercial computing servers and software in Illinoisand Northern Indiana. Concentration was helping customers to down size their information systems and movethem to open systems architectureSelected Accomplishments· Developed new territory for Government Marketplace· Managed quota base totaling 1.1 million dollars in volume· Recruited three new software houses to run on the HP 9000 PlatformNCR Didn't like it. It was not a good place to work at, People do not help you out to go in place in life. The mangers will not help out their co-worker or support them. decent place to work good job to help you get started.  only downside is you start out at minimum wage and you have to work there for a year before you get a raise. No review I do not feel comfortable giving a review of this company I have no feelings either way and would rather not make any opinions of the company or management Good workplace , left for old job ,  old job needed my assistance they were in a tight spot and wanted me to return to work to help them out if a tight situation I had worked for Digital/Compaq/Hewlett Packard for 30 years.  The most enjoyable part of the job was doing my work on my own and had been taught what was expected with limited supervision. At the time I worked there HP was an instrument company producing electronics instrumentation of very technical level. Production technicians, at times, had access not only to the production engineers but also to the design engineers. They have a serious problem paying their commissioned employees. I would never take a job again at HP if it has a commission incentive. The revenue tracking system is broken and although upper management has been screaming to fix it, there are still folks who are owed thousands of dollars and although they show evidence of a sale, after months, they are still waiting to receive payment. I learned to build HTML templates in AEM and this helped me position myself to get a more lucrative opportunities. I went to Intuit and worked with Java some more, because I realized that AEM is niche skill with few job on the market. This is asking me to review Hewlett Packard.  That is not the company I worked for or am referencing in my resume.  My position was with HP Products, a janitorial supply distributor. Worked for this company for years with limited advancement. Everything I learned to advance my knowledge was from my own or picking a brain of an individual in a department I was attempting to advance to. I enjoyed working for HP, but since it is a global company, they look for the most cost savings and unfortunately found people in another state to do my teams job for less money. Collaborative environment, with work life balance.  Growth potential, co workers focused and ready to help you navigate the upper management demands and culture. HP is a great place to be employed! The environment is awesome. I love the ping pong tables, and the fact that you can purchase food from vendors from the surrounding areas. I absolutely LOVED HP! I'd love the opportunity to be employed once again.  I never would have left if my father had not gotten sick.  I am at a place where I am definitely able & willing to come back as an employee If offered a position....Currently applying :) Working with Autonomy/HP was easy to explain and articulate based on the product quality. Employees were helpful and the culture was positive. I think a lot has changed since the full HP acquisition. HP used to be a great place to work, not anymore.All senior professionals I knew in HP were replaced by less experienced professionals in order to low company cost. Gave me the opportunity to grow in different areas. It's safe and the treat all employees the same..I would recomend working at hp. I like it. I have waiting a long time for a job like this you enjoy working and learn more and more. HP IT services is a difficult industry and it seems the leadership of HP didn't know how to navigate it very well.  This resulted in a lot of cost cutting measure which killed growth potential.   I would not recommend working for HP unless you can influence senior management to make good decisions. HP did hire from outside which was the very reason at age 59, I was hired at an above average starting salary ($85,000 + bonus) .HP was a very good place to work and I highly recommend it to others in Houston, and Southern California. Compensation was good with stock options.  They layed off 18K employees. I like working for this company. Many different divisions to work for, I would suggest them. never a dull moment. clients can be a pain. also can be stressful at times. i liked that there was always something to do. calls would come in back to back. not much breathing room. Started at HP when it was still a company that valued it's workforce.  Over time, it whittled away at the HP Way until it just died.  So now HP is just another mediocre company with a mediocre culture.  It's not a bad company to work for, but they will treat you like a number, offering few perks, job security or opportunities for advancement and growth. I basically performed administrative duties for a group of 10 ladies. The job was a no brainer and I didn't enjoy it. It was a job. I always longed to have a graphic design job and this just didn't cut it. Work ethics are great and good work culture but pay is unfair for permanent staff.If you start as a graduate you will make progress and go up levels but pay will hardly ever up. In honesty this company called out to me and provided great opportunities for work and experiences! The company is an organized, energetic, welcoming, family of representatives and management! I have no problem with company. the reason I am transfer to ... other by company. I really like HP is strong business I only work there a few years from EDS transfer to HP Arriving for your shift so be on time for work. Get your scheduled work assignment for that day. Attend any scheduled meeting set aside for that day. Be prepared for workplace culture that can be extremely stressful and fast pace. Keeping your mind mentally focus on the task at hand is always important. Also collaborating and showing teamwork within your department and fellow employees. As always the most enjoyable time of the job is when you accomplish and complete the project assigned to you. Working with a good management team makes all the difference. I cannot express more by utilizing teamwork skills to build and restore computers mainframes for vendors and manufactures was very rewarding in gather experience. It may have changed since, but when I was at HP they were struggling to find themselves.  Are they a hardware company, software company, services company, etc.  Each change in leadership brought a new approach and strategy. You can't replace 20, 30 years experience with people who have 5 or less years experience and not have an impact.  Over the years I've seen so many skilled, expert people leave that it has hurt the company to lose them. Overall a good company to work for, they definitely value keeping their employees and celebrate employee hire anniversaries. Benefits are excellent, 401k matching, good health insurance options and HSA. Management needs to communicate and set goals better and ensure good communication between groups and often time is wasted in meetings. Interesting C++ and Dotnet development occurring in Personal Computers areas. HP Inc. great environment and great company to make a career, I enjoy the people that I work with. Company has great benefits to have, company many programs to offer as an employer. HP was a great learning experience a great pace to work Home work Life balance was ok the management was great work place culture the hardest at about my job  sometime the hours they wanted us to work The teams were good to work with in HP.  Workplace culture for the team I was in was very good, especially for the teams onsite with customers.  The respect level for the management was not high.  There was a clear direction to bring in younger staff and transition out older staff; that seems like an unfair practice. Collaborative environment, with work life balance.  Growth potential, co workers focused and ready to help you navigate the upper management demands and culture. i loved being a tech. when i moved to sales the company was horrible, troupe was a moron and i hated working for him he harrassed me and was a horrible boss No comment at this moment because I took early retirement in May 2015 and have not kept up with the company or their future growth.  They have had a couple of lay-offs since I left the company Its the worse place ever to work for, they don't care about their employee, in fact, most of who worked there we made a pack that we never purchase HP product ever again. The original owner wanted to make a difference however that way has gone the offshore of jobs train people to replace you false promises cut in pay because of the economy while the CEO makes millions of dollars.  If you are a young kid graduated from college make yourself a favor never work there. Thank you Very bad company to work for. The pay was extremely low. There was no room to grow, no raises. many lay offs so no job security. Poor management. Would not recommend. Good work place, Okay Time Management Skills, Meeting New People, Making New Friends, Preping Food, Dining Room, Serve Drinks, Interacting With Our Customers. I enjoyed working at HP.  the workplace culture was very good.  The managers were very nice.  The only problem was planning, over-hiring, etc. which caused layoffs. Not to take our jobs to Bulgaria and too many managers in 4 yrs\working from home was great but not meeting each other didn't bring moralNo more For the first 5 years at HP it was good. Was able to learn my job well, got great reviews. But when we moved offices it went down hill. New management, new contract caused a lot of lay offs. Watched many co workers get laid off with no clue it was going to happen. They started out sourcing a lot of positions. Sad really. I wanted to spend my career there but had to leave, no job security. awesome coworkers. •	Responded to customer requests via telephone and email.•	Technical support with customers HP printers and laptops.•	Provide information and answer customer questions about HP products. Am not able to assess current situation. I left HP in 2015 prior to the company split. Enjoyed leading executive communications at HP (Compaq, acquired by HP) for many years. I like working at HP, it's a good company.   There's a lot of good people who work hard to make it all happen.   That said, I'd like to move to cloud sales and that's not an option for me there. Its a great company to work.  Great technology, culture, leadership. Focus on diversity and inclusion. Provides opportunities to develop new skills and grow professionally. Fun place to work. Had many friends while being employed at HP. Still in contact with most associates I managed. The contract work with DoD was extremely interesting and rewarding. I was able to work from home.  The hours were very flexible.  My team was global and was able to handle all our issues over the phone.  Very collaborative environment. Lots of opportunity to learn new technologies everyday and advance information technology skills.. Productive and Fun work place. The best company in many ways to work for. HP is a great place to work. I enjoyed every minute working there. Perfect staff, always friendly. If you want to be a computer support assistant i highly recommended choosing HP. Technical Support Representative is a solid stable job that can be very flexible with your work and allows you to not be stuck in office 8-5. A company car is provided and if traveling to different metro area, overnight expenses are covered. Management lacks clear direction of times on issues that techs go through on daily basis. Slow process to change and catch up. Little career advancement interest shown for techs. I enjoyed working with this company. I gained great knowledge assisting physicians with Medicaid enrollment. Customer service was a plus for this type of work Layed off do to lack of money.Worked 8-10 hours a day.Work place culture - Don't share to much, keep some back as winning points.The hardest part of the job is getting information to do things.The most enjoyable part of the job is the people that you work with, at work so-so, out of work very good. HP was a great place to work.  However, the company is not the same.  The CEO began to beak up the company.  That lead to several  job layoffs and relocations.  Many employees were affected. Today, the company has been broken up into many small parts.  HP Incorporated is still a great place to work based on feedback from past colleagues.  I would love to work at HP Inc I had an opportunity. Collaborative environment, with work life balance.  Growth potential, co workers focused and ready to help you navigate the upper management demands and culture. Its a temp to hire...so I hope I can get hired on full time. It starts as a contract. Working on developing my skills in the network admin field to be better and more marketable. Hp was a good place to work but they were reducing staff  every year,had to worry weather or not had a job every year.Car was a nice option every two years.Plus gas and ins. Was paid by hp A day in the life of a partner champion consisted of being with the reps on the floor, answering technical questions assisting with quotes as well as managing campaigns. The hardest part of the day was not having enough hours to be able to assist all 140 reps. The most enjoyable part was being able to work with the reps Last position  working Big Data on Neo View Data Warehouse for HP financials maintain and controlling a 512 processor system for ETL and Business Intelligence for HP financials World Wide. Overall upper level management couldn't care one bit about the employees. Their only goal is to keep shareholders happy. They make promises to companies that in no way could delivery keep. Too much favoritism. If you not study in University of Mayaguez you dont have the opportunity to advance on your career. Need to do a lot of job or dual role. Obviously working there 21 years was a testament to the great management and peers at HP.  Always a challenge but great opportunities to grow and learn.  It's unfortunate that my role moved to California and I was at a point in life where that was not my number one priority. HP is a great company to work for.  Good people, good strategic objectives to make the world better and support the shareholders.  They expect your best and properly reward it. Large global company with opportunity to grow career across multiple industries.  You must take ownership of your career and advocate for your next growth opportunity. Verifies accuracy of incoming shipments by comparing items and quantities against documents.Prepares items for delivery including acquiring signatures and maintaining Receiving documents.Sign for receipt of product from delivery drivers. Assist in unloading of trucks if required.Sort product and ensure accuracy of product received.Verify product condition and suitability for receipt. Electronically receive product. Use of automated data collection equipment and computers is required.Place product into assigned locations.Bin consolidation, warehouse transfers and restocking from overstock to pick locations.Using picklists or paperless picking tools, select items from stock to ship. Document items selected and record picker number on picklist.Using Picklists or barcode readers, audit picked shipments to verify correct part number, serial/lot number and quantity. Document errors detected on the provided log. Also alert a lead or supervisor if product condition is in question or there is any issue with the accuracy of an order. Enjoyed working at HP.  I moved after working there a couple of years.  About a year after I left the facility closed.  I understood HP provided good compensation packages. busy days always but very nice be busyvery flexible and the best management everworkplace culture is internationalhardest part is learning but you gain lots of knowledge Had the opportunity to telecommute for quite a few years but then was forced back into an office environment.  Telecommuting to me seemed more productive and not having a commute to work and back was great for work / life balance. A couple years after being forced back to the office, our work was outsourced and we all were let go... Working as a consultant there were very Long hours, but there was no opportunity for advancement.The work/life balance was not evident due to the long hours and lack of management support.Director strived on competition and conflict between employees and team Company with strong values and ability to learn and grow.Many tools and resources available to do your job.Some positions require extensive travel HP had a lot of opportunity and you could prompt with in. Its a friendly environment. Manager treated you with respect. Helped you wro with in the company. They value there employees Good place to work and has good company cultures.  Fair opportunity to employee and care about employee to glow in his or her career. Nice people to work with. meh, not impressed.poor mgmt, poor pay. tyrannical leadership. no respect.no empowerment or motivation for career growth.Too many dominant people eager to step on you to look good in their role. The company's split allowed them to restructure and rebalance. It was a great strategic move. I'd encourage anyone in Tech and IT to consider working for HP. I have been working for years without advancement options or raises. Opportunities for permanent hire are slim to none. No new skills are provided. Once you learn the job requirements, nothing else is learned. Most of the tasks are a bit mundane and non-challenging. Collaborative environment, with work life balance.  Growth potential, co workers focused and ready to help you navigate the upper management demands and culture. Interaction with DEV team teaches you a lot about processes and code. workplace culture is not quite but is bearable. Leads are nice, Management is good. HP's client chose to give their IT support business to IBM.  At the time of transition I was offered the chance to move to IBM.  After 5 years the same client viewed IBM performance as so poor that they chose not to renew the contact. I was originally very excited when working at this company.  It quickly soured when I had become overworked and was forced to work mornings and nights with no help.I have complained for months that I need another person to help out with my workload but was told 'Don't worry, you can handle it'This quickly went from a fun job to one I hated getting up in the morning for. I thoroughly enjoyed working with HP.  It is a wonderful environment and my co-workers and managers were all very helpful and friendly. Great company with a lot of growth potential. Its very Awsome company to Work for Hp, In It level its number one company but i’m very much intrested to work for abroad because i like the atmosphere climate over there, If can get chance i’ll give my 100% efforts to the conpany . This i saw in Hp the following points are given below as:- 1) Sales Planning2) Linerity3) Brand advertisement4) Product quality 5) Many more It been a long time, since I worked there. I heard they have changed the company structure. It was a data entry operator job and you have to be able to sit for long periods of time. Great Management, team activities were fun, sincere concerns for their employees, weekly team building meetings, continual training for educational learning skills high turnover, lack of leadership, too much office politics. Things that would take a week to get done at a SU would probably take months or sometimes years here! Good work life balanceGood cultureExciting workPoor compensation with good benefitsNo direction from senior leadershipRegular work force reduction could be demoralizing Typical day at work would be making it to work 15 Min early in order to get started and signed in to my PC. i have learned about costumer service and how to speak and treat users issues. also i have learned how to use the ticketing system service now and also outlook 2016. My work place at Hewlett Packard was very diverse and fun, i often had many great learning experiences with many of my co workers.I Believe the hardest part of my job was that many users had issues that where not able to be resolved right away and the issue was escalated.The most enjoyable part about working at HP had to be learning things that i did not know i could and performing those learning experiences with users. The job was fun but very fast paced and somewhat stressful because you had to build a certain amount of computers during your shift.Also there are no benefits. I work from home. I manage my own pace of work. I have had great managers and terrible managers. I enjoy working globally. HP has given me the opportunities to grown, learn and move into more challenging roles. Prepared my day with scheduling meetings, arranging travel logistics for new hire employees.  Set up conferences outside office.  Planned travel management and itineraries.I learned computer software skills in Excel, PowerPoint and Word, along with database  using Access.The workplace culture was balanced, informative and helpful folks who were devoted to teamwork.Hardest part of the job was gathering information from members for travel logs at times.I enjoyed my job at HP immensely.  I loved how helpful and kind the employees were. I had several positions while at HP.  I loved working there and wish i could go back.  It was the best company i have ever worked for and if we had not relocated i would still be there. Always learning something different about all prototype equipment.Everybody ready to assist with any problems.Work can go from relaxed to has to be done yesterday. . Very unstable company at the time. You would come to work and they would ask for employees to go home because there was not enough work. I believe this was right before the Compaq merger. good learning experience and if i get a chance, i will work again. the mgmt was good to work with. It was close to my house and work pace was pretty nice I worked for very busy managers resulting in long days so getting paid over time made it work the while especially getting home late and not being able to have dinner with family Great job just wasn't organized and sometimes a waste of gas when there was no work .............    So we got sent home alot and then they started laying everybody off Fun place to work you learn alot and can balance work and outside of work very well I had a nice time working for this company I would recommend anybody to work for this company Collaborative environment, with work life balance.  Growth potential, co workers focused and ready to help you navigate the upper management demands and culture. Typically work 8 hours a day. Help GM (IT contract with HP) employees, contractor and vendors either over the phone and remote in to provide technical help. Overall a good companyGood benefitsGreat health care InsuranceLaid back workplaceGood managementGreat people to work withVery nice work campusGreat paid time off HP has been a very supportive company.  Learn BA skill and C Development skills.  Co-workers are willing to help. Family oriented Management is fair.Dealing with difficult clients. Working on successful projects from start to finish. Benefits where a little below average (satellite company), but with annual cut-downs and lay-offs it was hard to know if you would have a job 6 months down the road... I saw several (very good) people leave for this reason, while a number of under qualified people stay as they could not find work else where. Company provided many outlets to grow professionally.  Supportive, hard working, and high expectations motivates employees. Employees work hard but are benefited from working hard. The internship program at HP is well organized and purposeful. It helps interns improve their skills, face challenges, make decisions, and explore career options. While completing real and important tasks for the company. It is fun and exciting to be a part of and pays well. I loved working for HP. I liked the fat that we can choose the hours to go to work. I have the opportunity to work at multiple stores which was a really good experience. Management provides the direction, and the employee is given a lot of autonomy to achieve the goal. Possibility to work from home. Working at one of the campuses was great too. Open-door policy with management. HP was fine until they reverted to wanting everyone in the office when it really did not make sense.  If not for the poor work lifwe balance I would have still be with HP. As a general agreed upon rule 6-8 calls per day is about any ones limit. These calls are usually dispatched to you the previous day. We then have a daily morning meeting to dispatch more calls even though you are technically full. I am not able to say much about HP. I was outsourced to HP from Citigroup and all my job responsibilities stayed the same. After 1 year with HP they laid off all of the Citigroup employees. Great place to grow and advance. I enjoyed and respected to people I worked with. I was a field tech that provided both onsite and remote trouble diagnostic and problem solving Not a position for a career or long term employment.Large amount of employee over. Training is provided but, slow on giving information on benefits. I was recruited to work as a chemical technician at HP in Corvallis this spring, and then I was laid off three days after I started because a big ink order was canceled. I was not given any notice at all, and the manager did not tell anyone on the team I was working with. This happened even considering that they had me leave my job in Portland, and move down to Corvallis for them.        That being said, it was fairly good introductory pay, and they did provide a good benefit package. If I was laid off in a more normal manner, and after a more acceptable length of time, I would probably have rated them four out of five stars overall. The only down side to working there is that not all employees are treated the same, as sub-contractors are arbetrarily barred from working on some projects, and there is essentially no chance for a sub-contractor to be moved to a normal HP employee.      They will also very frequently lay off sub-contractors. (A former associate of mine remembers them laying off 150 people at once)     Overall, I would not recommend that you leave a full time job in your field for a job at HP. The job there will be a good one, but they have a bad reputation for very frequently laying people off. (Unless you take an internship job. Those positions are how they hire regular (permanent) HP employees). But if you are unemployed, or have a random job that does not advance your career, it would probably be worth taking a job at HP, as long as it is not too expensive to move there. What happened to me is probably pretty rare. I enjoyed my 2 times working with HP the management  was a great experience, i wsa promoted after 2.5 years and really liked my new position and relationships i made with the customer. Challenging and busy but not stressful. culture is amazing as the people are very kind and accepting and willing to mentor you and teach you about their fields of expertise. Only way to grow@HP is to transfer out of your job and work you are good at, to find some other parallel group that would provide a career advancement opportunity, without little experience in the workings of that group, somehow hoping that this would magically fall into place with relationships build over time. it was a contract job and only hire contract workers, without benefitsit is 2 yr assignment work 37.50 a week. A lotof days didn't an work/slow which meant going home without pay. Excuse they would pay for 2 hours for showing up for the assignment. They did a great job of keeping employees happy. Great benefits and a lot of overtime. Management made sure everybody was happy when working there. Had to leave because of layoffs. Worked directly with marketing director. Travelling 2/3 times per week. From choosing locations, budgeting of trade shows. Very fast pasted interesting work. Collaborative environment, with work life balance.  Growth potential, co workers focused and ready to help you navigate the upper management demands and culture. Trust in the employee, many developmental opportunities and the people really matters. They allow flexibility regarding working hours. I love working at HP. Its  a good place to work, culture is diverse, people is nice, flexible working hours. Implement changes slowly, the market that company works is not easy. Forced rating system for review. Someone will get screwed during the review process. You are told to only worry about you can control, but if you're working with outside companies and they can't meet their obligations you get the blame. hp has basically become a call center and the culture is as such.  the pay is good but what really goes on behind the scenes is horrible.  mute button is your friend and the lack of customer empathy is real and terrible. it was a fun place to work we had a good group of people but they went out of business we did wen hair products and proctive makeup we had to look at the dates to make sure they weren out data we had to wear hair nets and beard nets Was a nice challenging job. Worked with the CSG Group and did reverse engineering. Worked with large accounts and did contract retention as well. Enjoyed the job and would do it again if it still existed. All work no pay. HP cut pay across the board multiple times. Also , changed workers job titles so they could pay them less upon acquisition. I would avoid HP if possible.. Although I haven't worked here for over 12 years, I worked there for 20 and I enjoyed the growth.  They offered ongoing education, I felt I was respected and would highly recommend working here. Worked closely with team-members and level II & Engineering teams to diagnose and improve product and support. Company was professional. I enjoyed working there. The management is very attentive and helpful. They are constantly promoting some fun activities.  They have a great culture and listen to new ideas no matter the position. consisted of many meetings but was a 'boys club' with little to no advancement for women.  Culture supported advancement for men, recognition for work performed by men. Worked at HP twice for a total of 8 years.  During that time, I met several top notch people who were driven and very professional.  I would recommend working there, especially if you're looking for a long term career opportunity. They were laying off people 20 and 30 at one time as the layoffs continued I was doing the job of 5 people with no raise. I decided it was best for me to walk away. Arrive at 6:00 am or so to get ready for the days meetings Prioritized work according to which person/group needsHow to work in a multi component environment HPE is great company to work since it give great opportunity to work in new technologies.They provide flexible working hours and help  main good work life balance.They provide option to work from home.It has lot of resource to enhance our knowledge.Management is very supportive.I learned different culture working with global team.Enjoyable part of the job is maintaining good work life balance. my actual job was really easy. replace parts. troubleshoot issues. order more parts and communicate with the customers. The only real issue is that HP claims they are a leader in the IT field however they pay like they are at the bottom rung of the IT sector. Also my manager likes to micromanage as much as possible. It wasn't a bad company to work for; it's geared more for individuals straight out of college. I just felt like I was never going to go anywhere and decided I had to pursue other companies. Strength of the company is in its employees and their willingness to work as teams to generate positive results.  The employee teamwork has been declining as senior level skills are being let go for less knowledgeable entry level employees. Honestly there isn't much to say regarding the company and the culture. Everything was great. My only bad experience was with a single manager who took over after my previous manager was moved. He sucked. I loved working here and the advancement potential was great until they laid off thousands of their team. I was making great headway with prospects and their leadership. CIO levels. Collaborative environment, with work life balance.  Growth potential, co workers focused and ready to help you navigate the upper management demands and culture. HP can be a great place of employment depending on which department you work for. Management varies so it all depends. As far as my own personal experience I felt HP was just a stepping stone to bigger and better things. I had a great experience with HP due to my manager but not everyone had the same experience. I was not micro managed and enjoyed my position. The corporate changes were hard to work thru. You never knew if you were going to be the next one laid off. Good opportunity, helpful management. The work culture is good and the staff are friendly. The hardest part for me was the commute to work due to high traffic. Transformation overtime blurred company Vision. Multiple management changes and not so smart strategic decisions, transformed a great organization into an acquisition target. While at HP/HPE the company worked closely with the PM's who were seeking their PMP to attend classes offered by HP peers to assist with the under PM's before taking the PM Exam. Very Helpful.The Hardest part of the job is dealing with the lack of resources in numerous departments to complete the assigned jobs on schedule and within cost. The environment is very hands-off by upper level management and growth potential is possible, but may not be as visible in the Houston campus.  I was a contractor, so these were not as available to contractors. Long-term employee over 15 years.  Laid off in 2012.  HP was a great place to work until the early 2000's when multiple CEO's and executive management turnover was rampant.  No clear guidance on company direction. ProsQuite relax place to be, you learn at your own pace, salary isn't top of the market but it sure is above average. HR is great and they have respect for any ideology.Several important benefits, and you get to know the top of IT hardware in the market.ConsNot to challenging, the part of following defined process was taken by DXCThird level management and above changes more frequently than what it takes them to understand the businessAdvice to ManagementDefine detailed processes for each department, and the interaction of each department with others. While there were clear deadlines that needed to be met the atmosphere was not one of micro-management. You were given plenty of leeway to plan your day and complete your tasks  at your pace in your own way I accidentally put HP, but when I worked, it was a company that HP as a client.  So, not saying much, HP is very thorough and meticulous about their troubleshooting process and business procedures, and news updates.  It's a great position if you have a knack for technical support, but you have to follow the guidelines that were laid out above.  If you don't, you won't last long.  I did because I followed the instructions to a tee. HP provides tremendous ethical and business and technical trainings.  It is a well balanced place and I have learned and progressed though my career to become an effective leader. It was production work and the company treated it's employees very well. Had a great work environment and food service, and great break environments. Communicated, trained people well. Had advancement placements for employees to advance to. HP Enterprise Services is great if all you care about doing is patching systems and marking incident tickets as fixed with out providing appropriate RCA. There's no interest in research and implementing quality solutions using great technology. Avoid at all costs. Great Company! I worked at HP for over 4 years. Each assignment was challenging and extremely rewarding.   One of the opportunities included the ability to meet upper management and discuss career goals. the job was travled alot and seen many diffrent areas as well as met alot new faces if it wasnt for relocating i probably would have waited it out and seen what became of it Working at HP requires that you work independently without supervisor or manager by your side. They expect you to do your job without any help. You should be able to read and follow special instructions to perform your job. Great company, flexible hours, good pay. Company has great vision and dental plans for full time employees. You get to make your own schedule or work around the schedule of your client still leaving time to handle your own business and be home to have time to prepare and meal and spend time with family. Very political. Networking was more important then product focus. Merit based rewards were non-existent. The more talent you had the more others resented you and tried to undermine your credibility. the CEO was more interested in pleasing wall street then creating innovation. CEO missed every major technology: cell phones; fitness tracking, Linux, public cloud etc. Days are busywhat I learned - failure analysisManagement is not kept in checkCulture is goodhardest part is being let go under false accusationsenjoyable working with new tools and different culture's There were generally good opportunities to grow and advance in the company. The work was rewarding because leaders encouraged employee ideas and solutions. Collaborative environment, with work life balance.  Growth potential, co workers focused and ready to help you navigate the upper management demands and culture. HP was a great company to work for, endless opportunities across many product lines.PreSales support, technical support, helpdesk and Onsite Customer Engineer to name a few. HP was a great place to work. Skills were regularly being refreshed. The environment was casual and relaxed. Pay was great during that time and advancement was available. I loved what I did at HP. It was a great place to work. I did many things there and learned a great deal.I had the chance to work in many different towns for HP. When they asked for someone to go to other plants I did I enjoyed learning many different jobs. I worked in the Americas HP Indigo Supplies Business, as a Process and Capsbilities Mgr. II supporting the Manager, Supplies Business. It was a fast-paced operations environment, that required a great deal of cross-functional collaboration, and times of significant stress reporting out to senior management. We reached our goals, but it seemed like it was always not quite enough to enjoy reaching the last goal since the next goal was always in front of you on a stretch basis. A typical day required approving customer supplies contracts, developing special one-off contracts, monitoring growth in business activity, evaluating large customer growth prospects, supporting the sales force, reviewing operational and financial metrics, and working systems and developing management processes. lots of opportunity if you took advantage. Left HP with far more than I started with. Travel opportunities and good people to work with made it a nice place to work Enjoyed my tenure at HP.  Offered growth and advancement.  Great team of people and great company.  Hope they continue to do well and can make it through the next transition. Customer Service and Inventory Control. Answering phones and tracking shipments and inventory.  The management and the workplace culture was very good.  I enjoyed the awesome teams I worked on. I had a great time interning at Hewlett-Packard. There were a lot of opportunities to work with the latest technologies. I learned a lot here during my time at HP. Worst Place to work.  You are just a resource like a laptop or a door stop.  There is no employee Development .  When Management makes a bad decision the Team pays the price. Mass  Layoffs, due to  HP Leadership bad decisions. Leadership continues with impunity and the Employee who actually is the product suffers in layoff.  HP is a terrible place to work and poorly lead corporation in my opinion.  Armatures in Sr Leadership that get the benefit of the doubt  and immunity to their mistakes  while throwing their employees under the bus. bottom line company. upper mgmt mostly worried about their own job security.  again, no long term experience as contract lost to lower bidder shortly after my hire. good work life balance, great management team, informative training,  peaceful work environment, pay should be better, and remote position convenience, Started my career with Hewlett Packard and it provided me with the skills to move onto other position.  I worked with HP until 1995 and the HP Way is the best way in the world. EDS was great before HP takeover.  The managers are not committed and throw you under the bus the first chance they can to save their job.  Lack of respect in the culture. HP was an amazing company to work fro back in the day.   Now it's a shell of it's former self.   Between bad M&A's, CEO scandals, proxy fights, spin offs and the general employee morale that was awful when myself and 55K employees were laid off.   They use you, chew you up and spit you out and make sure the door doesn't kick you in the butt on the way out.  Layoffs are a dime a dozen to HP. Contract work is not a 'foot in the door' for permanent job, rather it is a stop gap for cheap and easy labor without obligation for benefits.  Team and management culture are great but conversion to permanent employment isn't supported. The working environment is very friendly.Company encourages self-training, sponsor taking courses to improve yourself.The culture is good, occasionally innovation event. Worked for HP for many years until a workforce reduction.  Management and work environment changed drastically over the years.  Was for the worse.  Good people let go.  Bad people kept. Autonomy's CFO embezzeld 70 mil right before HP bought the company.  HP quickly sold the company off once HP realized it was a bad purchase.HP is a great company. I was sorry to leave but I could not handle the Director from Auntonomy who hired me. i can only say i would be an an asset to the company wherever i am.i love to accept new challanges and always tried to learn every side of business. Love to  help others . Not many people can say that they've achieved their dream job. Working at HP and becoming a Senior Account Executive was my dream and I loved it. It was especially productive before the Compaq/HP merger in 2001. Collaborative environment, with work life balance.  Growth potential, co workers focused and ready to help you navigate the upper management demands and culture. I was able to learn about newer technologies like data piping and alternate options for data storage and processing. Also learned a little bit about cloud development Nice work life balance. Allowed to work from home from time to time. Especially if you had doctor/dentist appointment like appointments. Their benefits are very good. sitting too long, not able to get assistance when needed, not able to take breaks long enough to stretch your legs or eat a good lunch and enjoy it. not really able to collaborate with coworkers. Overall good work experience with the company. For the most part the management was approachable and easy to talk to. The hardest part of the job is siting for long periods at a time and the most enjoyable part of the job is meeting people all over the world. Management does not do a complete a thorough background checks of their current employees, creating a bad and difficult atmosphere to work in. Does not give visibility to its own employees of positions being opened , not even locally. Poorly managed company. Not a people friendly company. Not a pay for performance company. Most HP employees felt under appreciated, overworked and under paid. It's not a problem with direct supervisors. Head of HR sue tubbs is drunk with power, and screws hard workers over, so she can get her fwb's jobs. If she's not there anymore, then it'd be a good place to work. Once a great company, it is undergoing change and remains to be seen how they emerge. While I was there a good place to work with predictability and routine. HP was a good entry level position, but facilitated an environment that would put it's employees into mind-numbing routines. It also took a lot of time getting the newly hired resources placed into projects. The job I did was a contract involving multiple customers and different environments.  Lots of opportunity for movement in the company and seeing all of the state of NM.  Company is very active in the community support multiple charities and different events. I enjoyed my 28 years at HP.  It was a great place to work up until the late 1990's, and then it was mismanaged.  HP helped me obtain my college degree. Overall great company with lots of room for advancement.  Company values it's employees and their contributions to the company focus. Benefits and overall company culture are a key benefit. I traveled every week, it was fun to travel to other countries, but the time away from home and family didn't balance out.  Being single and doing that job was ok, but not for someone who was married. Listening to people talk about how the products are causing them harm or how they are no longer able to afford to keep getting the product. Trying to retain them as customers. Hearing how they are closing accounts due to the family member dying. Its is heart wrenching. When I started at HP, I felt secure in my position and the possibility of advancement.  As the years move on, HP began a long-lived cycle of workforce reductions.  This cycle changed the atmosphere of everyone at HP and caused the morality and innovation to decline quickly and dangerously. From day one at HP, I was welcomed into the HP Way. Regular sales training was great and management encouraged open communications. Typical day would be calling on prospects. •Prioritize and take ownership in projects to maximize financial results and the goals of the company•Perform in depth reviews to analyze variance to forecast, budget and prior year in revenue, operating expenses and capital expenditures.•Prepare, communicate and clearly present formal budget presentations to management. Your experience depends on the team and management you are under and work along.  The environment can be relaxed and fun but there are some that do not work well with others.  Some are more strict than others. Great room for improvement Got a lot of info and knowledgeOverall rating Job Work/Life BalanceCompensation/BenefitsJob Security/AdvancementManagementJob Culture Only worked for HP a couple years after they bought our company.  transition was smooth and culture aligned well. In the time I was there HP had not really ingrained themselves into our area.  Overall I believe HP feels they are much more agile than they really are. Turn the teams loose and much more will be accomplished. Not worth the hassle. Overworked underpaid and managemet was the worst. They were very ureasonable with there expectations. Everyday was a disapointment Collaborative environment, with work life balance.  Growth potential, co workers focused and ready to help you navigate the upper management demands and culture. HP provides all there employee with a great work/life balance. I truly enjoyed working for HP and learned many different skills during my 7 years there There were times when I needed assistance in solving issues, the team i worked with will collaborate on how to resolve the issue. This was an everyday occurrence. I loved working for this company because it was like being with family. Even reaching out the the facilities and the staff was easy to obtain any needed information. Contacting the health plans customer service teams was fun as well. The hardest part of the job was for it to close down. I learned how to process claims via Medicare live and read the different types of portals for different hospitals in other states. 'HP Way' is the tradition for Hewlett Packard.  Everyone who worked there were very proud of it.  It is one of the best companies in the Silicon Valley! There was a lack of information and process that I needed to get my job done. In hindsight though I learned how to be more vocal and clear about what I need.Other teams did not seem to have this problem so perhaps it was just isolated to my team. Monitor, maintain and repair when necessary production line machinery. Teamwork oriented environment. Work under minimum supervision.  Great benefits. Working at HP was the highlight of my career. They worked us long hours, but I enjoyed my team it was like one big family. I wish the job would have lasted longer. Great company with great history of innovation and leadership.  Fantastic company to work for and grow.  Great people culture and leaders walk the talk. Coming from the founding culture of Silicon Valley HP has morphed so much over the past decades and struggles to find its place. It has gone from being a a place with a strong, achievement and people oriented culture to an also-ran in the computer hardware market HP was a great place to work. The position I was in provided a lot of opportunities to learn more. There are lots of opportunities to advance, either as an individual contributor or move into management roles. A very nice place to work at with awesome management and great benefits. The culture allows you to learn and grow at every turn. If you are looking for somewhere to stay for awhile, HP is a good choice. The management was easy going, but seemed to not really know where they're heading. Great facility and work environment. Most employees are a bit more veteran than the industry average. HP is very laid back but at the same time the company expect for you to still mingle with your team, which isn't cool sometimes. I did like working at HP and i really like my manager because he has a heart. But the company tries to load you up with too much work for a small pay. I did feel like at times I was being used and not respected for the amount of work I put in. I also felt I wasn't appreciated enough for my brainpower and great skills. I couldn't grow at the company and there is no job security. If you like working 50 to 60 hours a week at a small pay, HP is for you..But I still learned a lot... It was a great place where our section worked as a team.The hardest part was the reorganization.  Several of them and it was so difficult for everyone. HP culture and environment provided me with such a different aspect on working. They had a positive reinforcement on work-life balance that encourages you to focus on yourself and develop your career.  Their internship program was a great way to network with a variety of individuals on so many levels. Loved the job, but didn't get much of a pay raise. My manager and co-workers were super. Upper level management was in constant flux. The CEO was fired after he let so many techs go. Selling at HP for 27 years was a very challenging and rewarding career. Every day was different in dealing with many customers and partners providing a multitude of technologies and IT business solutions . Information Technology changes and evolves on a fat pace almost daily basis. Therefore, continuous training was required in order to stay up to date with new and changed technologies HP employed some of the best technologists in the world  and the internal  culture was very open and collaborative. One of the top technology companies in the world. A great place to spend 27 years always learning and growing, Happy about half the time, but not much opportunity to grow or be promoted within.  Excessive workload and lack of alternative opportunities, and coaching/mentoring by management. When I started with the company 30 years ago, it was very a very employee oriented company.  Now a days, you are always looking over your shoulder for the next work force reduction. At the time, HP was undergoing massive changes including a merger with another corporation.  As a result the culture was in flux and the pressures for performance were changing, as well. Collaborative environment, with work life balance.  Growth potential, co workers focused and ready to help you navigate the upper management demands and culture. great place to work.  opportunities, but no job securitythe people are great.  networking is very organized. Upper management cares more about selling stock then their product. We were a purchased company for HP, they had no clue what to do with our organization and eventually sold us off.  However, I think leadership there was good, and they respected and compensated their employees. Lots of autonomy and there are some great people to work with, but declining business makes job security tenuous at best and many personnel decisions are taken out of the hands of local management. Worked for HP for a long time and it's changed over the years  - it's just like any other company unfortunately.  They're focused on hiring millennials and getting the older workers out. The position of an outside sales representative was exciting and challenging .  I trained on all computer products, I worked with B2B, and enjoyed every minute of it.I attended and participated in computer shows and often manned a booth. Management and pay is not very good. Long hours for very little pay and bosses are difficult to work for. Would not recommend this company to anyone!! HP was under a major transition when I worked for its software division ... in 3 years we underwent 2 structural changes that ultimately cost my job. I mostly worked as a contractor during this time period. Great place but very fast paced.  Break rooms on every floor.  Always changing things but no one tells you.  You basically find out for yourself.  It is an older building and it floods in the garage so dont park in the lower level. Working for HP was a beneficial experience for using my skills and developing them further. The teams were fun and the managers were excellent at motivating without belittling. I dnot want to feel nostalgic, HP was a nice place to work. Now we need the innovation that are going to secure the company future, let ''s get back to an innovative company. HP lets you work at your own pace. There is no pressure to complete a task. You are rewarded for jobs well done. Benefits are amazing. The people all work as a team with everyone contributing.The finance department can be stressful at times, but the challenges are very rewarding. - Typical day at work typically involves meetings and follow through on action plans.- What I learned : Computer manufacturing and process.- Management is described very good.- Workplace culture is above average.- Hardest part of the job product qualification and testing in Far East countries.- Most enjoyable part of the job is travel, domestic and international. The HP culture of yesterday is what made the company a leader in its industry.  New management and the drive from the market has led to that original culture evolving to it now being one without distinction. I had a great time with my first 'big girl' job at Hewlett Packard. I still keep in close contact with everyone who was on my team, especially my manager. Overall work culture was good,this helped in balancing my family and work. I learned winautomation, vbscript and UIpath I learned time managementWork culture in office Working at HP was challenging in a great way. If you stayed focused and willing to take constructive criticism, you couldn't help but grow. Altho the company has gone through many transitions and changes, it was a great place to work. H.P. was a great place to work for.  The job was highly detailed and specific.  The benefits were great and there was room for advancement and higher education. Learned a lot in HP. Really enjoy the working atmosphere there. There are too many people who are involved in the decision-making process, or at least want to have his/her voice heard, which led to way-too-many layers of management and slow in execution. My time at HP was memorable. I held several different positions so the opportunities were unlimited and very exciting. I increased my skillset tremendously.  I loved working for HP. My typical work day started at 6 am because I worked with a global team in many locations. I spent most of the day collaborating with team members and completing required documentation after 5 the same day. I enjoyed working with the many people as they were talented and worked to achieve the same goal. I was able to grow and expand my responsibilities based on the services I supported. There was many times I did multiple roles since the offerings at times did not have an available offering manager. The hardest part of the job was being able to work with leadership on budgets and roadmaps. They were entrenched on top down estimating and did not understand the resource constraints. Collaborative environment, with work life balance.  Growth potential, co workers focused and ready to help you navigate the upper management demands and culture. Outstanding leadership and rich culture demonstrated throughout the organization, top to bottom. Large company benefits with a small company entrepreneurial feel. I worked for HP going into my last semester of my Bachelors degree and for almost a year after graduating. The team I worked on was located all across the USA, and we interacted often with counterparts in Europe, India, and South America. I learned a ton from my experiences working remotely, and would do it again if given the chance. The culture was relaxed in regards to work/life balance and office attire, but also demanding in getting work done correctly and on time. I was sad to leave the company, but needed to after moving abroad to begin a Master's degree. Management played a vital part in day to day activities.  Everyone were team players and assisted where they could to complete tasks.  HP also had great benefits. I started out as an outside consultant working at HP in the area or Project Manager taking over a major project which was not progressing.  My experience working in operations allowed me to cut through the skepticism existing with the developers and allowed us to work together as a team to implement the project.  After a period of time went by I was converted to a full time employee and given additional responsibilities in the areas of Critical Incident Management, then Problem Management, Change Management and assisting in Configuration Management duties. I had a good experience working at hp the people were great to work and management was the best. I loved the hrs and the work was not stressful the environment was great I was production floor, as a contractor. This was some time ago, but they rarely, if ever, moved contractors to full-time positions. Overall, I enjoyed my time there. Lay offs yearly prevented ability to deliver upon strategic goals.Exec leaders are not always transparent with company direction related to yearly cost cutting. Became an HP employee via acquisition.  Poor merger, poor planning, no idea on how to integrate.  After 4 years, the division was spun off in the HP\HPE split and was jettisoned to HPE.  Again no raises, multiple & continual layoffs, followed by being spun off in the HPE\CSC spin\merge that created DXC Tecnhology, where the no raise and continual layoffs are occurring once again HP has sold off some of the most profitable areas and have downsized the rest to attempt to compete with other hardware manufacturers.I no longer carry HP stock as the CEO takes a bonus as the company dwindles. I have no input to give this company was not a good place to work for but management was goodThey expected you to save far to many orders and couldn not be done due to was answered by another center that messed up order Give us your opinion about A typical day at work, what was learned management workplace culture the hardest part of the job the most enjoyable part of the job Learned to build circuit boards and work fixing or putting together printers. learning about FIFO with how the boards and printers were built. Concept stuck as to how that works. Typical company but has lost much technical prowess in the last few years due to unstable leadership.  The executive team failed to propel the company as a technology leader. A typical day of work at Hewlett-Packard usually included very stressful conference calls with corporate managers that felt it necessary to be abrasive and rude to lower-level employees, along with trying to figure out how to accomplish supremely large tasks with minimal staff that have little to no experience.  But the job would have been decent if it wasn't just a terrible work environment.  Guidelines and rules would be set up and established firmly by management, only to be bent and then broken just days later by the same management.  If you weren't willing to 'play ball', you would become the office pariah.    So the entire facility had dirty little secrets everywhere.  Tasks and jobs were being completed in ways that were definitely not established or within the guidelines that corporate stated that they strictly maintained.  Yelling from coworkers was a daily ritual, to the point that some of them could scream in your face without recourse.  As long as they played ball and watched each other's backs, they were free to partake in any job activity in any manner that they wished.     Gossip and nepotism were two more of the many problems this facility had, and it became so overwhelming and so aggravating to many employees, that a vast majority of them have simply resigned themselves to working the minimal amount of effort possible until they could find another job.  There was and is no changing how this company works and how they will continue to operate.  They cycle in new employees to use them up as quickly as possible and then kick them out.     Don't think  that you're safe as a senior employee either, as massive layoffs of lower-level employees are common.  Several employees of 20+ year of experience each with HP were laid off in a single blow.  The corporate office decided that they would outsource a massive part of their workforce so they could hire from a third-party company instead for minimal costs and minimal training.  Just don't tell the customer! Fun productive place to work. Fast Paced, learned a lot about the industry. Can be a bit volatile at times, we had 3 CEO's in two years. Management, isn't always as informed as I'd hoped. The company only hired their friends for inside jobs. They were very bias. They picked and chose the favorites. Overall it was not a friendly place to work.I felt like it was a cult. HP was a great place to work. I worked as a contractor; therefore, I cannot comment to the benefits.I cannot tell any thing else about this company, as I stated before I was contract only. Bulk of my career was here and I enjoyed working with my managers and teams.  Work was hard and demanding but we suffered the long work nights together.  It taught me the importance of hard work ethics and the nice rewards received from it, stock options, etc.  It was a nice time to work for this company. Don't know how it is now to work there though. I worked there before the split into HP Inc and HPE, but I loved that it was a very casual environment. My coworkers became like a second family to me! It was a great first job after college. Great place to work! Gives you freedom to explore and open for discussion. Workplace culture is very independent. great mind and manager gives you opportunity to challenge. Collaborative environment, with work life balance.  Growth potential, co workers focused and ready to help you navigate the upper management demands and culture. HP's new mantra says it all, Re-invent. Many of the most innovative people in the company have left due to the lack of support for innovative ideas. Everyone likes to be safe and comfortable doing what they have always done. Not great for being world class like HP once was. New culture is to buy way into markets and not invent organically. Who wants to re-invent the wheel?The best part is there are still some good people around. Good company to work for.  Excellent atmosphere. Advancement opportunities. Good managers. Contractors need to be hired in full time. Cutting edge in blade servers. Clean environment. Room for advancement if you apply yourself.  Great benefits and working environment.   Exceptional leadership and feedback to assist in excelling in every aspect come in to work to a operating linealways competing with other line to see whos does more productionsupervisor were great and getting down into the line Depending on management there can be flexible hours and working from home.You could also participate in training if you could find the time.The culture was bubbly but I'm not sure how it is today.The people were great. Contract position through apex systems.The contract did not last long and the pay was average.It did allow me to get a top secret clearance though. Decent job Well, when I was recalled to Active Military service, HP paid me like I was still working while I was on active duty.  They helped me in many ways with that.  The hours you set are based on your life needs.  I had no complaints at HP. Fantastic place to get hands on experience and learn marketing at the highest level.  The company went through a number of high profile mistakes but the vibe was always positive. My experience at HP was outstanding!  The job location at the General Motors Plant in Janesville, Wisconsin, provided me with unlimited opportunities to increase my knowledge in several key areas, 1) hardware/software, 2) scoreboard development/presentation, 3) inventory database management/tracking, 4) metric development/tracking, 5) project management/tracking, and 5) diversity skills from the daily interaction with the GM customers and HP co-workers. Company shut down in Arkansas abruptly. Moved our jobs to India to save the company money. Gave us a severance and other resources. Outside of that it was a nice environment to work in. I enjoyed my experience at HP. It was an amazing learning period for me.I'll love to still work for HP if possible.If the opportunity comes, I will certainly jump all over it without hesitation. Resolve all reported Incidents involving Blackberry Enterprise Server, Process all change requests and new requests.  Take part of weekend upgrades, patches and any security vulnerability. Always over achieving company SLA's in a fast paced environment. Great team and Open Door Policy.  Hardest part of my job was experiencing job reduction and seeing all team members being separated and ultimately I was the last person in Department till services were rolled over to new department as HP lost the business. Overall, the company is pretty decent.  Some management is right there in the field with you, others you'll never see.  Job security is a real issue though.  You're always waiting to the axe to fall again.  I survived three mergers before being laid off the first time.  After completing a huge project where our team was constantly traveling, we had yet another layoff.  It seems the upper management doesn't look at the people they're letting go, you're just a number. You counted the days as to when your job would end because they were moving all of their jobs oversees. It just wasn't a good place to work any longer. Manager was terrific and the employees that I interfaced with were professional and helpful. Meetings were kept at a minimum and process and procedures were closely followed. Great place to work but a shell of it's former greatness.  Organization had been riddled with shrinking market and poor decision making with M&A activity.  New leadership has refocused the organization and moving forward. Established Global company with cultural diversity; Data-driven organization is the current goal which provides for predictive modeling to drive the DaaS engagement. I loved the people. I thought I would mostly be doing tech support but it turned out to be more sales. Overall I just didn't like that different leads told you different thing to end a call while on a call. Great company, i missed working there. Company treated employees well. I had good worklife balance, everything was very organized.I seldom had to work crazy hours. GREAT COMPANY!!! Would definitely work there again. Good progressive upward  mobility if you are in the right location (such as the East coast or California). There are many possibilities but like any large company, hiring and promotions depend on the economy. Collaborative environment, with work life balance.  Growth potential, co workers focused and ready to help you navigate the upper management demands and culture. HP was a great company until the last decade.  Management started being hired from outside of HP and the culture was last as was a lot of the employee enthusiasm to make the company great.The company has split and change to the point that I really don't feel qualified to evaluate HP any more. HP culture was crumbled due to acquiring of companies with corrupt management. Job opportunities were given to management friends relatives or certain culture driven by the white house. Great place to work with flexible work hours. Little opportunity for advancement. Not much interaction with the person that creates the performance reviews. No training provided, always same excuse no budget. Management keep changing, no stability. No job security, Company always looking for cheaper alternative, the day they found your replacement, you are WFR on hours notice. HPE/ HP schedule flexibility is the best attribute. Everything else is below average. Pay, facilities, advancements, benefits but I must say HPE new CEO i working on improving the culture so hopefully some of those improvements will help make HPE the great company it has been known to be in the past. It is a good company.  There are a lot of interesting technologies.  Business process can be enhanced.  People is great.  Commute is bad from where I am driving from. HP went away from the 'HP WAY' a long time ago. It is a shadow of it's former self. Despite that, HP is still better than most companies. Pay is way below the market. Work is rewarding. I truly enjoyed my time at HP. Some of the best people and management that I’ve ever worked for and with. They definitely care about their employee, and are truly open to growing your potential. Deliver exceptional results and exemplify Company values while delivering these results. Was are viewed as a role model by others. Made significant contributions that deliver broad and positive impact to the team and organization. Performed at a highest level relative to my peers. Had an active career development plan in place and and had opportunities for rotations,promotions, and development programs I worked remotely giving me the freedom and flexible schedule I need for my personal life. Pay was acceptable and the benefits were comprehensive.  My direct supervisors were very fair and helpful. Opportunity to learn a lot.  over-reliance on Excel.  Lack of investment in BI tools.  Good place to work.   I'd gladly work there again if I were still in finance. Loved working there in its heyday.  Looked forward to going to work every day.A typical day of work involved discussions on solutioning Learned Management training.  How to train managersManagement at my level was very intelligentWorkplace culture was easy going The hardest part of the job was lay offs The most enjoyable part of the job was giving out annual bonuses During my time at HP, I held many positions each one building on the last.  WLB was great and I believe my job contributed to overall company performance I've not been in the HP culture for the past two years, so not in a position to speak to what goes on now.  In the pass however HP was one of the most sought after companies to work for and had a personality that was second to none, I've enjoyed my time there. Working with cross functional teams. M&A is a very dynamic and challenging environment where you are giving the opportunity to put into practice a wide number of skill sets. Most of my career advancement was at Hewlett-Packard.  I wish I could work there again, however, it is now based out of Northern California.  It was one of the best places I worked. Was a nice place to work. I showed up. They paid me. What more do you want? I suppose that I could go on and on about this or that but at the end of the day, it was a job. Inconsistent values, leadership not up front on a lot of issues. Great people and culture, amazing place to start fresh out of college with lots of paths to go to. Too many leadership changes and outsourcing job security is low. High per capita productivity, requires good judgment skills, excellent analytical skills, self motivational to engage, execute and deliver timely results Hp was a very nice place to work and provides a great opportunity to grow. The skills I've acquired I feel will take me far in life along with my degree. Collaborative environment, with work life balance.  Growth potential, co workers focused and ready to help you navigate the upper management demands and culture. By the time I left HP was an average company.  employees lost a lot of the benefit the company was offering .  Technical specialist provided guidance and expertise on how to utilize people, process, and technology to help Business clients remain agile while reaching their business objectives. The ASM is single point of accountability for HP service delivery. The Enterprise Services swears by EDS club membership, nepotism, sexism as in reverse discrimination are rampant, favoritism, cover-up, simple incompetence, rotten to the core management from the old times. Ok to work for a temp position.  If you like the good old boy type of work environment that doesn't allow for promotion if your not in the good ole boy group by the management HP was a great company to work for unfortunately my group one of the more advanced L2 groups in the company was layed offand the positions 12 in total were outsourced to India HP is currently in transition. HPE is better, however, is very unstable at this time. Good career move if you are a software developer looking for experience. I don't have review I was a contractor.It was a  great atmosphere and I would love to go back.I recommend anyone to go there.The pay was great. Just that the schedule changes. HP is a company with a storied past that has a great company culture that has gone through many changes over the past several years. If you were in the right location or segment then you were set for success, if you were not then you either had to move or find a new company. HP, Inc. has a very bright future as they break into 3D manufacturing and optimize their legacy businesses. Hewlett Packard Enterprise has undergone an immense amount of change in a very short time, after the split from HP,  there were two more splits that have  left a much smaller company in place. It is to early to tell if HPE will emerge as a great company or as a target for M&A activity. attend daily team meetingusing company car, drive to client location throughout NJresolve hardware\software related issuesrespond to work assigned ticket Que I started with EDS and was part of the HP purchase. I loved EDS, but HP did a better job of management and internally taking care of employees. Both companies provided good benefits and working environments. While I was there work from home was their culture, but soon after I moved on they changed that and mandated coming into the office daily. I can work in either situation, but prefer working from home and actually do better that way.Either way, I would highly recommend HP as an employer. Not worth going here. Skip it. Toxic culture.Really poor management and leadership. Full of politics and politicians who care more about how they look to their management than producing results. Lots of frightened people continuously threatened. Responsible providing telecom customer services to HP employees US wide. Monitor and maintain Northern Telecom Switch Servers, Adds, Moves and Changes. Project Management, Implementation and rollout of new technology projects. I really liked this job because I like working with and finding solutions to the problems with technology. I am always still who everybody that I know comes to for computer advice. I am currently trying to learn how to fix broken hardware. HP was a great place to start after working on an engineering degree. I was often frustrated that I wasn't in a more influential position, but I was offered advancement shortly after leaving and am confident that things would've worked out. I often recommend both Hewlett-Packard as well as the limited capacity role of chemical technician in and R&D laboratory to engineering bachelor's graduates  because I got good exposure to the PhD scientists who I was serving and was innoculated with an efficient work place culture before my later positions would set similar responsibilities upon me. Some of my fellow 2013 graduates went straight into refinery process management in Texas and were subsequently fired for lack of experience and something like that can be traumatic to one's reputation as well as enthusiasm for this type of work. Thanks, HP! This review does not apply to a US base HP location, but the one located in Panama City, Panama.The Technical Support department ceased operations and laid off the whole workforce after only a year of being open. Allows you to take new training's and work in a competitive way. Very supportive seniors who help you get a good grip on the projects and monitor you to help finish the work I collaborated with other team members on a daily basis to ensure that the needs of our customers were met for each project/task.Management was available to help move thru issues. Fun group of people and had the opportunity to work across roles. got a chance to work with the Program team, the Business and the Development team. Intelligent and collaborative group members. The HP way has been dissolved since my time at the company.  The culture was great and the opportunities to learn and grow were plentiful.  the company has changed Great place to work, compensation is very good, staff is very helpful, management is engaging, campus makes it easy to work and collaborate, global team is fantastic. It was a place that trained me and help me start off in my career. It was a help desk roll that taught me a lot that I still use today. Performing application and windows repairs that trained me in registry fixes and processes to address clients issues. Collaborative environment, with work life balance.  Growth potential, co workers focused and ready to help you navigate the upper management demands and culture. Call center - Good place to work as long as the work holds out. Payroll funded in part by a state initiative so when initiative ran out HP moved call center to Puerto Rico.Supervisors are good but not always available when you get a problem customer on the phone. Employee review is based on choosing a random service call recording. The odds of choosing a call that effectively covers ALL the aspects of the reviewers checklist is seldom in your favor. First 12-14 months were great then management restructuring and other changes made the environment tedious. Was actually pleased when I was laid off. Money was kept for the senior execs.  Technologist were not justly rewarded, raises were unheard of in the later years.   As things went on their attitude was 'vote with your feet' ok, depends on the contract you are on. I don't have much to say more than that. This forum is requiring me to write more words than what I have to say and that was everything I had to say. Team and Management work great with you.  Achieving your potential and creating new goals.  I have enjoy working there with a intelligent structure.  Management is very flexible with you.  Scheduling are flexible as well. As a call center Team Lead I found HP to be a team working environment no matter what the day may bring. There aren't typical days but I'd call them new experiences. Employees work together well and enjoy coming to work.  Aggressive Training updates and iinformation sharing is a plus for this company. The weekly training of employees to suceed is priceless. As with all companies there are challenges with some management personel who aren't exactly knowledgeable to assist with call center employee question mainly because they were placed in position from other areas of expertise. I  understand the process of taking care of tenured emploees but it does cause a problem with hourly staff when they don't have a knowlegeable Manager to help when needed. I enjoyed working as Team Lead because I love a challenge and being knowledgeable enough to assist follow employees gave me great pleasure. HP supplied the training for me to advance. Workspace is limited, but you never do the same thing... technology and people are great to work with!  Encouraged to try new job areas.  A must place to work if you don't mind change. Very joyful place to work. And very safe working place without dangerous risks. That is one of their priorities, quality products for customers and a very safe working place for employees and visitors. I worked for ISS Integrated Inc. Not HP I was a placed in that office as the facilities Coordinator which was a great experience and work environment. These questions are answered on the basis of ISS not HP. The job at HP was very demanding there was very little down time. This was not a problem for me because I love to keep busy and thrive from a fast past environment. The hardest part of the job was attending all the meeting. Office space at HP was limited leaving people packed together in small areas. However I love the culture and and enjoyed my job. Employees are encouraged to define their own career path and work with their leader to develop accordingly.  Regular checkpoints are performed to ensure the assignments stay on track. Great atmosphere, very approachable CEO, new office coming soon!  I've worked at HP, and now HPE, for eight years and have loved every team I've been on. HPE is an extremely fast-paced working environment meant for dedicated, hard working and collaborative individuals.. working at HP was truly an amazing job, I enjoyed going to work each and everyday working on something different each day.  Working in a customer service post where you go to customer job site and work on their HP equipment. HP hired and retained the most talented people I ever had a pleasure to work with.  Everyone was dedicated to their jobs, innovation, technology, and supporting each other to deliver the best service to customers.  The friendships I made while working for HP will last a lifetime.  It is a true company with integrity and respect for people. HP provided the tools necessary to do your job including coaching but still allowed the sales person to make the final call.  Great place to grow and learn. If you are an actual employee, this is a fantastic company. Plenty of benefits, and work life balance. If I could have got on full time I would probably still be there. OK: good team to work with to help solve client issues and create solutions to help clients achieve the buisness outcomes and goal with respect to their IT initiatives. OK if you do not expect to get recognized for your contributions.Opportunity for advancement is limited and always given to outsiders before looking internally. Working at HP enabled me to enhance my exhisting computer skills as well as obtain new skills i didnt have. I was able to learn more about computers and printers. The overall environment at HP was very pleasant. I learn how to actively listen to customer and train employees on product. It also, had the proper training that can help other associates on improving themselves. It helped by putting ourselves out there and trying to assist whoever we can. Execute global human resource initiatives and ensure all parts of the organization are onboard; a change agent, ambassador, project manager, diversity director, recruitment and retention, professional development, product knowledge, and leadership development. Everyday was a new day with new challenges and opportunities to grow and hone your skills. Collaborative environment, with work life balance.  Growth potential, co workers focused and ready to help you navigate the upper management demands and culture. HP was going through a number of corporate changes that impacted the individual contributors directly. The number of available job positions in the USA were being decreased prior to the split into HP Enterprise and then the split and merger with another corporation. This job was actually not a bad place to work, schedule was good, hours were good pay wasn't so great but they made up for it with all the time you are allowed to take off work. great work life balancenice culturegreat managementgreat insurance benefits and perkspromote employees to grow professionallygood hard core engineers I joined HP straight out of college in their Global IT organization right before the split. There are a lot of bright minds at the company with exciting and challenging projects. It was a great platform to get some good experience out of school and brand my resume with a very reputable company. I was at HP during the construction build out phase, and it was horrible.  I had a table with a computer on it in a hallway outside cubes so I regularly had 50 to 100 people a day walk behind me while I was trying to work.  I even had people accidentally run into my chair, or I would have to move so they could get past. The separation has been good for HP Inc.  Dion and his leadership team have brought back the best elements of the HP Way culture.  Career development and growth are available to those who seek it. I spent almost 6 years at HP, learning and selling technology solutions to NYC commercial businesses. I have a few of the best managers I could possibly ask for, and was always proud to represent HP Inc. I was on sales calls every day, always traveling in the field and solving problems for clients through the use of technology. I loved the flexibility of working from home, and visiting my clients. Worked with great team and colleagues during a very tough time for company.  The consolidation of businesses under several CEOs was challenging.   Vision,  mission and pure focus on customer was a challenge back then. While working from home was great.  There was absolutely no advancement within HP and not only did they not give a raise for years but they actually had everyone take a pay cut.  So I ended up making less when I left than when I started.  While the CEO took home millions. HP is a well known and organized company.They give you all the equipment to sucessfully do your job.They allow you to constantly get better and learn more. HP was not a lot fun to get up and go to everyday. I learned HP does not hire full-time employees very often. The management makes a clear cut divide between contacts and Full-time HP employees. Your told to not question HP employees. HP's labor business mold is 80/20. 80 percent HP full-time employees and 20 percent permanent contact employees. No room for growth or advancement. My time with HP as a support technician was awesome.I was in full control, yet I had an entire team that I could go to for support.  The workplace was nice and the people were all friendly.I was able to enhance my skills while I was there, and the pay was great.  It was a contract position, and eventually I decided to relocate, or else I would probably still be there. There is no room for improvement or advancement or I should say management talks about it but does not deliver.It is all talk. Compensation is OK but days are long and boring.  People do not interact well, meetings are always in the form of a phone call and extremely unproductive. It was a great place to work. I hired many people into good positions and we outperformed our peers. Management was not helpful integrating the server, storage and networking teams. They tried with compensation and requests for acct cohesion but they never inspected that needed acct plan except from each specific bucket or technology. Love how employees are treated. Good work life balance. Good place to work. Compensation also very good. Friendly atmosphere. Although organization restructuring seems to happen very often. I enjoyed working with the company. Leadership addressed any problems we faced on site quickly. The staff I worked with were great and were willing to assist you with any problems you encountered while on the job. *   Continue task assignment *  New tools and technologies *  Work and personal life balanced  good .* Very good training and team support structure .* would like to work again for this company . the job was nice but sometimes I had enough for 30plus hours a week, then other times it was barely 15hours.  The best part was my manager who was fantastic.  I even liked the traveling part. it is a great place to work but there is no opportunity to become full time. it seems old cultture of HP is going away , i hope it will come back soon If you don't mind being employed for only a year or less, then this is the place for you. Every year they 'eliminate' thousands of positions. Just doesn't make any sense. They spend way too much time and money hiring new people, only to let them go. Terrible business practice. Collaborative environment, with work life balance.  Growth potential, co workers focused and ready to help you navigate the upper management demands and culture. I enjoyed the cutting edge mindset and competitive edge attitude, this allowed for consistent learning and upgraded skills sets,keeping up with changing environments and competition in the industry. Joined the NMCI team an worked there for 2 years. Got exposed to very large enterprise systems and developed team work skills working with different stake holders and teams. It was great to work with the company. the company has lot of interesting out look. The merger has changed alot of things. It really depends on what account you are in and the account manager. HP is an amazing company, Wish I still worked there! Was sad to hear when my entire division was shut down at last minute to save additional $ for HP. Contract work. I performed a data analysis project for HP's EG Pricing Team. This was a contract position that I convinced HP product manager in Poland and Houston, Tx to help them global analyze sales data Very clean and organized place of business. I learned how to operate the SAP system. Hardest part of my job was staying awake because it was an overnight shift It was a very nice place to work for. The Line coordinator at this location taught me a lot that I still use til this day. The staff, my co workers, were very helpful and easy to get along with. I do not wish to provide reviews of companies and their stuff.  I really do not have an opinion at this time but  seem to be forced to complete these reviews to continue. HP 'used' to be the place to work, like Apple, Facebook or Google are today. And it was just as difficult to get hired there. Somewhere along the way, they lost their mojo and then came a revolving door of leaders, reorgs and upheaval. It was a once proud and thriving brand that lost it's way and that grew too big for its own good. Now it is a bit of a punchline. Bureaucratic and stodgy, with more time spent developing powerpoint than developing products. Job pays well, co-workers are an added benefit. Management is easy to work with.The only downside is the amount of paper work required just to make a simple repair. old high value end-to-end solutions to prospects throughout Latin America. Product offerings included photographic software, image enhancement, digital presses and finishing equipment for printing service providers (PSP). Gained an in-depth understanding of customers’ business environments and future growth strategies to recommend customized business solutions to achieve sales goals and expand profit line. Built and leveraged business relationships with printing and photographic organizations to better brand HP Indigo and expand market penetration. Worked 40 hours a weekWorked with different countiesEnjoy working with Programmer to Investigated, troubleshoot and diagnose service requests or incidents and identify the resolution and/or issue Was able to work with diverse group of intelligent and capable engineers. Fast paced environment with future always in mind. The company structure is old though and perhaps falling behind. Excellent opportunity to learn new technologies. As a contractor, I was paid somewhat well but no permanent role available. Suggest company try to avoid keeping contractors forever. Don't need any skills, certifications or training to do job, all you need will be learned there, hard to get promoted or work in the area according to your skills/certifications. Low salaries and good benefits. Enjoyed the work, management went to bat for you, pay was good and work/life balance good. Company does not have a retention policy. They have a nasty habit of laying off entire sites. Job security is null. If your laid off your blacklisted indefinitely. Don't get me wrong. I loved working there and still would be if they didn't shut our site down to buy another company. Working at HP was a interesting experience as it was only a temporary contract position. HP was starting in 2014 to lay-off is starting to lay off contract workers even at this stage. You had to be a full-time worker if you wanted to stay there at that time.I was hired as a Project Manager but I was told when I was hired that I would only be a project manager with no hand-on experience. I was very disappointed to learn this. I enjoyed the type of work.  However, because HP had a contract with the State of Wisconsin, I reported to two different supervisors - one at HP and one at the State.  This situation occasionally caused confusion.  My HP manager's behavior was not always professional.   I knew of other people who were employed in different capacities at HP and who enjoyed their work environments. I was thrilled to be called back to work as a contractor for a great team at HP. We did everything right, including coming in under budget on a regular basis. Unfortunately, however, due to other departments poor financial management, HP chose to terminate the project early. After my initial shock, I was glad to have been laid off early, because the remaining few on my team were tasked with laying off all of the other affected employees and contractors and then themselves. Very sad. HP is a typical American capitalist firm. It cares more about it's shareholders than it's workers. The disfunction can be seen at all levels. American workers are laid off only to be rehired as temporary employees without benefits and other jobs are sent overseas. Collaborative environment, with work life balance.  Growth potential, co workers focused and ready to help you navigate the upper management demands and culture. HP is not the place it was 15 years ago. Poor planning and clickish culture has taken over and contributed to the steady downhill slide for this once great company. * Train associates and educated customers about Hewlett Packard computers, printers, & accessories* Provide customers with knowledge and advice on in-store and in-home services from retail stores Worked as a Case Manager for a 2 year Contract. Supported the West Coast division and learned on the HP HRMS database. Morning were very slow but the pace picked up in the afternoon. HP is a great company, competitive salaries and lots of growing opportunities and networking. The company culture is based on innovation so anyone's ideas are more than welcome. Good company. Enjoyed the people and resources. The tools provide were extremely helpful in terms of applications to support your job. Knowledge transfer was great. They think the only way to cut costs is to continually layoff trained employees and high untrained employees at much cheaper rates.   This tends to cause support to suffer. Worked here to support sales and marketing objectives.  Management was hands off because we worked remotely and in stores.  You were managed by technology and GPS to make sure you were on site. Fast paced environment with a very high stress level. Good team members but at time lack of focus from upper management. Overall I had a good experience but pay or should I say lack of was an issue for me. We were routinely shorted on our paychecks with no real time line on when the problem would be fixed. As a man with a family, I couldn't wait for them to figure it out. I made the decision to pursue other options. HP in it self is a good company just the department I was working for was not great at all. Made some great friends among my immediate colleagues not to mention the amount of friends I made in other teams. Work might have been so so but the atmosphere made up for it. HP was a better company in old days, but it was still good in 2015.Now there are two companies, HP Inc and HP Enterprise, and my job went with the second one. Quality of Life and Quality of Work, both are excellent. Management is good. There is space and recognition for your individual contribution, innovation and initiation. Empresa de grande porte com excelentes oportunidades de crescimento e ambiente de trabalho formidável.Funcionários trabalham felizes e satisfeitos em seus cargos.Possui excelentes sistemas internos Management was lacking, and it was clear the business was firmly grasping for the 'do more with less' mentality as it regularly burned out its employees.  The location on Wake Forest rd.  in Raleigh has an external reputation of somewhere Network engineers do not want to work. Great environment and culture. Very competitive pay and provides all employees with an opportunity for growth within the company. They also help provide the necessary training needed to advance and/or become better at your current position. Great pay and benefits. Day at work consisted of monitoring calls for  quality assurance, coaching associate, making sure calls were completed in the time allowed ending with a sale. Hardest part of the job making sure all of my administrative duties were complete leaving the time needed to train my employees to reach their full potential. The most enjoyable part was watching my employees reach and exceed their goals. diverse company with a blend of different culture and subject matter experts. An innovative company with many new technology....great environmentThe departments are very structured with process and documentations in place. Very professional, team is there to help you learn, healthy working environment, competitive benefits and pay, teamwork and flexibility are a must for this job. This is a place where you're encouraged to reach out and try new things. Fast paced with a lot of layers. Can be confusing at times but also rewarding. I would not recommend working for HP they do not care how many hours you have to work or if you have a long commute management was very poor, hours were long no recognition for hard work, employee allowed to humiliate you. People laid off a lot. Was not paid on a few large deals that I created and closed. Took my concerns to the VP, however, they elected not to change their decision. Excellent benefits including a car to use, gas and health benefits. Collaborative environment, with work life balance.  Growth potential, co workers focused and ready to help you navigate the upper management demands and culture. Organization with lots of potential but has not meet employee or market expectations.  Lots of change over years and continues to struggle with market identify; punctuated by numerous acquisitions and spin offs. Great place to work. The only reason I had to leave was because my mother got sick overseas and I have to leave for more than two weeks and my manager didn't have anyone covering my schedule.  If have the chance, I will go go back to work for HP again. Was a great place for training and education, I acquired over 250 certification while working at HP and I will attend my classes over the weekend and off the clock. Work force reductions were always looming. , People are overall friendly and supportive. All about Aruba, and Servers..  Complex org structure. Your a number, HR, all about protocol, process, procedure. Quick paced or no work at all. If no work, sent home. Takes advantage of your abilities and doesn't pay out or give any raises. No room for advancement. Unfair management. prev company acquired by HP, staff and products were flushednot a great company to work fortoo much bureaucracythey made huge mistake buying prev company HP is a great company to work for.  HP is leading technology to provide DaaS to commercial PC platforms, which will provide for cost avoidance over the entire business platform. The division within HP was amazing. HP itself did little to support our division, but the group and managers I worked with were solid.Good culture, ability to work from home, and a great personal managers over the years made it a great place to work. The benefits from HP were top notch. Overall this job was fun and relaxed. Cleaning a building at your own pace till it's time to leave long as everything is done. I learned how to do detail work when cleaning for this job. They never really make you an employee so they can come in and layoff entire departments at once which is what happen to my group. That being said I enjoyed my time there love working with the Group I worked with and the campus is amazing It was a productive and supportive environment where we all worked as a team with a consistent roadmap. The senior management was very involved in the project work. Absolutely no opportunity for advancement. No benefits. Mandatory lay off. Income may possibly decrees as you continue renewing contract depending on temp/contract company. Flexible work force means the end of job security, certainty and keeping long term friends or relationships. It's a breakdown of the moral fabric. I would only work there if you are losing weight and are hungry...if your losing your house, you probably will anyway since the pay is so low, Lots of working opportunityChance to learn online Good evaluating systemGreat personnel Very relaxed working environmentMany life work balance orientation every week My experience at Hewlett Packard was a great experience for me to have just  graduated 1 day before I started that job. Hewlett Packard is very hands-on if you are trying to become a full time worker for them. HPE work from home policy, but I am ready to get back into a office as well..a good company to work for benefits was good and matching up to 4% for your 401k Very laid back yet still very productive.  The work which was done there was very thought out.  Projects were worked collaboratively.  Worked a lot with people out of the country.  Great work flexibility. Over the 4 years that i was at HP i loved it. the 6 months or so before i left i had a manager switch, the manager really had it out for me and was constantly on my back for everything. i complained to their supirior and requested a manager change. i was ignored, i should have gone to HR about it but instead i quit.i dont even know if i am considered rehire-able, if it was up to my last manager probably not. it was such a shame cause i really loved working for the company. Hewlett Packard was a good place to work.  I worked there before the break up into multiple companies occurred.  I was a benefactor of the Bill and Dave version of the HP Way and it was a great motivator for day to day performance. Only worked one job for them in Branson, MO. Was ok, but paid for my own gas.The drive was not bad, Since I stay in Springfield, MO. I just thought that the position would last longer and that I would be able to advance in the company. I would have stayed longer, but the position ended. I was hired as a contractor to help DevOps with firewall openings and closings and testing applications thereof.  I was very impressed with the people I worked with and would say they are top notch.  Contract ended after 4 months. This company has gone through so many changes it's hard to even look at this company as HP anymore. They are always trying to change without fixing what is broken. People have spoken up and management are attempting to fix the problems but instead of fixing the spokes on the wheel they are reinventing the wheel, and the wheel is now square and now management is telling you a square wheel will roll correctly. Lay-offs are certain to come in the near future as they consolidate every technical person they can and force everyone to do more for less from lower managers to field techs.  Assigning managers that have no experience in a certain technical field to the field techs, it's a failure waiting to happen. HP stock prices are looking wonderful but don't let that fool you on what is going on behind closed doors. Collaborative environment, with work life balance.  Growth potential, co workers focused and ready to help you navigate the upper management demands and culture. Work tended to get very slow at times. Management would sometimes ask people to go home volontarily whever workload was low. I was a contractor and never felt secure working there. It  was  a  great place to work. Laid back. I wish I didn't have the  family issues I had. I really liked it there.  Managers  were professional and  friendly. Lax dress code. Last 6 months back due to the Harvey the the project came bit late and we have very less dead line to come it, so all the co-workers stay bit and we all completed in time.I usually work for Offshore in India, some time if the HDD come in the afternoon, I will stay bit late and come the daily task and go home or some time I get work home and completed it. I loved this job and all that it entailed.  The people were great to work with as well.  i can not say enough about how pleasant this company is to work for. The overall job itself is very easy. The workload can be a bit much with all of the phone calls, emails, and daily reports, but if pay was better, this job would be ideal. Used to be a great place to work...In the many days in the past, used to be a very nice place to work, folks mentored the new employees, and there was a spirit of hope... The Company was run for the stockholders. There was little to no real concern for the Customers, or the employees. The review process that was put in place promoted a cutthroat environment. HP is HP.  Huge company.  I worked at an acquisition of HP in Utah, and it was a wild ride.  Startup mode the whole time.  We accomplished a lot, but in the end, HP decided to pull the plug. not a happy place.  most of the people I worked with are gone, either by their own volition, or laid off (like me).  I was able to work from home so that helped but maybe that contributed to my being let go. Exciting atmosphere with many people beginning their careers. High turnover rate, unexpected changes were made often, there was never a sense of job security. I loved it when I was there. Collaborative and educational management team, cool projects and a work-life balance that tips towards the life side of things. HP was fun to work because of the team I was associated with. HP has various contracts so moving throughout the company at the location I was in, is like applying to a whole new company. As a contracted employee I found that I mostly worked with other contracted employees. Most people seemed to be working from home most days, which meant there were a lot of scheduled meetings throughout the day. You'll work hard and there can be rewards.  Unfortunately, internal teams with conflicting metrics can lead fact based data 'off track'.  Not a lot of regard for work/life balance. HP was a great place to work.  However, I was a contractor fresh out of college, and for me, although it was a great opportunity (I have a patent there), it was not a career feasible path.  It was difficult transitioning from Contarct employee to Full Time with benefits.A typical day was very professional, very orderly, exactly as you would expect a large professional Tech company to be.I learned tons under great engineering tutelage!Management was fair and very professional.  They wanted to retain me as a real emplyee, but hiring freeze was on in 2000.  No luck..Hardest part was walking away from a world class organization into an unknown S3 that was in decline.The most enjoyable part of my experience were the talented and diverse folks I met while working there! Una gran empresa, el ambiente de trabajo y la posibilidad de crecimiento es muy buena. Since this was a contract job, HP would not allow me to attend certain meetings and classes.  At the completion of the project, I was not allowed to attend the company sponsored appreciation dinner. Overall Hewett Packard was a great place to work, the management team worked along your side and was very supportive. Managed 20-25 employees over the entire warehouse, learned a lot about people and became a better leader. My team worked together to complete their task even when they were moved around to the volume to help others. There was nothing real hard about the job, keeping an eye on 25 employees became a small task and making sure that everyone was doing their jobs. I worked 3rd shift along side other departments and we worked well with one another and made it enjoyable to learn other areas. Just a tough and stressfull help desk just like any other. No room for advancement. Dealing with Military people that think you are military and will be combative. Productive and fun workplace.  Where you are allowed to manage your work schedule.  Very family oriented.  Promotes teamwork, training and support from co-workers. Collaborative environment, with work life balance.  Growth potential, co workers focused and ready to help you navigate the upper management demands and culture. When I was employed at HP it was pretty cut-throat. No one wanted to get let go, so the culture was very stressful. Poor management as well. You were not rewarded for your work. There was a lot of favoritism. Probably the worst thing I am going to say about this review is the need to do it to have on in my day. Really annoying. HP was good worked there a long time ago. Who knows now. HPE is a multi billion dollar company with goal to improve its operation world wide. The company is doing a good job aliening with its objective and goals. Need to be more aggressive and fierce in the product to market strategy. workplace culture - HPE seems to have lost its indentity.  Doesn't seem to know what piece of the market to go after.  Lots of layoffs and instability in the executive level My time with HP was one of ups and downs due to the environment of the company and the department. I wish to only thank the people that I worked with for allowing me to grow as a person and as a professional. The lessons that I were able to learn have helped me become a better professional. I like my job. Just want the opportunity to advance and at the moment that is not possible at my job due to me being a contract worker. I would like to advance more in my carreer. Wonderful company, good management, good training, good people, went down hill when hired a new President without any background in the technical world and spent too much money when purchased Compaq and did not merge in company well and lost too much money and the company was not operating very well with the new leadership, person was eventually let go and promoted from within this time and worked a lot better.  I was sorry I left after that, but was still working for HP people that left HP.  I was trained very well and loved the company until it was mismanaged. A great company went downhill, upper management is for themselves. There is no help with more rewarding role, or carrier change. No salary increase, job performance review is mediocre. Run away unless you got a better salary offer. Daily activities are revolved around working to establish new acquisition accounts while maintaining a solid relationship with accounts that we have a history of working with. I work with no less than 115 accounts as a standard working with them on everything we sell at HP Inc (no servers). Tough to see a career in a product company when you are a consultant providing services.  Company did provide the opportunity to have a work balance which I appreciated. Top management is popular.  Company needs to provide more collaborative work environment for location diverse teams.  Some people like working there and some don't at all.  Turnaround an issue with newer and younger employees. I believe the atmosphere at my current employment is amazing. I work with some great people. The management is nice but sometimes they seem out of touch with our needs and responsibilities. Great company to work for.  I would recommend HP because it is a challenging environment where everyone works together to make sure that the company succeeds. Good experience as a Technical support, enjoy your work together with your co-employee. This company gives you a lot of opportunities to gained knowledge about printing solutions. HP provided a lot of opportunities to gain experiences in different industries and technologies. The benefits were good and HP stressed a well balanced work and life culture. EDS was a great company to work for they understood what outsourcing IT managed services was all about.When HP purchased EDS it was the dark ages. HP had no experience in the services business.  They were responsible for over 40,000 - 50,000 EDSers loosing there jobs over a 7 year period in the United States. It was a good place to work and management was always clear in their requests and helpful as needed.  I learned a lot from my supervisor and colleagues.  It was a good work experience. my day at work . i kjeep my self busy by getting the job done . i make sure i don't i dont do anything to slow th job down . always come back from luch on time . and never come to work late if u need the time u can call hours to let your supervisor know you will be late HP was a very good company to work for until it split as HP and HPE.  I went to the HPE side and things were not the same. Not sure if HP continued to be a good company. It  was  so  long  ago  I  forgot  how  much  I  really  really  loved  the  company. It's  too bad  that  it  was  temporary,  though.That  is  all. Collaborative environment, with work life balance.  Growth potential, co workers focused and ready to help you navigate the upper management demands and culture. I love the place very good people to work with and a lot of room for advancements. very good pay and very equal job opportunities. good bonuses and incentives. overall a very good company to work for. I would recommend anyone who is looking for a fun work environment with room for advancement to come and join he team. Good work/life balance. Good opportunity to contribute to the overall effort to perform to standard and work with fantastic people who had a similar work ethic. I love the company overall.working in a teamwork to complete the metrics.I learn everyday in my position and the others.New experiences everyday Some of the most dedicated and collaborative colleagues.  Opportunity to work in many different areas of the business (GBU, Regions, Supply Chain, Services, etc) and locations / countries.  Well balances and diverse work force. A stressful environment that was primarily focused on production. Compensation was poor and environment was not a good one.A small kitchen available for lunch breaks and cafeteria for seating. Very good company but went through major over haul. 70,000 jobs were cut that did not have dedicated account support. No open requisitions to save employment. HP was a great place to work because of the coworkers. Services was a stressful field not because of the work, but daily not knowing if your job would be around. Working on the latest hardware was always one of the highlights of the job. I worked in Panama Central America.  It was cut throat. The job was good but those Panamanians are competitive. I don't know why.  We all got the same pay.  I moved back to Miami, FL.  They closed that department down shortly after I left. Better if you get hired on FT so that you feel like you're apart of the team. Once on the team, lots of collaboration is able to occur. Just getting in the door is hard though. Great place (Building) fun and loyal employees.  We could take as many software classes we needed.  Always busy but not hectic. Supported R&D team and Customer Service.  Again, the employees and managers were very supportive and great to work with. HP continues to reinvent itself and that has me charged to be part of a company that is running into the future. They dominate the print and image world. Working with campaign managers to review campaigns and results.   as technical marketing manager asked by colleagues to help develop scripts and train telemarketers on the products to be promoted to generate demand.Mostly what I learned were knew tools to use for any activity and Salesforce to review opportunities to offer assistance for my specific solutions.Management was direct with a certain style of here's what to or how to do it.  There was no sense of empowerment.  1:1 meetings were rare.Workplace was easygoing, especially as a telecommuter.The hardest part of the job was getting some tools to cooperate; either they are slow or don't work as intended requiring do-over.The most enjoyable part of the job was seeing results, seeing your finished product, and being recognized for a job well done. CEO and high level executives were struggling with sales and would cut employees to satisfy stock market.  The market was changing and the leadership was looking to split up company. HP was ok to work.  Having  nearly 20 years in there, it really boils down to the people.  A good manager and the year flies by versus a bad one and you feel as though you won't make it another day.It didn't seem like their confidental processes were actually confidential and often times leaders were aware who said what about them,.  I think my biggest concern was over expectation over salary enployees.  I was a top performer in the lower paid percentage of my job scale. I would often work no less than 50 hrs a week.  I never got compensated with additional time off   (for example).  And when asked, it was some round about answer like, get your work done in 40... The company is great stepping stone for anyone in the technology field. You will learn a lot with the different tools, applications and systems they use. Great entry level position to learn about insurance and healthcare. Flexible work schedule, friendly and helpful environment. Hardest part of the job is telling a provider that something is not a covered benefit. Good pay, work was stressful, but not too difficult.  Answering phones all day anywhere is a soul-sucking job.  Manager and other workers made showing up fun at times.  Great atmosphere, everyone wants to help everyone else out.  Wouldn't leave if I could work from home at all, but working with US Military and cannot perform actions on classified networks from home. Company needs to invest in their Human Resources and stop laying off experienced people.  Need to spend $$ in IT to support their Supply Chain systems.  Too many gaps and holes that require experienced people to patch.  When those people are laid off, issues ensue. A very misleading company. Poor management lousy training bad instructors. Poor attitudes. No advancement in the company. I really did not learn a lot while I was there. A very diverse team oriented workplace that focuses on educating their employees and clients. A company that like to promote internally and is forward thinking in product development. Collaborative environment, with work life balance.  Growth potential, co workers focused and ready to help you navigate the upper management demands and culture. Working in my current position has afforded me the opportunity to realize that compensation and greed from a multi billion dollar company has been overcome with an improper state of mind while trying to keep those that have been dedicated individuals, get little to no pay increases over their entire time at the company. Good place to start in the corporate world. Would highly recommend for new graduates. It can be slow at times, but the people that work with you make it totally worth it. Also, there is plenty of room to grow. My overall experience was good at HP, however we had a racist manager in leadership who was not qualified for her position, so it made it miserable to go into work each day. Also, the company was very cheap on their events.... there was great variance from each department Nope not the Elon musk one but the opposite,no creativity no sense of advancement, a lethargic management with several thousand employees and a handful of clients. 10 year HP veteran, part of EDS acquisition.  There were pros and cons to working at HP.  My boss was great.  I found however, that the company had gotten too large and had lost its competitive advantage.  I also felt that it was an overly insular company.  That all being said, I do not regret working there or my experiences and skills learned. Company was constantly laying off people.  they managed buy the quarter to meet the analysts expecattions.  no strategy or direction just cost cutting.  Leadership was scared for their jobs so there was no pushback from them to do the right thing.  Everyone was scared for their jobs Everyday all day stay with your laptop and be on green status. No respect for your personal time or family life. The best thing is that everyone can work from home if needed too! It truly is dependent on the department you work. The FAIT group was considered to be the most challenging and stressful in the company. We had an average of 83% turnover per year in that department. It was close to home for me so the travel to and from HP was great.  The area where I worked was mainly men, so it was competitive in this area. I worked in giving network support. Staff are always made to do with less resources and constantly looking to lay people off.  Sr. management is looking to help shareholders instead of doing the right thing of building the business. Morning status meetings set the priorities for daily events. Weekly project update meetings determined whether or not we needed additional manpower or man hours to keep project on schedule. Monthly project status meetings determined how well the life cycle progressed or digressed. Most days the environment is very relaxed with well defined objectives and tasks to accomplish on a daily basis, culture is fun and very diverse. Coworkers  are always there to help. Call center environment which consisted of working in a small cube type space sharing it with a co-worker. Consistently measured on number of calls taken, length of call, first call resolution etc. NO  had certain call center agents assigned as 2nd level support agents whom had the title 'engineer' and they presented themselves to the UP customer base without ever having an engineering degree or background. Very mis-leading and deceitful business practice. started work as a contractor with Digital Equipment Corporation and remained with company through transition to Compaq and HP.  Wonderful staff and employees felt their work was adding value and they had a real sense of purpose. Too many company splits, no loyalty, no compensation or packages, no raises, many layoffs, no job security, flexible hours for the most part and work from home for the most part. The best no stress on driving or getting stuck in traffic. worked from home and did all the daily chores.Plus at the end of every quarter we would receive gift hampers as a token of appriciation. HP was a pleasant working experience working with professionals who were all remote. Team was pleasant with most individuals willing to participate in working meetings and whatever it took to get the job done. Favortism and nepotism are going on at the manufacturing site . However , HPE is a great company to work for because of its benefit and vacation time along 6 days leave. I haven't worked at HP for over 15 years.  It would not be fair for me to give feedback regarding current cultures and work environment. I do not feel that my experiences from 15 + years ago would be helpful. Warning, HP employees still read Dilbert and Slashdot.  The people are mostly reasonable, the company is stable.  But at the end of the day, they're making printers. Collaborative environment, with work life balance.  Growth potential, co workers focused and ready to help you navigate the upper management demands and culture. Coming from Dell to HP was difficult and the HP and Dell culture clashed to say the least. I was placed in a very small desk and never really felt at home. great place to work and learn. lots of training and education also plenty of new equipment to work on. Sometimes a little hectic trying to deal with all of the processes and procedures. Productive and fun at work. lot of learning for carrier growth and development as QA Engineer  . Good Manager and team.  Really enjoyed working at HP. Good place to start a professional career, but not a place to keep yourself for a lot period of time. A good thing would be that there were some parties on holidays to improve the mutual collaboration among work partners. great place and great environment. great employees. good management. low pay and no room for growth for temp employees. otherwise a great company to work for. This company always promoted from within.  They invested a lot of time and money in training for further advancement and development.  It was a very young and fast paced environment so not for the slow movers. I went around to several retail locations being an HP demo guy. The pay was good for a Student, but part timers get shafted in terms of lame 1 hour shifts at several locations throughout the day. I tried to contact my boss and she never responded to my emails. It was frustrating. It was like I didn't really even have a boss which is both good and bad. The boss and co workers are great. The benefits were good and I enjoy my job. The business seems to be moving in a different direction and I am ready for a new start.. productive project work, great team completed on time, great team work. Remote workforce reduction following the merger with Computer Science Corporation. I very much enjoyed the roles I held at HP.  For the vast majority of my tenure, the mantra was, 'Take care of the customer, and we'll figure out the internal process later.'  Toward the end of my time, things were much more process and metrics driven.  I understand that with 300,000 employees, there must be some controls in place, but I think that somewhere in there the customer dropped in priority - and to a certain extent, so did the employee. loved my job, hated that I always worried about being laid off.  When they let me go after 16 years, I called it involuntarily retirement.  Miss the culture of the team i was on Indeed is a fantastic place to work. I've been able to grow into an entirely new role without leaving my team. Two levels of managers above me have been going out of their way to help me progress my career, including asking about my career desires, suggesting new projects to build those skills, and giving me time to grow in those skills. Company offers opportunities for professional growth, open doors policy, trust and respect, motivate to teamwork, work&life balance, develop of creative thinking I enjoyed the team effort and the collaborative nature of this job. The supervisors are understanding and supportive. There is plenty of opportunity to learn. Formely an EDS delivery center in El Paso, TX Hewlett Packard purchased with the official mission statement being that they offered 'off shore' costs for an 'on shore' location.Cannot recommend working at this particular delivery center, but unsure about the culture of HP as a whole.  If you have no relevant experience in the field of Enterprise development then this is would be a good place to start.  Just have intentions of leaving after a few years for better opportunities. I go into work, with vest and badge on. We stretch and have a meeting about how the day will be. After the meeting we would get started unloading product off the trucks. What i learned from HP is having patience, being a team member, and i learned about microsoft excel . The workplace is fast paced and filled with people who work great in every department. The hardest part about working is staying busy and doing hard work 8 hours straight. Lastly the most enjoyable part is having 3 breaks and getting through the day faster as long as you're being productive. My day is an On-Site technician. Minimal supervision. Do my calls, handle logistics, deliver on-site service.From Servers to SAN's and NAS'sFrom the small mom and pop business to DOiTT in Brooklyn. I held various positions within Hewlett-Packard company.  Mostly in management and project management.  I enjoyed my career at Hewlett-Packard, but, I really wanted a chance at the brass ring so I started my own company and followed my passion for building. I was laid off from HP in 2014 after a wonderful successful career.  HP is a great place to work because a person is always gaining new skills to add to a career portfolio.The staff that I worked with were like family and employees worked together to collaborate on projects with the goal of producing the best outcome. Fast Paced, high energy. It was like I was going to two different colleges when I was interning there while I was going to college. There are multiple ways of learning. Collaborative environment, with work life balance.  Growth potential, co workers focused and ready to help you navigate the upper management demands and culture. The technical support analyst position is very hard: speaking different languages, solving problems over internet , troubleshooting in every different case: truly hard job. Hp medical was a very good place to work, people were exceedingly intelligent, creative and well meaning.  The management was respectful and very technical.  Products were not produced to sole make money, but had to make a technical contribution.  I've never lost that thought as part of my development experience. Performing multiple levels of work with minimal employees. Underappreciated employees and minimum level of recognition.lack of clarity on job roles and expectations. Contracted position that was supposed to go forward for many more months & suddenly the state of Arkansas demanded that the service be moved to HP's offices inside of Arkansas. We were not told of the move or offered a transfer, it just ended that ended abruptly. Entire team was laid off. Company recognized someone's contribution and effort. My former manager was very fair and provided ways to advance if I worked hard and achieved goals. I enjoyed my duties and responsibilities at hp especially when it comes to insert the memories and the processors into  laptops or desktops,then settle the hit sink on top of the processor. The feeling to qualify control the finished products was an amazing satisfaction . I learned to work with sales reps and multiple departments personalities. Management was helpful and encouraged growth. The hardest part of the job was using multiple systems to enter the same information. Technology is cool.  Being able to access new software, new hardware and to see the applications of the technology is all cool.  You feel like you are part of something important. HP is a productive learning environment yet has the competitive spin to keep your skills sharp and up to date.  There are numerous classes and webinars you can attend for free to keep your skills fresh and/or provide opportunity to move your career in a different direction.  The culture is vibrant and fast moving.  Most managers are willing to mentor for growth and support advancement.  The most enjoyable part of the job are the people.  Great people come to HP Inc to learn and contribute. HP is a great place to work.  The people that work at HP make the difference.  The tools are a pain to work with but everything else outweighs that.  Great company culture Hewlett Packard is fun workplace. A typical day at work was busy as usual, but the team working together become more less stressful.I have learned a lot from assembly to the finish product.Management were very helpful from day to day business and task at hand. A very professional management team. The workplace culture was very busy , stressful sometimes,but with the team working together, it become more fun and we finish the contract work before the deadline. The hardest part of the job is waiting for the new contract work will comes in. We are all eager to start a new contract, cause we knew that no matter what happens,we tackle the the jobs with ease and on time. The most enjoyable part of the job was ,when we finish the contract job, then we can relax for while. If I didn't have the invisible carrot of being hired in by GM hanging over me my time at HP was worthless. Management were rats and the work environment stressful Loved it and would do it again.  Even being incarcerated, they tried to keep me by exhausting all of my options to come back.  This is why I would even work there again. very good culture at HP......... ........................worked as a developer and had a  very good experience thorughout my time in HP.I would like to refer my friends. In working for HP you are a number not an individual.  It is all about the bottom line for this company.  Very immoral and unethical behavior by management. Global IT was a stressful, high paced group. Large workload but with sever time constraints it was hard to innovate and truly build lasting well developed software. Culture (before the HP/HPE split) was very multi-cultural and inclusive with care to provide for events outside of our usual work environment to celebrate achievements and support team unity. Post the split, and especially for the DXC.technology spinoff, company culture was destroyed and a culture of cutting and irrelevance was introduced. HP Global IT doesn't exist anymore I worked in two main modes during my time at Hewlett Packard.First, I was in a call-center assisting persons with their printer issues.Second, I was working in a ware-house rolling out a Virtualized Server Solution - very smart people.Both solutions and behaviors were well handled, and there were multiple people I could ask for help when I was out of my depth. The most enjoyable part of the  job was to be a data entry clerk. Good benefits this company is employee oriented, they looked out for the employee welfare. Gave me good experience.  Enjoyed working with the customers, but not all of my work associates.  HP continues to downsize and may shrink itself out of existence. Lots of senior people just waiting to take retirement.  Lots of dead weight with managers who don't have the training or backbone to coach them out of their roles, making it necessary for others to carry their weight. Collaborative environment, with work life balance.  Growth potential, co workers focused and ready to help you navigate the upper management demands and culture. nice place to work. co workers where very nice. your work schedule could change very week. laid back environment. nice building for the work office. my supervisor was easy to work with. Many employees lost their jobs in the US only for the jobs to be sent off shore to other countries.   These employees were committed and dedicated employees who deserved more than this. Compaq was a great company, but a buyout of Digital was the beginning of the end. Benefits kept getting pulled from Employees with tenure, and placed to attract new employees. Everyone focused on customers. Teamwork always, Management by walking around, find someone doing something right. Benefits excellent, profit sharing consistent when company is making their numbers. HP is  great company and was a pleasure to work for. This was a while ago, so I cannot speak to the current environment. However, at the time, the culture and work was enjoyable though advancement potential was limited. One of the HP departments created a group of contractors to migrate their databases. I was mainly doing SQL Server migrations but also got to do a couple of Oracle RAC migrations I was a Deployment Supervisor so I traveled 100% of the time to different facilities. I learned to deal with all kind of customers, so me difficult and some friendly. My typical work day was on average between 10-14 hours. I was in a management position so I was required to complete all the end of shift paperwork as well as monthly training for myself and employees as required. The hardest part of the job was the long working hours sometimes and the most enjoyable part of the job was traveling to different locations and meeting interesting people. I worked remotely ... so missed the collaboration with employees, but the pros side it was no office politics. The other con - interaction with my Boss was only in meetings or performance reviews. Therefore, I felt i was not evaluated properly for my work and didn't receive the salary increases or bonuses. HP offer unlimited training and advancement opportunities.  Because I supported the sales team, I received bonus for deployment and implementation of HP services and products.  The company offers top of the line benefits. Personally, it was a good experience to grow professionally. As a company, she was very responsible and attentive to her employees. The job was a comfortable one, but we had to work several hours on the weekends since I managed the backups and had to be aware of them. I was thrown into a very mismanaged environment.   I saw people not going home after work and sleeping at their desks for the night.People taking their laptops on vacation and working on the beach.I had to work numerous hours at night from home and many weekends.They still required you to take educational classes on your on time even though one is working over 50 - 60 hours / week.Management meetings where a complete waste of time.I've never been micromanaged like a had been at HP in my entire career. Answering customer tickets concerning network configurations on HP Equipment. It was not the only equipment. There are times where this equipment was attached to Juniper, Alcatel, Brocade and cisco equipment I enjoyed working at HP, meet some really great professionals who I still keep in contact with and go to for professional opinions and advice.  Flexible hours made working from home easier. My time at HP was good. Very flexible work life balance. Had the opportunity to work from home when needed. There was not much room for cross training Many conference calls, very experienced teams, good synergies.  Guidance from PMOs and organization.  Experience program manager giving good guidance and direction. Learned new tools, enjoyed the commaderie. Management lacked direction from above.Management was driven by leaders that lacked focus.People were Great, management direction changed daily.Management was to micromanage, and missed opportunities.People that were marginal were promoted.Team members were well balanced and tended to shareexperiences to create cohesive balance. I enjoyed working in HP. It was during the transitions of HP purchasing Compaq. I worked in a group that was outsourced by Bellsouth to do technical support. HP was diligent in the service it provided to Bellsouth. Technical Team collaboration was a standard that was very useful in completing projects. The majority of the day was spent in meetings with various teams globally. My colleagues were competitive, but fun to work with.Work-life balance was always encouraged, and the company has been transparent through its ups and downs with all their employees. As a contractor on a unique, remote global team I was treated like any employee. The director to whom I reported was respectful, supportive, and trusting. He was also able to give great advice, and worked very well with our team at large as well as individually.Tough culture, but rewarding work experience. Collaborative environment, with work life balance.  Growth potential, co workers focused and ready to help you navigate the upper management demands and culture. HP provided me with high quality training and management which was valuable right out of college. I learned a lot from my peers and management and my time there was very valuable. Was very challenging at times spend a lot of hours at HP when it was needed for special projects or assignments was responsible at times for over benefits, records and wage & salary administration for over 1000 employees.. Enjoyed my job 95 per cent of the time and also management lots of responsibility but loved staying busy wish lead to a lot of opportunities.. Flexible hour, friendly environment, easy internal transfer.  Benefit is not as good as others.  Such as no 401k match if you leave in 3 years.  No stock option.... Loved working with my team and field team. Excellent benefits and the opportunity to volunteer monthly. Competitive but fun. Opportunity to win trips and money. Management made sure you understood your job and provided extra training when needed. The typical workday was informal. First thing, log into the team chat and emails to review high-priority cases. Examine data extrapolated through throubleshooting by peers and personal experience. Setup labs to test working theories. Give the customer the best possible assistance. Every day is a learning opportunity. Good mentorship programs help to infuse new-hires with expert knowledge and backup in high-profile scenarios. competitive salaries, flexible work hours, good benefits including medical, dental, vision plans, life insurance, paid time off, stock option, open communication, good work environment with collaborative work. I was able to manage my time.  I was assigned opportunities that I worked.  I provided custom pricing and solutions for non-standard services, RFP and RFI request Quality and customer satisfaction about products  is the main goal.Good training about esd and how to handle product and safety in the manufacturing plant. I worked for HP for a long time, going through several mergers.There was a lot of opportunity for advancement.Things changed a lot after the merger with EDS. HP was in a time of transition.  Leadership did not understand the job we had been tasked to do.  None of our supervisors had security expertise; and were slow to learn. great company to begin your knowledge on technology industry, teaches you how to be very indenpendent. also you can learn other areas of the company like enterprise auditor, or test technician this was in a factory that makes the worlds best transmission. I loved the setting and noise and smell of a factory. Most may not but it was one of my favorite jobs or at least the favorite location. I think management can do better to employees to better let them support and decide what is need to continue with production.management makes decisions and does tell employee so work can br completed in timely matter Best place to train in a new job. Great opportunities for advancement.Most exciting place I've ever worked.Culture was open and relaxed.unfortunate layoffs from 2006-2012 Very good team and work culture is excellent. The way we approached to the deadline  is absolutely great.There is Good support from Management and the location is very good Typical workdays at HP were very stressful and most of the time un-productive do to overbearing management.  Countless useless internal conference calls, forecasting multiple times per week, tons of office work.  At HP you spend about 80% of your time in some sort of training, spreadsheet work, forecasting work, planning work, etc and only about 20% (or less) selling to a customer.  Just think how great HP would be if the Sales Teams spent 80% of their time engaging customers!!! It was a good job, not a lot of headaches and easy going.  I was able to work with adequate time off available as well as paid for hotel rooms in case of weather emergency. not bad for most part your left alone and allowed to work how you want as long as you meet deadlines and other expectations. They were very Flexible.. Great management, great people, good work flexibility. People is nice and you learned a lot in just a few months, i can manage my work schedule and get work done better. There was no work to be done, but they kept hiring a new 100 people every week for a tax break. I was the only skilled IT professional & wound up doing any work that was ever available while working with felons that had absolutely no interest in the jobs they were hired for. There was no work to be done 90% of the time & we stood there losing our minds. HP does not hire people. They only hire through a select list of contractors. There are very few actual employees. One man had been there for 10 years & was still denied his request to be an employee & called it quits. You have to walk in & out of metal detectors to use the restroom. It was a 5 month prison sentence, but at least they feed their captives in prison. Collaborative environment, with work life balance.  Growth potential, co workers focused and ready to help you navigate the upper management demands and culture. I loved working for HP moved up three different positions from a contractor to a direct employee. The only downfall is getting W.F.R.(work force reduction). Great company to work for if they went back to the old ways and cared about the employees and products The HP I knew is no longer. It was spun off to HP Enterprise, and then sold/regrouped to DXC. Therefore, any review of the company is irrelevant and not applicable. Clinical application specialst. I perform allcardiac ultrasound and organized the work day. I assisted in teaching students how to use the equipementand perform ultrasound. High hours per week; I averaged over 80 hrs per week for 5 years. Considerable time spent off-shoring resources from US to India and other low cost centers . Even though I call the culture average by the time I left, I still liked working there because the quality of the people that I worked with was still way above average and I'm sure it still is. Upper management was expecting a lot more with losses in benefits and compensation. Raises were very small and rare in my estimation toward the end of my tenure. Not just for me, but in general for the average engineer, who are mostly well above average.The great thing about the company is that they work in multi-discipline teams, i.e. writing system, electrical, mechanical, chemical disciplines.We had fun in our work. I had a great experience.I learned a lot   had very good managers lots of room and areas that were challenging.  I was in the SW group and we were spun off Good company, good people. Limited stability. Moved fast. Executive team was a rotating door.  Progress was measured using metrics but we did a lot of Power Point! conducted case studies on real business scenariocollaborated with colleagues across departmentslearned a lot from one-on-one session with supervisors/managers The company really worries more about their client than their employees. Not all that hard of a job to do but company needs to work on employee relations. A driven professional with twenty seven years of Supply Chain Management experience in the manufacturing industry. A combination of strategic and analytical management styles that provide customer and results focused style of leadership; while employing strong team building skills and motivational practices. I loved working with HP for almost 11 years. The past few years were filled with many changes and job insecurity as layoffs occurred every week somewhere. I made a lot of great contacts and learned so much about project/program management. HP Inc is a huge company. There are a lot of teams working in many domains. Over all work life balance is good. Learning and growth really depends on the team you join. Work hard and play hard. Lots of recognitionManagement was fair in their policies and dealings with employeesI did not find this job hard at all.  Lots of opportunity to help people.Most fun during periods of recognition such as Employee Appreciation Week, Customer Service Appreciation Week, Birthdays and just because days. there's not enough collaboration and team work within the organization. At time, you will feel like your let on an island. Management could be better if wasn't so remote. the HP company is excellent place to work with. comparedable benifits wiith others big company. also work environment very good. the reason to leave the company,because manufacture moved to oversea. Everything is done reactively.  No processes or best practices in place for dealing with issues.  Three different, often conflicting, layers of management.  Typical work day consists of service related cases opened for support with minimal training on the equipment to help on technical issues.  Many have little to no experience in additive manufacturing/printing.  The workplace culture differs between divisions and products.  All are treated as start ups and some seem to reinvent the wheel instead of studying and Implementing best practice processes from successful groups. Nice sales environment.  Work as a team to increase sales revenues.  HP offers excellent benefit packages.  Managers are easy to work with.  You are rewarded for hard work. Company Culture is outstanding.  They value diversity and you have a lot of growing opportunities where you can advance in your professional career.  A lot of training is provided to help you in that journey.  The opportunity to work and collaborate with professionals all around the globe gives you a unique view of other cultures and work behaviours Cross Functional Communication needs Improvement.  Ability to telecommute a plus.   Good facilities to work at, employees always willing to help, overall an okay environment. Various  tems support other  companies technology issues and needsSoftware and Project developments teams as wellNot too many business roles in MI Collaborative environment, with work life balance.  Growth potential, co workers focused and ready to help you navigate the upper management demands and culture. Recent management directioin is to relocate 80% of all jobs out of the  United States. No raises in the last 5 years. Monthly reduction of forces. In the last 5 years, tens of thousands of layoffs. Love to work here. Excellent company.Great culture and Team workGreat benefits for regular employees, excellent Facilities and activities for employees pretty good over all. Great company to work with. Upper management was thoughtful and willing to help you reach your goal. Workplace was clean, safe, and colleagues were helpful. the employees at HP (now DXC) are great.  The constant cost reduction measures required (workforce reductions) make this a tough company to work for long term.  If they could get back to delivering services of value it would be a great place to work. For a large company the people are very caring and respectful. Mix of oldtimers and new, but the company has metamorphised to a trimmed down business and they have laid off many. had a great time and enjoyed working with everyone at HPE, relaxed environment. Training programs available for everyone. Enjoyed diversity at HPE, if Harvey didn't happen I would still be working for HPE. it was good team, working with agile methodology, very friendly and professional, but some unknown reason client did not accept intermediary result and fired the whole team. Nobody expected and it was not a season, so very qualified programmers were forced to look urgently for change of plans to find any job in NJ, PA, even DE and MD. Big troubles Was an ok place to work. Was promoted to remote worker I enjoyed working from home much more comfortable and quite. We earned free products on a regular basis. This is a different company than HP the large technology corporation.  So my review does not apply at all for this company.  I am writing this to complete the process. The company has all the tools but has become stagnate and slow changing.  It is using an old business philosophy in a new business environment.  It constantly states that change will occur but it does not.  It has spun of it valued parts which are doing well under a new philosophy.  I hope it survives. It was great working at this company for the brief time I was there..  A great atmosphere to work in,  Really good co-workers to work with.  A all around great company. I worked in Fort Collins, Co on a six year 'temporary ' assignment..In that time, hp could not decide whether or not to hire me permanently, but was able to bring in numerous candidates form overseas to take on similar assignments. This probably compares with competitors practices, but it was sad to see it happening at large in hp.  I had previously worked for 17 years in a different division. Was laid off when that product line moved offshore.  What is left of hp does not resemble what was there in the past. Sorry to see it go.  I buy hp products from time to time. Do not see what the hype is about. No longer a force in the marketplace , as far as I'm concerned.  Good -bye , hp. I liked working there.I was able to learn a lot.After a management change, I didn't care for some of the decisions that were made, ie. hiring new employee's instead of contractors who had been there for 5-10 years who had applied. Company was great. Provided job flexibility with allowing remote work abilities and flexible work schedules. Also, there was a big campus that was pretty nice to work at. HP is a very fast-paced environment, but the collaboration among peers and departments, is very refreshing.  The transformation is questionable in my opinion, but hoping for the best. I will be recommended any one to join if it’s possible because a lot of knowledge you can gain that would be helpful for future carrier path.I am very much Satisfied working with them. working your casesplacing ordersspeaking to customerspeaking with TL, SME or manager if neededattend meetingsreviewing emails locating a solution for customer I enjoyed working at HP as most of the folks loved technology.  There was a competitive culture that sometime got in the way of taking care of customers. Management continually changed... had 7 managers in the last 5 years there.  Great co-workers.  Managers claimed they were forced into having only one or two top performers and made to have one or two bottom performers with everyone else in between for reviews. I really like HP, Inc. Since the split there is a lot of drive to succeed and a lot of room to learn more. They pay well and have good benefits, but they require a lot of hours. There is a time in November where they require 19 days straight of 12-16 hours a day with no days off, little to no lunch, not Sunday not even Veteran's day off. That is a company policy in finance and top-down company enforced.  They aren't very good at respecting vacations or your other time either. But if you can handle that, the rest of it is good. Collaborative environment, with work life balance.  Growth potential, co workers focused and ready to help you navigate the upper management demands and culture. During my time at hp as a manager I felt empowered and rewarded for my efforts.  The hp way culture was a wonderful environment in which to work and created a productive and efficient situation for both employee and employer.Training was always an important aspect at hp and this enabled employees to grow, develop and mature into more productive and effective individuals. Hewlett Packard has undergone a lot of changes in the last 10 years, or so.  Cost cutting and restructuring has pretty much made the company unrecognizable to HP veterans of old.  Since I wasn't required to move to one of the centralized offices before I volunteered for workforce reduction, at least my work/life balance was good there at the end. HP acquired the company that I worked for and we transitioned into their work culture over time.  In the beginning we took pay cuts to keep your jobs.  Its a continue revolving door with layoffs occurring on a regular basis globally to meet business financial objectives and keep the share holders profitable. Stressful at times but OK. I believed sometimes it was rumors the supervisory feed into but if I would put this on a scale of one to ten it would be a five HP was a great work experience they always gave us training on the equipment that we work with. Safety was very important. We will always receive traning.. Job turned out to not be what i applied for and I discovered I preferred an office environment.  Other than that, good management, and excellent co-workers, on the occasions that I was able to meet them. Management is great and supportive. The good place to work for if you have good experience in the industry and sector knowledge, HP has an enjoying culture with lots of team events and activities. same as my other job as my job was sold to Cibermore relaxedwas on-callworked on projects and had lots of meetingsmanagement was a little disconnected from employeesseemed to have some company loyaltynever knew what most of my days would be likethe building I worked in and the people I worked with were great I loved working at Hewlett Packard (digital, Compaq, HP, HPe) until about 5 years ago.   I LOVE logistics and LOVE my immediate managers and the people I work with.   I love all of the collaboration and support of co-workers.   The work has always been challenging and fun. HPE is no longer the company that it was for over 30 years.   Values have significantly changed.   HPe management started focusing on short term cost cutting and outsourced critical work to low cost countries, which is detrimental to long term success.  HPe management does not value employees - they only care about cutting costs.  Long term this will cause the demise of the company - as employees should be one of the company's top asset and treated as such. I really enjoy HP as a whole. They are constantly improving and growing the business. HP is on top of technology and in always looking to do better. They also have a great culture of business. Very good place to work, Good R and D lab to work for.Good Collaboration.Work as a team. My immediate manger was very good and helpful. We worked like a team. i like this company ecause they have a great management, and everything have tobe done unless you have been trained, i did a month training   and learned a lot I enjoyed working at HP as part of the acquisition of Compaq and Digital Equipment Corporation and led work on integration marketing data and global reporting. HPE for me is the best work place for any beginner to work.For me, I was really happy on how everyone treated each other with a lot of patience, and care.Some days, because I was working in Tech Support was hectic, but I loved my job, so I didn't face any difficulties.The management is good, but my main concern was about the salary, or else this is the perfect place to work!!!! Working at HP was stressful and cut throat the job culture was survival of the fittest management was horrible the hardest part of the job was receiving customer criticism about the errors and attitude of HP remote support and calming down the customer. The most enjoyable part was getting away on vacation. Started working when HP was EDS in 2000Loved the family type caring culture when EDSWhen bought by HP, that culture changed.liked working in a busy fieldlearned alot of the day to day workings of a large IT company HP is good place to work ad provides a great work life balance. People are extremely helpful and are motivated to drive projects to success Being one of the oldest company is the silicon valley, it stll is going strong in a extremely challenging market. The job was not difficult but the pay was low, had no opportunity to advance after 3 years, and high expectations with no additional money and additional responsibilities I was screamed at, Told i did not hire you so i don't want you etc. The GM's are all absent and when anything is said your to blame not them, im happy that job is over. HP no longer exist - they closed their doors.The company was divided into business units and sold. HP was a sort after company to work at . I was privileged to work for the company in South Africa. Collaborative environment, with work life balance.  Growth potential, co workers focused and ready to help you navigate the upper management demands and culture. HP was a fun place to work, there was scope for professional development, work was very interesting and challenging. There was a lot of flexibility at work. I enjoyed the camaraderie. Overall this company is a good place to work for a short period of time, the on site training is very useful and will be used for future reference with life skills and other jobs. However as nice and laid the job is it requires a level of self discipline to continuously keep busy. Also the communication over all between other shifts and other coworkers can be considered shaky and not balanced. I learned more on the following topics:  XML, DHTML, SQL statements, Excel.  The hardest part of the job was that it was a contract position, although permanent.  The most enjoyable part of the position was the work I was doing and my coworkers. A Very relaxed yet competitive work environment. the company is great and people in each group are like family.  the culture of HP is nothing i have ever experienced any where else. I would go back to work for HP any day. HP has a great culture and much of a slow pace job. However, the issue there is that upper management seems to keep changing direction on how the company will move forward. The salary there is low compare to what the market pays. Experience vise you get to be exposed to a lot of advance technology due to the demand and what HP's customers expect from HP. HP as in all companies has a great track record of developing talent and providing tons of opportunities to grow and extend skill sets.  Like other companies there have been great cycles and not so great cycles. HP finds itself in an overall great cycle with lots of swagger as it enters this year. The management was constantly in crisis mode. There was no pushing back to senior leadership when a task was impossible, it was still pushed down to the analysts who did all the work. HP was a fun and collaborative place to work where the people were the best part of the job. Second to that was the Technology. HP was and still is a great company. Fun job with HP Marketsource only seems to hire outside management and leaves little to no ability for promotions. No matter how hard you work most field representatives that actually understand the changing marketplace is Trumped by Marketsource only hiring from Marietta, GA. Marketsource makes field work a dead end position good job. However if you want to be a DSM or above move to Marietta, GA they will make schedulers a District Managers (DSM) before premoniting any ASR  or DSM to upper management no reward for those that actually make the numbers that renews Marketsources contract with HP! HP was going though changes when i worked for them. The company had opted to leave the market that i worked in and therefor my time there was short. Healthcare was spun off and formulated part of Agilent Technologies. I worked or the Ultrasound division and enjoyed it very much Characterized embedded wireless antenna and over-the-air performance in an accredited CTIA laboratory for development and Mobile Operator certification.   Antenna measurements consisted of 3D gain pattern and efficiency measurements made using a near field measurement. Amazing pay and full benefits for a summer intern. AMAZING. Highly recommend. The campus has an on-site cafeteria, gym, etc. Great place and environment to work in. A typical day of work was logging in to my chat client and conversing with customer support, case support and accounts. Technical Support and product support were specialties. I learned a great deal about PC, Printer and Server Technology. On top of the products I worked with daily, I learned about infrastructure and building business relationships. My management was excellent. It was very hands off and employees 'managed themselves'. Our direct leaders were mostly for problem solving and schedule issues. Our leaders were always available to any education and for general networking. It was very different from what I was normally used to. The workplace culture was typical office cubicle culture. Employees worked together to reach team goals and profits, but they rarely worked directly together. All culture of HP was tech based in teaching as much about new technology to coworkers. When new products were introduced, it was up to employees and not management educate. The hardest part of the job was teaching customers who are otherwise lost to technology and have a low level of understanding. Teaching customers was a challenge, but with the proper tools and understanding of the product, it was a winning battle. The ability to manage myself and do my jobs at my own pace. Many of my past jobs have a standard and a direct supervisor that would make orders or tell you what to do on a daily basis. HP was wonderful because I had a goal to meet and standards I was required to abide by, but how I accomplished them was my design and my ideas. It felt good to get wins  knowing that I was the one who crafted the job from beginning to end. When HP took over the company they tried to run the services business like a sales company.  Many of the people they gave a salary cut, with promises to make the difference up on bonuses which of course never happened. Executive level so required a full, very busy, very invigorating day collaborating with executive offices and our local and international teams, as well as supporting my offsite VP. The hardest part of the job was scheduling meetings because of the international timelines involved. The most enjoyable part of the job was the partnership with professional and friendly local and international teams. No chance to advance career at HP Inc.  They are now trying to preach development, but this is only because HP Inc. is being sued for lack of career opportunities. I learned how to manage projects and resources to accomplish company goals.Management was consistent and available.The work culture was open door. There was access to all levels of management.The hardest part of the job was many positions were being outsourced overseas so one always felt like their position was expendable.The most enjoyable part of the job was working with widely diverse culture. Dealing with merging with other companies and lots of employees.Many areas for growth but needs a propoer management and leaderBig company with talented prople. Competitive wage, excellent management, work environment & work culture. My overall experience was outstanding. I would work for HP again in a heartbeat. I really enjoyed my job at HP. It was busy at times, but when you are busy, It is fun and you enjoy what you are doing time just flies by. I would recommend anyone to go to work for them. Collaborative environment, with work life balance.  Growth potential, co workers focused and ready to help you navigate the upper management demands and culture. Workplace culture was fun and enjoyed the after work functionsGreat Learning Experience for a beginnerLearned about Medical Equipment and other products HP has a positive work environment, and for the most part, good people to work with. Very few opportunities for career growth and continuing reduced budgets due to poor senior management decisions. Great job, very good Teamwork, every day was a new challenge.  Great opportunities to grow and development. The workplace culture was great. Trainings well documented HP sets a high bar but they provide a wealth of guidelines and work samples and a mentor to assimilate you into the team. The hardest part is learning and following all the rules because adherence to the rules is as important as the quality of your work. No benefits to contract employees even they are working harder as compare to permanent staff.Lack of planning and marketing, most of the time no work at production floor.Most of the time inventory is short. Items are out of stock. I would strongly recommend working at HP if your are planning to come to live in Boise. Its a great culture, great people, great campus. People here are nice and no one is out to put any one down. I've made lifelong friends from working here. Great teamwork and technical work. Wonderful benefits such as profit-sharing. Lots of opportunities to advance. I overal loved the environment here. IT was a great place to learn and all the technicians are approachable. This was one of the first jobs that I actually liked coming into work Hp is a great company with many opportunities.The departement was short staffed. Sometimes guidance from management was a problem.The staff at HPO was willing to cross train. You have to find the right manager here, the supervisors are usually great, but some of the managers dont seem knowledgeable AND they tend to throw their employees under the bus unfairly. Taking care of an airline can be a high stress environment.The team that I worked with was 100% on board when it came to getting a network change up and working. Would work with that group again in a heart beat. it was fun working there, not paid good, would recommend friends as a job for starters, who needs a good salary has to look somewhere else than HP, stressful HP has been on a downward spiral since the 2000. It has lost its touch and innovative spirit. The merger with Compaq and Tandem and Digital Computers was a disaster. Great place to learn basic IT troubleshooting. I worked in supporting the Shell Help desk Level one and I was able to have a successful amount of time to develop the skills needed going forward I enjoyed my time at HPE/H-P, however I do not think anyone in the 1,000 person Cloud Products division that I was in enjoyed getting pink-slipped and watching our 5+ years effort sold off to the highest bidder - hardly anyone at all was brought on board by the new company. It was really too bad. I liked most of the people I worked with, think that their upper Sr. management is in it for themselves, and let's face it: the company really has not been the H-P that built Silicon Valley for well over a decade. Great team but very very low salaryI dont know why you want people to write a story this is very short and clear Silly Feature Again You dont Management is terrible. Favoritism runs rampant.They will not appreciate your hard work and they encourage an environment of chaos between employees.Terrible and toxic to the mind, body and spirit. Hewlett Packard is an innovative company that helps shape technology with the creativity, energy  and determination to succeed.  HP is a great place to work for because of the people you get to work with and the opportunities available to grow within the company. I have spent almost 20 years. HP/HPE treated me nice but the last couple of years were rather difficult and everything was outsourced.Declining Company with no clear vision. The hardware business is dying and Dells will take over soon. In a nutshell, a nice place to work with decent benefits and compensation with respectable people to work with. I enjoyed my time there and would recommend it to others. Collaborative environment, with work life balance.  Growth potential, co workers focused and ready to help you navigate the upper management demands and culture. HP has always been on the cusp of leading-edge technologies.  It provides a challenging and rewording work environment with an emphasis on employee development. I enjoyed working at HP.  Most of my managers were very good, with one particular standout that really helped me improve my skills and advance my career.  Be prepared to be dropped into all kinds of difficult situations, and to have to pick up pieces left due to poor contract negotiations with clients.  In many cases HP is their own worst enemy, but if the management just let the folks do their jobs, things would improve. Overall, my tenure at HP was great. Wonderful, talented, and diverse people made the daily grind worthwhile.  Only negatives are it possibly become too big over time.  The connection between senior level officers and the teams on the front lines became disjointed.  There was considerable chaos transforming the company every time the CEO position changed -- rippled through the organization. I spent 33+ years with HP and was released by one of the poorest excuses for a leader I have ever experienced. The culture was poor and constantly focused on nothing but metrics and the quarterly financials. While those are both important the old culture of quality, customer service, great products and individual creativity and achievement that can affect the entire team are gone. Such a shame to see a great company begin to crumble because its culture and heart have been ripped from its chest by management that serves itself above all else. It is fast pace work environment. I loved doing my job and learning new things. To me it's all about team work. It was the Alabama medicaid call center. I looked up claims. Changed addresses. Updated names dates of birth. Sometimes i had to do intense research and made sure i always got back to my recipient on the progress. And always made sure it was resolved. Each day was smooth with team meetings 2x a week.  Management was awesome and the workplace was great.  The most enjoyable part of the day was just working with teammates.  The hardest part was being nervous when it was time for QA. Long days, server builds, Management overall was great. No experience with customers. Everyone had great breaks and very friendly. Most enjoyable part was meeting new people. I was only there 6 months I was hoping to get hired on full time but it did not pan out how I thought it would with what was going on at the company. Thought my time there was well spent I learned a little about everything I could possibly could. Work force reduction and lay offs happen way too often. I wished the employees were and their families were considered more often. I have worked for Hp contract worker and direct hire they have always laid off after two years of service. I received oral or written orders from my supervisor to clear buildings' furniture in an orderly and repetitive fashion. The ability to apply common sense was very necessary to prevent injury. Hewlett Packard is an excellent company to work for! The work is very challenging.  However the work life balance and workplace culture are great.  Too many layoff rounds motivated me to leave this organization. Great experience with wonderful people.  The best times were those spend in highly collaborative teams supporting clients to delivery projects on-time and within budget. Terrible company; cost cutting is a higher priority than retaining talent.  Forced large number of work force to a contract house in order to take away benefits. In a company as big as HP, your work load varies greatly depending on the project / manager.My projects were rather relax, and I was able to work on a flexible schedule. HP servers, data storage and network switch technology is outstanding.  I was cursed with a first time, first line manager who created a hostile environment with uneven and unfair account distribution and attempts of poor performance reviews. HP provided a competitive salary and benefits however, you were always at risk of workforce reduction when your current assignment ended.Management didn't seem to always value their employees the past several years. HP is a process driven organisation which sometime could delay decision making. This could impact of customer satisfaction and employee retention.The work culture is flexible depending of who your manager is and his/her location. It encourages work-life balance. After 7 years, I truly enjoyed my time with the company.  There were many good managers and many that were not so good. The business unit that I advanced into was not given enough credit where credit was due. Liked my job very much.  However a reduction in workforce ended my tenure.  People were great and got along with them all.  Managemnet was a little lost on priorities. The warehouse itself is very small in size. Very quiet. It is a lonely job . working alone most of the time. No team work. used a rf scanner  and documented inventory Collaborative environment, with work life balance.  Growth potential, co workers focused and ready to help you navigate the upper management demands and culture. The company split, leaving fewer jobs for existing employees.  Most of the co-workers I had left for other states.  It was never the same.  I guess it looked good oh the CEO's resume. Split company into HPE and HP Inc, wasted tons of money on transition and still performing poorly.  Told employees HP Inc was going to be a startup...yet funding wasn't there to continue endeavor It is what it is. Dont expect much. Dont have your phone out, dont be late, dont leave for lunch because there's no time to go anywhere and be prepared for shut downs/layoffs that last a month at a time. Good for entry level folks, not a place to work a lifetime as upper level opportunities are limited as the business shrinks. They are so focused on cost that nothing else seems to matter. Daily meetings with internal support resources to collaborate on proposal projects in process or to be developed.  I learned that you must always have a mindset of self-development and look for mentors who are willing to advise and guide in support of my career development.The hardest part of the job was trying to make sure that we had a team of people who were focused on collaborating internally, as we worked to meet the needs of the customer.  The most enjoyable part of the job was the people I met, the long life relationships I built, which are still in tact today, and the development I received that I could take with me to my next career. I enjoyed working at HP.  Very good place to build a career.  A lot of nice people that all worked as a team.  I don't have anything bad to say about HP. This job was doomed from the beginning. I didn't receive a laptop for the first 3 months, was never sent to the boot camp training I was told others had attended, and needed to attend, and basically just felt like I'd been hired as firing fodder when the layoffs came around in January of 2014. On the plus side, time off was generous, and the layoff severance package seemed fairly generous in spite of the fact that I'd been there less than a year.The manager was decent, but seemed spread extremely thin with too many responsibilities.Despite being hired as a telecommute worker, HP soon thereafter changed to an office-based work policy, forcing anyone within 60 minutes of an office to drive-in. Fortunately there was no where nearby, so I was exempt from this sudden paradigm shift, but many people had to commute to an office, where they would sit and talk to remote colleagues via a chat program, just as they had while working from home. Ridiculous. On the Phone 6 to 7 hours a day Selling HP products and services,Always learning about new products.  Great environment good people good managers, kept busy and was very productive due standing behind our products,  great place to work Getting the deal ,hardest part of the Job not winning the deal HP, which bought Compaq, which bought Digital Equipment Corp - went through several cultural changes.In 2015 - the emphasis was quarter in and quarter out - quarterly performance.  This made it very challenging to have any long term plan that required everyone's participation.  Was always 'sell more' - even if you were in a technical or support role. I started working for Compaq, but HP acquired Compaq and proceeded to start laying off Compaq employees. Compaq provided a generous severance package, so I requested it from my manager and was granted it before HP stopped providing this generous package. I started out with Compaq in 1999 as a manufacturing/production manager in their Palo alto California location. Then there was HP/Compaq merger and i was requested to relocate. When relocating to houston,tx I was offered a global operations manager position where i was required to work from home. I was working over 40 Hrs. per week as during day time had to work with local customer contacts and in the late evenings was required to work with Overseas team to get the updates on orders, projects and upcoming changes.. So it was never a 40 Hrs. week. During my career at HP many CEO's changed and with that HP culture and work ethics changed. I loved my job as it was required to work across multi cultural environment and off course home office. but with home office it came with it issue as you locked up in the house all day long and don't get to see your co-workers, management or actual work environment..So you really lose touch with upper management then only see everything via papers and reports and based on that you get your reviews graded.but then you get used to it after few years..I would go back to HP any day if i was to offer another challenging position. I would only recommend working at HP if pay increases were given more frequently and mandatory OT was eliminated. They were very good about giving away products that we sold as incentives. Enjoyed my time at HP. Great people. Growth opportunities. Many good managers. Professional leadership, processes, support systems and fairly realistic goals that we always met. Not such a great manager. Daily workload was mainly client oriented.  Ensuring orders placed by employees were properly documented and considered needed for their work.Enjoyed team I worked with. Thoroughly enjoyed my years at HP.It's important to always be flexible to ongoing changes in the industry and make sure you take the effort to manage your career. My manager is really nice and it was a pleasant working experience there. Also the working environment is relax, you can arrange your own working schedule. Would not recommend this company to anyone that is starting off their technology career, because you will not learn what you need for later expansion. Honestly, the management team out of the Northern Virginia was incompetent.  Very dishonest and cut throat.  Personally, my direct manager was very well qualified and fair. She was an asset and a real people person, a listener. Hard worker and motivator.  She was laid off and replaced with a nightmare.  I would never recommend HP Enterprise Services.  Many folks that were there at the time were extreamly stressed and it was a very hostile environment. Loved to work there. I liked the culture as well. The HP way was still there when i left and it was real! I would have gone back but it was all changed I worked in a global organization that had a small presence in Texas, so work culture wasn't great for me. However, when execs came in town from other countries, my view of culture peaked. Could not ask for better benefit options, PTO and holidays. The entire company shuts down for a couple weeks during the December holidays. Collaborative environment, with work life balance.  Growth potential, co workers focused and ready to help you navigate the upper management demands and culture. HIP is a good company to work for, very good pay, great hours, overtime given, fast paced, management was very understanding. Coworkers were friendly and helpful. I dont have anything more to say This is not a good overall job in any way.Not everyone in the world can have his or her perfect job. But no human being should have to spend most of their only life doing something for a job that will never let you advance. Wonderful place to work in. Very healthy competition. Management is very supportive. Hardest part was initial setup in the initial weeks. Most enjoyable part would be the team that I worked with. Absolute gems. HP  is very structured.  They have good benefits and invest in their employees. There is room for advancement but constant layoff's and management changes. Good training and support allowed easy transition into the job roleAtmosphere was relaxed and enjoyableVery diverse and energetic employee basePay wasn't overly competitive but the company was fantastic. If I could get the higher wages I need, or another role more suited to my career path, I'd still be there. Hewlett Packard lost its old culture through the years having removed benefits that impacted the financial stability affecting the employees  retirement benefits. A good place to work enjoy the people and being new friends, Iron Man working with HP to anybody if I had a choice and the program was rehireable I will go back to work for them. Working at HP was very enjoyable.  Worked with very intelligent people and learned many things helping other companies reduce workflows and increase their spend ability. poor 401k matchingToo many splits and acquisitionsLack of company directionHigh employee turnoverThe entire company is not stable, spend much time on re-org every year Good company but pay raises are barely enough to cover annual benefit increases.  Needing consistent managers who are competent enough to do their job. Projects were not defined and lack proactive PMO for Enterprise Support. People pull together to get the job done and all have a family like friendship The work hours are great, you only work monday - thursday 10 hr shifts. You get 2 paid breaks not including 30 min lunch. The bosses are something else tho. they think they can treat you however they deem. They don't pay good unless you are one of the chosen ones. They give you vacation days but you can't use them until they tell you. For some reason you can't directly speak to the president not even a hello or good morning. It was a great experience working here.  I was able to work with many great individuals that helped me learn and excel in becoming an asset to this company The company is a great organization.  However, not all of the employees are equal.  You could be made a lead which pays out more than the average employee, however, the other employees may or may not do anything at all.  This will leave you with the 3+ hours of paper work, phone calls, etc AND the 5+ hours of actual installing of hardware equipment.  Insight Global / HP look for able body employees without putting too much effort into checking past work experience for work ethics of their employees. Great career but wanted to go in different direction.  Great people and benefits and pay.  Challenging business with printers but great projects with the design team. HP lost its way due to poor management in the past and are now trying to reinvent their business in order to stay alive. They are making progress, but time will tell whether they can truly turn around the company HP was a good company to work for. however, due to the wrong management decisions, the company went south started around early 2000. it changed CEOs from time to time but it never get back to the days before that time. Hope it will turn around soon. Very stressful place to work, always worrying about layoffs. Very hard to get promotion if you are not part of the 'good old boy' click. Some good people work here but their futures are not secure. I really enjoyed working for Hewlett-Packard. We often had good days. The management was great. If I could work there again I would. Great company to work for. I have worked under contract for HP for almost 7 year.  Leaned a lot of new things.  Management at first was great then grew down hill.  The people  how ever are great to work with.  You work as a team and accomplish things.  Learning can be a learning curve depending on the department.  Overall HP was a great time and experience. Collaborative environment, with work life balance.  Growth potential, co workers focused and ready to help you navigate the upper management demands and culture. HP provides me many opportunities to advance in my career and grow professionally. Create benefits and a good environment. There is a collaboration spirit between teams. HPE has undergone massive changes in the last 7 years.  The core seems to be solid and with the spinoff of their services and printer groups, the company seems to be more focused.While this is a time of transition for the company, I still recommend working there. Company to big and they did not care about employees.  Would lay off in a heart beat.  No job security.  Company management did not care.  Local onsite management should not have been in management. Sometimes work life balance was hard but due to the flexibility of telecommuting I was able to work things out.  I made a lot of good professional contacts within the sales teams I supported. Enjoyed working there but IBM was giving me all my years of service back and had a number of years there and would get my years back which meant more vacation. Great opportunities for learning in virtual team, diverse geographies and different cultures. The company started to move fast, as per market needs, and has clear goals. Constant threat of layoffs, lack of funding, etc.  Stressful and dysfunctional employee rating system.  Forced distribution for ranking.  Upper management is disconnected from employees.  Direct management can be good or bad depending on personality and ability to handle stress.  Lots of Asia travel for some engineers. it was a good time working for hp. treated their drivers like humans and not steering wheel holders. the pay could have been better but thats all union mandated. I used to love working for this company but lately the company has been laying off workers and this has had a negative effect on the workload on the the existing employees. The company expects to the workload with less personnel and will not compensate with additional pay in salary. The company does not care about who they hire anymore, they will hire anyone now without a degree as long as they save a buck. Family oriented, great place to work, employee were happy and got lunch delivered on Fridays the company paid for and also recognize employees for job well done I work here before they merged with Compaq and I loved it very face paced i learned so much i met great people and I would recommend the experience to anyone I worked for HP quite a while ago, but it was an amazing company! Especially in my first contract there, everyone rallied to work together on a very large, important project the ended successfully. I would go back to HP any day. Laid off out of nowhere. Vacation and volunteer hours are the only good thing. Employees you work with are nice. Would never trust to work for company again. It was a good fast-paced place to work.  It was a great place to learn more about computers.  It let you know about the best drives and hardware to use in personal and business activities. Hewlitt Packard is a strong company with global opportunities. Local management is very capable and compassionate. I would gladly work for them again. good as a side job, flexible hours, and good pay. management was very down to earth and understandable. also the punch clock system was very easy to use. Developing and building new web store was exciting educational and demanding. We used an agile methodology with up to 30 developers in several location and it introduced new programming tools and concepts.  It was a very positive experience until company split and application was outsourced. HP was a very fast paced environment.  It was a wonderful company to work for and I appreciate the years I worked for such an amazing company.  I regret that the work went overseas, for I would still be working at this company had they not relocated. I would recommend anyone to work for Hewlett Packard. Highly engaging and fast paced place to work at with great compensation benefits.  A growing company with multiple opportunities for advancement. Mi dia de trabajo empieza a las 6:00am y termina a las 3:00pm, me gusta mucho lo que hago, sin embargo por cosas laborales se llevan la cuenta para otro pais, cosa a la que uno como trabajador no puede imponer, pero los 8 años que estuve con esta empresa no tengo queja alguna, me gustaba mucho lo que hacia Collaborative environment, with work life balance.  Growth potential, co workers focused and ready to help you navigate the upper management demands and culture. As was the case with DXC, the companies primary objective was to reduce operating expense by shifting jobs to low cost offshore locations. The environment was stressful due to the cost threat of workforce reduction. HP was a great place to work for. I was lucky to have good management that promoted collaboration and allow you make decisions to help the company growth. I loved working here. The hours were great.  The Supervisor was very nice and fair. Upper Mgt. did not appear organized, in my opinion they did not follow thru with promises, or questions. Working there will depend on what your long term goals are in life. I've seen many talented good people get laid-off in the organization i worked in. You can make a good living, but I'm not sure if you'll make it to retirement. I left on my on accord. I loved my job there, the only draw back is that I worked day and night, In the office during business hours and then at night working with the India HUB team of developers to install code. I really never had any time off even to sleep The work place was clean,friendly and very spacious.I have learned how to drive Forklift there and it was the first time I was working as an Inventory Control associate. All work assignments were challenging and rewarding with complete customer satisfaction.  I provided the best customer service to HP management and their client. Started my career in HP. I could only say positive things about the company itself. The management is OK, could be better. But overall, I had a great time there. I learned a lot while working at Hewlette Packard  I was taught the pros and cons.I worked under great supervisor that took time to show me the rite way to do my work.I also wanted to stay permenant but the job ended to soon.Thank you  would love to come back. Could use more collaboration across departments horizontally.  Overall a stable place to work, but not easy to change jobs or find new jobs in the company. Had great life balance, a great experience and learned a lot, was hard to move up in the department I was in. Management was ok as well. Overall great work environment if you fit the culture. This job is stable and secure. You get paid well. The culture is a bunch of super comp sci people so if you're into that that's fine but I wasn't so I left. HP products was a family owned company while I was there, and it was a great place to work. they cared about the employees and took care of them. they have since been sold. The people are good to work with.  Leadership is fine, but sometimes inconsistent approaches.  Remove vs. onsite work  options change frequently.  Benefits are good. A great but slow job where my duties were to look for alarms from a handful of their 'Enterprise Customer' base and do layer 1-2 troubleshooting. There was not much variation and a lot of eating. stressful place to work at, I learned a lot about the HP equipment hardware and how it's been designed, I thought it was pretty fascinating, the hardest part of the job we had a manager every 2 months and every manager brings a  new rules, so we had to change the work rules every 2 to 3 months Started as a transportation driver and ended up learning calibration, upgrades and repair.  Everyone was responsible for their own area.  However, when there was a lot of work; training was offered.  Teamwork was the best part of the job.  Free breakfast on Friday.  Occasional catered lunch for office.  Played basketball during lunch breaks and played golf on the weekends with coworkers. Easy going, nice place to work, room for growth Team meetings to make sure everyone’s up to date with product information. Friendly co workers who are willing to help with growth Departments that bring in a lot of money have the best time and appreciate working at HP.  Then again they get all the recognition, retention, and HP products for personal use, budget raises,and new computers, pens, paper, etc.  The none money making groups constantly get shafted no matter how much money the company makes.  Take this year and all the bragging that was done by leadership and the most any of us got was 5% bonus and merit (majority was 1-3%).   The mock how little they provide yet admit that they require corporate functions (HR, IT, Real estate, Marketing, Legal, etc) do not only their jobs but other as well. The environment is not health and some have said it rises to bullying.  If the benefits were better maybe that would make up for some of the insanity and abuse, but those suck as well.  Plan to work as much as two jobs get a secondary insurance at your on cost or set money aside to cover any medical expenses, do not be appreciated, and unless you are one of the chosen ones you will not be given opportunity to change departments or be promoted much less paid at the industry standards. What ever you do, don't need migraines, birth control pill, or sleeping medication as only ED (men's meds... apparently the name is considered inappropriate) medication seems to be covered. Worst of all....do not have a life threatening emergency as you will be denied treatment in most cases and will be force to appeal the insurance company on you own, since HP is self insured.  Hopefully you are not a diverse candidate, there are not many of those  outside of the IT program roles. I did not like this job, infact I hated it. I wish I never worked here. pay was good though. Hardest part of the job was everything very stressful.... Collaborative environment, with work life balance.  Growth potential, co workers focused and ready to help you navigate the upper management demands and culture. My job at HP was the best job I've ever had.  Pay, benefits and job security were excellent, and I made the best friends of my life there.  Very good environment. I have been working with State Project (CMIPS II) in HPE,Learnt a lot for my future and also good working cultureHad really good team members helps at all ime I'm looking for a position where I can grow and eventually become manager or a higher level I'm very motivated and a fast leaner very indepent person that you can count on to get the job done . Just a great place to work.  Employees are treated well by management. Workload was always considered in assignments.  Also a good learning environment because assignments were also focused in broadening experience.Employees are always recognized for our job performance. Very good company to work for. Every thing is provided for you. Very quick start up pace with. Opportunities to move around in the company. Very good experience HP did have a fairly structured and smoothly operating system. The work was steady.The installations of equipment involved replacing Bank of America work and teller PCs with new ones. I also had to replace and reconfigure all servers, printers and scanners, including Point Of Sale Quick Teller Service equipment on the teller lines. This was a terrible place to work. Constantly seeing people being scape-goated and thrown under the bus so their supervisors/managers could cover their own butts. Hard work/quality results = no pay raises. It can easily take 3 - 5 years to go from contractor to direct hire. Everything is awesome. Training was vey informative. I learned new skills and met new people. I recommend this job to anyone. It is fast-paced but you have a team. Typical day was me going in and helping train anyone on HP products and services.I learned that HP has many innovations out there.My manager was very helpful in helping me to grow the customer base whenever I needed some assistance.The workplace was very fast paced but enjoyable.The hardest part of the job was not being able to please everyone.The most enjoyable part of this job was learning about the newest tech before it hit the stores. HP was, by far, one of the best places I've worked at. You get there on time, get to your terminal, do your thing. I never had to rush, or stress. There's always at least one manager or lead there, in order to help you out if you're in a bind. The hardest part of the job is when customers aren't happy, but I think that's part of most jobs, still, there's no better feeling than finding a solution that ends up working for both the company and the customer. Working at HP was a great experience and has helped me grow and understand team dynamics within a corporate agency. The work was demanding but rewarding once complete. It was a great job absolutely love working for the company of heward Packard. HP is one of the greatest companies I ever had work for I love working there I love the people that work there Great Technology and Services ... Stressful environment...lots of reports and con-calls ... reaching over to other departments was a Challenge...but always got the job done...   Lay-offs are always on the Horizon.... Indeed's freaking making me write a review of 117 characters. It totally sucks because i'm just trying to see what other jobs are out there and dont really care about writing a review for HP. Great benefits, but not great management and little support/training for my position (field tech). World-wide company should be able to provide better tools, but I found them lacking. Good benefits compare to its competition.Professional Management encourages employees to be proactive in dealing with customers issues. Management supportive of its employees activities and appreciate employees initiative to bring in additional business from its current customers. This is a good place to work, I would recommand this to anyone who is starting or is fresh out of college, good place to build your prof skill.Thank you This is a great company to work for. I ended up here after being a security officer for Indiana University Health. I came into this company with great benefits. While Hewlett-Packard is always attempting to utilize the best applicable tools, it is, nonetheless, a behemoth of industry. Changing direction often takes time, especially when a company effects millions of people across the globe. It may take more time than a sleek startup, but HP still runs with the best, and aims to top them all.Open to suggestion and reveling in innovation, the company is ready to look into new ways of thinking and even able to reflect upon their current goals and processes. Did not like HP after they bought EDS, they reduced our pay and gave no raises. they should of stuck to making printers and computer system. It service was not there specialty. Collaborative environment, with work life balance.  Growth potential, co workers focused and ready to help you navigate the upper management demands and culture. I was laid-off 2 months after being awarded for being one of the highest billing employees by HP upper management.  Upper management and HR would not help.  I am a single parent and take care of my 74-year-old mother. I would not recommend to anyone to be employed by HPE. Management does not take accountability for anything and the old saying of stuff runs down hill is the motto of upper management. pay is not even compatible to the market and benefits and bonus are the worst int he industry. I enjoyed my position at HP and the sense of community among my co-workers throughout the business unit and corporate culture. It was particularly stimulating to interact with a team that was located throughout the United States and across multiple continents. Management worked hard to develop a high-level of employee engagement and positive culture during much corporate realignment. I learned a lot about how to design and implement an effective & positive employee engagement community and atmosphere. low pay , no advancement, work life balance is great because you dont have to clock in and clock out. Work for home is possible for some positions. Managers do not recognize achievements Very big company lots of options. Safe, They take care of their workers.flexible hours. good attitude.I enjoyed it but the location and pay did not work for me. it was a grreat  job,with great benefits and good pay,we work alot of hours so the life balance was crazy.we all got along with 1 of another ,the management team was awesome. If you're young and bright don't work here. It's mostly for older people and people who like to take ten years or more to advance. Office manager was really nice. Difficult to navigate as a new person. The HR system is very cumbersome and onboarding is a huge challenge. The employees are very very nice but in my experience the management is difficult to deal with. This is great environment company.  I had learned a lot of experiences, well trained, and very great field service jobs. I went to many companies in bay areas.  Most of them are great companies . I got chances to learn from many great engineering and experiences... Fun culture to work in.  Solutions are test in the lab with specified limits before client implements solution.  Other vendors unknown to the customer use the customer as the lab.  Return those solutions when you suspect that is happening or communicate with other business and discuss their experience before buying. An open door policy -(announced) but not really enforced--Management did not keep up with up- to -date working equipment.  The sad spirit of Employees not trusting Team Leaders, Supervisors. Otherwise the job was workable. I worked at the Aguadilla Ink Cartridges facility. I was on shift, which was not ideal, however, it was a great team. I performed Quality Control (QC) and really enjoyed it. It was competitive yet encouraging environment.Recommend it! Very stressful and cut-throat once you reach an age close to retirement they lay you off. I seen this happen to many co workers over several years. BEWARE!!! Worked with very bright people. It was not very stressful place to work compare to other high Tech companies in Silicon Valley. paid was not good as I was a contractor I did not have any medical coverage. It is a good  job over all. It is competitive  with a nice pay but less hours. below 15 hours a week. Despite the medium pay range above minimum wage. Great company, great products, outstanding work environment and nice management team to work for. Great place to get personal development. Highly innovative, world class technical level and most of all extremely talented people. Over load you with work - but pay little. Work long hours. But this also depended on what department you work for. When I first started it was a great company, but over time different changes with management. After about 10 years of CEO changes and senior level managers' inability to fund R&D, there is nothing left of the company and it is being sold of piece by piece. There is no future for the company of the employees that are left. Wasn't enough man power. managers had problems with other managers nobody works together unorganized just a poor company to work for wouldn't recommend at all Collaborative environment, with work life balance.  Growth potential, co workers focused and ready to help you navigate the upper management demands and culture. HP gets a good reputation somehow. If you like being tortured by customers then be sure to work here. If you like gossiping managers and unfair pay and bonuses, be sure to work here. Do not come here with a genuine personality, put on your fake enthusiasm and be prepared to pretend for the rest of your employment. As a CE you have quite a bit of control over your schedule.It is up to you to keep up with the new products being marketed.Management is by numbers only. HPE is no  longer has an employee centric culture.The best part of the job is that you could team up with peers on complex projects to get it done in a timely manor.It was a royal pain to keep account your time. the tool to do it was horrible. Excellent company, great benefits, gifts and pay is outstanding. Best company I ever worked for by far, exceeded IBM  and At&T. Great managers and a great support team to sell your products.l Working for HP as a contractor, you were treated as such. Contractors were not allowed to certain areas on the camp. The job was very stressful especially working the night shift where all backups would run. Working as a field technician under contract for HP is stressful and costly. Pay is low as a contract employee and you are expected to provide your own transportation, including gas and maintenance. The area covered is both the Phoenix and Tucson metro areas. The benefits are minimal with no holidays or vacation. The demands are excessive for both daily output and administrative functions. The customers are usually great, but can be demanding. Worked in IT.  Hours were un-predicable at first then I implemented a follow the sun policy, which worked better with my global teams.  Gave them more of a personal life work balance. The unfortunate part is that the IT portion of HP was off shored. 1 HP Site I worked at was outstanding in every way as an employer.  When they sent the work overseas and closed the factory, I transferred to another factory.  It was terrible.  Most of the managers did not have a Bachelors degree or people skills.  What a difference Excellent environment due to their policy to allow their employees to work whenever they choose, and expect results that bring inventory quotas in monthly. We have as of the last audit have done an excellent job for this time period. As a contracted employee, I found the work atmosphere on campus to be very professional.The regular HP employees treated contractors with respect and courtesy. I loved working for this company. It was fun but we got so much accomplished. We were the best company to work for anywhere!It was easy to get ahead if you worked hard and made improvements to the production processes. Working as a call center representative had it's challenges, but they did try to make the work as fun as possible. We were rewarded for good calls, and they had fun on the holidays. Overall HP is a great company with great products! Benefits are very good besides the 401K match is no longer matched quarterly. HP now matches the 401K annually. The new HP is too interested in hiring foreigners than US citizens so I don't recommend this as a place to work. Let them hire all Chinese and Indians with H-1Bs. I worked at HP for 25 years starting out as Compaq.  i went through all the changes.  Great campus to work on great people to work for.great opportunity for advancement HP is a great stable company with great culture.  very people based who like to enjoy a good work/life balance.  Advancement is available if you want it, but also happy to let you grow and advance in your current role to become a specialist. You have to monitor the work load with lots of Screens to follow. Implement the written procedures and participate in the trainings The work load was part of the team efforts to succeed.Learned lots of the new technological and found it to be challengingand rewadrding. Worked at Philippines HQ. I'd say that there's a good work-life balance, very competitive, fun place to work into. Above all else, the culture is what stands out the most. Hewlett-Packard encouraged continued education by providing education reimbursement, this ensured that the employees would remain employable both inside and outside the company. The workplace culture was positive and encouraging and produced a family-like work atmosphere. Nice people, products and service. Great place to learn professional sales acumen. Excellent product line for most individuals and business/government. Many learning experiences. Very good exposure to differing technologies and ability to change positions and locations.  I would recommend this as a first or third job for someone. Collaborative environment, with work life balance.  Growth potential, co workers focused and ready to help you navigate the upper management demands and culture. Dedicated and focused Administrative Assistant who excels at prioritizing, completing multiple tasks simultaneously, and following through to achieve project goals.  Answers a high volume of incoming calls while handling in-person inquiries from clients and colleagues.   Flexible and hard working with a strong drive to succeed. My experience (dates back to 2010) was a horrible culture.   Company had people convinced they were fortunate to have a job.  Top performers were not recognized.  Management was terrified of the changes coming from executives.   Survival mode was prevalent. Would recommend that others work there. Can be stressfull at times but management and team is very supportive. Time on the phone with customers building repor is key the enviorment was relaxed and co workers were great. the boss was a very nice kind man. I would recommend this place. pay was not so great. well balanced overall. Hewlett Packard has a beautiful huge campus. They treat their employees fair. They have security guards that wont let you in unless you have a security badge. Which keeps out the Riff Raff. Typically, I prepped documents and prepared them to go through a scanner. Management was pretty fair and for the most part the work environment was cool as well. I enjoyed the holiday parties and the genuine love that floated around their establishment. nice work day, shared learning, good management, great work culture, would go back in a heartbeat.  Good co workers relationship for everyone.  Loved my job. this is the most stressful work environment I have ever been in. I experienced a senior team member who had more than 10 years with EDS and 'HP' go off during a regular project meeting and just meltdown mentally due to stress she was feeling It was not enough support of Management for employees while work on GM site.  I learned working Unix servers and application support on the workstation. Leading multiple conference calls and attending meetings via calls.  Managing IT and business teams to get maximum support for client contracts. It's all about your team at HP - there are excellent teams with excellent managers.. I was fortunate to have that for my career at HP.  It is difficult to manage teams when there are integrations due to mergers/acquisitions, when employees know there will be RIFs.  I was offered many opportunities to grow and develop at HP. Lots of changes due to mergers and acquisitions. I don't feel anyone ever feels safe at their job due to all of the changes and seems to come regularly. From the start, HP wants to make sure you're doing what you love. You're encouraged to have dialogue about your work life, projects, and communicate often. While still being a team player, you're encouraged to push the envelope and pursue your own foresight into the company and industry.The workplace culture is open and relaxed, though work moves at a very fast pace. From a woman's perspective, I always felt in equal standing with my male coworkers. My management was extremely accommodating and responsive, and ensured I would get the most out of my internship there are possible. My internship there was the perfect supplement to my studies in UXD. I would highly reccommend them to anyone pursuing a similar field. HP is lacking a defined culture.  The management only cares about itself.  The culture where top executives have frequently changed over the last 15 years is evident, it is in disarray. HP is a great place to work, there is definitely a working HR department there that cares about employees.HP takes employee satisfaction and advancement very seriously. Managers, for the whole part, are highly professional. Wish I was still working there. Great Company, Great Campus. The work schedule was rough, constantly having deadlines, but very rewarding. I was able to work with the latest HP Proliant Servers and Software. A typical work day at HP consists of meeting with the team supervisor to discuss top priorities for the day, which could range to a number of things from software upgrades for enterprise servers, to Server Imaging, to Cluster Network Setup. I learned a lot while working there. If they were hiring then I would go back. They do a lot of layoffs so it would have to be more of a second job than just an only job. My most current position was a contract position. Contractors need to be kept informed with org changes and other pertinent information, not NDA constrained,  regarding the decision affecting all employees. There is a sort of structured tier  regarding the aforementioned experienced at HP unlike other competitors. started working at digital/Compaq/hp several years. Best company by far, many job opportunities, in-house training, flexible hours, telecommute , work from home.   decent wages.  The most professional colleagues hands down. The company is growing and outsourcing.  The staffing model the company is going to is not going to be sustainable in the coming years.  The current CEO is a great leader, however. Collaborative environment, with work life balance.  Growth potential, co workers focused and ready to help you navigate the upper management demands and culture. Super slow paced and boring. Management breathes down your neck and their claim for 'work-life balance' is not even close to accurate. They're doing mass lay-off right now too. HPE was a great place to grow in my career. I believe others can still have the same experience, you just have to go out there and seize the day! I think I have at least 6 different jobs while at HPE over the last 20 years. Lots of opportunities. The split of Hewlett-Packard into 2 separate companies has done wonders for HP, Inc. HP is now much more nimble, moves faster, focuses on the right business objectives, is delivering what it promises to customers and the street, and is improving the internal culture.Downside: very limited upward mobility for long-timers. Roles are filled with external hires instead of promoting from within. good opportunity to work at innovating company, fast pace, and energetic.  company can find ways to be engaged with employees and share goals for future. I participated as a 1L Summer Intern. The Best internship ever! Amazing pay and full benefits. Also a chance to work with any attorney or any issue throughout the company. I loved going to work each day, there was plenty of room for advancing.  I received additional training as I took different positions within the company.  Pay was great and allowed less financial stress.  Work place culture was great . Unix Systems Administration and System EngineeringTroubleshooting, analysis and project management.Very stress as continuous layoff rumours....... great place to workLots of travel, company carOn going training on HP product.Independence, of performing work load.Customer satisfaction most enjoyable part of job. Started as a big company buying other companies.  No specific goals or direction.  Now it is down sizing by spinning out certain areas.  Most work is being done in other countries. Fun Atmosphere, Great Management, Competitive fun environment, Good positive upbeat people, Loved the fact that I could Watch football, Check my feeds, While selling over 1.1 million in revenue for the company in one year. A fantastic company.  Recently I believe the products have become inferior in quality.  But then again I no longer work with them!It was a pleasure at the time.Things I did:Project Presentation and projected AnalysisBeta testing of technology (reporting, analysis, field review)Sales and Marketing techniques and presentations to increase market share. Fairly straight forward place to work, the people and nice and so were the benefits. While it did not work out for me, I wouldn't dissuade others from working there. Good to work for a large company due to the positive reputation we brought.  Other employees were technically skilled and helpful.  Vast opportunity for training. I spent 23 years at HP. They were filled with variety, great support, challenges that expanded my capabilities and competitive financial benefits. Although there were an enormous number of reorganizations and shifts, the experience was very valuable! Too many worforce reductions to be a reliable job. Very stressfull and high turn over rate. Shorthanded and not much support from anyone. The hardest part is having a support team that is overseas and you cant understand them. good work environment with a defined work culture that help each other and department to succeed.  Employees are treated with respect and with a friendly environment. May have been the team I was in, but no one worked more than 5-6 hours a day.  This is great if you're content with not advancing or learning anything, but it wasn't for me. I want to know that I'm earning my salary, and helping the company grow and be successful. HPE seems to be in a permanent job cutting mode. I left before I would have been laid off like many of my coworkers have been. Company is now poorly run, decisions are all about cost cutting and not about growing the business. That is if they could figure out what the business is actually supposed to be.Not a good environment to work in now. Future does not look good. Team members and managers were very knowledgeable and patient in teaching and getting everyone on board to help everyone be successful at the same time.  Everyone was a champion and knew what to do with or without management when the time came due to earlier training by management teams. Its a nice place to work, very nice people, but rarely had fulltime jobs with benefits, and rarely give jobs with benefits only temporary jobs without benefits, Collaborative environment, with work life balance.  Growth potential, co workers focused and ready to help you navigate the upper management demands and culture. I thoroughly enjoy what I do, but there is zero job growth within my state and when we lost the contract, my only option was to relocate or find a new job.  No matter how good of an employee I am, there was zero support from management to help find or recommend another position internally.  It seemed as though the only people getting promotions were those higher up.  For those of us working in the field, there was next to no promotional opportunities.  To even be promoted from one tech level to another (the main way to earn more money), your manager has to recommend you for promotion (but can only recommend so many a year) and then someone who doesn't know you or what type of tech you are decides whether you deserve that promotion.  Unfortunately for me, we lost the contract while I was up for that promotion, as well as being told before the contract loss, that I was being named one of the team leads for my area.  At the end of the day, I'll be handed my walking papers with no chance of coming back to work for the company should something open up. Great company but can be difficult to advance if you are not in with the right group. There is no real set track for advancement other than brown nosing as best as you can. I was responsible for line of servers that were deployed worldwide.  I was notified of all quality and design issues that were discovered in the field and it was my responsibility to implement design changes to prevent issues from reoccurring. Not a bad place to work if you like working for 5 different companies at once. So many different accounts to memorize, lots of reading and scripts. Hours are not that bad though and pay was decent. Long tenure with the companyEasy to move to new jobs if the fit is right and openHigher than average people developmentManagers were always supportive and solid coaches HP was a great company to work for.  If you wanted to improve your skill or gain new ones they would enable you.  The company had a great atmosphere.  The managers were enabling and encouraging.  I would go back in a second.  I got caught up in layoffs after their purchase of Compaq.  If I could be I would still be there. If you're a contractor expect low pay. Otherwise it is a very relaxed environment. HP employers have it much nicer with relatively good pay. If you're going into being a lab tech expect pay of 12/h. rip I liked it.  Autonomy did amazing pattern matching , borderline AI stuff.  I thought it had the possibility of changing the world and was disappointed to see the technology misused int he HP acquisition. HP was a great place to work.  Many great benefits and lots of opportunity for career advancement.  Days were long but so were the weekends.  Work life balance was great.  Management was always there when needed. Good life and work balanceGood work environmentLower salaryNo perksNo BonusNo travelNo Promotion is hardest partGood work cultureOK management When it was Compaq computer it was like a big family. I wasn't like going to work. When you woke up in the morning you did not dread going to work. I hope to find this true at Amazon. The executive leadership and many lower end directors just simply do not have any idea what is best for the company. Just all about them. HPE, even though I was contractor, I saw this on an unimaginable level.The moral was the worst I have seen. Hewlett Packard has been and is good company. I worked there years before moving to Aerojet. One of the main employers in Roseville area. Nice campus as other companies have located in some of HP buildings now. Same job and functions as company was taken over by Compaq and my job continue on as it was.I did perform yearly visits to customers and part of being a TAM. I enjoyed the work and the people that were my coworkers HPI outsourced the entire shop to Mexico. HPI management is more concerned about moving up the ladder then developing their work-centers. A huge amount of politics at HPI. The majority of my years at HP/Compaq were enjoyable. Fast-paced, but not really high pressure. All was good until HP bought Compaq out and they began laying off mostly previously Compaq employees. My typical day consisted of picking up my logistics every morning from UPS for our day.  Our customers ranged from residential to commercial.  I was responsible for repairing all HP equipment and in the event a need was presented, offer to sell additional parts or warranties to clients. Best people to work with.  Strong management.  Amazing products.Good opportunities to make an impact.  Challenging market place.  Have weathered it well. I was a board inspector and the job was very easy to manage and there is a lot of documentation on everything.  Every day you learn something new and there is always something to do. Colleagues are very good to work with and the benefits are very good. This is a great place to start a career which is what i did. They gave me the opportunity to work while coming out of college which was great for career. Collaborative environment, with work life balance.  Growth potential, co workers focused and ready to help you navigate the upper management demands and culture. I absolutely loved working for HP. My direct management was great to work with as was my team. Our customers were awesome, too. Sometimes work would get stressful, as any support position will, but we always had help. They treat the Hispanic line workers poorly. They do not do a good job at securing line worker tenure. Too many temps with little option for job stability. Employ too many people at floor level that do not have proper paperwork to be hired. This  creates high turnover and makes for nearly impossible improvements on the floor. They can not keep floor supervision. They must work harder to retain good floor supervision. HP used to be a loyal, great company to work for.  Now, its all about the bottom line.  Profits are important, but not valuing employees has a negative effect on productivity, so offering no job security only hurts the business. Layoffs and threats of layoffs only motivate employees to look for new jobs, not try to make the company more profitable. work is pleasant.  i have learned how to work hard to achieve goals, how to build relationships with many people. manage a lot of accounts.  the hours fluctuate too much and need more stability as far as hours.  main drawback My overall view on HPE is, that they are very helpful with all projects and are also helpful when a natural disaster. My workload is pretty simple/ I love a challenge and I can not wait to try a new project because HPE is always elevating to another level all the time and that is what makes this job exciting. I have worked at the Roseville, CA HP and the atmosphere was great. The people are determined and hard working. Also worked at the Rancho Cordova, HP which is a small office but worked with the receiving department and the training and business was exceptional. Little support for remote consultants. No perks like company cars. They no longer have an educational assistance program as they once did. They are really not into the service industry anymore. the company down sized sending all its work to mexico and let go all of their manufacturing departments. but not before hanging us by a thread giving us hope that we would have jobs. and slowly taking all of our hours away. you had to show up every day but after driving there 50% of the time telling you there was not enough work so you have to go home. and if you didn't show up they gave you points to determine if you were worth keeping. Hewlett Packard was a great place to work when I was there but I have since heard that it is not as good as it once was.  It is sad to hear but  they merged another company and the culture changed Buenas relaciones interpersonales, puntual, cooperador, abierto al aprendizaje. HP as a company was going through a lot of reorganization that made it difficult to understand your position within the firm. Headcount reduction was rampant. Jobs were being moved to low cots countries. HP was a great place to work, along with great people working together and accomplishing meaningful work.  If one is willing to do their part, management is highly supportive. HP was an interesting time in my life. My entire family worked there all at once and It helped make the hard times much more bearable. A typical day was usually not typical. I was in charge of a lot of different project and had to manage which ones had a higher priority over the other daily. Some days I would be at my desk sending out emails and reminders of processes all day, others I would be down at the loading docks prepping shipments. This was at times a little stressful, but as I got into the swing of things this got much easier, and my co-workers were some of the most amazing people I had ever met, always willing to help out or give guidance. Management at HP was great overall. As a contractor it had two, one through VOLT and one through HP. My HP manager was much more present and knew of what I was doing more than my VOLT manager. I appreciate all that they did for me, they both really did look after my needs and were almost never too busy to listen to me if I had any concerns about a work related issue.I learned so much from my time at HP, and did a lot of things that I didn't know I was capable of doing myself. I would be challenged but it was all worth it, as I know they wanted me to succeed. I learned a lot about Excel and the countless tools that you can use in that program, and well as plenty of organization skills, especially when it came to all the different emails relating to various tasks.Overall my experience was a great one working at HP. It was my first corporate job and I met a lot of truly amazing people there, and for that I am thankful to  have had the opportunity/ Some of the best hardware available.  No need to reinvent the wheel every 6 months.  Simply improving upon products here and there is all that is necessary. I had two different positions at HP. My first position was great, but the pay (for what I did) was low. In addition, my position was due to be 'best shored'.I then took a promotion to a new position and found the management to be poor. They didn't listen and just kept piling on the work even though I was already working late and worked every other weekend. I was required to perform a task alone which was also being performed by other groups with about 10 people performing the same task. In addition, I was to perform this task by 5 days after the close of the quarter. The other people performing the task took about 3 weeks after close to complete their analysis (with 10 people) which is why they wanted me to complete the same analysis.In addition to the above task, I also maintained a data warehouse using Access (I would have preferred to use SQL Server, but our repeated requests were denied). The data warehouse contained about 10G of data which required constant management and splitting of data into separate databases (Access can only have 2G of data per database).Finally, I maintained a set of KPI reports for upper management, but was not permitted to work directly with upper management because I was not in a management position. Because of the poor requirement gathering, I was constantly required to make changes to the reports.In summary, because I was getting all my work completed, management continued to assign more work. I informed them that I was having to constantly work excessive hours, but was ignored. I knew that I would eventually fail due to the  continued increase in workload and decided to leave rather than fail. Company was always going through restructuring and downsizing meaning opportunities were limited as was job security.  Since leaving the company has split and I believe the culture at HP Inc has changed but not so much at HP E HP is a great place to work with a lot of education opportunities for their employees. It will train employees for basically any skill that is lacking. The environment is professional and the corporate culture is also professional. Benefits are very good. The management is well trained in leadership courses. They believe in treating their employees well. Not people friendly - company is less interested in keeping quality employees than saving a buck. Putting in almost 20 years, thinking you are improving your value to the company is 'rewarded' by being placed higher on the chopping block. Great place to work.  Work with many different cultures through the Country.  Training available for different aspects of the job.  Work/Life balance was important to the company. call center oriented. talk to 400-500 people daily. work place has low moral and high turn over rate. hardest part dealing with angry, upset customers. Collaborative environment, with work life balance.  Growth potential, co workers focused and ready to help you navigate the upper management demands and culture. A typical day would consist of answering inbound calls for tech support on HP products like Laptops and desktops.The hardest part of the job was getting training on products we support. HP's culture and management style is what attracted me to this company.  They have a formal training program for their managers so they can be successful in leading teams When changing careers within the company, there is a cap of 20% on your pay increase.  I moved to a job that should have been double what I had been making.  I unwisely chose to make the move for a pay that was 40% below what it should have been. HP was a great place to work but the threat of layoffs was always looming in employees minds.    I worked with a great group of people and had some awesome managers.  The last manager I had was by far one of the best I ever had.  He truly cared for his employees and you could tell that by his actions. I enjoyed working with external customers and selling as part of a collaborative team.  Learning about the IT industry and its ever increasing changes over time was quite invigorating. I worked at HP during a time when HP was entering the IT consulting business intending to compete with the big consulting firms. HP ultimately decided to change its approach and business model. In my 14 years in HPs Outsourcing arm I had 17 different managers. There was no way to build a true development plan because the new manager Would have a different focus. My last manager lacked leadership skills and set unrealistic goals making it impossible to meet. Stressful environment, too much work and little appreciation, not enough support from co-workers, hard to find help or motivation.good place to learn all about hardware. I like working for a Fortune 500 company.  This was a division, formerly EDS and as a result was easily sold off, due to work force reduction. The computer system was outdated, depended too much on EXCEL spreadsheets instead of DELTEK, COST POINT etc I like what I do, but not the turnaround of employees in my department. The pay and benefits are very good. Fair amount of holiday time and personal time. HP believes in off shoring all U.S. technical jobs. Drastically Reduced employee benefits. No raises unless super performer.Unfulfilled performance based compensation promises constantly. I was part of the major layoff of remote/telecommuter employees. It was stressful leading up to it. I'm sure the experience would be different now in a more streamlined organization. Love my coworkers and the my direct management, but we suffer from FREQUENT reorgs and strategy changes, which prevents forward progress.  That's a bummer, and exhausting. Sought new sales opportunities for the company, supported the information technology department with all technical conflicts and inquires, and coordinated with multi HP Field Representatives across the Greater Los Angeles area, New Mexico, and Arizona to unveil innovative business branding and opportunities. Typical day starts from 0630 thru 1500, the work load is a fast pace. The team members pull together to get he job done quickly and in safe manners with guidance of the supervisors and managers, normally  they would leave  us alone to performed our daily duties.   The most difficult aspect of the jobs was coordinating with costumers because working with  civilian workers they tend to show up a little bit late to work and that would put a kink on our delivery schedules.The most enjoyable moment at work is that all team members pull together as one to get the task completed on time. good work environment lots of overtime and crunch schedule.warehouse had no ac so it got hot during certain season.it was crowded at times do to pore work space. Rewarding manufacturing job . Hours were good and flexible if needed.  Work was fast paced at times but was rewarding.Workplace culture was pretty relaxed at times In a fast paced work place with constant changes made by the client it could be challenging at times.  Helping the insured and providers understand the insurance and claims process made my job worth doing.  Teaching new hires the job and see them succeed  was even better.  The hardest thing about the job was telling the insured or provider that their claim was not getting paid due to policy and procedures set forth by the client.Each month management came up with ideas to show their appreciation of the hard work by the rest of the staff. I uses to like HP, the first time i worked there, it wasnt to bad, decent pay, good hours, no advancement, but the job culture was ok. Now, its trash, complete trash, they pay you well below what they should be, no chances for advancement, no benefits, at all. Do Not go work for them, unless you have no other options! HP is a great company to work for locally. However it's unfortunate senior leaders sitting in their ivory towers are so removed from the good work being done at the grass roots level.  It feels all they care about is $$$'s.  They seem to forget that without the hard work and commitment of their employees worldwide they wouldn't be a successful company making $$$'s!  When it comes to reward /  recognition the imbalance of distribution is a joke - especially for lower levels of management and individual contributors.  For a company that makes millions to offer employees at best a 2% bonus is an insult.  I'm sure the Executive level employees wouldn't be offered the same! "
                },
"encodingType":"UTF8"
}
