{
"document":{
"type":"PLAIN_TEXT",
"language": "EN",
"content":"Great company with passion for its employees and customers. Easy picking path the hours are crazy thoughA lot of over time mostly on peek season.Not too suitable for people with families you work all day.If you like the money there you go. Overall a good place to work, however each year seems to bring about a new direction for the company. Worked in a couple roles that allowed me to see how many areas of the business operated. Production place..good communication between boss and employees. Need to respect a little the workers life because sometime forget that..the people there try to do the hours on time but sometimes need like a minutes range en case arrive late. pockets of capable and strategic thinking people, but the other 'lifers' quickly drag them down for fear of change or losing power. Terrible or non-existing policies and rigors of how things are done so everything is a firedrill. I can only speak for the location I worked in. It was inconsistent the management team was unprofessional. the morale of the employees was low. Managers sleeping with employees. This is the worst accounting dept I have seen in my life. There are way too many people touching the same accounts and way too many duplication errors. The management team leaders are very poor and unprofessional with a lot of favoritism which leaves the moral very low. And on occasion be prepared for random people to come yell at you in a very unacceptable work environment manner and management doesn't do anything about it. That should be grounds for them being fired. No one in other depts seem to know how to do their jobs or they are just all very lazy and so there is no support from other depts to resolve issues. Very poor working environment with people who don't care to help anyone else. No team work at all. Would not recommend anyone to work here! This is very much a learning organization - consistently sending out surveys to employees for feedback and insight.  Information is searchable internally - you should be able to find answers to your own questions.  However, with that being said - you will appear to be an idiot if you don't know how to use all the tools at your fingertips. The interaction (million scheduled meetings/activities) between superiors and entry-level employees seem a bit robotic/forced.  This company still needs to find an authentic balance between our advanced tech-communications and our actual human resources/interactions. Great job to work, clean place to work, fun work place, big break room with real cooks, enjoyed working with Management, got to buy Products at lowest price Great place to work, co workers are great. Very understanding management. Fun place to work. Lots of free food and perks. Beautiful facility. Very secure. Exciting and technology is on the edge. working  6 days a week at least 8-12 hours depending on workload. had to learn as you go after trainingmanagement wasn't very dependable when it came to  answers to questions about workhot in summer and cold in winter hardest part was no time to self and familythe coworkers were the best part I enjoyed working at Ingram and really enjoyed the different people I came in contact with including Ingram employees as well as the customers I supported in the field. In my role there I was able to provide suggestions on hoe to grow the business as well as effect the way we shared our solutions. Because of the travel nature of the role, attending the many Ingram events, I was exposed to many different solutions the company offered. Overall I enjoyed working at Ingram and was excited about the sales strategy we put in place before the purchase by HNA. Job is not what you as a person would wanna do  i hated the job wish i never wasted my time at that place management is terrible and the staff and leads are no good Ingram Micro is a good stepping stone to start your career and move to a higher paying job to a reseller or vendor. Each department has their own views and follow their own criteria. Fairly okay for a start. But the pay was a bit small to keep a family up.I know by know things must have change. They really need to work on this but this is a good company to work with Ingram Micro is great company and I would recommend someone to work there.  I am looking for more growth which is why I am looking elsewhere.  The company has good 401K, PTO benefits but the salaries are generally low and corporate lifestyle is real there.  I'm looking for something faster paced and more challenging. With so much technology and so much of it changing rapidly, this is the center of it all. The focus is entirely on the customer and you get all the support imaginable to make their experience the best. From top to bottom (although you're never treated as if there were a top or a bottom) you're working with great people. Nice place to work . Provides opportunity to grow with the company. Always taking suggestions and improving for the employees and to satisfy all their customers. The opportunity to learn and grow is amazing with great resources.  Depending on your superior you will have a great or bad experience. The people are great to work with. During the time that I worked here.  I was just so happy to be working here, it was a good job to have at the time and plus it was close to where I lived at the time.  This was a good job to have and also a good experience, but it was a temp job only.  The job was not hard at all. The site of the said Organization in Manila provides limited selection when it comes to food. The nearby establishments are also expensive. Food cost average ranges from 100-150 pesos. Great company with passion for its employees and customers. This place is a horrible place to work for, they don’t care about if your kid is sick or  even if your family member is dying they want u there regardless and if your not there they lay u off, like they did me and then tell me I’m not allowed to use the bathroom but while everyone can I can’t it wasn’t fair and it was ALOT if FAVORTISM Great company for a start up career. Better than Fedex and Dell in my opinion. Fantastic benefits, management and decent pay. I only left because I had to relocate. If I stayed, I surely would've been promoted. Management turnover was very high which made things more complicated and difficult to accomplish goals.  Although Finance/Asset team was great as they were the only area with stability. Very cultured, fast paced, but a good is a place where you can learn from others and they do multi task alot. A lot of young adults can learn many tasks from working here. Autonomous work is encouraged and granted, but resources and support is very limited. Had to work late nights to support colleagues working in India. I was able to work remotely at times, so that was a plus. Ingram Micro was a cool place to be I had a lot of friends there I learned a lot alot working there , I I worked in receiving exception working with phone's . Ingram Micro is a horrible company to work for. Their management is rude, obnoxious and out of the loop. We have to work overtime at the last minute and I can't remember the last time I didn't have to work Thanksgiving or Christmas Eve. This company is currently reorging thier IT dept. So there is very little stability or clear vision here. If you are a sales person it works well enough. Just best to keep to yourself and just do your work. Stay out of the gossip scene, and all other high school things that the adults do there. And to stay on point with the attendance policy. It was great money but poor management it was a easy job I liked working there for the most part the employees were kinda lazy but the supervisors made sure they made them get back to work and I loved the overtime I enjoyed every day I spent working at Ingram Micro. I had the perfect job that fit my qualifications. I was treated very well and I did my very best every day.  I felt that my job was to work myself out of a job.  That meant optimizing every process, automating as many processes as possible, eliminating redundant processes, and training someone who could work in my place any time I was on PTO, training, or was needed for other projects. I obviously achieved my goal. I was let go during a recent layoff.  Mission accomplished. I am happy to report that things are still working smoothly in the Business Objects area and I am now free to move on to bigger and better things. bad manegment and bad treating workers and working hard but no equality in work zone and aplaying for position very hard to get and no team work always not good work inviroment . Great place not a lot of stress plenty of opportunity lots of charity work, great benefits open door policy great work space and good managers who listen Granted it has been 15 years since I worked at Ingram; however, I find my time to have been well spent and productive. Had a great mentor that was patient and showed me the ropes and vastly improved my skill set. Ingram Micro was one of my favorite jobs to work at. I wish it wasn't temporary because I would still be working there now. I like that we were all fun and laid back as long as you got the job done. They were big on efficiency and speed. I loved working there and wish to go back and stay permanently this time. The most enjoyable part is the check you come in do your work the most thing is that you don't have long hours until the 4th quarterI have learn a lot here at Ingram Micro Ask the same question to management and get different answers, sometimes even on the same day.  Most likely this is because they are looking at the days projected revenue stream,  but this leads to an inconsistency in expectations and workflow, as well as overall quality. As well as just poor quality as Standard operating procedure are ignored and rarely implemented. Leading to confusion. I appreciated my time at Ingram Micro because it placed me in a position to learn great skills and make incredibly valuable contacts. I left to make more money in my industry and they were very supportive of my decision. I would recommend anyone who wants to advance quickly to consider Ingram Micro as a path on the road to success. I was responsible for scanning all the product that was shipping. Its was a fast paced job for the season of Christmas. You had to stand all day while scanning the items. I have worked in this facility for many years it has provided steady income for myself as well as my family. Ingram strives to be the best with ISO certification, continuous improvement, and lean initiatives. Great company with passion for its employees and customers. Micro Ingram was a great place or work in which i loved very much. I liked how the company showed appreciation to the workers and how helpful and understanding all the lead and supervisors are. It was a fun place to work, many people from many different cultures to meet and interact with. You can learn many things from different people that come from all over the world. But its also not that dependable of a job. There have been many days where you leave early or just get sent home because there is not enough work, that doesn't work too well if you're trying to make money from the place. Working place is goodGood leadershipHelpful and friendly co workerGood Motivation at workGood behavioural companyPeaceful environmental hard worker friendSuitable schedule for employee Overtime facilities The company hires temp workers at $10 an hour for non equipment workers and $11 for equipment workers  and when you become permanent you get an extra $1 to start and .40 or 50 cents every 6 months but this was implemented somewhat recently.The highest workers make $16-$18 per hour but they have been there 10+ years.Temp to hire depends on expected work and not performance.Overtime is told last minute so you cannot make plans during your work week. .The work is easy but the job is stressful due to late in the shift label releases that cause unneeded overtime. Reallly laid back job , that consist of good people to work around. The company also provided us with group events , such as barbecues and game days . Overall Ingram is a very good job. The job itself was enjoyable as were my coworkers. Management didn't take their positions seriously and there was too much favoritism. Be prepared for retaliation should the manager find out you complained to HR. Ingram Micro was a great workplace where i learned a lot of. Everyday was the routine, we always start with a brief meeting that explained to us what will be our daily work, what we have to do to improve the yield rate. i learned how to work with a team, how to share our ideas to make the job flexible and easy.and the most enjoyable part was when it's time to clock out, everyone made a joke and created a good vibe around us. Its a decent job if your looking to move up ingram is a hard place to do that the people are welcoming to all new employees. In the summer it is very hot in the winter it id very cold It's was nice place to work and nice company .They listen  employee when they have problems. They have nice training and help everyone  they have nice Tim and supervisor like this team. I would work 8- 10 hours 2nd shift monday thru friday. During November to December is peek hours, where you would work 10-12 hours everyday until customer needs were met. Work was hard on O.P. forklift where they would keep track of your percentage. On pallet runner was less physical work, but had to make sure priority lane shipments were down at shipping. Benefits are very good, but pay a little on the low side. Management is better than it was, but need to address better communication and work hour fairness. I found Ingram Micro a good place to gain experience in a distribution environment. Work hours pick up during holidays but other than those times  weekends are free Love the job nice work environment managers are very professional but low paying benefits long hrs overtime should be expected there is room for growth I really enjoyed working here until the transferred all of the AP work over to the Shared Service Center.  Then it became just a babysitting job.  This has been I worked in the special pricing department , pricing computer software  for certain sellers.   Fun place to work. Laid back, and lots of fun co workers.Made great money but worked so many hours didnt have time to spend it.  Would be met at time clock, ready to go home and be told we had to work another mandatory 2 hours that morning. Management was always changing. During my 1.5 years working for them, we had 4 different managers. At a point, we had no manager. Only a team leader who had to run both upstairs billing, and ground floor special pricing. So many things need fixed and there is zero chance of getting it done. They speak of change but history constantly repeats itself. There is no work life balance, all work and no life. Un buen trabajo a la hora de la paga buenos compañeros I was working there as a temp for Remedy Intelligent Staffing. It was only a seasonal position. I really enjoyed the management and co-workers. I wish I was there as a permanent employee. Work is continual, with no downtime, for which you are underpaid and underappreciated. Management does not collaborate with each other, so there is little unity within a department, making things much more stressful. The culture of the company is good.  People I worked with were good.  However, transitioned to another company with better pay and more career advancement opportunities. Ingram Micro provided a professional environment where the job requirements could be accomplished. Weekly paychecks and steady, consistent hours were a great feature of the company. Great company with passion for its employees and customers. Extremely difficult to get work done here. Very poor execution across the board. People do not show up for meetings. No accountability or integrity. Very poor culture. A lot of gossip, very toxic place. People are physically ill a lot and some management is very corrupt. There are some good people but they are either new or have been there for a long time. Very high turnover and a lot of layoffs. Its a productive and easy job, the employees and the managers all got along like family. Ingram Micro its self would give us ice cream parties on hot days; give us lunch for a good job done and frequently give away raffles for all employees. This was the lowest paid entry level warehouse in the city. There were employees there that were unable to speak english. it made communication very hard. The work is constant and the money is decent. Customer satisfaction is what drives the company and there are always an opportunities for growth. There are no hard parts to this job. It was a short term job though the temporary company. My job was easy in my opinion but they keep me in that position because I was good at it, but I wanted to advance. it was a little bad when i heard the guys talking bad but some of the people were just fine. The area was perfect i liked the lunch area i also i liked that they had alot of space to hangout it was just a big building in general outside of the workers area the working area was great too a typical day at work, hard work place culture. i enjoy the work even though i didnt work too long there. over all i would like to say that it was a great experience Work and work play is balanced at Ingram Micro.  There are many team oriented activities.  It is expected to bring talent to every job but at Ingram Micro they allow you to also bring some of your personality.  The work can pile up but there are great people to help get you through it. I worked in securities on the Juniper team! It was great my team was awesome and our vendor was as well. I think anyone that is looking to get into the IT distro business should give them a shot! okay,the comany has minimum work,benefits, no jib security,okay managment, and job culture is okay.Over all the company is okay to workthis is my feedback. Ingram Micro is a well oiled machine, as you learn more with your job they groom you for the next step up.  One negative is most of the reps are not as much micro managed as much as under a microscope.  You were required to to X amount of certain things daily which can be a bit of a grind whether it's needed or not. Ingram micro was a place that you clocked in went through a metal detector, walk to your work station, collect your supplies for the day, sign in, and stretch. Boxes would come in you would open it , count the phones scan each barcode, put it back in the box and proceed to the next one. This job was very repetitive it would be the same thing till the shift was over. No chance to advance , poor system , poor management , the pay sucks. I did not like the hours , we did not get permanent seats and the headsets were horrible did not work. Good place to work, clear advancement path. Processes are very archaic. Management sometimes is stubborn on change. Lots of challenges with unique vendor and reseller relationships across the company. Great place to work. Just sometimes get some busy times with the holiday season. Have a small break room with vending machines. And good parking area with an overflow lot. Very collaborative environment.  People are helpful and great team environment.  Management gives employees the ability to manage territories as they see fit. It's a great place to work, you get to work overtime that is a plus. Everyone is friendly. Managers know what they are doing. somedays you go home early due to lack of workload. other than that there is so much opportunity. if you're looking for a job you have to start off through a temp service. Picking using an rf scanner, packing. Nothing was hard about that job just trying to keep your numbers up. We did have alot of work though. We had to go through a metal detector everytime we would walk in or out of the warehouse. The cafeteria was amazing. My daily work was superb. I learned a lot of things in terms of the warehouse jobs. The Management team was so supportive and approachable. The workplace culture was great and nothing was the hardest part of the job, always enjoyable one. Im just passing through until I find something else. Its a cool job nothing negative to say about it. So until them i m going to stay in my lane. So should everyone else Great company with passion for its employees and customers. The management. is horrible, they have absolutely no People Skills ,Non appreciative of your work Bad working conditions, if you complain or express  your opinion, you will get fired. Manager yells a lot. Its like a High School environment rather than a place of work. Very disrespectful Management that does not care about their Employees. You basically show up and happy to leave at the end of the shift! Working in QA was good at first but started to get stressful and I started to feel over worked not to mention working  12 hours everyday in hot humid temperatures they have air in QA but it's wack and to see my check it was wack too and they very UNFAIR!!! The benefit package once you become full time is AWESOME REALLY REALLY GOOD !! The main  reason I stayed as long as I did oh and some of the managers and workers are really nice I miss them...... But my review is my opinion You  may have a better experience especially since it has new Management changes are being made for the better hopefully...... Working for the sales training manager was a very difficult  person to work with. Working in the sales department delivering mail and supplies was the best part of the job. I worked remotely, so I full control over managing my time. Which though advantageous due to the flexibility, I ended up working extremely long to compensate for that flexibility. Job required constantly updating certifications which could become stressful. Up 60% travel required which happened to be a good deal. Managers were very supportive to as far as they were allowed. The most difficult part is when a course version changed and you had a very short time to update and prepare for teaching. But then you could also exhaust yourself you had a period of downtime. The most regrettable part is that I was dedicated to the company and turned down multiple job offers only to have my job position eliminated. I was hoping to build an enterprise level lab which could also be rented and would have been an additional source of revenue, however the upper management apparently was unconvinced this was important enough to allocate funds. It would have completely paid for itself in 2 years or less and then it would be free money after that. The most important take away is that you must balance your needs for stability and success over loyalty. It may not be in the reverse. That said, I really enjoyed working at Ingram Micro and enjoyed every stressful moment and every exciting fun activities! I attended, baseball games, foot ball and basket games among other activities. Fun place to work. It’s a very diverse place and very friendly people. Poor management and communication. Advancement promotions mostly by who you know than how you work. Need a total clean up like from the scratch to the Quality department and operation specially boses that had been there for a while because they will also pass on that bad culture to new management. I learned a lot about all the tasks, I surpassed myself in all the areas, getting to do intelligent and interesting works. I liked working there, but they moved to Indiana so I no longer had transportation .  Nice people .  Good job. I like the people and I liked the work that I did there .   They helped us get to Indiana on a bus for a while, but now there is no bus or wait to get to job since it moved to Indiana If you are single and have no family or kids this is the perfect job for you. You will work 7 days a week want November comes thru the end of December due to holiday season. But have good medical insurance. great place to work if you can dedicate your time to meet their needs  learned great work ethics to apply elsewheresupervisor and manager well respectedno hard parts easy days and available overtimegreat co workers of different cultures The company is a fun workplace. People were given a chance to speak their minds. Hardest part is the tedious work itself but we still manage to finish it on time. Most enjoyable part is to be with the vibrant people. You are generally stuck where you are hired and it is a typical large company.  The pay is on the lower side but the benefits and people are excellent. Ingram Micro is great for young people just starting out.  At first perks seem great but eventually physical prizes (like TVs and often times people will end up winning 5) and trips do not compensate for liquid cash that you can pay your bills with.  People there will do the same job there for 12 years to finally get promoted to do the same job with a slightly higher hourly pay and more of a cut on team spiffs.  If you a person who is in the middle of your career its not that great because you are waiting to get promoted behind people who have worked there for many years and want to get promoted after doing the same job for a long time.  Its very clicky and unless you are young and fun or well connected it's difficult to make your way through their clicks.  In sales with it being prize driven and prizes are determined by manufacturers people can become very vicious and undermining.  If I could have just done my job and I did it well I won Presidents club twice and if I could have just focused on the technology and opportunity without the nasty culture I would have stayed. I was at 100 % or more for my year over years sales goal with the exception of 1 year I came in at 97%. I am not sure if being good at my job caused resentment but the culture of Ingram unfortunately made working there unbearable.   Lets put it this way when I interviewed at Ingram a recruiter warned me that she didn't Iwould like it there and I tried it anyways.  It ended up being one of the worst decisions I've ever made and to this day I still regret it. Ingram does not deserve to be labeled the Best Place  to Work in WNY for Buffalo Business First and they do push you to take that survey so they win it.  I miss my customers I miss learning about technology but I don't miss the culture the cattiness and the viciousness of that company at all. My supervisor lied to cover his own back. I loved my job and loved what I did. I loved and worked hard for Ingram. Everything that was asked of me I did. I was a Marine for 26yrs and have always been a hard worker this place is okay but stays hot they do not try to cool this building down at all. i had to bring my own fans and they gave our department 4 and all the doors stay closed. work is easy but the computers are a pain they are really cheap and have horrible PC's that are from like 2002. Blue IQ is horrible and has many stupid steps that are not ideal for a warehouse environment. you scan item, check item, check costumer comments and then see if it's true,bag item and every individual piece,box it then go thru the 20 plus steps of blue IQ then fill out a paper called a traveler that is just redoing what you did on computer. Fun working environment the people are nice and cool to talk to the manager was chill overall the job was co jsjdjjdjdjdjcjjcjcjcjcjjcjcjcjcjjcjcjcjcjcjcj Issues at Ingram Micro include:1.  Poor leadership2.  Minimal accountability3.  Draconian management style 4.  Inconsistent rules 5.  Over dependence on certain groups for results6.  Dishonesty 7.  Disrespect8.  Integrity Ingram Micro is a results driven organization focused on retaining its position as the world's number one technology distributor.  High accountability is required for all employees. A great brand within the distribution segment. But this place is not for everyone. Very noisy work conditions, as it is for the most part a call center. So if you are tasked with NON call center duties, as I am, it is very hard to focus. Largest distributor in the IT channel. I have learned a lot over my 15 year career and have had the opportunity to grow and learn all facets of the business. good place to workfriendly, busy ,walking, learn something new, meet new people, enjoy prizes,  company dinners for accomplishment.  sociable, management Great company with passion for its employees and customers. Ingram Micro introduced me to an advancement of being involved in a company environment. They moved me around different fields in their workplace to improve my corporate knowledge such as Digital Marketing, Event Marketing, Customer Experience, etc. I gained so much from this experience, and made a variety of different communications while working there as a summer intern. Ingram Micro might not see like much at first glance, but inside its walls is a large warehouse in which the more competitive you are, the faster you will excel. The starting pay is not too bad but work hard and you will quickly reap the rewards. The environment is comfortable and the people are friendly. You quickly develop bonds and good work ethic working among-side some of the most focused and goal-oriented employees you could hope to work with. Management is strict, but fair. They genuinely care about those they oversee. Everyone there is extremely nice and professional. It is a comfortable work environment and they have great company culture. It is an international company, so there is a constant work flow with reasonable down times. Great company, in the office I was in managers had a lot of autonomy in decision making and building the culture of their own team. With the good managers it was a great environment, really felt part of the whole, but there were a couple of managers that promoted toxic competition, rather than a healthy one with badmouthing team members and other departments. I would have liked to see a more cohesive culture rather than such great fluctuations from one department to another. it was very entertainig to work at ingram micro i learned a lot and the workplace culture, i met a lot of very hardworking people and really enjoy the job it was my first big job on a very large company. Ingram Micro has opportunity for growth, advancement, and the best part is that there are so many contacts outside of Ingram Micro that when you need a job, you can find one easily. As with most places, your experience will depend on your manager and department. There is room to move up and there are perks like company lunches and events. No room for advancement, poor leadership, and major disconnect from the c-level suite to the general population. You need to be a favorite of a hire up to get recognized for anything. If you're not a favorite, good luck getting noticed. While it is a great place to work, it is a far drive from my house with rush hour traffic both ways.  Plus with the new change in management i am no longer enjoying what i do Its a ok place to work. The managers have peesonal agendas. Its best to learn as,much as u can and move on. Great place to learn some skills you could use at other places of employment. N/A for my position Nice work place too far to drive.  I like the staff but out sourcing is a high idea.  I completed all project assigned but travel distance is an issue. must be able to adapt to direction change and mixed signals due to constant change and lack of focus. long term goals are difficult to meet due to this. I enjoyed working for this company. I learned the value of how the importance of working as a team. The management was great they helped me to advance in other areas of the company. I am very appreciative to have been given the opportunity to work there for over 20 years and was fortunate enough to have been exposed to various departments and tools which was extremely helpful when when doing reporting and BI.  (360 degree view of the company!) The company was recently bought out by another company, so there are many changes currently in the works.  I am sure they will continue to thrive once things are settled. culture is horrible, management and HR have no intentions of fixing it, facility could be shutdown after contract runs out with existing customer, results have not meet customer expectations.   its a chop shop for labor that doesnt pay as well as competitors, so the turnover is abundant, therefore more mistakes and less productivity. High volume distributor for e-commerce. expect to have long busy days with an extreme focus on quality. UPS/ FED-X loading is the highest demand in the company The management team closely resembles the multiple managers in the movie 'Office Space'.  They will each come by to tell you what you're doing wrong without any real advice on how to fix it.  What's worse, very few of the managers are on the same page.  In fact, they tend to contradict each other more often than not.  So doing what your immediate supervisor tells you will quite often put you in the hot seat with the department head.  Even more frustrating, is that during these berating meetings, many of the supervisors show their true cowardice and flip their position (making it appear to the department head as though you have refused to follow directions).  THIS IS NOT AN ISOLATED INCIDENT!  It happened to me about 4 times, and many of my peers regularly vented about the same type of treatment from several different supervisors.BEWARE of this company! very fast pace environment , team work is needed  .I learned to get the worked done but do it right the first time .safety is very important and paying attention to what you are doing is very important because you can get hurt always have your hair up and do not wear any jewelry . The third shift was relaxed and the people I worked with were great as well. equipment was well maintained. information was passed on promptly. training was done in a timely manner. It was a good place to work. I have no complaints. The cafeteria is honestly the best part. They have caterers every week or you can choose food that you want. Great company with passion for its employees and customers. People come and go nobody knows much even the management don't stay long or have answers for you if they do then they miss lead you. Everyone has diffrent answers. Good company to work for with room for advancement.  Friendly and professional management staff including upper management. They practice a lot of Lean Methods. The hardest part of the job was having to deal with contract negotiations every few years and deal with the possibility of lay offs because of the industry. Good place to work. A lot of fun. Although they don't have air conditioner it still a great environment and the management is awesome. So if you don't mind the heat I would recommend it. Don't care about workers and there ideas.. Managers don't communicate with each other... They don't care if you work or not.. They yell at you for no reason.. The raise for every years is an average of 15 cents. Loved being in the IT sales, managing 12 people and handling 2 territories. Great company with great benefits. Lots of activities, training, company events. Ingram Micro have a lot of facility arrow the world. Some place is maybe a excellent place to work at. But the one I work is a warehouse type, so in the warehouse we have no air conditioning at all, and a lot of noise too. That is why depend where do you work at. But I think Ingram Micro is a good company to work for. I enjoyed working with Ingram Micro, I grew personally and professionally. The team, my manager, the Country president. Everyone is so supportive and great. very good supervisor.  great work place very down to earth great training  paid break decent pay great management.. paid time off. overall a great place to start a amazing career Ingram Micro is a fast pace working environment that has a good team of leadership as well as their employees. They community with their employees on all aspects of the business. Made decisions and worked through the success of the decision. It is an aggressive highly results oriented company. Management is involved in coaching and leading the organization. Good place to work job for. Great benefits overall to the 401k to the insurance. I would recommend people to work here if needing a job. I have a great manager who runs the building like no other. Its a good job experience and recommend for those who are starting in the working field, Lots of different people and many different personalities but all work hard to get the job done. Great place to start out after college graduation to gain experience. High demand industry with at times mandatory overtime. The people and work culture are amazing you won't get better in the Buffalo area. No work/life balance.  Bad pay.  Bad raises. No bonus if supervision.Workers seen as expendable.  You are just a warm body.   Company started on a project that failed.  Office personnel, Supervisors and Managers took hit for Engineers failure... No bonus, again.But engineer got a promotion and award... Sad but true. Things have been steadily been getting worse since Ingram bought Brightpoint. I learned about warranties and how so many phones can be sent out defective . The hardest part of the job was remaining calm while dealing with crazy angry customers. Than the mandatory overtime Ingram Micro often touts its associates as its most valuable asset, and I would agree. The dedication of the associates to customers and each other is outstanding Ingram Commercial and Lifecycle Services continues to grow into new business sectors an open new sites.  The company has been successful in rebranding itself and consolidating some of recent acquisitions in mobility and handsets. They are so friendly and nice to everyone who work there .tbey also give as a uniform which is good and every Friday we are allow to wear anything that we want The management has really no idea what's going on... they don't know how to value IT professionals.  The executives literally call them monkeys or will say that apes could do professional IT jobs.  There is no work life balance.  Your management will not support you.   It was truly awful place to work.  My manager was terrible. Clean and structured place to work. Professional people working there and kind. Work environment was clean and orderly, security was good and not confining. Great company with passion for its employees and customers. I worked with really great people but management was completely inconsistent and played favorites.  The rules changed between which facility you were located in and corporate had no idea how to manage a local location Productive workplace, very fast paced. Work is required on most holidays and weekends.Very good associate base with very competitive salaries and benefits. a very nice place to work very nice people nice bosses , manager, supervisors, a big cafeteria with own kitchen. helpful co-workers, paid breaks. is nice !! Ingram Micro PSTS is a nice place to be content. If you are looking for a job that you can go to everyday, put in your time and collect a paycheck, This is the job for you. Ingram was a good place to work and the team was very collaborative. It is a pity that they decided to outsourced many jobs to the Philippine including mine. Inconsistent training across departments. Ineffective, disrespectful management still hanging around in many departments. Widely known HR will not protect you in any situation. Lowest paying in the industry. Charges way too much for an embarrassing level of service. Bones are good but way too big for its britches and arrogant. Ingram is a great company to work for, especially as an entry level employee.  You will gain knowledge and contacts that can further advance your career.  The company works hard to motivate their employees with fun activities and incentives.  There is a good work/life balance. This company is more focused on their profit. Temp employees aren’t treated nicely that’s why they have problems recruiting people during peak season. Everyone from the employees, administration, management, logistics, technicians, accounting, senior management, etc. are very helpful and as accommodating as they can be depending upon situations presented. They want to help you to succeed. Great people! Great company! The people are great at Ingram micro. Management is very understanding as long as you give 100%. Training is available but inbound call volume determine if you have time to take advantage of it. It was fun working at ingram micro. Learned alot about cellphone and had chance to know somehow about managing floor. Friendly culture makes it unique place to be. my boss was great it was a lot of people that were in leadership roles but was racist. It just was sometimes good team work . But you would have an lot of people that was childish and mean spirit be havior. Overall a Decent place to workStressfulCompany is not good with work/life balancePay is competitive for this area but not for the industryA lot of duplicate work Typical technology distribution company that provided the best place to work in the upstate area.The vendor and associate business relationship provided a lot of synergy between partners (resellers) and the vendors whose products were transacted. it was ok really long hours but the pay made it worth the job.i would go back. i really didn't stay as long as I would like, but it was a good place to work. in a typical day of work i come  in get my orders and head over to being my day in inbound or outbound duties. complete daily task and give hand off.. Good job, good co workers. The managers were good, always made sure their employees were okay and working . I would recommend people to work there if they needed a job. great job for emergencies but the pay is very low even with over time people have second jobs    they need to pay more in all departments and work better with peoples schedule the work is easy but the pay is horrible cannot survive with that bad pay I would rather not comment in text I feel this is something that is better conveyed in person......................................................... Every year they do layoffs to try and stay profitable. Some of them make sense and others do not. The upper management says they care, but the actions speak otherwise. In engineering things are different, but in most other departments there is too much politics and drama. They say they want you to have a good work life balance but then you have so much work that you end of working late every night and weekends. Great company with passion for its employees and customers. Supervisors offer support and training, very friendly workplace. Not high rates, usually 40 hours per week, November and December more than 60 hours week. I would not recommend working in this stressful organization.  Most unhealthy is the middle management who get pressure from upper management for daily reports that becomes everyones problem, with no focus on true business objectives, realistic goals and measurable successes. Lots of opportunities for improvement and learning. Environment can be stressful. Occasionally work long hours. Highly demanding but good benefits and salary. For young professionals, Ingram is a good place to get a feel for corporate America.  Teaches the skills to take to other roles within or outside the company.  One of the problems with Ingram is they promote too much from within based on favoritism and not on merit.  Management does not pay to bring in quality from the outside that can provide an impact on the business as often as they should.  The people that work at Ingram are awesome, but many in management have never held a position outside the company and don't have a full understanding of what other quality organizations do to be leaders in their market. it is a huge company with a lot of old processes. You can learn a lot if you just finished school. Great to start a career and learn from different perspectives. Ingram Micro protects their associates and gives the opportunity to change roles and learn from other areas. It is a very complex business and learning curve it is lower than other industries. You will work and be productive with goals to exceed every quarter and year. Depending on your role you can be commissioned or not, but if you don't receive a commission in some roles you can get a bonus once a year. You will work with businesses all over the US, mostly East Coast here in Williamsville, NY. Accuracy has to be 100% because this is an Multi-Billion dollar company. You can't make a mistake, if you do then you are forgiven and work goes on. Don't let that fool you into thinking you can keep messing up. This company is a solid place to work for, people know the name locally due to the over 1,000 people that work on this campus. It is worth it and just apply you have nothing to lose! Would recommend but does not pay enough. Pros- A lot of Work Experience.- Good HR Staff (Listens to you everytime you approach)- The understanding between manager and you is always good.Cons- Ingram Micro is currently expanding in Chennai. (Should expand in many more cities in India) We did excercise and did lots  walking got along with most people meet lots of different people the staff is a rude most of the time I really don't have much else to say they will do what right for them Not a good place to work. Too many mandatory work hours, with minimum notice. Not fully staffed, and could not keep staffing. Management always changing. The best paid time offBad managmentLack of development careerGood locationI don't know what to say more about this company because I don't have to much to say. Over the past five years the management changed and began to outsource IT operations both on-shore and off-shore. This led to a feeling of never knowing if your co-worker or yourself would be next to be be replaced. Before the new IT management structure was installed the place was great. We would have team building events in the park, bowling alleys and other events. But now the place is devoid of happiness Senior leaders lack strategy, reward bad behavior by giving incremental responsibility to those that don't perform. The only strategy is to cut costs by cutting people, there are no plans for profitable growth. lots of favoritism .employees are not rewarded for their hard work. nothing much to say about this place other than its just a job just like any other warehouse job. This can be a high stress environment depending on your position/team.There are a lot of changes to schedules. Low morale.Poor management - inconsistencies. A typical day at work is fun, relaxed but we get the job done. I have learned to work hard and be safe while driving the forklift I have also learned to pay attention to my surrounding for the safeness of others around me. I enjoyed working there for three years. There was plenty of room for advancement, I just am not cut out for the 9-5 mold, so I left. I would highly suggest it. Some of the management are not good and the fever other people and make others work harder than others. They don't care if you are a hard worker they only promote there people. I wasn't there but a month   it seems to be great place to work I was in shipping  so I don't know about any where else, enjoyed working with  my co workers  real nice people ,my truck drivers where very nice also medium level talent and only way to advance the business is to reduce opex in senior leadership view.  Company has done lots of acquisitions but has not invested in systems to leverage.  Very manual with a ton of administrative work. An easy stress free job with employees and managers with the mindset that wants to work. A great place to start building a career as a forklift driver and much more. Great company with passion for its employees and customers. Excellent Forward thinking company which utilizes its employees to the utmost in deciding how to execute strategic objectives on a daily basis.  Great An open environment with offices only for VPs and above. On paper this increases collaboration, but I often felt isolated and out of place. The acquisition by a foreign conglomerate caused unrest. My position changed from front desk to being locked behind doors in a little room with three other women all talking at once,  Then my position was eliminated because the level of phone calls decreased. It's a great place to work, co-workers far and away are the best there are. Good benefits, and for the most part not too hard to advance. Great paid time off and ability to save days for vacation. IngramMicro is a very good company to work for.My inventory skills have improved a lot since I had been working there. ingram was the best job I had. There was always a 10-15 minutes briefing from the manager on previous day work and our daily bill plan with emphasis on safety and 5s. Associates were given time for questions and answers period. Our manager was very opened and willing to assist when asked. We also received trainings on the job that enable me to become an Inventory Control Specialist. Our manager took us for lunch most often on Saturday and we discussed personal matters with him at that time. job need to be done to satisfy the customer but obliged to stay until all orders be cleared and the supervisors rushing the associates to clear the orders at time A great job with lots of overtime. Great people. They pay for training and great experience. Vary fast passe job. Not suited for working students, they need full-time applicants. Not stressful and easy environment. Everyone got along great respected on another I really miss working there, there was opportunity for growth. Atmosphere was great as well Over the past 2 years the company has gone through multiple layoffs. Unfortunately the employee development opportunities are not that great. Wish they took the time to keep and develop good employees. Its decent. Not a bad place to work. I just require more things to do to better improve myself. I enjoy to learn new things all the time to add to my skill base. Good job and great people. There is a lot of opportunities to advance and become a good use in the company. There are good people here who are willing to help. Reorg in sales or I would still be working for Ingram.  Loved the company and the management team.  Excellent industry training and vendor training on all products.  The freedom to run your territory as needed to tend to customer needs and introduce new products. Ingram Micro was one of the best jobs I ever had.  The work was exactly what I was looking for.  The opportunities to expand my skills were practically unlimited and very supported by management.  The management style is not to micromanage but to empower employees to think outside the box and act on new or different approaches and ideas.  The benefits and pay were excellent.  I was sad when I had to leave and would work there again in a second.  Just an incredible place to work. We had 2 ping pong  tables there, we had commities for safety we had picnics every year I was given monthly awards at times as well as employee of the year awards I served on several different committies  and audited 2 different departments a year. management was good and we had a good workplace culture. the hardest part was the auditing and the most enjoyable was doing the research. Great job start off a career with a big company but no real advancement. Pay rate isn't the greatest due to the competitive environment. Floor managers are easiest people to work with as you do your work and time they don't bug you however the upper management is something else. They're just hard to get a long with and don't listen to employees when they voice their opinions. this is good steady work place if you doing well but the bill is too high and if they still having with company moving in and out having problem not good. A typical day at Ingram was straight forward until the end of your shift. You may have a client's request at the last minute that would add an additional three plus hours to your eight hour shift; or your done for the day. Knowing how many hours one would work at the start of your day was always unpredictable. On the other hand the amount of experience one could gain was close to limitless. Ingram's clients always wanted what was current and trending therefore it kept its employee's current in the IT field. Management was always on deck and worked with its employees's from time to time. To insure all projects got out with high quality, and in a timely fashion. The hardest part of my position was my schedule. Knowing what time to be at work, but not knowing what time I would get off was truly a challenge. The most enjoyable part of my position was my work environment and the access I had to further my career. Going finding your forklift working in different departments working a lot hrs. Management was okay it was okay working there. Long hrs never new what time you get off.When you get off on time some days. We start the day sorting out emails at the same time taking in inbound calls. Managers change every 6 months, but the team manage to handle SLA's and the volume of work given to us. The hardest part of the job is handling your own escalation and at the same time resolving them. But Ingram Micro taught me to become a team player and at the same time independent. Great company with passion for its employees and customers. Fast moving environment. Slow sometimes depending on the stats.  Wherever it is slow in the building they place you elsewhere to get experience in different areas. Ingram is very involved in the community and takes care of it's employees. career development can be changeling. very supportive peers and people are willing to help you if you can figure out who to look for. you get reasonable pay and they have understanding management. time off requests are approved easy. and also holidays off for sure. over time pay is great I loved working at Ingram Micro.  I enjoyed the team members and there wasn't one day that was the same.  Good company culture and the director really cares about the employees well being. This was a good start. The company was great at recognizing hard work. The pay rate was fair and culture was good. Overall a good place to learn and grow in your career. The only recommendation for anyone joining is to learn as much as possible and leave as soon as possible.                      not much I can add, good luck They're a nice company to work for. Great hours, supportive management team that will work with your needs. Terrific/healthy work environment, also great benefits. Ingram Micro is a distributor of information technology products. The company ranked 64th in the 2016 Fortune 500. In December 2016, the HNA Group acquired Ingram Micro in an all-cash transaction with an equity value of approximately $6 billion. Mi consejo es lograr que el paciente espere menos tiempo para ser atendido It is a great repair cell phone company to work with. Management team are very smart.  I will go back and work for them again when they have an opening. it was fast paced, every one knew what they where doing and that's good. no one really had problems with anyone. if anyone was looking to work there i would definitely recommend you going ,yes its a lot of work but you get the job done. very nice work place. supervisors are nice and understanding. clean and safe environment. good staffs. very organized. always trying to help the workers It's a good company to work with. The management team are awesome. Work with your needs. PTO hrs every check, use it when ever you want. Chances to learn how to drive equipment. Great co-workers, fast-paced. Helpful people. Management disconnected from staff. Very secure environment due to inventory.Temporary workers treated as second class citizens. Loved the pace but was exhausted from it after 5 years of this role. My father dying had much to do about it and why I became hospitalized, and eventually at the wrong moment, fired. I loved this career more than anything Many of the supervisors are racist and show favoritism. They advance whom they want and fire when they choose. If you are looking for a fast paycheck I recommend, anything other than that I advise to keep it moving. Choosing not to review further- I should not have to fill this out when I am posting my resume on your site. Typical is 8-5pm day, with breaks when needed/Management wasn't always the best and HR wasn't on top of monitoring the education of managers. Hardest part of the job was internal communication. Igram Mciro is a company that needs further consolidation of policies and procedures. It would be beneficail for it to fully look at the operations and make key strategic moves to streamline process which holds the company back. Employee driven, good company to work for, they cared about everyone and how they felt. Very tight margins but good fun. Learned alot because of all the vendor interaction. Es una empresa para comenzar y ofrecer una buena experiencia laboral Great company with passion for its employees and customers. I didn't like working there, everyone was held to different standerds, if you have more knowledge than your boss he will not like you very much..totally unfare Micro Ingram’s philosophy is different than any other company that I’ve ever worked for. It is a fast paced warehouse enviroment with encouraging partners to encourage feedback from various employees on what can be improved. It is a based on needs job. Ingram micro has plenty of opportunities available. Ingram micro is a very established company in the distribution field. I worked for this company for 6 months and it was a very pleasant experience. I was forced to resign after I had to relocate but if I every moved back to that area I would definitely apply again. It was a great job for a while then the management changed and everything went bad. All the old schoolers were kicked out  and were replaced with non experienced  personal I worked with Dell systems, Amazon fulfillment and other companies that shipped to and from us.It was awesome to be able to see the new things ahead of them being placed in the general market. I wasnt very happy at Ingram. I didnt feel i was treated fair. Lots of clicks of people who worked there 10+ years. I was never invited. After 3 years a position above me was filled without my knowledge. The work pace not alot I hate the way people goes in the refrigerator and get others lunch but the way it's set up is for success and I learned easy at that place My time at Ingram Micro was a good experience overall. I learned what I am capable of in a new environment and new work setting than I have been accustomed to. The base of business is very large and they have a great reputation. It is a very large company.  The work force is large packed into a building not large enough. A typical day at work was having 5-10 min meetings to update employees about the work flow of the day, informing us of mandatory overtime, and sign safety procedures logs expected at work. What I learned at Ingram Micro are the values which include innovation, integrity, accountability, teamwork, respect, learning and social responsibilities. Management at the company was very informative, respect their employees opinion, and showed dedication of improving the safety and concerns of employees. Management would hold 30 min meetings with all shifts maybe every 2 months to inform us of directions the company was taking and would ask us of our concerns regarding any issues we had. Work Place culture was very fast paced in regards to priority packages to reach the truck in time. We all worked together as a team, but also had fun when it came to holidays. Every one knew what their position were and executed their position as best and safe as possible. The hardest part of the job was the excessive overtime and working with new workers with strong opinions which did not co-exist with your own personal values and you had to maintain a professional manner by discussing your differences with a leader. The most enjoyable part of my job was my co-workers genuinely did care about each other and we always had each others back. Ingram micro its a place to learn new things and improve someone career .i love the overtime and how the supervisor treat the workersI have the opportunity to learn in different department No cumplen con las 40 horas por semana lo que no posibilita una estancia adecuada con las necesidases previstas. Full time position but sometimes part time too Young employees without work experience sometimes struggle to adjust to the expectations of a workplace. Teamwork. Work experience teaches employees about the value in a day of work diagnosed between 5 to 15 daily telephones all the brands of telephone administered that all were under warranty for cellular companis fast paced environment and good hours. would highly recommend to a friend or family member that is looking for a full or part time job located in mira loma. typical day was just to wait for the lady to receive the product and label each pallet. Then use the reach truck to start putting everything away.management was really picky.people were helpful.hardest part of the job was to work with the racks that they use.enjoyable part was being on the reach truck all day long. Ingram Micro is a big company very competitive on his sector but very thoughtful with his employees. A culture of friendship and collaboration which makes the job easier. I have been at Ingram for almost 12 years and I love it. It's like being with family all day long. You make life long friends here. Work can be stressful at times but I have an excellent management team that are always there for you. Great place to work. Nice environment. Provides adequate training for new and existing associates. Working on becoming a more diverse place to work. I would recommend Ingram Micro Great job, great Managers, great working environment with lots of potential. Decent wages if you're full time, NO NONSENSE PLACE OF WORK, nice cafeteria with people who acutally cooked for us. In that place, you got lots of excercise, the building is immense and it took time to walk from on part of the building to the other..!! Great company with passion for its employees and customers. Itruly enjoyed working for this organization, everyone was youthful and ambitious . Vendors continuously fed us, we had pep rally in the parking lots. The incentives and motivation will forever be burnrd into my heart. Good place to work. Difficult at times because most of the workforce only speaks Spanish. It is difficult to explain procedures to people who do not understand English. compensation and advancement were limited. everyone did the same thing - job description changed over time - great place to work if you just want a job This is a place that has a terrible background check process.  While i was there myself and another person were sexually harassed by a former felon.  I've never been treated more like I didn't matter. My onboarding experience was horrible thus I did not last long at IM, however, I liked their culture, the work-life balance and my manager.    Goals and expectations were not clear.  My on-boarding consisted of searching the LMS site to teach myself what I thought I needed to learn, telling my mentor what I didn't know so he could train me and talking to co-workers to find out what they do so I could figure out my role. Managed channel partners in the Michigan market that sold wireless products through there retail locations.  Enjoyed working remote and managing my time. Fixing cellphonesWe always need to do a diagnosis to the unitsReview the claims of the unitsSend them back to the company to the client I like it a lot because of its way of working together and to help each other. I've learned so much things about electronic and electricity. This was a great company to work for. As a temporary position through Ultimate Staffing the Buyer/Planner position was challenging and busy. It was great working with the best in their fields. The company provided everything imaginable to keep their employees there at work to get their jobs done (cafeteria, dry cleaning, etc.) This company was a great company to work for, and It was sad that I had to relocate. They treat you like family in the office, and even out on the warehouse floor, if you were part of the IT team, you were treated as royalty so to speak because they all had the understanding that we played a large roll in the everyday business. Work days long . Learned bit about the organization. The management team was decent. The workplace culture was diverse. The hardest part was the long hours. Ingram was a great place to work,The first 3 or 4 yrs' next couple yrs' got really unpredictable,as far as Managament,they would promote within, and they made bad choices,Just my opinion.I work there over 10 yrs' ago'Surely it's changed.With that being said Ingram was GREAT the 8 yrs' I was with them.Company really seemed to care,Management only cared about them selfs, and their favorites. The most enjoyable part of the job was that the work culture was very stimulating and social.  The ability to move up and obtain a promotion was the most difficult part of the job due to high volume of employees. If you are wanting a place to make a lot of money and meet a lot of people this is the employer!  Good work culture.  Not super intellectually stimulating, but that is not what tech distribution is about. Very good company to work for . I would love to work for Ingram Micro if it comes back to Sacramento. It had a very good management, friendly work environment and very flexible work schedules,with very good benefits,bonuses it was very normal wed get to work do our stretches and continue to help out 2nd shift and then start with our shift.....they were a concerning company against discrimination working at Ingra Micro is nice, but they usually don't have enough works. we get went home all the time. i  recommend this job for those who don't like to work enough hours. IT's also a very cool place to work. Great management and team . Work life balance is been incredibly great. I cant complain after working for the past 1 year and 5 months . Been truly grateful for the opportunities and I will never forget the knowledge and learning's that they have taught. buena compania para trabajar, atencion a los trabajdpores, diferentes horarios, buenos beneficios. bad place to work had to work too many hrs with no idea of when its over,rarely ever hire on the fulltime employees treat you bad,the bosses treat you bad and the temps do all the work Call center environment with heavy focus on sales training and staff development.  Great opportunities for advancement within the organization including senior management. Great company with passion for its employees and customers. Great place to work. People understand what it takes to be a team member. Cool stuff to work on. Provides wide variety of opportunities to grow professionally. I have been at Ingram Micro for many years and this company continues to evolve and gets better and better every year!  Great leadership and coworkes make working life fantastic. As a team lead, I have to over see 50 plus agents at a time, iI have to make instant decisions on whether I need to send people home for any reason, I need to deal with all breaks and lunches, I have to deal with processing warranty exchanges for cell phones in a timely manner. This company was a company i worked for in the early years of my adulthood and i had the best experience one can have working here plenty of hours plenty of overtime Sketchy Management. They won't accommodate any restrictions... They sent me to a physical department after I told them I was pregnant, I felt like they wanted me to quit, so I did. Unfair and just do too much for little pay. while other do what every they want. u work hard everyday just to have ur manager talk to you unprof. and to watch others do nothing while u do everything cuz they get paid more. Please don't work here, no one cares about your opinion and all management are all snakes. too many favoritism and not an equal opportunity employer , so many people are not treated equal from others. Lots of job opportunities however management runs the company like everyone is a high school student.   Very much a call center mentality and not very professional.   Company has been sold to a Chinese company so there is an issue with that. Ingram Micro was a great place to work.  Excellent opportunity to learn new things, with classes and software always available.  Much of my knowledge today came from my job there, and I am very grateful for that.  It could be stressful, especially with so many people working together, but thats to be expected.  Overall, great place. Been with Ingram Micro for 6.5 years, if you are a solid performer, this is a great company... if you are a slacker... they will make your life tough.. This is a fast paced, demanding job... serve your customers and they will serve you. It was productive work place. depending on how many orders they had to ship, Work can sometimes be fast paste and really slow. I just really didn't like the pay. At ingram, you have to be willing to do hard labor work. Over time is a mandatory thing for everyone. It was hard to balance your personal life with your work life because the hours pretty much took that person time away. Ingram Micro at the time I was there was a high energy environment in a dynamic industry. Since then it was acquired by a Chinese firm so I don't know what life is like there now. be a great environment to work in as long as you don't let others hinder your productivity.Consistent work and will make sure that you get your 40 hrs if your status is full time.Decent hourly pay if you come in through a temp service.Presented the opportunity to learn a great skill set that can help you in the future. I was in Quality Control at Airtech for 6.5 years.  I did inspections in Cargo.  Lots of uneducated leadership and cronyism in operations.  I was under one supervisor who literally only had a GED.  It's very hard to move ahead with these people. Very strict environment and turn over is pretty high. No cell phones on the floor.  The pay was only $14.26 and hour and one had to know a lot to do the job.  You get a .40 cent raise per year. It's variable hours so you'll never know when you'll be home or if you'll have to give up your weekend. Ingram Micro is a company where you are not on stress everyday. Though you might be at times due to last minute changes but does not happen always. It had really good work environment and you have option of work at home which is a great as you can choose your time to work rather than the normal work hours. ingram is good.soimetimes there'e ups and dowm/ i don't like no specific time and mandatory over time. overtime should be voluntary request first before mandatory.pPeople should be respected Stressful.  Long hours.  No work-life balance.  Little to zero communication from superiors.  Lack of consistency in direction.  Too many initiatives causing none to succeed. This is a very easy job, they offer nice incentives for doing a good job. It does get very hot in there during the summer but it is bearable. Lots of time of during the holidays. If you are looking for a place to work that is insanely stressful in sales this is it. Your pay for the industry is low, and goals border on insane depending on department. Nothing you do is ever good enough, though you will get hollow praise for your efforts. If you are looking to get ahead and promoted do not worry about hard work or being good at your job. Just be someones buddy and play the game. They are more interested in garbage metrics than your actual success in your position. These is little to no help from management in setting you on the path for your career goals. Again I cannot use the word stress enough. My health literally improved within 3 months of no longer working there. There are two groups of people essentially working here. Lifers and newbies.People have either have been her 10+ years or under 5 years. There is almost no in between. Most people leave within a couple or are forced out by 5 years. Seems mostly to control salary. When you start to make too much money for them they will find someone cheaper to fill the role. In many cases actually lowering the position grade for the new hire and making them get promoted to reach the position previously held for the role. Example Sr. Sales Rep leaves, they are replaced with a Sales Rep 1. They would need to get promoted twice to reach the previous person. Great company with passion for its employees and customers. There is no home/ work balance at Ingram. Managers do not care about their associates and HR doesn't either. You have a lot of managers that engage in inappropriate behavior with the associates as well as associates and nothing is done about it. The temps are treated even worst. Ingram has a great atmosphere for collaboration and training. The management team is fair and understand work, life balance. They encourage you to grow. The most enjoyable part of the job is building solutions for client's business needs that I am passionate about. Company puts a huge emphasis on Sales. If you're strong at sales, I highly recommend Ingram. Hoping they change around their commission payout though. my typical day at work was loading the ups trucks and what I learned was planning everything out so it would be easy. everyone is nice at work they greet to everyone. very relaxed, work-life balancedmanagers are for the most part friendly and willing to help and coach youyes I would recommend it for someone starting their career As an intern with the company, I was trained very efficiently and was able to assist with tasks very quickly. The team that I worked with was very helpful and taught me day to day routines with the company. I was also part of workshops that the intern program organized for us, which involved distinguished individuals with the company. Good place to work for to start your career in logistics. Learned alot and advanced in my career at Ingram Micro. Got to travel with the team oversees to implement warehouse managment system. It is a great place to work at if money is not what you are looking for. The people are amazing and welcome you from day one. I learned how to prioritize, speak Spanish in a business setting, and a whole lot of tricks in Microsoft office. I loved my job as PeopleSoft Developer.  PeopleSoft team included IT & the business partner made a great team!  The environment was competitive which resulted in talented employees. I would give the best ratings for benefits and compensation when they were actually paid out (sales commissions and goals were not always paid out & goals sometimes set after EOM). Management was not good at responding to questions, concerns, or requests for help. You would typically have to 'corner' managers to get approvals on processes or answers to questions. Getting things done that had to involve management was by far the hardest part of the job. Also, there are annual layoffs. Some years would see layoffs in mass twice in a year. As an engineering graduate, I would want something more technical. It is a good job to be working at, while in college. But for an engineer, it would be only step in the process. management don't know how to work right they don't see the hard working people that get the job done and everyone get blame for not doing inufe work they overwork us the hard working people while other stand and talk Don't be mislead by the perks you receive working here.  Nothing is actually provided by Ingram Micro itself, the perks all come from the vendors.  Ingram grossly under pays their sales staff compared to the amount of revenue that they bring in.  Consistently increase quotas or create new sales goals to reduce commissions that they pay out.  The actual people that work their are great, except for the majority of the managers who only care about themselves and the bottom line. Ingram is a good temporary job to get by. It pays well and is mostly just a Monday-Friday job. Its a little fast paced as far as work load goes, but a the team approach is nice. The management was a little all over the place at the time, but they were working to improve. Some people get hired on full time, but some do not. For me my temporary assignment ended, and I did not get hired on. They offer flexibility, they have a compassionate management team who will strive their best to accommodate your working needs, and its a uplifting environment. Ingram Micro is an amazing place to work for. I left because there was not much for career advancement. The work culture was laid back but professional. The company encouraged work/life balance. In the past year, my office has laid off more than 35% of the Finance and Accounting teams. We've had 4 presidents in the past 4 years. My supervisor doesn't understand what I do. They have only a basic understanding of how the actions of our department impact the larger finance/accounting functions of the business. My supervisor doesn't trust me to do my job independently. My working environment is old and dirty. My superiors spend time and money to push initiatives that have little or no impact on the success of our business. My fellow coworkers were the best part of my day. I truly enjoyed everyday I was there, except the day I got laid off. I would recommend Ingram Micro to anyone. I learned how to deal with different type of customers, some mean and some were nice. I learned how to talk the irate customers down and resolve issues. this job was seasonal only i enjoyed working there it's a very busy an productive warehouse keeps u busy an on your feet at all times. worked at a very fast pace as well on a assembly line an at a accurate time Great company with passion for its employees and customers. There have been multiple changes within the management structure over the past few years resulting in a lack of direction, company culture, priorities, and a general unease when job security comes to the conversation. typical warehouse environment, pay is a little low, not much opportunity for advancement.  would recommend for an entry level position slightly above minimum wage. Your role and responsibilities vary depending on the vendor line you cover. Some lines are more proactive and allow you to work the business side of the role, while others are more reactive and you barely have time to take a lunch it's so busy. The day was spend with mostly inbound calls which was great but felt I wanted to do more and started a familyI learned how to make myself notice in just an inbound call center Great place to work.  Gave me allot of experience for my future.I would recommend this place to anyone getting out of college.Most enjoyable part of my job is the customers I had work with. A typical day at work in Ingram Micro is very easy and in the past 2 years working in my department (Kitting/Config) I have learned a lot about this wear-house. I'm pretty much experienced with everything in the work place as far as using the RF gun, wrapping, labeling, and also driving every power equipment they have in the wear-house. I'm also familiar with much more so I'm pretty much multi-tasked. They literally broke the law and forced me and my coworkers work 7 days a week 11 hour shifts for almost 2 months. The management are too 'friendly' with some of the coworkers and the management are too competitive with each other and abuse their workers in order to one up each other. They don't care about you having an outside life and will fire you if you're going to school or have an emergency and can't work the hours they require. Iphone season is the worse and their turn over rate is ridiculously high. They announce over time sometimes the next day at the end of the night and you are required to go. Need better manages and training. It's a very stressful environment only because the workers and mangers don't have good communication. But the pay is ok working with micro ingram was a lesson and a blessing to learn different things, it was an opportunity that I wouldn't pass up. I had a great time working there while it lasted. A worldwide company that does not care who you are or where you are fromyou are always welcome pay is not the best but with effort and sacrifice you can go upexcellent and copersacion and learning skill placea clean and healthy work placebecause the most important thing is you. So so place to work , close to home with good time (schedule) for myself and I like the shift that I am worked, but dues to not enough work or running out of work so we all let go by the company after more than 12 years. Ingram used to Brightpoint, which was a great place to work. However, ever since Brightpoint was bought out, the environment turned cold and all activity budgets were cut and it was only a JOB after that. It was a cold environment. Executive team kept pushing for more work yet they kept cutting everything for the employees. Now, Ingram has been bought out by a Chinese company and more people are being let go. It's just not what it used to be. Great customer's to support with regards to the full time IT positions. Well trained staff. Growth is huge, Smart people to work with. minimal travel. Highest level of technology utilized. El trabajo es bueno me dedicaba a piquear por ordenes y a mover paletas para diferentes sitios Best company I've worked for.  The company culture is friendly and caring.  Executives and managers have open door policy.  Career advancement is encouraged and supported by managers. Proud to be a team member of Ingram Micro. Had a lot of fun with Co-workers and staff members.Excellent distributional practices that enabled me to become a better team player and business man. It was a good place to work, they gave me good working hours. The employees were good workers and always met there dead lines. They also worked good under pressure. The only good thing about this place is leaving it. Period. No money even working 12 hour shifts..  No respect from management. Paid biweekly. Temp service for more than a year Great place to learn the business.  I enjoyed going to work here.  Great place to work at.  I looked forward to going to work.  Most companies are not like this. If you like a professional structured atmosphere you will love Ingram Micro. Business Acumen is necessary to become successful at Ingram. Put your knowledge to work. Great company with passion for its employees and customers. Company focused on low cost to their customers and that translates to how they treat their employees. Good work may sometimes be recognized but not rewarded properly. It is not very far and the hours are excellent. It is many different people to work with and learn new things. You have the opportunity to learn many things Ingram Micro was one of the best places to work in the 90's and maybe early 2000. Then upper management change and so came with them layoff and then rehiring the same roles. Ingram micro was a good experience for me because I learnt a lot of things there with cell phones with the android, iPhone and other phones. I also experience I good working environment with diferent races. The training I received was not for the periiod of time it should have been.  I was only trained for 2 weeks and then I got put on a bench of my own.  I still had questions about the assignments that I had to configure.  I was supposed to be on a 3 month 'probation period' and I was told by the Supervisor I would be training during this period.  Obviously this did not happen! Ingram Micro is mixed environment.work place. Some area worker enjoy their work and some area are very stressful. Depend Manager and supervisor. They got nice building this year. May be they will do better. Ingram is a high paced company with a great culture.  The people, events, and atmosphere are what makes Ingram such a great place!  The industry itself is complicated and hard to understand at first but technology is always changing. Ingram is a great place to work and gain experience. It is one of those places where you really get out of it, what you put into it. If you are willing to put in some extra effort, it does get noticed, and you are able to gain things like promotions, or get chosen to work on a spacial project that will help get you noticed. It has really great learning and development courses that are offered, and great forums to join. They are all about advancing the people, not just letting their employees plateau. That being said, it is a large company so it is easy to sometimes get overlooked and passed over. You just have to be a go-getter and be able and willing to self promote, and you will have the ability to go places there. Managed a regional ALC.   This was a multifunction operations supporting the Ingram Technology platform of their VAR customers and the 3PL customers, primarily in e-commerce.    Large Management staff peaking to 700 hourly associates during peak season. Ingram has changed a lot even since 2015. Until you get to the executive mngt level there is a lot of mediocrity. Increasingly very young people being hired, quantity not quality. good job for just work, dont expect advancement.  Not a competence hierarchy, its a 'are you friends with your boss' hierarchy.  Management is unresponsive to needs. Tienen mucho problema no tanto de racismo como de diferencias de clases te sacan de tu trabajo sin ningún motivo solo porque no le agradas al jefe o que me digan a mi cuando cometí una falta cuando no trabaje hasta tiempo extra solo que no me dejo decir estúpido por nadie puedes ser el jefe pero no mi dueño si me respetan respeto I am always learning something new everyday. I have an excellent supervisor. The hardest part was to become a PIT trainer. However,my supervisor made my training so easy that it was not as bad as I thought it was going to be. Great Place to Work.  Team building by getting employees feedback in order to make it a better place.  Training is available for employees to become more valuable it just a fun and friendly place to work for. it a nice facility and great environment. the facility have different type of culture and races. some of the manager is okay Ingram micro was a wonderful job to have working filling orders for Walmart.com and Amazon.com the only thing I didn't like is when I applied for the job they told us one time we would be getting off but we never got off on time. I been here for almost a year now I've grown to this job like my home but I think it's time for me to advance to another job. My dislike about Ingram micro is that they over work you with little pay. Ingram distributes product for companies such as Walmart, Amazon and Overstock.com. So, there is a variety of product being received and shipped. There is forklift operator positions(cherry picker, stand up reach, pallet jack), shipping , receiving, stocking, and order picking positions. It tops out at roughly $18 over 15 years or so. I really enjoyed working there. The people were nice and even though we worked long hours it was still worth it. I wouldn't mind working there again if given the chance. it is a great place to work. there is a lot of overtime available. they always keep up with compensation requirements, and are very competitive in that regard. Great company with passion for its employees and customers. we use to pick orders, pack boxes, the people where very helpful work as a team. hardest part of the job was the hours. but with all the friendly people around you it was cool place to work at. The place used to be so good to work for and as it grew more mature and more aggressiveness takes over.and my last experience there was nothing more than a sweatshop in America. Ingram Micro is a great place to work They are fair and the work life balance is goodwork schedule Monday - Friday 830-530pmMeet great people there Good place to work good people everyone gets along for the most part the only problem with it is to many people want to have the better job and they will do anything to get it Things could be run smoother with different management. Last minute changes with work schedules. No decent start time hours.  Never know when you will get off work. A lot of favoritism. Hard work does not get recognized. At first when I started working for Ingram Micro it was okay. We were put into groups to work on large orders to be shipped for the holidays. This was were it was fast-paced. Once the project is completed and you are sent to pick products using your RF scanner (alone), it becomes more slow-paced. You are given a stack of orders to fill which wouldn't be so bad if they didn't have us walking back and forth from the front of the building to the back constantly. The only thing I did nkt like was the fact that even of there was no work you were mandated to stay (even if that meant walking around for 3-4 hours). All in all its not a horrible place to work but beware of supervisors, they rarely help you out since they have so much on their hands too. Its pretty confusing if you've never used an RF scanner so you will more than likely be trained by someone else in the facility who's nice enough to help (if you can find someone). It will more than likely be a coworker who's been there for about a month or so, but once you get the hang of it it isn't so bad. Over the years with Ingram Micro there were many opportunities for advancement that I took advantage of learning work from entry level to training others and supplies procurement.Ingram Micro has a diverse workforce and nice work / life balance most of the year.  Being retail related, 4th quarter expectations can be stressful to associates given the numbers of hours that are put in, and management recognizes that by having associate appreciation lunches and events. I'm grateful for the opportunity of having worked there but I have 2 cents I'd like to share. I hope it doesn't take away the fact that its an amazing organization to work for.A typical day can include a variety of tasks but you are sure to be extremely busy due to the fact there is a lot of bureaucracy, internal disorganization and lack of effective communication. The core strength behind this organization is nothing more than a name that has been in existence for some time. There is a bit of arrogance when it comes to what they have to offer and aren't intimidated by the fact their market has been penetrated by competition.This is that common attitude of 'we're big' 'we're bad' and at your business is at our mercy.There is a lack of customer service.  Emails go unanswered for days or weeks at a time..Then there is the internal communication.  Instead of getting up and walking right on over to resolve an issue, the preference seems to be endless emails, tossed between different departments.. Its a never ending non-productive approach to problem solving.There are two types of associate here.  The doers and the donts..  Accountability, lack of communication, abundance of circling emails.. and the list goes on.  They need a solid format.  One that works and one that can help them reclaim the stakes.Regardless, though, there are those that make the working environment a pleasurable one.  There are lots of amazing things that can be accomplished in this organization.  One piece of advice is..  learn the politics and you'll succeed.  When your day  is numbered, its numbered and unless you are willing to throw others under the bus, its hard to succeed.This is my experience and I hope it helps.  Give it a shot.. Lifes always got a different experience for all. Great company to start a career and learn many things about marketing, technology and what it is like to work for a Fortune 100 company. There is an opportunity for a lot of travel is you like It is a good place to work for job security, but not for pay or career advancement and men are definitely paid more than women.  There is very little in the way of promotion path. horrible management they do not care about the wokers at all as well as we work 12 hour shift and on holiday pay only get paid for 8.. now you tell me where they do that at lol I really enjoyed working at Ingram Micro. learned a lot and the supervisors and management were great. they gave a lot of overtime and weekends. i really liked the people i worked with and they have there own restaurant there. work life balance very good. management solid. remote days given to associate level and higher which is really nice if you have a family. people work hard and are helpful. Ingram was a good working place, because their supervisors were nice to people, but the thing I didn't like about it was that they had less work and they had to send us home. I learned quite a bit at the company and made some amazing relationships.  The culture and organization has changed quite a bit over the years, in some positive ways and in others unfortunately not positive ways. Life at Ingram wasn't as hard as I'd expect it to be, considering you have to meet a daily quota that varies according to your position, and also the company's needs to stay 'productive.' The co-workers are a fun bunch and help relieve some stress and pressure. In the Tennessee warehouse, it is bad paying job for all the work you are doing each day with a lot of overtime and other Ingram companies pay is better for the same job title Ingram has a very solid reputation and each DC takes the feedback from its management team into account when making day to day  operational decisions. good compensation. work life balance could be better.  current executive leadership is providing better overall direction.  Culture is not the best.  Job security is definitely not optimal. I have health problems which i told then before i was hired. I would miss days and come on with a Doctor excuse AND STILL get pointed. There is no compassion for the sick here because any other day im here ontime and stay until im not needed anymore. Great company with passion for its employees and customers. I was a temp job and I lived far away, couldn't do it anymore so I had to quit but it wasn't a bad place to work at and ppl were really nice, always willing to help when needed Working with them was always a very exciting challenge and I was very good paralegal because we were always very busy just to finish their work and we rested for 2 days but it was always very good work with them In the beginning of my work career at the warehouse hours were not normal but when company became bigger work hours were pretty fair as years went by the company grew even bigger got really busy in and around fourth quarter they seemed at sometimes not to have enough workers they then added temp force employees and they really were not trained well and we had a lot of over shipments and short shipments and late shipments witch hurt our bonuses and had a lot of in house damage that was not called for , that's about all I got to say besides that I didn't like when they blacked us out for about 6 weeks and nobody could have off . And it was always the fall time of year hunting season !!! I just don't think that's fair and we worked at one point 12hrs a day 7 days a week  good money but people where making a lot of mistakes This job is ok if your new to the field of warehousing but  Beyond that not a good place for evolution of any position.  Multiple managers controlling the same areas and employees leaving at a consistent rate. Great place to work! I highly suggest anyone to work here.  WIth a great company culture you can't go wrong with Ingram Micro. IM also offers many internal opportunities! this is a company that is in a constant state of fluctuation. The business units do not communicate well and often lead to poor results. The culture at Ingram is not transformative nor emotionally intelligent which is why it struggles with diversity. - Frequence change of materials-Weekly new items roll out-Confusion through the chain line of management.-Scheduling issues with employees-Misscommunication between management and employees.-Attendance issue without being notify-Easy termination without warning.- The good thing about the place is being diverse-The benefits are also great- Security system is not good- Favorism is the big issue, but when complaint about it. You become the victim-Backstarve is another major problem with nobody concerned about Good people good Paid time off good management very very very good work culture good work/home balance good pay there are a lot of opportunity such as getting a college degree. A good place to work. Very fast pace and the pay was good. I would work there again but need more pay. Looking to find some that fits my growth as a enployee. Ingram's going through a lot of transition currently after being acquired by Chinese conglomerate CNN.  It's also trying to development into a tech company from it's roots in electronics distribution.  Too early to know if that will be successful.  Due to it's size and transition, much is in flux and its difficult to keep your bearings. my day star at 11pm to 7am sometimes work 12 hours I'm learn driving and picker the most  hard work is the boxes is to heavy and sometimes you need to take the heavy boxes in very high places. Ok place just need better management They don't pay enough for the work that your doing. The job security sucks. Its no  organization in the work place and they hire permanent they hire a lot of temporary workers Ingram is the perfect place to get on your feet. but the schedules can interfere with your kids and outside life. The people are awesome and the management could be a whole lot better. Your coworkers make the job go by a whole lot faster and are very friendly. Ive learned that job security is important, but family matters more so if you don't like being away from home a lot then I wouldn't refer it. it is a good place for a first job experience. not so good of a pay rate, but for the job to be not so stressful it is good. overall i give it a three stars. Ingram Micro is a great place to build a solid professional foundation for solving operational challenges. I learned to effectively apply LEAN standards to improve process. Temporary position. Very fast paced enviroment. Picking orders. Worked 12 hours shifts every day. Very strenous and no air on certain levels. Managers were very tough This is a revolving door for young people. Loved working there but things can change in a second if you get new management. If they decide they do not like you they will do what they can within the corporate guidelines to get you out. no stability unless you are in the in group. Worked there during the dot com bust and things changed drastically.  Looked for other employment during that time because hours  had been cut. Great crew and management Good work place,Speed and confindence,good management,clean and loveable,there wasn't anything hard at this job.everyone got alone good. I would recommend people to work at Ingram Micro for housekeeping cause,thats the field I were working in.i enjoyed meeting new people and new faces. I really hated leaving this place. The work wasn't hard and the supervisors and managers where great when it came down to making sure everybody's job was secure. Great company with passion for its employees and customers. Its basicly pretty simple and easy as long you dont mind working in a warehouse. Everyone pretty much has help to offer when u need it. The only dislike i have would be that in summer its extreamly HOT and winter its too COLD. I really like how everyone keeps the motivation going with such fast pace at work and have a possitive attitude the whole time I loved going into work every morning. Everyone was always smiling and greeted you with a friendly hi. Even the customers I had the pleasure to talk to were really great. I learned many new ways to work smarter and achieve quality work. The managers and supervisors were very supportive and always had an open door policy. We were given lots of training opportunities. Ingram Micro is a great company for a young professional to gain experience within different departments of the tech industry.  Great company to progress a career within the indusrty. I really enjoyed working at Ingram Micro.  The environment was fast paced but it was my favorite job.  My box was the Chief Technology Officer and he was responsible for over 2,000 employees.  There was never a dull moment with this job. Bad management in IT  department. Incompetent people promoted. some groups had real bad managers , surprising how these kinds of people were promoted. Boring job that doesn't offer much of a career path.  This is a good opportunity to get some experience, but then move on to something more progressive. nice working there,i had a good time being there though production was low,also i had to go back to school and make my career worthwhile....i met few people i cannot forget in the life i have lived and i hope those people just remain the way they were.... Great company for someone who likes the overtime.And to work evenings because I believe when I worked there you started on night.Leads are always around if you have a question and coworkers always there to help The work environment at Ingram is very fast pace and at times very negative. If things are not executed perfectly, it is a blame game of whose fault instead of focusing on fixing issues right away as a team. The upper management follows this the most and leads with fear instead of inspiring employees to do better. Great place to work to learn operations management.  tHERE IS AN 0pportunity for advancement if you're willing to relocate, including international placement. Ingram Micro- IT distribution giant. I have a very limited perspective, as my time here has been under 2 years. Luckily, Ingram offers plenty of entry level positions- all of which you will be provided sufficient training. I had entered the position with NO experience in the IT world or distribution. You will have innumerable resources-whether it's from your own team- or management- or tech support- internal support is basically at your fingertips. Most veterans and experts are approachable and helpful. Typical day at work- You will be managing one or more email inboxes depending on your position. Your team and you will follow the team protocol- or SOP- (yes, Ingram LOVES acronyms) while working out of the inbox or answering incoming phone calls from a reseller. Depending on the time of year, and again, team, your workload will always be in flux. workplace culture- This one's for the millennials. There are over 1,500 people employed at Williamsville, and you're going to see every personality under the sun. You will learn how to tolerate each one. However, Ingram loves extroverts and winning- especially if you work in sales. This attitude has been bred and coveted by work and education institutions for a century, so you can't blame management for their personality preferences. The company culture is very supportive, relaxed, inclusive and amazing on the surface. However, there's also this weird trend. It's kind of contradictory from what I had previously stated about support. Vulnerability is not welcome here. New employees are sometimes expected to learn through  osmosis. There is a high 'fake it until you make it' rate of employees. I had been one of these. The information is there for the taking, but the team support can be fragmented and hurried. You'll do well here if you're a linear thinker, like the bills, like to drink beer, play golf, drink tim hortons coffee. You'll do well here if you take pride in your work. You'll do great here if you like the stability and benefits. Ingram actually is awesome, and I'm grateful for the experience. Ultimately, the company culture and daily operational work was something that became soul-sucking to me. There are some incredible people who work here, and if you work hard, there's plenty of advancement opportunity. I recommend Ingram as a solid, reliable work place to everyone I know. They don't know what they are doing. Managers comes from Taxes and all work stops.  Too many supervisors or acting supervisor that don't know what is going on. 1. Typical day of work with clean and attractive environment and international and varied ethnic outlook2. Learn much on application of powerful software in Inventory Control and movement - Logistics3. Pleasant and friendly management with core values emphasizing team work and respect4. Stress free atmosphere 5. Most jobs are enjoyable as your boss takes delight in working with you.It would not be hard to innovate with free and confident mind.6. The most enjoyable part of the job is siting to work with the computer well dressed in the spacious, clean, and noise-free mighty warehouse and taking break every hour and thirty minutes. The nature of the  job is also enlightening. On a daily basis I would take phone calls, process quotes/order and work my pipeline. I had focus accounts where I would provide white glove service to their account specially. Its easy,  perseverance,level headed, its so beautiful and cool ,not really hard. love the scanning part its really a part of me each day i go to wrk. It is ok to work there they keep people as temps for ever.  also will give you tons of over time when there busy so if you need the money not bad. just be prepared to deal with some headaches. A typical day at ingram Micro for me would be standing in one spot all day, but i had two jobs at ingram micro. I also tapped and unfolded boxes, and i was really good at the and it kept me moving around and not standing in one space. one thing that i did learn was that working in a warehouse is not as easy as it sounds. the hardest park for the job for me was doing maintenance, and having to stand in the same spot for 8hrs. the most enjoyable part about the job was getting to know new people. “I make sure to be ready and out the door so I can get to work at least 30 minutes before ‘start time.’ That way if there are delays such as traffic I’m still on time for any meetings or important tasks. I check voice mail and the calendar, then plan my sit down work time around other things like meetings. Sometimes it’s hard to balance between being friendly and keeping on task, but people understand that I don’t like to chit chat during the day – I like to work.” Productivity is a major thing at this job.  Attendace is based on points that are limited up to 3.5 for Teporary associates versus Full time associates whom are given up to 12 before equalling termanation.  They make sure you know the just of your area.  The only frustrating thing at this job is the question in which you will go home,  you never know. First shift job where you come in and do your job and go home.  Not recommended for a career.  You can move up in position.  Many positions and places to work. Great company with passion for its employees and customers. Very easy going work environment, with helpful employees. The hours were very flexible and oppurtunities to advance opened constantly. The forklift operators taught me so much and we worked as a team Ingram was a fast place work environment. Sometimes your work day would started a 5 am to 3:30 pm. You are cross trained so you are able to work in difference departments. I worked 12 hours 6 days a week. Its a pretty huge warehouse. The hardest part was getting laid off after being told that I worked better than the full time employees that's been there for years. There was opportunity to make a lot of money but you put in over 70+ hrs. When the work slowed they laid off 80% of the staff. no room for advancement. They also do not work with your schedule. It was 70+ hrs or nothing. This was a fun company back when the company was growing leaps and bounds.  The sales team had a chance to help customer and win a lot of gifts for selling a new vendor everyday.  Great place to learn about all the different vendors. Management and colleagues encourage and foster a healthy environment for you to succeed, grow, and work cohesively together. Most of the jobs are going off shores, therefore, there is quite a bit of panic with hourly workers. This company was really awesome. I used to work more than 80 hours every week to overcome my financial crisis. The management was awesome. They used to approve all my overtime because of my hard work and honesty. But, because of the loss of contract with the customer or vendor, this company closed the whole department and sent all home. its a terrible place to work. Management lost. they will have you working every department in the building and don't want to pay nobody. Don't care about your personal life It was a good job but I believe would be harder on time management for people that have to take care of kids. It is a lot of walking, standing on your feet and working in a loud warehouse Great place to work. Great associates and benefits. In three year had four managers. The once public company sold out to HNA Group Co., Ltd.a  Chinese conglomerate at th end of 2016.  Was laid off first week in 2017. ingram is very satisfying place . love my job and the people In it . they are very nice and respectful . we have good management they are very corporate with you . hardest part of my job is sometimes all the numbers on the box starts to look the same and I make a little mistake and mix a number that's about it .other than that I love my job no problems or nothing Buen trabajo agradable muy activo y cono buenos compañeros da gusto trabajar ahí y un buen salario working at Ingram Micro is a safe working place. management is good. working at Ingram Micro helped me be a fast paste worker. my enjoyable part of this job was shipping and receiving for eBay and learning computer basics. Management and supervisory staff, not experienced in a warehouse environment, which would make any new hire nervous.  Furthermore, everyone seems to have their own way of running the business, with no uniformity.  So, there's always conflict.  Lastly, most people forget that their presence in the workplace is to do your job in a professional manner. And particularly, DO NOT use racial and derogatory comments to your colleagues.  I understand, it's African American-dominated environment, but hearing the N-word all throughout the day isn't my idea of the proper everyday workplace. Ingram is dedicated to growing the business while meeting shareholder expectations.  There has been a lot of ups and down with the overall senior leadership  which has caused concerns in the associates that work there and lack of direction in general.  This organization is not going anywhere given its sheer size and will keep humming along.  The many changing directions of the company took a toll on its team members but appears to be settling back into a better path forward. There is no possibility to advance at Ingram Micro.  Additionally, we are not compensated as we were lead to believe we would be.  Management does not value the efforts of my  team. The people make this company a great place to work and I feel the work I do everyday contributes to the overall success of this company.  There is a great work/life balance also. This is by far the best run warehouse I've had the pleasure to be a part of. Work days could be long but never boring leaving you feeling accomplished Difficult to draw a balance between your job and private life. The job takes most of your time but there is no commensurate compensation. Job security is not also a guarantee. Very little or no chances of advancement. This company is very family friendly and encourages you take time to be with your family.  They allow in some departments for you to work from home if need be. Great company with passion for its employees and customers. Ingram Micro Mobility is a fun workplace where one can learn the aspects of the business. i recommend everyone to work for this company. High work pressure, high retention but the company invest a lot in technology so a good chance to work on new innovations. Fabulous job for anyone whom enjoys a fast-paced work environment...Plenty of chances for advancement...Culture of the work-place is comfortable and welcoming... En lo personal deberían de tratar de no tener mucho favoritismo, es una de las mejores empresas me encanto trabaje allí Worked 12 hours 7 days. Coworkers was nice and helpful. Some days were slow. Everyone helped out. Never had a problem with anyone the time I was working there. Ingram Micro helps businesses fully realize the promise of technology.TM No other company delivers the full spectrum of global technology and supply chain services to businesses around the world. Start-up feeling at a large company. Building processes from the ground up.  Great People! Great support teams! Terrific place to work at.  Open forum to speak.  Currently synergising recent acquisitions and also being recently acquired.   Company and personnel will become more competitive with time. Start on the low end, kill it, and move up, Be ready to make connections and to create relationships - Distribution is driven on that political/social side of things.Otherwise, kind of boring, corporate, drab culture.Management is multilayered, full of career drones. They drive results through creativity and innovation.They are a winning team where people are valued for their differences and collaborate to achieve unparalleled success.It’s here where you will learn new skills, are encouraged to share ideas and see your contributions at work.They thrive on change and use challenges as opportunities to grow our business and our careers.They provide our customers and vendor partners outstanding execution and value every day. The Job was a really good experience, as I got to gain a lot of experience in the customer service field. From day one I was trained, and taught all that I needed to learn Coordinate labels for shipment, pick orders, meet the deadlines, show up on time, rarely call off, contribute to helping others, as well as extra duties You can get a point for every absence, so plan your off days a week in advance. Management can be describe as overseers, they care nothing about the people. Truly this one of the worst companies in Memphis Great place to work but no job security. I worked for almost two years through an agency and was never offered a permanent position. Ingram Micro was an excellent experience in which I learned many things about a Fortune 500 company.  The typical day was very long but the rewards were plentiful in experience and incentives.  Management was extremely helpful and understanding in the needs of employees and accommodated them appropriately. Upper management stated there were opportunities for growth within organization.  No such positions were available.  One person was responsible for all office duties, accounting, order and customer service.  No appreciation from management. I've learned how to use there network . I've learned a lot about moving and deleting bin locations I've also learned how to look for product in wrong location . I enjoyed my time at the company working with great people and attaining sales goals month after month in a great atmosphere. Ingram is a good company to work for.  As with other logistics jobs, the hours vary and can be very long during the holiday season, but not enough work in the spring.  Job security is pretty good, but training for all positions could be better. Working at Ingram Micro, I learned how to work fast and efficient. I worked a assembly line packaging products, which usual continued at a speedy pace, continuously for about 2 and a half hours. I also worked cargo, which consisted of loading ptrucks on too trucks. Good place to work at they got love for everyone and friendly. Good security and best services. Wish more to come for the company. Great company with passion for its employees and customers. My job consists of extensive customer service with a vendor in orders, logistics, inventory management with end users, dealers and company owed stores. My skills and previous experience is not being utilized to the fullest with this position and I find myself not being challenged. I enjoy the laid back atmosphere but would like to be able to have a position that may not be so repetitive and does not isolate me to my desk. I enjoy being able to satisfy our customer but would like a more challenging role in doing so. Great organization to learn and grow with, and management is very supportive and helpful. working with multiple vendors can be a bit challenging, but makes for a much more interesting day. Ingram Micro is a great organization. It provides room for growth and amazing learning opportunities. The best asset of the company is without doubt its members. Ingram puts a lot of emphasis in its employees and culture. Being the largest IT distributor in the world and a top 100 Fortune Company is very respected and recognized. It is a true global organization that has successfully evolved its culture with the flexibility to adapt to the complexities and needs of the markets.The team is dedicated with an approachable leadership where open door practice is truly practiced. Innovation and creativity are constantly present. I am very grateful to this organization, the opportunities it provided me and the input it had on my professional life. Assisted the Sales Team in completing requests and making sales to our direct customers. Managed an exclusive E-Mail Inbox which dealt directly with hundreds of customer requests from various partnered corporations regarding sales and inquiries of different offered services. Responded promptly to customer E-Mails and provided extensive information and various options to best suit their specific needs.Management was very Hands-Off which at times caused issues due to problems remaining unaddressed. Work volume could sometimes be overwhelming. Muy buena empresa! Es miy tranquilo y lo mejor de todo que la vestimenta es a tu gusto. No better people than one's who work at Ingram Micro.  Great work atmosphere with wonderful benefits and excellent pay.  Company encourages work/life balance by limiting overtime and encouraging holiday time off and family events. Lots of overtime. Room for advancement. I loved this job. Would go back in a heartbeat if they asked me. They hired me to do international shipping. I did that for 16 years. No me quejo mucho del trabajo pero hay muchos jefes q quieren mandar y no son jefes pero por preferencias los permiten As I was at this company for several years your coworkers become close friends/ family. Integrity, collaboration, accountability, and teamwork are a must have. Apply yourself and be open to learning new things. Great work place and have opportunities for advancing. Great experience working for this company it was very informative and productive. I liked working at my own desk and computer I enjoyed learning about antiques and authenticating various brands and collectibles The audit team was a wonderful experience to work with, the facilities that they provide are extremely good. A very professional environment. Has office thru all Latin America. It's a productive compony with a daily mission.I had learned how to work under pressure and how to manage the things with time.co-workers were very friendly and productive.The most enjoyable part of the job is everybody was friendly which makes working environment better in a productive way. 8 to 10 hrs. getting along with other employers  nothing is hard about a job give a good days pay for a good days work. I have more time in the warehouse industries, I work for Harry & David in Medford Oregon for 5 tears Plus I work at this company rhough a staff mangement company back in 2010, I work at the neww facilty for the CDU department during the new flu shots. Great culture, hard to advance in certain departments. Company truly cares about the area and giving back to local charities. I'm a person that believes in organization.Without order,production and efficiency is limited.I thrive on fast paced, but accurate work.I am very comfortable in a warehouse environment.It's a second home to me.I would be honored to be able to pursue this position.Thank you! Ingram micro is an good place to work.  i am currently still working for them.  just looking for a part time job to help with bill. so why not do what you love to make extra financial help. they are very unorganized  did not  have a lot of work very dirty and they higher just anybody and they shouldnt do that and barley have any work and didnt know where to place people To notch we'll run organization with true dedication to its employees. Management involves it's employees in many decision making problems. I'm a person that believes in organization.Without order,production and efficiency is limited.I thrive on fast paced, but accurate work.I am very comfortable in a warehouse environment.It's a second home to me.I would be honored to be able to pursue this position.Thank you! My typical day would start off by inspecting phones for function and/or cosmetic damage. I would process information in the system if it is a pass or fail phone and put in correct color bag. I learned a lot about the mobile phone refurbish business and was even cross trained in Level 1 technician experience. I had a great management team. They were there to help you whenever you needed it. They made it easy to approach them and ask questions or to let them know you had made a mistake that needed to be corrected. The co-workers for the most part were nice and if you were unsure if you were doing something correct, you could ask them and they were able to help you out too.The hardest part of the job I would say was meeting quota. You had to work at a fast pace and make sure you passed or failed the phone correctly or you could find yourself in trouble with the supervisors.I technically liked my job, and would still be working there if it were not for the massive lay off. I came in everyday and worked as best as I could. The job itself can be very stressful. You are the one to determine whether the phone is passed or failed, so you had to make very sure you did it right the first time, because once you submit, you could not undo your mistake unless you told a supervisor, and they were not always happy to help you on those mistakes. Great company with passion for its employees and customers. I enjoyed my experience at Ingram Micro. I learned how to drive a forklift an it taught me how to be a good team worker. I was able to become a lead before I left an that was the best experience I've had as a lead in all of my working experience. The lunch break was fair, my job was close to a lot of restaurants and plus they had food at the work site. Overall I loved this job. Enjoyed my time here. Becoming a lead gave me better  knowledge of my position and future insight. Also the staff was readily available in time of need, especially peak times. Excellent working environment; Great People; Excellent Compensation Package; Great Opportunity for advancement. It was a really nice and positive environment to work in. it was a seasonal position where i wouldn't have mind staying long term No single day is the same as the previous one.  There are always vendors visiting to promote their product lines and new products.  Te team in the Scottsdale office is what really makes coming to work every day enjoyable. Good company but low salary. Big company and giving more jobs for more people. Supervisor and leads are good and security system was irritable. Duty schedule is not good. Thank you. This is a good place to work at and there a lot of really good people to work with. Pay isn't particularly great, but there are opportunities throughout the company. Great Management, Great staff, great support infrastructure, matching 401K, good benefits, company  provided lunch, flexible hours.  only leaving due to relocating out of the state I Work There And I Love It! It's Not Hard Work! I Am A QA Biller And I also Picked At ingram micro! The Supervisors Are easy To work with! I Am Looking Forward to Better My Careers one of the best places i could have ever worked i learned alot and got paid for the work that i did it was ran the way that it was suppose to be ran and it was good as far as the benifits the training was very good as well. I worked full time at Ingram Micro seasonally from Sept 2015 to April 2016. The work was not terrible but the safety regulations were not enforced as much as they should of been. Goos work/life balance, very professional people. Strong company. Good growing opportunities. Not too good compensation plans. Beautiful offices. Good management team. I and my co-workers drive cherry picker forklifts we use RF scanners for picking and we have to be accurate we have to build and place our packages on pallets and unload on to a conveyor. I also worked in shipping loading trucks with my co-workers we have to build a wall and make sure it is sturdy. The hardest part of our job is the accuracy. The management is strict but fair. The most enjoyable part of our job is making sure we are picking the right product. There is a lot opportunity to grow. Co-workers are very friendly and supportive. The hardest part is on 4th quarter, employees has to work longer hours. Great place for people who enjoy a fast paste environment. Management could give less about you all they want is get product in so it comes be shipped .long hours no raises no bounses .branch huddles very few even if have one .need to get Union in .they cutback on Christmas party no summer picnic . It is all they want to do is more money in Ingram pockets I worked there for 17 years. Was a job and that's about it Ingram Micro is where I developed my working skills and worked at different department.while I was working as Data entry there was misunderstanding with my coworkers about pulling parts for the technician who fix the phones but I come up with the solution and explained to her the way she understood me and then finished the plan for that day.I did't find the hardest part of the job because I'm always willing to learn new things that comes through and had no difficulties with it. They always gave us training before doing if there is some thing new come up. The most enjoyable part of this job for me is that I learned different stuffs everyday and moved to from one department to another which helps to have a skill of doing different things. and the people I have worked were awesome and helpful. Great place to work. Make you feel like you can get help but when you try to you won't get it. Example you go tell a supervisor that you need help with a task they say they will help the next day they dont and keep butting it off on till you keep reminding them everyday. Also some departments always ask for help yet don't help back when they don't have work... To keep employees, balance the salary and the life style.Get better projects...get some different client basePay is a little below industry average. Single person controls the organization so no much room for negotiation. Not getting enough hours to pay for the bills I have. The people and work is nice but the distance is far away from where I live at now. Working in a warehouse had to be the most wonderful jobs I have ever had. The experience was great, only because it was easy and good pace. It made it better because some of the other workers give lots of respect. Great company with passion for its employees and customers. Iam still an employee of Ingram Micro and one thing never cahnges... we Are required to be here if there is work. No If's and's or buts... We continue to work 10 hour day's 6 day's a week... because our staffing is based off of forecast and not actual work... Its been a hard 8 years.. but the people i work for and with has alway's made it enjoyable. You work  7 days a week -  10 + hours a day  even when there is no work.  Not many tools for every person . They promise us a pay raise but lied. The workers quit each day more and more. Not respect for employees. Very friendly environment to work with. Met lot of new people and learned a lot from then. Good platform to work. I improved my skills my facing more challenges which i came across. Managed, trained, and established net-new as well as current Motorola accounts through a process of live, hands-on training, marketing events, rebates, and relationships. Accomplishments:                                     •  Customer Management: On-boarded all Motorola partners and advised how they can hit their sales goals.                                      •  Sales: Exceedingly over achieved on an $8m+ quota at a rate of 104%.                                      •  Management:  Created and conducted marketing events with current VAR, DMR, and other channel                                           partners as well as continued building new relationships to achieve sales quota. 12 hr shifts, 7 days a week. No room for family or a life. They do not have funds to get folks the equipment to get the job completed. touching product too much to get out the door. folks standing around talking way too much. lied to on hours, there are times you are there 14-16 hours day. they do not fix processes, do not upgrade facility to make a productive work environment. Excellent company with great culture, great people and advancement opportunities.  Ingram is a very social organization with a great focus on philanthropy.  My personal experience has been very positive and have worked with very intelligent charismatic people.  It has afforded me multiple opportunities. The most enjoyable has been the travel and meeting customers all over the US and the events are outstanding. -  The good environment, -   low paid rate - Team spirit- Multi- culture-   holidays paid-  hard work-  stand working- no flexible schedule for student-many tempory workers- Good people and management was good, just bad hours especially during mandatory over-time that gets called at the last minute, but hey it's more money Everyday we come in every afternoon listen to how many hours we will be doing. Then i will walk into my work place and get on either 3 to 5 computers. I learned that not all cell phones are easy to program. Most of my co-workers are easy to work with, but some people give me a hard time. The hardest part of the job was to stand on my feet for 8 or 10 hours. The most enjoyable part was to program new phones before anyone see's them This company keeps you working minimum 10 hours a day. I learned it is good to get along with others because your coworkers are your support. If you want to transfer to another department in the company, the ability is possible. I've been working on entering the serial number of the mobile phone and pin through scaningIt was very good and  easy workWe are depending on the type of Scaning the phone and phone model and color of the phone as phone companies and booklets Very easy to work there, not physically demanding.Fellow employees are fun and great to work with when longer hours are required. Ingram is a good company with flexible shift they make everything easy for you at Ingram Micro and when you can make it to work to give you time off and make it easier for you that's just the main thing they have a lot of people even me Ever changing and continous improvment keeps the staff busy.  Customer's expectation are always met and in most cases exceeded.  Great Leadership and work force. Ingram is very proactive in educating their employees and training them. Management is positive in their day to day interaction with their employees. Love the work area and the people and leadership team. Like  the work location the training was very well set up to help you learn more in your area. Good team work there is growth inside the company but it slow moving. A lot of company growth and fun A typical day at work, I would come in early to get my area ready to count, so employees were not just standing around after our daily meeting. Hardest part was waiting around to count because orders were not completed and everything needed to be transacted  before we could count. This often happened when production worked over time.  Ingram has a very diverse culture and its is interesting about learning where others came from and about their cultures.Co-workers were friendly when you got to know them but when running three shifts, one often would hear a name, but never know what face belonged to it. I think they would benefit if they would have a meeting once a quarter where all Managers and Supervisors would get together to introduce themselves. (some type of catered lunch).Although it did take getting use to, I find that I enjoyed working third shift. supervisors will put blame on their workers for things that were their fault. They also grant you things then tell the manager that they did not to get rid of workers that work hard and not there to be friends with the supervisors. Have been known to drive 40 minutes to work to be sent home after an hr and a half Typical 8 hour work day consisted of stocking, picking, loading, unloading and making sure we meet quota. Learned how to use an rf, how to properly handle equipment and maintain a steady workflow.Management was great and coworkers were very helpful and reliable.Hardest part was making sure everything was done on time. most enjoyable was being there making money. At the beginning of my career with Ingram is was a great place to work with free lunches and shirts for the last 10+ years the company has been more tight with their money Great company with passion for its employees and customers. loved working here, never dreading going to work, great work people. quotas were reachable. lots of time off, hours were flexible go to work an do the reqired amount of work needed and go above and beyond  support great management team great co workers by far i learned alot of products computer skills an much much more the job isnt hard a pretty comfort work the most great thing about the job is i feel like i have a family with ingram micro Great place where I was able to hone my sales skills and build strong customer relationships over an eleven year period. I like the people i worked with. The job was really cool and chill. I would still be there but i moved. If something doesn't come through soon i may go back Transction of repair parts and giving parts tp repairi learnt Data Entry,content clear, master pack, staging and pullManagement were really good as well as co workersthe hardest part is when i was trained first on data entryEveryday execise was what i enjoyed resume at work by 8am and close by 2pm because it was a part time job. co workers are mostly friendly and we work like a team. I left the job due to relocation and also to look for a full time job. call center is  a joke they dont care about anything but there self teamleads pick and choose who they talk to they are rude and careless very disrespectful As an intern, I am learning every day. This is a great opportunity to get into the industry. I enjoy the people and the layout of the building. They use an open space environment. The downside is parking is shared with other companies so some people have to park further away. My manager is really nice and supportive. The people are fairly friendly but that is where it ends for me. Overtime was mandatory especially on weekends, I lasted as long as I did because of the people. Overall its not too bad. I enjoy working for Ingram, they treat their employees well, and pay competitive wages.The vendors do include SPIFFs for sales as well as bonuses available for hitting goals on top of your base salary. like going to work with a smile and coming home not being stressed out. management always listened to everyone's input. gave awards for outstanding performances. I worked at Ingram for 10 years. I had the opportunity to take many online course and workshops. Coaching EssentialsEmotional IntelligenceMicrosoft ExcelResolving ConflictsDiversity and EthicsChange in the WorkplaceViolence in the WorkplaceThe co-workers and QC's that were on my Team showed me great respect and leaned on me for answers.The hardest part of the job was making the decision to leave and go back to school. The long 60 plus hours each week for two years without a break was more than I can do and stay healthy.The most enjoyable part of my job was training others. Great place to work, there is a ping pong table and free food everyday. The managers are very good and understanding Picking, stocking & loading.  Each tasks allowed a different learning experience. Teamwork was key.  Job tasks were easy & enjoyable. The supervisors make the difference they go above and beyond to make sure that you are comfortable and love what you do. The company would have employee appreciation week which they would celebrate with silly but very creative themes. The company is well managed, and takes action to reach it's goals. I really respect the leadership.  Profit margins are very tight, so every dollar spent is important. In the last few years, the pace has picked up so there's always a backlog of work to do. my over all experience working in the subway was good. this was my first job and i like the environment and co workers. they were very help full. i enjoy a lot working here. this job make me independent. Only worked for this company temporarily, typical warehouse environment where a large part of the team is made up of temporary workers. Went from picking orders to processing orders for Intermec. Not the best place if seeking to advance in the company. There wasn't much management in the office. Very disorganized. A typical day there, is theres usually opened from 7 am to 12 am . Since I started they've been really easy to work with and have not given me any problems. They are always nice on the phone and respectful. Great company with passion for its employees and customers. Good place to work at if you want to work a lot of overtime hours. Sometimes work Monday- Sunday. Always on your feet and moving around, typical work day is from 10-12 hours. I worked at ingram Micro a few years, at the plant i worked, they had very poor management and extremely poor work conditions A typical day at work is fun we laugh and we work together to make everyone's job easier and I have learned how to multitask on the job. Management is easy to work with because everyone in management are down to earth people and my coworkers are fun to work with because everyone has good attitudes and don't mind helping one another. The hardest part of my job is standing up the whole twelve hour shift until u get a break. I enjoy about my job that everyone gets along laugh and joke and everyone works together we are a team there so it makes the job less stressful Review the different types of manufacturer warranty with customers. Attending to customers via inbound and outbound calls, emails and web chat to resolve issues. Work closely with the escalation team to ensure that warranty claims are prepared, filed and collected in a timely and accurate manner. this is a super company.I would like to work full time here.Everyone is nice and friendly and very technically competent. Hot and sweaty, heavy workloads, but time passes by so fast during the shift. Many days called for mandatory overtime during the shifts but over the intercom. i learned alot of skills at ingram FL shipping Picking. Co workers help oiut alot and very friendly supervisors. The breaks are short for the hours we work wich is 12 hours day with only 2 breaks Prepared design specifications, coding, unit testing and peer code review.Developed test cases based on existing applications and high-level requirements.Performed all types of testing including Database, functional, acceptance, sanity, browser and regression testing. Great place of employmentCafeteria is a really nice part because a lot of people that are unable to go on lunch can utilize the cafe Typical day included drafting, reviewing, and negotiating IT related contracts. Also included purchasing duties, such as handling and processing purchase orders for IT hardware, software, and or services.Co-workers were what made it a good place to work.In this position, I learned how to negotiate contracts as well as process them from start to finish.  Also participated in some RFP's. Typical Day - ReActive rather than ProactiveWhat I learned - Solid Business StructureManagement - High LevelCo-Workers - Good PeopleHardest Part - MonotonyEnjoyable - Flexible Ingram Micro has such a diverse collection of operations under one roof that working in analytics exposes you to a great variety of applications, more so than you might get at a smaller or more industry focused firm.  The corporate culture is fantastic, though with the corporate office located in California and the main operations office in Buffalo, the upper management can be a bit disconnected from the rank and file. 9-5 type job. Culture isn't very interactive. Very good company in total, but not the most interesting place to work out. A lot of the employees don't like their job there. The company was a great place to work.  the pay was a on the low side, but the people were great to work with, and senior management cared for the people. Constant growth through the wireless provider services industry. Challenging but can be very rewarding and fulfilling. The associates are hard working and committed to the success of the company. Mangers never talk to associates, they say one thing and do another. no communication, overtime is ask 5 minutes before your day is over. we go there early in the morning and do our best to get the job done. Shipping cell phones and its accessories all over the country. We have safety meetings every month, management is fair. Ingram Micro is a fast paced environment. Ingram Micro encourages educational growth and offers many venues for their employees to reach their personal goals while working. Learning and Development is very beneficial handled by Human Resources. Ingram Micro encourages a balanced work and leisure life for all employees. It is a productive place to work. I had been working 40 hours per a week in my over 3 years experiences. Each day at work, I start with energy and go home not completely out of energy. Also, I learned data entry skills there and became very efficient on the forklift operation. Moreover, my co-workers are good people to work with. There is no one day that we have blamed each other. If you did a mistake, you own it. And the hardest part of the job is being very mindful of every detail in data entry, missing even a small detail affect the company. The enjoyable part of my job is sitting at the table when entering the data on a computer. However, I have been working as a temp for over 3 years. As some items may seem interesting. The management will lie and avoid problem resolution.  Favortism of full time and temporary staff. While those who work hard feel the greatest scrutiny. Great company with passion for its employees and customers. good work , stay busy lots of work overtime every now and then . learning new things hoping to get better raise this year , challenges every day  with new bussness coming in . In 2015 Ingram Micro purchased a number of startups and smaller high tech companies. After the acquisition we feel that our quality of work and life deteriorated.  Ingram's corporate culture feels impersonal and restrictive. There is not much communication going on between teams. Our benefits also degraded significantly. Long hours and a lot of week end work. I have been able to talk to the management when I have problems and they listen.  I have some nice co workers. It has its ups and downs but for me it was a place where i got alot of experience. I really helped me become a better worker. The hours can get long but it usually goes by quick if you dont think about it. The management had things to work on but all and all they were doing there jobs. Fast pace and people I worked with were easy to work with. I liked working there I can't really write a review  on this place because I have nothing to nice to say about Ingram Micro. They have absurd rules, low pay, unequal hours, management is inept. I have enjoyed my time with Ingram Micro, they gave me the experience that I needed and will take everything that I learned with me to my future opportunity's. very busy job. can go fro very slow to very busy so you must be prepared for all the changes that comes with that. i will recommend Ingram to anyone. There is no typical day at work the only thing you know is what time you come in. Management waits until 5 minutes before you think it is time to go and tells you  have to work 12 hrs.not 8. There is nothing hard about this job, it just is not organized, all managers have their favorites who never do any work. I have learned a lot working at Ingram. Not only have I networked with  some of the top company's/vendors in the world, but I have a proven track record or success. Everyday i scanned in the the shipping sticker. Then i find the location of the product. Once i have found the product i scan that as well, then i find the appropriate box for the product. Pack it and send down the line where product will be shipped off to customer. I work on replenishment put away driving OS. Sit down. High Reach I Piking Order Tray to learned every where I work because is necessary learned sometime new for a better job. I worked in close quarters with many other people. The managers and team leaders that I worked with did not communicate well, or tend to follow through with promises made. In a single work day I would program over 150 different phones, up to 3 different models. I learned how to be a team player and productively make use of the time I spent at work. The hardest part of my job was switching between different models of cellular devices and remembering each individual characteristic of the model I was programing. The most enjoyable part of the job was the steadiness of the work and learning about the newest technology that was available during that work period. It is a great place for young people to launch their careers. Managers work with employees about their future advancement. Ingram Micro was an awesome experience to meet different cultures. Great work environment with possible advancements. Ingram micro is a great place to work learn with fun. All I learned is that teamwork and hardwork is the essential key factor at any Job. The most miserable environment I ever worked in my life. I lost seven years of my life with this company. Disgusting management. Best part of the company is the people.  It is just a great group of people.  Co-workers, and customers.Typical day involves sending quotes to customers, order processing and management, opportunity management, strategic knowledge to win market share, calling partners and strengthening relationships, forecasting, pipeline reporting,Most difficult part of the job is the difficulty in leaving work at work.  It is very easy to stay late to finish something, and you end up doing several. The job it self wasn't bad it's how they worked 6 days to 7days a week. The supervisors where very rude. The company it's self isn't to bad the work you do is simple just the way you get treated makes you not want to work there. Ingram Micro is a good company, but they need to take a look at the management. Some of them have been there for years and new ones have caused some issues with the employees, including lying to cover their own butts. Great company with passion for its employees and customers. my day consists of picking boxes off the line and finding the correct items to fill them in, also labeling and packaging the boxes and special products and sending them off to shipping. I enjoyed working here because I like the fast pace jobs. There was always someone there to help if there ever was a question or issue you had. The management was very nice and the co workers where great to work with as well. The hardest part of this job was not being able to get hired through the company because of how many temporary people they hired for seasonal work. Received workload for the day. Placed associates in the proper positions. Made adjustments when needed. Meeting with associates to inform were they were throughout the day.Kronos at the end of the day. I started as a temp and Ingram then I was hire permanetly and it has been a great place to work. Work for Cisco vendor and the managers are great and realible since they know you have a life outside the company, they will work with you if you work with them when it comes in taking PTO or other. This job requires you to be on your feet all day and you are competing against your fellow workers for job advancement. Fast pace work environment. the environment working here was great and very dangerous , such as forklifts driving around , always had to be on your toes. witch made the job fun It is good for the hard workers but for the seasonal period only they don't care about how hard you work for the company. They will give you overtime and everything in the season but they will not hire you and for some reason after the season will kick you making any reason that you made errors and your accuracy was not upto the mark etc. No room for advancement and the training is sub par at best. Some of the management is good to work with while others are not by far. This is a high performance, low margin culture you can expect the pressure to be pretty high to increase profitability and work at a consistently high level. Teams and departments are encouraged to work together so there is a minimum of backbiting. The perks are great depending on the department you are in and you can generally be happy to come in to work. The down side to all this is that there is a great deal of pressure to perform and if you don't for whatever reason it's your butt. Over all Ingram Micro is a great place to work just expect to work and do not apply if you can't take pressure. Great people, interesting work. The industry is very dynamic and it is a great place to start a career. Most days are administrative tasks but sometimes there are legislative tasks to be completed. Ingram Micro is a business that requires hard working individuals that are quick and safe.It also needs people who are accurate with their work. we go in get our lifts and then we would go to the desk to get the orders to pick then we picked the orders and put them on the line for shipment Was certainly a different kind of company to work for. Security so tight, even employees struggled and/or didn't bother to go on breaks due to the fact, by the time you got through security check, break was over. Management behaviors with employees was not the greatest also was not fond of mass termination of staff on exactly the day healthcare would have begun. My current job requires you to be a self starter as most of my work history required.  I start each day early and love what I do but am always looking for more challenging opportunities.  My typical day consists of emails, phone calls, dealer and employee support, paperwork, new account prospecting, creating and training.  In the last 6 months I have more than doubled the number of selling doors in my market with a pipeline consisting of approximately 17 more doors in various stages.  Account management is a daily requirement to control inventory levels and inventory account net terms for dealers. Since Brightpoint became Ingram it has fallen way down hill.  My trust in superiors is gone and my expectations are buried. there is fun work placei learned smart work good managementgood partnersno thing was hard accuracy work and partner were nice Well for starters they work you like a machine and if you get hurt on probation well tough luck you're replaceable to them so goodluck. The management team try everything as 'confidential' and big news are not pass to the employees that find out for hear say. Great experience to be had.   There are many opportunities to learn about a wide array of technology solutions.  The people come from many different backgrounds so there is plenty of experience to learn from. Layoffs are what Ingram is noted for... it is continual. No security, especially if you have tenure. For the most part lower level associates are pretty helpful Great company with passion for its employees and customers. Long hours shorts lunches alot of heavy materials management is always on you to go faster than what you are able too rf guns heavy wrist pains suck Company is good at hiring being unemployed. They have new executive management that SUCKS - Ingramis NOT the nice, same company use to be. Many layoffs (yearly) HR not compassionate to associates only to Exec's. Nice environment but lengthy drive. You definitely are an activate participant in what goes on in the warehouse while in Operations. I loved the fast paced environment and high energy.  The company also offered a lot of on site services which was very nice.  They did, however, seem to restructure every year or two and that typically led to RIF.  Job security was always in question. I enjoyed my time at Ingram Micro.  It was my dream job.  Great people.  Fabulous work environment and good pay.  I started in general sales.  6 months later I interviewed  for a job in the new Government Division. This was a challenge but I worked very hard an help the division move from 26 K per year to 1 Billion dollars per year. In 1998 I applied and was awarded a position as a Sales Champion or a Vendor Liaison.  Again I worked very hard  and excelled at the job.  Unfortunately due to a company reorganization I was released from my job in March of 1999.. We all get a long at work and outside of work. Good Friends to have. I've gain a lot of technical experiences such as configure Servers, Routers and Switches, Desktops, Laptop. Excel Spreadsheet, Data Entry. Learn a lot about Quality Audit. The hardest part of my job is not having the support from my supervisors. Since there are a lot of associates it is difficult to do it alone some days. I enjoyed the people I worked with, I enjoyed the job that I was doing. Management changed and it became all about numbers and business. Not enough people to get jobs done in a timely manner, over worked some departments. For 18 years I have woke up with no issues about going to work. I have made many friends that I call my work family. After 18+ years my job was eliminated do reduction in workforce. I will miss this job, but I will move on with many things I have learned over the years. I am ready for a new adventure in the IT industry with my strong IT back ground. Mangers with 10+ years are cronies and only care about exec mgt not their employees. It is not about performance or innovation its about brown nosing them. They are dumb and stuck in the past. The hours are okay they have different shifts. The staff are great. The working environment is good. I improved my customer services skills This place was cool for a while, but then things changed. I got a little bored of my job and it was a little too laid back. I wouldn't take my chances of going back, but some of the people there were cool. I'll never forget my experience here, it changed my life and outlook on things. Very diversified....Hard working people...Only problem is their hiring way is tooo long....Some good leads and managers. -A typical day at work was overall fun and very fast paced. -I learned being safe is the number 1 priority in the main warehouse.-Management was very respectful and helped when needed.-Co-workers were quick to lend a helping hand and worked well everyone. Like family.-Hardest part of my job was learning the PDT gun.-The most enjoyable part of my job was going to work everyday with people that were as hard working as me. Great place to work, training staff is very understandable and friendly.Very simple place to work at, people are always willing to help. Entering account data by inputting alphabetic and numeric information on keyboard or optical scanner according to screen format. Preparing source data for computer entry by compiling and sorting information; establishing entry priorities Inventory Control Truly a great place to work for and with. The people were very knowledgeable and involved in improving processes to promote the most appropriate business solutions. Great place to work with multi-cultural  People and we can learn so many things.Great Management team and respectful environment.Family culture among the corporation. Solid management team. Numerous lateral and advancement opportunities. Scope of work was challenging. Informal work environment, management participation encouraged. Typical day at work support 500 + users, trouble shoot daily issues, configuring servers, desktops and other equipment, I’ve learned  a lot and keep learning, other coworkers they have been good to me we have a good team.The hardest challenge I had to configured a windows deployment server for our workstation refresh creating images for the company.I would say the most part I enjoy is working with our co-workers. You'll learn how to use RF Scanner, you learn how a basic warehouse works and this is a mediocre place to work the only people who work here are people who cant afford to quit except the manager and corporate people. also if you get hired by a recruiting agency please quit immediately and get directly hired by a company they'll be taking off your check more than taxes Great company with passion for its employees and customers. Performed transactional functions and order entry duties. Reviews and verifies accuracy of requests, maintains records associated with requests. Handles customer inquiries and supports the vendors and team members to deliver excellent customer service. Coordinates delivery/shipment, inventory, pricing. Resolves complex transactional issues and provides training to other team members. Subject matter expert in crediting and correcting errors. Created cost efficient solutions. Ingram Micro is a good place to work.  Provides a good work/life balance.  Has potential for growth.  Very good team environment with active leadership.  You always know the company's business objectives and culture. I learned a lot from loading a truck to packing out orders I would work there again if hours were different I just did not like the 2nd shift hours i work 8 hours a day sometimes we do somes overtimes wich rise the paycheck  , with two 15 minutes brakes,i work second shift from 4h30 pm to 1h00 am , Speedy environment. Encouragement all throughout the day from coworkers and supervisors.Great workout. Helps improve time management skills. Walking all day with a lap top on a cart, and scanning items. After that make boxes and pack items. The job does get very boring, and the pay isn't the best. we were always busy. co workers always discussing of what to get and what not too i never care work is work i was there too give the best of me and never complain always learning different stuff how to pick the locations of the boxes etc.., i like my job when ididnt had to deal with co workers debating on the boxes. Good old way. Great people, great work. Great benefits. Treat associates well and everyone got along. One of a kind, sorry it had to go away. RR Donnely was an interesting warehouse to work for because it had an upstairs and a downstairs. It reminded me of a gym because your were constantly on your feet moving around. Ingram Micro is a fun and positive place to work, the workers are great, company is great and its just been a wonderful time. Open to change, yet unorganized.  Laid back, yet a little of the blame game.  Small compension, yet paid lunches often.  Management fighting amongst themselves. Must be able to lift and move 50 pounds or morePhysically exhausting jobCustomers can be very awesome once you have been there for a long timeGet called into work a lot yet are assumed to do a lot of work off the clock because overtime is rarely allowed It is a good place to begin a get some experience in areas such as production, shipping and receiving. Also, they train you on the forklifts. I took this job as a way in the door at the company.  Unfortunately for me, the direction I want to take with the company has very few openings. Excellent company benefits available to employees to take advantage of working for such a large corporation.  Excellent team atmosphere and managerial support. Going thru security, getting my equipment for work, receiving different orders, okay management ,friendly , long hours , lunch breaks ,different products. It is not a bad place but it depends on who you work for. Most of the people that work there are respectful, however, a few bad apples spoil the bunch in this case.  The good part of the job was that you get to work on a lot of different accounts. Management lacks leadership and overall interest in employees advancement. Outside culture reigns over American companies cultures. Corporate employees are given preference over locals. I worked at Ingram Micro for almost a year. The work was interesting, there were opportunities to learn something new every day. Our team was larger with approximately 25 people on it so there was never a dull moment. All of our team members also provided great opportunities to learn new things and new aspects of the job. The training however that I received was not nearly as sufficient as it could have been. I'm the type of person who loves to learn new things and challenge myself in all aspects of my career, but I also need to adequately learn those methods first. If the training had been a bit more structured my experience could have been a much different one. Ingram Micro is very busy being that everything that sells through Wal-Mart comes through the warehouse first.I have learned that timing is everything because customers want merchandise day expected.Managers and co-workers are like family because everyone works together.Most enjoyable part is when you reached over the amount of orders to put out. Great company with passion for its employees and customers. Worked at this company for seven years and learned so many different skills throughout the warehouse. Lots of great people to work with as well. I would not recommend anybody to work here. The people I work with are nice. The management needs a lot of work on there management skills. Most employees work an average between four and seven hours per day. Some work overtime. The company should do a better job managing resources. 80 miles round trip to work. Start time is always the same 7am. I am a supervisor but dont get to run the floor the way I want, but is still held responsible if something goes wrong. I work with great people. l love the job great managment nice co-workers i dont find hard worh i do enjoy everday with all department . learned everday to go more goal we have On the first at work at Ingram Micro, It was very strange as I used to work  in  writing, but I had to be scanning , packing , labeling phones of different  categories. The management was decentralized according to department. The co workers are cooperative with collaborated work. The hardest part of the work is standing for along time, the most enjoyable part is seeing various mobiles phones at times in parts. This teaches me about recycle of phone and technology at work. I worked in the field but I was part of a great team and everyone I met at Ingram Micro was professional and friendly. I was extremely busy and my team was great. why working at ingram i find my self in competing with my numbers from the day before .my surperviser is cool .i get along with my coworkers. the hardest part is when i'm running out of work.i enjoy working learning to improve tasks daily, learned to perform a variety of shipping and receiving procedures, management was very supportive, co-workers are team players and very detailed, the hardest part of the job is not completing a task in a timely manner and completing all tasks with 100% complete orders Constant challenges and learning experiences keep the job from being dull. The company strives to keep employes happy as part of the culture and constantly looks for ways to improve. The job at Ingram Micro was easy. The management was okay. The hardest part of the job was standing throughout the entire shift. A typical days work included picking, packing, and shipping customer orders. Very self explanatory job need to work on management still need a lot of work pay rate could improve just a little the people there i enjoyed working with i know its about business need and a lot of good workers were out of work after peak season the hardest part about the job was high production rate with new employees and alot of weekly changes This job involved unpacking Apple products that have been returned. We would scan the product ID into the system that would then decide where the return should be directed. The job required attention to detail. The job was routine it also was a changing job with the new Apple products. At Ingram Micro I loaded new software on warrantied phones from a cellphone company called Alltell. I learned how to factory reset phones and use various computer programs to upload new software onto the phones. I checked the phones for cosmetic damages. The management at this company was intermediate. The organization of job assignments when work was slow was not so great. The coworkers were the best part of the job. We learned how to compliment one another when work was slow so that we could all have something to do. The hardest part of the job was being occupied with work when work was slow. Employees were getting sent home voluntarily every day. The most enjoyable part of the job was the bond that the employees had with eachother and our superiors. You get out what you put in. Great company and people.Be prepared to work hard, and you will get ahead.Many associates have been there for 20+ years. The Ingram is fully Process oriented company, they are masters in follow the process.The co-workers are simply awesome, they are always ready to help to the new people.My Manger is really nice man. A typical day at Ingram Mircro Clock in get my RF scanner log in and walk to the back to Void Fill where we would package the boxes with paper once all items are inside the box and ready for shipping, if that location was slow i would then go to the picking area and help pick the access boxes being left on the conveyor belt and once picked send off to be shipped, if that was slow i would Label and Replenish.Management was really nice and always payed attention and were willing to help if you needed it. My co-workers were FANTASTIC always in a good mood. Hardest Part of the Job....i had no hard parts besides getting home tired.Most Enjoyable part would be the people,great environment. Great place to work. Very good hours through out the week with a lot of overtime. Most of the time your off on weekends but could work saturday. Very friendly co workers I come in stretch with my crew, pick up RF gun to pull orders. Usually stayed to myself and work efficiently. Co workers were amazed with my rapid work pace at times. Co workers develop a friendship bond; hung out and bought pizza for the crew, etc. Hardest was dealing with overtime, which would be mentioned right when it was usually time to go home. Fun workplace. Enhances growth ! Co-workers and helpful. Help you to grow. Awesome company to work in !.......................................................... Great company with passion for its employees and customers. Very hands on very easy once youve got everything down always had a great cast of people helping me out great place to work Starting out at the largest distributor gave me a vast knowledge of the channel.  I was able to learn marketing in a fun fast paced environment.  I really enjoyed my time there and appreciate the foundation it gave me. The work I did reported directly to the Executive management team and the Board of Directors.  I enjoyed doing competitive intelligence. Any typical days i didn't mind because my best friend was working there also and i could get through the day with her plus i lovw money . I've learned how and repair , type all in one job , my manager was cool but then he got moved to another spot so i got another manager and he was a not fair , my co- workers kept me motivated and happy all the time . The hardest part of my job honestly was looking and searching for the small damages , I Really enjoyed my job because i was sitting down and getting oaid 8.50/hr. Ingram Micro is a great place to work at, they will expand your horizons and make sure that you are taken care of. They have great opportunities to expand yourself. Example the Carrier Club and new job openings are always  available. Ingram Micro was a fast paced company with plenty of opportunity to learn and grow.  A typical day included collaborative meetings with senior management and later meetings with my staff to discuss objectives and current projects; continually review goals and objectives of staff members to maintain the integrity of the company goals and objectives. Additionally, financial management and analysis including providing rationale for sales goals and operating expenses was an integral part of my job. Management and coworkers have a great rapport.  There is an atmosphere of integrity, trust and shared goals. The most challenging part of the job was the language barriers and time differences involved in working in an international business.The most enjoyable part of the job was the people that I worked with and the challenges that I faced every day.  Every day was different with new and interesting challenges to face.  The feeling of accomplishment after a busy day was very gratifying. Fast Paced job environmentLearned new work environments, different departments available Co-workers are friendly and adaptableWork is not that complicated Enjoyed collaborating as a team Company never prepared you for layoffs.  You would see it on the news and press would be at the front door upon arriving at work which made it an uncomfortable environment to work at. Ingram Micro is a very fast pace place to work for, but there are a lot of perks. There is a lot of stress, but the people are fun and the perks are great. it has been so long since this company was worked for - possibly not in existence, I have not looked for this. do not know if owner is still in southern California. shipping department. scanning product to be billed and loaded on the trucks or os forklift doing label picking or product selecting The point system is a way to get rid of good working people. Operators should be paid more. Managers don't listen to workers. Lay you off if you ask for time to take care of personal issues. working in a positive environment , fast pace, inventory of all the products coming into the warehouse, being productive , highly recommend this job to everyone. Very fast paced, always new faces. I had great communication with employees and common respect. High capacity of product coming in and out of the warehouse. Had to be very visual and precise. Call center environment with strong management support.  Great growth opportunity. Quota based, but not difficult is you plan you week. A typical day was helping dealers to get the best product, device, offers in order to offer the best for their end users.Placing orders, verifying status for special pricing on bulk quantities.I leard how to negotiate huge quantities with vendors and depending on the end user-  this include for national accounts, government, pharmaceutical, banks and vertical markets.My co-workers were the best team work,  happy people, great support and best management!!The hardest part was when didn't get the price the dealers expect,  we used to compete so much with the 'generic brands.'The most enjoyable was overachieve the millionaire quote. This review is based on my experience with Ingram Micro back in 2004-2005.  There is a cafeteria but main buildings are very old-school with putty colored walls.  Not a real exciting place to work and management seems to hide behind closed doors. Working here on a typical day is always busy and hot. I learned how to use a rf scanner and a pallet jack. The management was ok but not that good because of their lack of work. Some of the co-workers were friendly and did what it took to get the orders out in an orderly fashion. the hardest part was sometimes working in the heat and not being able to drink water when it was to hot. What i loved is learning what goes into each module. its a friendly job with different culturals of employees, i learned almost everything in the building. i wouldve stayed if they hours could have stayed the same. All of the supervisors were friendly. The hardest part to me was when we had no work to do. and what i enjoyed most was conversing with different people. Good place to start but need to keep looking for more options. The company needs to look at their processes and 5s standards. Great company with passion for its employees and customers. loved this place the people.  everyone was kind and helpful.  fun place and got work done. during my tenure i had many great supervisors/managers. they kept me up to date with the companies objections as they had changed from year to year. The agency postition at the time of empolyment was long term. I am not aware if the direct hire benifits are good or not. Clock in pick the orders, no room for growth, mechanical treat employees like robots. Co workers are mostly good people some act like they are still in high school trying to form clicks. Long hours and standing on your feet. Clocking out brain tasking and few fun. it could be boring sometimes because one has to be on particular spot for hours too many layoffs, management says a lot but does too little on any level. Not enough safety in the warehouse and ignorant operation coordinators the don't help you when you need it . they rather you get hurt than help........ Great environment, no micromanagement and given the freedom to try new ideas. It always kept you busy. Great team work. Their is a lot of walking, which is good for me. The hardest part of the job was, walking up and down the steps for different locations. First thing in the morning checking all production reports. Looking at total team units per hour along with cost per unit. checking what is in the pipeline to be completed for the day. Evaluate the number of associates needed to meet goals. Report to director if forecasting overtime. Check in with all other managers in relation to their needs to meet goals in other departments. I learned about how to manage cost throughout the day to meet the companies expectation. Management has got to be a solid team that looks out for the greater cause of success on a daily basis. the hardest part of the job was getting capitol expenses approved for upgraded equipment. The most enjoyable part of the job was coaching associates to their fullest potential... Evrything looks good but team leader Carmen From the group of 10 we got in only 3 of us stayed , my self was about to quiet because of the mean and disrespectfoul lady in charge of us in training CARMEN. she do not have any pascient to train she hates if you ask her and she gets mad , she makes you feel really bad And make negative comments at you constanly , other coworkers told me their own experiences with her as well , I was used to be questioned from new employees on why is she the way she is that she just go over your shoulders and treat you like if you are a little kid , Was embarazing and sad to hear from every formal employee and new ones on how is she .horrible uncapable of training lady All my co-workers in my group had quiet because of her She gives you instructions on how to do something or tell you where to take an item or box than she contradicts her self saying why do u do whetever she told you to do Because she had made a mistake and wants to take it at to you , so she don't get in trouble with supervisors .I feel sorry for this company since they will be loosing alote of good employees because of her actions . Really bad experience with this person Carmen her name . Good place to work and learn about the IT field. Good Management and friendly workplace. The best I have enjoyed my job anywhere. I worked as temp picker. One temp worker waited 1 and half year to become FT hired.  Even so, the pay is still barely above minimum wage.  The management did not care about the broken microwave in the breakroom.  It was an easy job with no rating per your hourly picking.  I could sing a song without approval from management. I work for g4S security. Pay is low, and no pay for holidays which isn't right. But its some money and its our choice! Ingram Micro’s role as a leader and innovator in technology and supply chain services has fueled its rise to the 69th ranked corporation in the FORTUNE 500. Wonderful place to work but the pay is very low for associates. I learned how to lead in a productive way, as well as, learning how to work with others in a supervisory role. The hardest part of the job was the mandatory overtime. The most enjoyable part of the job is working with the people. Every day at work was the same. We would go in and kit and assemble product. There really wasn't much learned at this job. I really didn't feel the management was very professional. The co-workers were very nice. The hardest part of the job was not having enough personal time to myself outside of the job. Especially not being able to spend time with my daughter. All employees are courteous and friendly. Supervisors are very helpful and always stress an open-door policy. Overall good place to work if you are looking for just that, a job.  I felt as though there was a conflict of values/direction concerning performance management.  Absolutely no advancement opportunities nor is there an effort to develop individual growth.  If all you are interested in is a '9-5' then I highly recommend IMM, but if you are in it for more I highly recommend that you continue searching.  Good luck! Everything was terrible at that job.Management was very rude and expected more out of their employees.They did not provide us with the proper equipment we needed to accurately do the job. Great place to work if you love high stress and low pay. The management is horrible, the training is done by other employees. They use the trickle down method and keep you out of the loop if something important is going on. I did not enjoy my time there, made a lot of new friends however, besides that, a horrible company to do technical support for. They will squeeze every moment of time you have out of you while you are at work. Great company with passion for its employees and customers. I enjoyed a long career at Ingram Micro until this year where they went through an 'organizational effectiveness' process and my position was eliminated.Ingram Micro is a great place to work... the culture is young, active, and constantly changing.  There are growth opportunities in several areas throughout the company. Very busy stressful days.  If you succeed at Ingram you will succeed anywhere. process orders and quotes You will learn a lot about purchasing CiscoManagement is awful and there is very little training providedVery heavy work load for very little pay, there is a high turnover rate.  You will see your fellow co workers leaving at least 1 or 2 a month for better jobs either with the company or somewhere else. I enjoyed challenging myself, learning new maintenance tips and techniques to perform this job at the best of my abilities. Management was firm, precise, and consistent in order to maintain a high standard of production and safety. The larger percentile of my coworkers were reliable and dedicated to their jobs. The hardest part of my job was time management of repairs around the production schedule because it often changed. The most enjoyable part of the job was the completion of vital priority situations and the satisfaction it gave me when completed before or on time with success. Only worked for them for a short time, they are a very large company, but i have no complaints. I worked night shifts. I learned how to work with pallets and other different machines to stock up boxes. My co-workers were amazing. Hardest part of the job was unloading the boxes. The most enjoyable part of the job was making sure everything was correct and in place before it ships out to their locations. A large busy company which always kept you busy and giving the opportunity to learn more with other depts.  Hardest part of the day is offloading containers of 1k plus pieces I don't wish to expound on any reviews. not applicableTeam Leaderaccount management I was a carpet roller at that company.I thought it would be a simple job,but it was the opposite.I had to lift heavy dusty rugs and carpets everyday and load them in a truck which is not that easy. Ingram Micro Mobility is one of the best companies in Texas, especially in Fort Worth. It helped me adapt myself to any condition I met there. For example it offered me the opportunity to work with people of different cultures, or different social levels. Each of its departments has well-conceived work instruction enabling anybody to complete his tasks. However sometimes verbal or oral instructions from supervisors or managers gave hard times to employees. Load materials and products into package processing equipment. Clean containers, materials, supplies, or work areas, using cleaning solutions and hand tools. Record product, packaging, and order information on specified forms and records. Examine and inspect containers, materials, and products to ensure that packing specifications are met. Measure, weigh, and count products and materials. Mark and label containers, container tags, or products, using marking tools. Place or pour products or materials into containers, using hand tools and equipment, or fill containers from spouts or chutes. Remove completed or defective products or materials, placing them on moving equipment such as conveyors or in specified areas such as loading docks. Assemble, line, and pad cartons, crates, and containers, using hand tools. Manually loading Fed Ex and UPS Trucks, and scanning. Data entry, Pallet building, Gift wrapping, Gun and Computer RF scanner. Started in 1997 as a picker/packer. Worked my way up to an Operation Coordinator/Team Lead.  Currently prioritize, print and distribute work to 25-35 associates to achieve the daily business goals. Constantly observe order flow and re-distribute manpower to the appropriate areas. Prepare work and break schedules for 3 departments. Responsible for problem solving – research and resolve issues with missing product and backorders. Appointed as the OJT (On the job trainer) – as well as the equipment trainer. Control desk specialist – print out all job orders and separate by priority. Responsible for tracking all orders by zones throughout the day, and re-distributing work load. Responsible for RMA’s, Oversee activities directly related to making products or providing services. Direct and coordinate activities of businesses or departments concerned with the production, or distribution of products. Review activity reports, and other performance data to measure productivity and goal achievement and to determine areas needing cost reduction and program improvement. Manage staff, preparing work schedules and assigning specific duties. Establish and implement departmental policies, goals, objectives, and procedures, conferring with board members, organization officials, and staff members as necessary. Determine staffing requirements, and interview, hire and train new employees, or oversee those personnel processes. Coordinating with other department heads as required. its a good opportunity to prove my talent and improve my skill and knowledge The Internship was incredibly interesting and it helped me learn and grow in Warehouse Management issues as well as productivity and layout design. Co-workers were great, and they let me be involved in decisions and learn about their work also. Great place to work. I would have stayed working for this company, but I got laid off. i learned a lot of diffrnet job i learing how to work on the shipping Enjoyed the work I was doing.  I was always encouraged to do better and I was compensated for all my hard work. great place to work for if u like a fast place job learn something new everyday and did something different every night I have learned a lot about technology working with Ingram Micro. I enjoyed the workplace because of my management team and also my co-workers, they are very friendly and helpful. WMS out datedGreat room for advancementGreat payUpper management are greatLong work hrs. Great company with passion for its employees and customers. I learned a lot about networking from the workers in the organization. It was competitive,and you were reward if you performed to the best of your abilities.The managers was approachable and okay to work with when you needed to take of issues.They would listen to you,and evaluate you strong points and weak points.Very good place to learn the skills necessary in IT. my honest opinion is that the pay is good but not a good place to work if your family orientated. coordinate between product management and subordinatesI have learned a great deal of Operations and supply chain managementManagement is cooperative and sucessfull I really enjoy the atmosphere and the people as well as the task at hand. this job just was a job. Paid good money though. I learned how to packed boxes. I like the job the only problem is hours. We are not getting 20 hours a week. The people there is great and I love the management team at Ingram Micro. A typical day at work consisted of picking and packing orders driving a cherry picker and putting them on a conveyor belt. The hardest part of the job was getting orders to help meet production. The most enjoyable part of the job was knowing I had a job to help provide for my family. If you are a results oriented manager or associate with good values and a desire to succeed in a team environment you will enjoy working with Ingram Micro.  It is a collaborative environment.  Associates who can multi-task and perform at a high level for extended periods of time will be presented with opportunities. I loved that the managers were willing to listen to my new ideas. great coaches and great kids at this place. this is not sjdfkljasdl;'ajfkl'afasdjklfjdkl;sajkl;as Ingram Micro is a great place to work as long as you don't need to depend on your manager to have your back on 'he said, she said' issues. The majority of people at the company only look out for themselves. Ingram Micro is a excellent place to work. The people are great and the work is steady Overall it is a great company and the members of your team are highly encouraged to support everyone to be successful. Fast paced with daily deadlines for order release and month end on-call responsibilities to meet Ingram, vendor and customer goals.Independent work environment and accountability. Limited supervision, but available for decisions requiring higher approval authority. Ingram Micro is the biggest IT distributor and is more than just buying and selling.  Ingram offers many services to its vendors and resellers (its customers) to add value to their business. It was a temp job so when the job description was up I found a nother job Ingram Micro is a great place to work and wins best place to work in WNY year after year.  Entire company works well with one another.  Very open to allowing you to sit in with different representatives and learn what a day in the life would be in that positon.  Over 1500+ employees in the Buffalo, NY office alone. I learned all kinds of job in Ingram bec.when job in your dept. was done they will pull you out to work with other dept.and there is a cross training in that way we learn their job in other dept. too.Managemant are nice to all the workers,they will even let you buy a stock in the company,no problem with my co worker because we all work as a team,there is no hard job if everybody was helping each other and we always go home at the same time. lots of work, barely anytime for breakhard work pays offmanagement is ok different then most places very friendlyco-workers are nice but just keep to yourself and work hardkeeping up with work itself can be overwhelming being incharge of your own section A day at Ingram Micro was always a fun day. You knew you were going to be challenged and you got a chance to see your progress as you grew within the company. Great company with passion for its employees and customers. Great place to work. Days aren't the same and you spend much of your time learning new things about the company it's so large. The most enjoyable part of the job was assisting others and providing them the support needed to accomplish a simple task or a project. Working this job has provided me with a great deal of experience in the global business world.  This includes communicating with customers in spanish and english, and communicating and collaborating with co-workers to ensure that the process of making a sale runs as smoothly as possible.  I also dealt with freight forwarding companies to maintain compliance with export laws as well as laws governing the handling of hazardous materials.  Learning to navigate the logistical and operational inner workings of such a global company has given me invaluable knowledge for the future. My work is warehouse company we are working for T-mobile  we received phones the one peoples have insurance for it.same of them they send it back because it no good anymore or it has a liquid damage on it the need T-mobile refund  them  a new phone. good company get along with others lot of work to be done its a quick pace and keep clean revilement pay every well Good company to work for with lots of opportunity. Good pay but you need to at your best to stay competitive. I learned to work swiftly to complete numerous tasts. Management was helpful and enthusiastic. Co-workers worked as a team. The hardest part was keeping up with production time, but it was also the most enjoyable because it kept me in shape with the quick pace. I supervise over 50 people on my shift. I have a Team Lead and great associates who work hard for me. I enjoy establishing relationships with my associates and helping them grow in the business and as individuals. The hardest part is the hours and a lack of up-to-date tools to keep up with the volume that we deal with throughout the year. I have learned how to manage people well, communicate to large groups effectively, branch out by being innovated with the processes that we use from day to day and making well-discerned decisions every day. Interesting place to work with a lot of simple benefits and vendor appreciation parties, Hardest part was the fluctuating hours! Not enough room for advancement, it's all based on your evaluation no matter how biased. staying busy. full case always had work. or pick module needed help out thru out the day. provided technical expertise to resellers and sales staff in the configuration of high-end computer systems It's always a good day at Ingram, go right to my work station and start binding those books away. So that the valued customers get there orders  on time. check for all the quality control checks, which is the good part, why? Because it feels good to solve problems i do have a good eye for Q.C checks not bragging but have to admit it. Enjoy what i do at Ingram. Ingram Micro, Atlanta, GA                                                                                                        (2014-present)Channel Partner Account Executive - Cloud Services - SoutheastI work with Ingram Micro’s top channel partners in the southeast to build their Cloud businesses including: •	Enabling partners to sell and deliver Cloud solutions, software & services•	Developing Go to Market Strategies & Plans with partners•	Designing and executing partner readiness programs and activities•	Designing and delivering sales and technical partner enablement activitiesIngram is a $42B, Fortune 100 Company and is the world’s largest technology distributor. Ingram Micro has a Cloud Division and is a Cloud aggregator offering 150 Cloud solutions from 50 Cloud Service Providers. Ingram’s Cloud partners include: VMware, Cisco, Microsoft, Amazon Web Services, IBM, Symantec, Veeam, Citrix, Rackspace, Salesforce, etc... Excellent work environment and friendly team mates.Would love to work in this Organisation if I get chance. This is the best job I've ever had, the only reason I'm leaving is because I'm moving to Jacksonville and they don't have a location there. The environment is very friendly and inviting. They make you feel important and apart of the team. The most enjoyable part of the job is the fact that you get to work alone and on your own goals but still have opportunities for team work. This is my first office job so it taught me a lot about computer software and IT Distribution. A typical day at work would consist of me processing orders, answering customer and reseller phone calls. Problem solving. Data reporting, product quoting and training other members on my team and sometimes training new hires. The hardest part of the job is getting used to the technical lingo but once you get it down you're good to go. I come in a hour earlier to work to prep orders so the staff can process on there arrival work is not stressful, there are very few conflictsI've learned how to audit different departments. Learned how to navigate different data bases.Management is very laid back and easily approchable.My coworkers work together, help and train eachother in different areas.To me the hardest part of my job is the audit research and putting the words togetherthe most enjoyable part of the job is the indepence, no bosses down your neck You were treated unfairly in my department if there was no work they expected you to make production.days was very stressful.Management was very poor.If he did not like you he would not listen to nothing you had to say.Trying to make production without the work to do it with Unlike other temp agencies Remedy always has steady work for those in between careers. Great place to work. Management is great. The only problem is that Ingram has a lot of lay offs. Great company with passion for its employees and customers. 	Load and unload trucks		Check the freight for damages as I unload it 	Count and log the freight	I also use an RF scanner	I also operate, the forklift	Cherry Picker	Dock Stocker	Pallet Jack	Reach Lift High production, engaged environment and workers.  Upper management is harried but listens.  Middle management is hit and miss by department although the Sales and Operations staff is top notch. it was great working there for the time being. it paid well and i enjoy working there a lot. They were out of work sometimes but it all good. I have great mentors and have been able to develop many valuable job skills. Learning new topics in each day.Employee friendly and Good management.Co-workers are very helpful. Broken promises. decisions made by customer rather than direct leadship. You'll get an in-depth look at the machinery that runs international organizations at Ingram Micro. The experienced team and management will be valuable assets to anyone looking to learn and grow as a professional. I, specifically, garnered a detailed understanding of the developing cloud marketplace and its implications for the future of business. I enjoyed learning about what industry heavyweights like Amazon and IBM where doing to position themselves to deliver value to stakeholders and partners leveraging cloud technology. The abundance of employee perks and benefits serves, at least in part, to amend for the salaries that are, on average, slightly below market value for comparable positions. The career advancement and opportunity conversation also varies between departments and management staff rather than being a company-wide culture of employee development. Therefore, as should be the case regardless, you may need to take more ownership of your personal career path as in some cases no clear path is identified even when inquired about. All told, Ingram is a large company with many resources that can be a great place to start or build a career. All the tools and knowledge is present and available to make a position with the company a valuable and fulfilling one. receiving and shipping , rma , it an good place to work i been working there almost 7year now This job is very repetitive sometimes there is a ton of things to do other times you are just standing around Awesome co-workers. Great experience dealing with different departments. Feels like family. The most enjoyable part of my job is training associates on our new processes that we get. I would do inventory counts, enter information into the computer system and help out where ever I was needed. Pick and pack product. Record keeping, filing, ten key and researching skus and upcs pick & pack orders by ticket & using a rf scan gun highly secured well keep that value they workers labeling the products and receiving it using computers,and some maths skills required to do that part of work because i have to verify how many cartons or pieces i'm gonna receive.my friends at work don't hesitate to ask me about anything concern the work. Continuos development of local and International Dealers Drive daily Sales to reach Daily and Monthly quotas Promote key products within our authorized Dealers Develop a continuos growing pool of new Dealers Developing Commercial segment with Audio and Video Solutions Incentivate sales of products with promotions,B Stock and Slow Stock Team player to control Inventory Vanguard knowledge of all new audio, video and automated technology for Installations and Integration Continuos strive to maintain margin goals and sales goal All other task related to support Corp growth I'm the type that will work as long as the boss needs, I'm flexible, I'm willing to learn things that  I may not already know to the best of my ability. I am a hard worker and I take pride in my work so, everything I do it will in tact because I'm not only showing a reflection of my work I'm also showing an image of my employer. Heavy lifting, always doing somethingI have learned to use an RF and computer for the warehouseManagement has no communication with each other, ie..one person tells you one thing and the next person tells you something differentmost of my co-workers were very nice to work with and hard workersthe hardest part of the job was being told you were working over time at the last minutemost enjoyable of the job was work was steady Good place to work! i would recommend going there.The only reason i left was i had was my boss would treat me badly because he didn't like my father. Large fortune 100 company. Lots of opportunity.Changes direction quickly for a company it's size Great company with passion for its employees and customers. Great Company, High pace work environment, poor management and very low pay. day starts at 615a every day Monday through Friday. I have to grab a scan gun on my way into the department. take turns unloading trucks and when finished grab a pallet of amazon kindles and sort them. Management is easy to get along with very friendly. Co-workers share job duties of unloading daily trucks and pallets of amazon kindles. Hardest part about the job was the unloading the truck the best description of it is like playing a game of tetris. Most enjoyable part about the job is there is no pressure to make sure the product is received/sorted perfectly. Great company to work for. Needs a stronger leadership team that has a better understanding of the always changing trends in technology and plan and execute according to it. As an Executive Assistant to the CFO, I was responsible for arranging travel logistics, meetings on premises or off-site.  Preparing Expense Reports as needed.  Due to CFO's 80% travel to Latin America, I found myself with ample time to volunteer my assistance to the President's Executive Assistant.  I also merged myself with the Accounting & Finance Teams to be productive during the CFO's frequent travel schedule.In 2007 his position was merged to the Presidents' therefore my position was eliminated.  I remain grateful for the 5 years of employment at Ingram Micro, it was an excellent opportunity to use my talents and contribute to a great growing company. Working here first shift is challenging but learning about different pieces to cellular phones is cool. Super busy. I learned to always be mindful with what you do. Being responsible is very important for the job. They expect you to get you job done quickly which makes it a tough exciting job. The most enjoyable time is seasonal time. Its very busy and it keeps me busy. I enjoyed my time working at Ingram Micro.  I would be willing to go back and continue my career there if the opportunity arises.  Great people there! I have so much accomplishment with work experience, but I am puntual, teamplayer, be on time, communicate with other co-worker, independable, and get the job done! I have learned to do customer service assistance, cardboard ripper, meat wrapper, unloading trailers of merchandise, stack on pallets by numbers on pallets of merchandise, rf scanner control as a grocery picking, labeling packing, oder picking, bill boxes, tape boxes after packing, and sweep floors. I have education skills for tile setting vocational trade and high school diploma. Stocking products with an RF scanner. Learning how to do inventory, pick, loading and unloading, and keeping work area neat and clean. Co-workers are competitive but at the same time it was fun. Hardest part about this  job is to hit more than 80% productivity and it was also fun at the same time. Most days began with reading e-mails to obtain the priority for the day, as priorities frequently changed from day to day, then I would typically distribute the work load amongst employees.  I learned a lot at this opportunity, dealing with high pressure situations and handling others in order to meet the pressures of these situations.  Management was good but there were outside circumstances that created  an environment of disorder.  The hardest part of the job was the up and down  environment, constant work schedule changes and priority changes.  The  best part was the people, there are really good people out there! great workplace environment great pay and even better off on most weekends. Excellent place to work and grow. Very friendly people and many was willing to help you. It was Just Hard to have a life working there. The people are friendly. it was a really hard job. i learned alot. how to wrap a skid, how to pick products. the management was nice. Inside sales - listening, speaking, reading, writing and technology i liked the ingram micro. Fun to work with my associates. i have learned about checking the functions of mobile and finding the defects on mobile. co workers are very good as friends. Actually i didn't feel the work to be hardest. Its an easy job and i enjoyed the work very much. Ingram is a place of building young adults more likely students who want to acheive their big dreams in the future. I have been a team lead for over two years and working with several different employees makes me always want to be at work. It's sometimes stressfull because you have to meet product deadline for shipment, but acheiving your weekly goal as a department makes it rewarding.I have learned leadership skills and have been able to develop my own self through working with top managment teams. A day at Ingram Micro was great and  helpful people. I learned how to deal with many different cultures and friendly environment.I also learned responsibility,dedication, and teamwork. I developed  the ability billing,picking orders, and boxing orders to prepare for delivery for FedX,UPS and Airborne in a timley manner. I aslo assist with daily inventory counts and distributed orders to other Associates to pick to meet deadlines..The Management Team was always willing to help and assist with any issues.Management also entrusted  me with multiple task to oversee other Associates also encourage them to meet production of customers and achieve customer delight..The hardest part of the job was sometimes trying to get employees to understand the importance of Quality and ensure correct products are shipped.The enjoyable part of the job was communication skills displayed by Management was great and people were very friendly.Training was provided on a daily basis and carpool incintives were given  as well. There was always shirts or barbeques given when quotas were made. good team, global exposure, big team, lot of scenarios, different time zones I liked working here but it would be better If the shift did not start too early (4 am) and the pay was better (8/h) Great company with passion for its employees and customers. great job, good pay, not so great managers, plenty of hours, stable, steady raises work long a hours and burn out after five years of very little rest time in between.  Drastic change in management every two years. Everyday you come into work the management team and co-workers great you. Everyone knows eachother and gets along great. I enjoyed everything about this job and there wasnt anything I disliked about the job. Everyone was friendly and I would recommend this job to everyone Lots of different job opportunitiesCompensation may seem low as a base but there are lots of commission, spiff and other award opportunities that make it very lucrative to work here.Management is excellent and always striving to help their employees reach their career goals.Always fun activities happening at the office, lots of free stuff and food, young atmosphere but there is a wide range of ages. Not bad 45 min lunch 15 min breaks secure break rooms and lockers good people Great Company to work for with a good balance. Hardest part of the job is to get to know everyone as it is a big organization. Co workers are very helpful and the environment is nurturing. Working at Ingram Micro was an amazing experience! I learned so much in my time there and I would recommend anyone to work there. Great co workers and great work atmosphere. Depending on which department you work at, room for advancement is limited. typical 8 hour shift job. Many temps made the job harder. Was really confused on who was in charge The EVP and I decided that parting ways was the best thing for both. You never really knew what you were facing when you walked in the door. There could be an electrical project starting one day and the sewer pumps were failing the next day. Good people to work with which made the tough jobs a littler easier. The hardest part of the job is achieving a balance between the need of your technicians and the need of the company. As a leader you must say what you mean and then mean what you say. The business results and the human factor must be in balance. When choosing a management position you must accept that you customer is your employees along with your company. So you have to work towards a mutual respect and an environment which promotes growth and advancement. As a leader we must achieve business results and provide a work space where an employee can arrive and understand what is expected of them and what they need in order to reach the next level. there isn't a work life balance. expected to work excessive amount of hours with limited training I worked there for 16 Years They start weeding us people with yearz in with stupid reasons. Didn't want to pay the money. Top out pay is now $14.50. They shafted alot of us. This job was tedious and the hours were long. We worked an assembly line on your feet and the breaks were too short. Ingram Micro culture strikes a great balance between high performance and fun.  The people are intelligent and enjoy their jobs.  I enjoy coming in each day because the work is challenging, yet I feel that I have a strong network of co-workers who can help me when I need it - just like I can help them. i liked working here it is a realy good job an it pays well and it is a good company to work for My work day went with the start of my shift and getting my RF gun and forklift key and harness.The hours were a 8-12 hour dayThe management was great very helpful and great to get along with. Monday, is the worse day for whole week.Hard work .Poor management. co-worker is good.Even you are sick you cannot leave the work without Tardy. when I have pick the orders walk all day . Ingram is a good place to work with plenty of opportunity. The compensationg and benefits are low to the industry but they are a stable and well known company. Great company with passion for its employees and customers. Enjoyable atmosphere to work in; not to stressful with genuine support personnel . The most enjoyable part of this job was working with a team of friendly and professional individuals that worked together to reach a common goal. I worked there for 3 years had a blast, long hours though. Made some really great friends there. very first warehouse job, learned to pay attention to detail and was able to hit a specific quota with my team members every day. learned the difference between the slow quarters and the fourth quarter. the night shift was pretty cool, and laid back. If you're new to this field its ok but as the shift goes on its hard to find something to keep you busy til the end of shift. Ingram is a Computer distribution call center. I learned so much about all new IT equipment, if you worked hard you got promoted and paid well.  They offered great benefits. Friendly co-workersGood managementTeam orientedClean and safe work place Good work place to get started, pay is ok, you learn alot. easy to advance if you get in with the right managers Great work environment, great atmosphere and competitive salary it embraces diversity and its great compensation plan. it has lots of over time too and a lot of empoyees Long hours of work 12 hoours, you have to be quick and accurate when working with orders.  Great benefits....personal, holidays etc.The most frustrating part about this company is that they are against changes and new ideas. I feel like many of us were not used to the full extend. In my experience with Ingram Micro/Brightpoint, the best part of working there was meeting great co-workers to work with each day which made the job easier. I loved helping my co-workers when they needed help.  Ingram Micro offers a fun, warm culture to work in. The management is operates in a 21st century manner. They empower employees, which make them feel motivated to work. There are several events held each week in which employees can enjoy! Definitely recommend working here! I have enjoyed working with the people at Ingram Micro.  I have learned so many areas/department as an Internal Auditor at Ingram Micro.   Ingram is a great place to work at. Everyone is very welcoming. Management is well organized and supportive, they are always open to new ideas. Very team oriented which is great and can be really fun! I have learned a lot working here. many different departments within one company leaves ample opportunities in various departments. co workers make the day more enjoyable and the perks to working for the company are amazing.  a typical day at work was a day at the beach, our boss was a very understanding person. I learned everyday something new a short cut to make my job easier an faster to get a high productivity rate. an management was great. although i was a temp working for an agency they treated me like a Ingram micro employee i had a smile on my face everyday going into work. The hardest part of the job was just going into a new warehouse not knowing any of the locations, the most enjoyable part of the job was knowing i was taught well how to do my job an having a good day doing it.  Working at Ingram Micro was a great experience for me. Management was fair, approachable, and willing to listen to employees, and find solutions to make the compant run smoother, allowing for happier employees, and better customer service. It was a great place to work but I wanted more. I wanted to make more money. Ingram is a really nice company with a great culture. There are many different departments that serve just as many functions which creates a lot of opportunity within it to try different job roles. Great company with passion for its employees and customers. Designed out network solutions for Resellers in the Channel envirnoment, First point of contact for Sales and Market Develepment.Presented new information about various products such as Cisco, McAfee, 3Com/HP, Plantronics, Polycomm to team mates.Lead Sales Engineer for McAfee and 3Com/HP Very welcoming crew and staff. Managment is well organized, which helps employees follow instruction. Ingram Micro is a safe environment to work in. Very fast paced. Demanding, days go by fast. extensive work load. decent pay for upper management. All the employees are always willing to help each other and work as a team. Management is also very upbeat and helpful. The most enjoyable part of the job would have to be the different people you get to meet. This was an awesome company to work for. The pay was excellent and the benefits were also good. Learned how to use an RF scanner, managers were very helpful and easy to get along with. This company was at the time the world's largest distributor of computer hardware and software. I wasn't there 2 weeks and they announced they would shut down the facility. On a typical day, i release all the priorities and sort them out in order of cut off times. I pick boxes based on the information on the labels and label them. After that i send it on the conveyor to be picked by other associates while i track it on the system to make sure that it gets to the track on time. The most enjoyable part of the job is knowing that all the boxes irrespective of volume make it out on time. The hardest part of the job is when you have to track a box which is going round on the conveyor and with time not on your side. Ingram Micro is a great company that holds great values and hires the best people. I have learned many sales and marketing functions including: the art of negotiation, building a marketing strategy, and proposal writing. I have learned the act of relationship and client management to help grow business in the sales and marketing sectors.Ingram Micro employs the best people. Ingram has such a team atmosphere and the people hold the same values and high standards as the company.The hardest and most enjoyable part of the job is holding discovery meetings with my clients to build a creative and successful marketing plan to help meet their goals and objectives. it was a good job but i will always be fighting with the store owners wife because she wasnt fair. they will pay us les then what minamum wage was. a day @ work is nice and simple,stay focused and be safe.i learned how to use rf gun,pallet jack,shipping & receiving,void fill,billing,stocking,customer service.management there was very poor,none of the supervisors kept in touch with one another.the hardest part of the job was 4th qtr,12 hr days,7 day weeks,in a high percentage picking margin.the pay was great,the benefits were also great as well. A typical day at work involves coming into the cafeteria and setting down your lunch bags in their designated area. After that, the next step is heading out to the work place after walking through the metal detectors and going to your position. I learned how to use an RF gun and how to pick as well as how to set things down on the line. Management is very nice and professional when it comes down to their job. The co-workers are all great workers and good people to be around, they help those who need help as well as teach those who are having a harder time then others. The hardest part of the job was learning how to do everything in a quick pace while your working but it is also the most enjoyable part of the job since your gaining a learning experience as you continue working. Arrive at work and get the job done. Most employees and managers leave you alone to get your work done. Room for advancement is limited as this is a typical distribtor that has pretty flat managment tree. -On a daily basis I process invoices for payment and run several reports. I update excel files and input data regularly. I verify receipt of orders and contact vendors when necessary. I also deal with associate incentives and work with managment in order to make sure that no associate is missed.-I have learned how to effectively use excel spreadsheets to make the job more efficient and to track our budget, our orders and our rebates.-I work well with managers as many of them oversee account orders and deliver packing slips for delivery verification so that invoices can be processed. Working with management is a large part of my job since I count on them a lot in order to get the information I need in order to update files and complete my work.- When I am not working with management to get my work done I am working with my co-workers. One of the files that is updated daily lists the hours worked by all associates. I then have to take those numbers and input them into several different excel spreadsheets to show how well we are working as a company and to show the number of shipments that are going out and what the associate cost is per shipment.- The hardest part of my job is finding a challege. I can no longer learn new things in this positon and I can no longer be promoted so I feel it is time to move on and find a new challeging position-The most enjoyable part of my job is getting to work with people. I really enjoy working with others. Overall a gerat work/life balance. A typical day in sales consists of being on the phone quoting items that the customer knows they want, pushing customers to technical support or fixing order errors caused either by the warehouse or technical support or due to customer selection error. Advancement is the company is very difficult unless you chose to leave for a vendor and return a couple of years later. College education is also not weighted much within the company anymore so if you don't have one, it isn't an issue. It should be noted however that there are some perks such as breakfast served a few times per week and internal training opportunities that could be transferred to other organizations. Overall it's a great place to start working if you are new to corporate environments, but for the college educated professional looking to grow their career and be able to make a liveable wage for their family, this is the wrong place. I have been at Ingram Micro for 15+ years. I was in shipping for 5 of those years when I started and now I have been in returns for 10 yeras. Good people. Poor Managers in some areas. Corporate mentality in a smaller package. company is only seasonal, but will work you great hours during season, after season dont want to keep you busy Data entry, input orders in computer in receiving area, co-workers, safe and friendly environment, Job was very easy and quick to learn Ingram has a great culture and a great work environment. They do not, however, utilize their resources to the best of their ability and the pay is not aligned with the level of work the job requires. I have done far less in my former jobs for more pay. Great company with passion for its employees and customers. Extremely good environment for learning, developing and advancing, packed with action accompanied by constant interaction within and outside of the company. Management works miracles under signifficant amount of stress, protecting employees and encouraging talents. Perfectly fits my personality. Certain departments require above average skills, hard work, devotion and commitment. If you are looking for an easy and calm work days with average work load and minimal stress...pass it. Not very personable at this company. Too many hours and not enough pay. Analyzing, multitasking, attention to details, problem solving. My position with Ingram Micro kept my mind busy, reviewing orders for accuracy and utlizing the tools i was given to accurately correct any product issues. Worked many long days particularly over the holidays.Learned how to operate some new equipment and be responsible for my production percentages.Management was fine and providing all information needed.Not a ton of co-worker interaction since we each had our specific job responsibilty's.Maintaining strict percentages when picking product using high op's.Tracking my picking percentages and work efficientcy each week. As a result of collaborating with various engineers on a daily basis every day holds something different. I perform a wide range of PC and non PC functions that span from the deployment of a server to the installation of PC software to calling in a RMA.• Deployment of physical and virtual servers• Maintain an up-to-date datacenter• Assist in the deployment of computers, hardware, and software• Coordinate with vendors to carry out RMA processes• Some programming, hardware interfacing, and testing A typical day would be coming in reaching my daily productivity in a very timely manner. I learned how to operate heavy machiner, the rf system and how to be multi-task. My job was not hard at all! It was coming in and knowing what you had to do and just doing it. My co-workers and management was very hardworking. We knew that working together allowed us to have a more productive day. Great company to work for many perks. check out the great benefits Any person responsibleWe work as a teamAlways looking for the bestInnovation For salary associates it seems to be the same story from those i know. Ingram Micro has a close organization and 99% are wonderful people. You feel like you know everyone and are welcome to be around. The draw back is that projects and support of th Operation requires dedication and sometimes long hours. But most the time the people are the reward as you feel appreciated for what you do. Modern Technology I enjoyed the most working with this company! Great co-workers, team oriented Very good place to work for, has great benefits. It's a very hi paced work environment, with more then 200 or more associates in a 24/7. But it is very comprtitive work place. Managment plays the favorite game to much. I did learn alot in my 18 years there. Working from the bottom up. It was hard for me to leave, with all the Ingram Micro family there behind. There is a big diverse culture there. Made alot friends and little un friendlly's there. it was okay. the hardest part was working in a shop with no air circulation coming through. i learned how to weld a big trailer. the management wasnt very good. they were a new business starting up. working 8 hrs a week and on the weekend. Learned how to unload trucks. Management and Coworkers was very polite people.The hardest job was stocking shelves. The most enjoyable part of job was waiting on the customers. I really enjoyed working for Ingram Micro, the people were friendly and management was GREAT! Very Busy Place.Need Patience.Mixed Co-Workers.Transportation.Large Lunch Room clock in at 12am and unload and load trailers by hand. very back braking work A typical day at Ingram Micro consisted of maintaining the workplace for safety purposes, processing new inventory, stocking, interacting with co-workers, labeling inventory and picking A typical day at Old Time Pottery consisted of maintaining the stores appearance, processing new inventory, stocking, interacting with customers, and performing any tasks needed. I responded to customer emails and phone calls in a call center environment.Incompetent managementNice co-workers, but gossipy, immatureHardest part of the job: walking through the doors in the morning. This job drove me to quit drinking.Most enjoyable: using my foreign language skills!Free coffee.A fine place to work if you have no goals or ambition and need a paycheck. World class company with highly developed standard operating procedures and opportunities for advancement. Great company with passion for its employees and customers. Each day was something new repair machines like box makers restart rooler lines getting box jams doing P,M did day to day lubrication and trouble shooted production errors hydraulic/pneumatic and electrical systems My skill include electricity,PLC equipment heating/cooling,welding Come in and review the order summary as to what needed to ship priority an what needed to follow from those proceeding orders. Meet with the associates an have a prework, inform them of what's going out who was assigned to what module an who needed to pick only priority orders. Make the proper phone calls as to when high priority orders was completed,Give direction to the OS drivers on what needed to run first and last. Ensure that all conveyor system was running properly through out four buildings to the level it needed to travel to be processed and shipped out to the trucks. Constant emails, conference calls, meetings, and phone calls make the days go by quick. I have learned how to successfully manage large customers and vendors to a profitable end. Co-workers and management were keys to my success, as I was always part of a team. The hardest part of the job was dealing with irate customers. I dealt with this by doing my best to calm them down and give them extra special treatment to ensure they would bring their business back again. The most enjoyable part of the job was having the ability to be creative in managing my customers and vendor line. I loved my job but my boss was clueless. Some people are born managers. She isn't one of them. I worked in Business Operations which was a very small group of 4, on the east coast, including me. We were over worked and under tons of pressure all the time. My coworkers and I would cry during the day from the stress. We had no support from our boss. No help at all. If the department had a better boss, I'd still be there. I have found Ingram Micro to be an outstanding company to work for and one the presents many opportunities and challenges. I think that they respect the contributions for their employees and recognize the value that they bring. Not that bad of a job, they give great hours, clean environment for a wharehouse, nice co workers, great pay. I like to diagnose the equipment that every body has problems with and finding new more efficient ways to repair equipment. I share my knowledge and experience to help the maintenance team. My typical day starts at 0500 a.m. I clock in and go to the forklift area where I log in to my computer and send out a status report of the forklift fleet then I assist in repairs on the conveyors and all other equipment in the facility. I interact with lead technician on daily status. I believe going to my job before star working, and prepare myself for what I have to do it was amazing.I learned to be able to driver a forklift also I built a great relationship with other friend. Most of the time people are great so I didn’t have any issue with them. I had a lot problem since I didn’t diver the forklift but at the end I did it and I enjoyed. i worked long hours 10 to 12 work days.I like a challenge in work. Doing different jobs. It was cool. Fast paced environment. Enjoyed the co-workers. i go in do what is asked and go homethe company wants to pay as little as possible but demands you are their slave Wonderful people working very hard very long hours. Leadership frequently changes significantly. Ingram Micro is a great environment for someone starting out. They take the necessary time to train you and they allow for growth within the company. The building is beautiful and the culture is nurturing and positive. Picked orders, for a computer warehouse, the co-workers were great the hardest part of the job was working 12 hours a day with little pay, I learned how to operate forklifts, side riders, cherry pickers. A typycal day at work was calm, I've learn that no matter what happens around you don't let it bother you and keep doing your assigment. I learn to manage the codes and as my co-workers they where fun to be around that hardest part of the job was the percentage you had to have. I've been at Ingram Micro Logistics for 3 years now. I happen to work at the largest center that Ingram has in the world. With that being said, we also have the largest volume of orders per day. A typical day would include punching the time-clock in the morning and listening to the huddle (which was lead by our 'team leader' or manger). In the huddle they would address existing company policies that have been recently violated, and changes at Ingram. Also they would tell us how long to expect to work for the day. Working at Ingram has taught me many things, for instance, how to use their in-house inventory program 'IM-First' and many other order processing services. Management at this facility is a joke, we have switched site directors at least 4 times in a period of 2 years, and so called 'team-leaders' are just over payed, under-educated, employees with a power trip. Management at this facility is in need of a MAJOR overhaul, all the way down to the operations coordinators. Fellow associates are probably the most enjoyable part of this job. You meet very diverse people, who are almost always friendly and kind. The hardest part of this job is dealing with the heat in the summer time. Temperatures can reach to 105 on the the third floor, and when compounded with the dust in the air, it makes for a nasty combination. In addition the long hour (often 10 to 12 hours) days can be quite straining on one's legs and back, since you do not get to sit down at all, except for breaks and lunch. This job rocked from the time I arrived to the end of the day. Always learning new things. Meeting vendors and selling my experience to our clients. This warehouse is a very big, hot warehouse. You have to work at a fast pace up and down stairs. Enjoyed working there, but was only seasonal work. Management was helpful and nice. Recieved product from incoming shippers. Processed, and made sure of accurate count. Inputted into Knossos system. Filled orders, packaged and shipped. Did yearly team audit to assure company accountablity. Interaction with co-workers was always educational, productive, and rewarding. Hardest part of the job, would be shift changes.Most enjoyable part, was seeing new technology, and companies emerging. Using Ingram Micros Logistical process. ISO 9000 Great company with passion for its employees and customers. very robust IT structure; systems. Mira Loma had POOR infrastructure; equipment; Good security; too may exempt promoted from within; too many family members working; NO work life balance. no job sucession plans in place. Good place to workBI4Management is great and helpingCo-workers are friendly great company fast paced always working hard, great employee's, over 1800 per location loved it at ingram micro A typical day would be learning how to process apple's accessories simply checking and making sure all item are in place. I learned how to operator on a cherry pick in which make my life a lot easier to get up to the top unreachable section to find missing items. I also data entry all the missing items and it was really fun. Call after call after call after call... There is no break in-between calls and you are required to be on the phones for an unreasonable amount of time per day. Formal training is minimal, mostly on-the-job by asking senior employees. I learned that cubicle, call-center jobs are tough and sitting in a chair all day in front of a computer monitor attached to a phone headset is disheartening. The hardest part of the job is not gaining 10 pounds in your first 6 weeks. The most enjoyable part of the job is leaving at the end of the day. How to work with accuracy, how to maintain the productivity, howto keep your surrounding clean & how to work safely, I learn allthis thing in this company with discipline & honesty. Enjoyed working at this large corporate HQ. Would work there again if I had the chance. It was the best company that I have work for so far in my life I went in starting at one amout and in less then a year I was ip almost a dollar and a half . There was sick pay vacation time best part it was non union and the company still took care of us . They were a very fair company to everyone . Very delicate balance for the sales team to achieve sales goals set by management with an adequate amount of customer service. Know how to 'service the customer with a sale'. Ingram Micro is a powerhouse in its industry and for those who are seeking a steady job with a structured corporate ladder, this is the place to be. As with most companies, the job and opportunity to advance is what you make of it. Job security at Ingram Micro is very strong and if you are willing to put in the time, you will give yourself the opportunity to advance over the years however you must be willing to put in the time.For those people who are interested in quick advancement, this may not be the best place as you have to put in the time in order to advance, however with time comes opportunity.Ingram Micro is know for being the premium breeding ground for allowing associates to be hired out by its vendors. The training and exposure to vendors, you receive from Ingram is top notch and they also provide a variety of courses available for future advancement.If you have the patience to advance in Corporate America, Ingram Micro is a great place to work. I loved working for Ingram Micro. It's a large company so everything was structured. You knew exactly were you stood regarding attendance, productivity, management, job advancement, etc. Worked there for 2 years and was laid off. Constant layoffs but always under the radar.If you get a job there, it will not be your last one. many oppurtunities there and advancment.Its just that the medical field is not me Excellent training and the culture was very friendly. I had some really nice and engaging managers who assisted with my growth and development as a sales person. Demanding jobs but with company benefits and services in place for employees. Stable company with long history, Great company to start out on, then leave for bigger and better opportunities Ingram is a very successful business a good employer took care of its employees had good benefits with 401k. It had alot of over time and pressing work levels but it was ok Great company with passion for its employees and customers. Easy picking path the hours are crazy thoughA lot of over time mostly on peek season.Not too suitable for people with families you work all day.If you like the money there you go. Overall a good place to work, however each year seems to bring about a new direction for the company. Worked in a couple roles that allowed me to see how many areas of the business operated. Production place..good communication between boss and employees. Need to respect a little the workers life because sometime forget that..the people there try to do the hours on time but sometimes need like a minutes range en case arrive late. pockets of capable and strategic thinking people, but the other 'lifers' quickly drag them down for fear of change or losing power. Terrible or non-existing policies and rigors of how things are done so everything is a firedrill. I can only speak for the location I worked in. It was inconsistent the management team was unprofessional. the morale of the employees was low. Managers sleeping with employees. This is the worst accounting dept I have seen in my life. There are way too many people touching the same accounts and way too many duplication errors. The management team leaders are very poor and unprofessional with a lot of favoritism which leaves the moral very low. And on occasion be prepared for random people to come yell at you in a very unacceptable work environment manner and management doesn't do anything about it. That should be grounds for them being fired. No one in other depts seem to know how to do their jobs or they are just all very lazy and so there is no support from other depts to resolve issues. Very poor working environment with people who don't care to help anyone else. No team work at all. Would not recommend anyone to work here! This is very much a learning organization - consistently sending out surveys to employees for feedback and insight.  Information is searchable internally - you should be able to find answers to your own questions.  However, with that being said - you will appear to be an idiot if you don't know how to use all the tools at your fingertips. The interaction (million scheduled meetings/activities) between superiors and entry-level employees seem a bit robotic/forced.  This company still needs to find an authentic balance between our advanced tech-communications and our actual human resources/interactions. Great job to work, clean place to work, fun work place, big break room with real cooks, enjoyed working with Management, got to buy Products at lowest price Great place to work, co workers are great. Very understanding management. Fun place to work. Lots of free food and perks. Beautiful facility. Very secure. Exciting and technology is on the edge. working  6 days a week at least 8-12 hours depending on workload. had to learn as you go after trainingmanagement wasn't very dependable when it came to  answers to questions about workhot in summer and cold in winter hardest part was no time to self and familythe coworkers were the best part I enjoyed working at Ingram and really enjoyed the different people I came in contact with including Ingram employees as well as the customers I supported in the field. In my role there I was able to provide suggestions on hoe to grow the business as well as effect the way we shared our solutions. Because of the travel nature of the role, attending the many Ingram events, I was exposed to many different solutions the company offered. Overall I enjoyed working at Ingram and was excited about the sales strategy we put in place before the purchase by HNA. Job is not what you as a person would wanna do  i hated the job wish i never wasted my time at that place management is terrible and the staff and leads are no good Ingram Micro is a good stepping stone to start your career and move to a higher paying job to a reseller or vendor. Each department has their own views and follow their own criteria. Fairly okay for a start. But the pay was a bit small to keep a family up.I know by know things must have change. They really need to work on this but this is a good company to work with Ingram Micro is great company and I would recommend someone to work there.  I am looking for more growth which is why I am looking elsewhere.  The company has good 401K, PTO benefits but the salaries are generally low and corporate lifestyle is real there.  I'm looking for something faster paced and more challenging. With so much technology and so much of it changing rapidly, this is the center of it all. The focus is entirely on the customer and you get all the support imaginable to make their experience the best. From top to bottom (although you're never treated as if there were a top or a bottom) you're working with great people. Nice place to work . Provides opportunity to grow with the company. Always taking suggestions and improving for the employees and to satisfy all their customers. The opportunity to learn and grow is amazing with great resources.  Depending on your superior you will have a great or bad experience. The people are great to work with. During the time that I worked here.  I was just so happy to be working here, it was a good job to have at the time and plus it was close to where I lived at the time.  This was a good job to have and also a good experience, but it was a temp job only.  The job was not hard at all. The site of the said Organization in Manila provides limited selection when it comes to food. The nearby establishments are also expensive. Food cost average ranges from 100-150 pesos. Great company with passion for its employees and customers. Easy picking path the hours are crazy thoughA lot of over time mostly on peek season.Not too suitable for people with families you work all day.If you like the money there you go. Overall a good place to work, however each year seems to bring about a new direction for the company. Worked in a couple roles that allowed me to see how many areas of the business operated. Production place..good communication between boss and employees. Need to respect a little the workers life because sometime forget that..the people there try to do the hours on time but sometimes need like a minutes range en case arrive late. pockets of capable and strategic thinking people, but the other 'lifers' quickly drag them down for fear of change or losing power. Terrible or non-existing policies and rigors of how things are done so everything is a firedrill. I can only speak for the location I worked in. It was inconsistent the management team was unprofessional. the morale of the employees was low. Managers sleeping with employees. This is the worst accounting dept I have seen in my life. There are way too many people touching the same accounts and way too many duplication errors. The management team leaders are very poor and unprofessional with a lot of favoritism which leaves the moral very low. And on occasion be prepared for random people to come yell at you in a very unacceptable work environment manner and management doesn't do anything about it. That should be grounds for them being fired. No one in other depts seem to know how to do their jobs or they are just all very lazy and so there is no support from other depts to resolve issues. Very poor working environment with people who don't care to help anyone else. No team work at all. Would not recommend anyone to work here! This is very much a learning organization - consistently sending out surveys to employees for feedback and insight.  Information is searchable internally - you should be able to find answers to your own questions.  However, with that being said - you will appear to be an idiot if you don't know how to use all the tools at your fingertips. The interaction (million scheduled meetings/activities) between superiors and entry-level employees seem a bit robotic/forced.  This company still needs to find an authentic balance between our advanced tech-communications and our actual human resources/interactions. Great job to work, clean place to work, fun work place, big break room with real cooks, enjoyed working with Management, got to buy Products at lowest price Great place to work, co workers are great. Very understanding management. Fun place to work. Lots of free food and perks. Beautiful facility. Very secure. Exciting and technology is on the edge. working  6 days a week at least 8-12 hours depending on workload. had to learn as you go after trainingmanagement wasn't very dependable when it came to  answers to questions about workhot in summer and cold in winter hardest part was no time to self and familythe coworkers were the best part I enjoyed working at Ingram and really enjoyed the different people I came in contact with including Ingram employees as well as the customers I supported in the field. In my role there I was able to provide suggestions on hoe to grow the business as well as effect the way we shared our solutions. Because of the travel nature of the role, attending the many Ingram events, I was exposed to many different solutions the company offered. Overall I enjoyed working at Ingram and was excited about the sales strategy we put in place before the purchase by HNA. Job is not what you as a person would wanna do  i hated the job wish i never wasted my time at that place management is terrible and the staff and leads are no good Ingram Micro is a good stepping stone to start your career and move to a higher paying job to a reseller or vendor. Each department has their own views and follow their own criteria. Fairly okay for a start. But the pay was a bit small to keep a family up.I know by know things must have change. They really need to work on this but this is a good company to work with Ingram Micro is great company and I would recommend someone to work there.  I am looking for more growth which is why I am looking elsewhere.  The company has good 401K, PTO benefits but the salaries are generally low and corporate lifestyle is real there.  I'm looking for something faster paced and more challenging. With so much technology and so much of it changing rapidly, this is the center of it all. The focus is entirely on the customer and you get all the support imaginable to make their experience the best. From top to bottom (although you're never treated as if there were a top or a bottom) you're working with great people. Nice place to work . Provides opportunity to grow with the company. Always taking suggestions and improving for the employees and to satisfy all their customers. The opportunity to learn and grow is amazing with great resources.  Depending on your superior you will have a great or bad experience. The people are great to work with. During the time that I worked here.  I was just so happy to be working here, it was a good job to have at the time and plus it was close to where I lived at the time.  This was a good job to have and also a good experience, but it was a temp job only.  The job was not hard at all. The site of the said Organization in Manila provides limited selection when it comes to food. The nearby establishments are also expensive. Food cost average ranges from 100-150 pesos. Great company with passion for its employees and customers. Easy picking path the hours are crazy thoughA lot of over time mostly on peek season.Not too suitable for people with families you work all day.If you like the money there you go. Overall a good place to work, however each year seems to bring about a new direction for the company. Worked in a couple roles that allowed me to see how many areas of the business operated. Production place..good communication between boss and employees. Need to respect a little the workers life because sometime forget that..the people there try to do the hours on time but sometimes need like a minutes range en case arrive late. pockets of capable and strategic thinking people, but the other 'lifers' quickly drag them down for fear of change or losing power. Terrible or non-existing policies and rigors of how things are done so everything is a firedrill. I can only speak for the location I worked in. It was inconsistent the management team was unprofessional. the morale of the employees was low. Managers sleeping with employees. This is the worst accounting dept I have seen in my life. There are way too many people touching the same accounts and way too many duplication errors. The management team leaders are very poor and unprofessional with a lot of favoritism which leaves the moral very low. And on occasion be prepared for random people to come yell at you in a very unacceptable work environment manner and management doesn't do anything about it. That should be grounds for them being fired. No one in other depts seem to know how to do their jobs or they are just all very lazy and so there is no support from other depts to resolve issues. Very poor working environment with people who don't care to help anyone else. No team work at all. Would not recommend anyone to work here! This is very much a learning organization - consistently sending out surveys to employees for feedback and insight.  Information is searchable internally - you should be able to find answers to your own questions.  However, with that being said - you will appear to be an idiot if you don't know how to use all the tools at your fingertips. The interaction (million scheduled meetings/activities) between superiors and entry-level employees seem a bit robotic/forced.  This company still needs to find an authentic balance between our advanced tech-communications and our actual human resources/interactions. Great job to work, clean place to work, fun work place, big break room with real cooks, enjoyed working with Management, got to buy Products at lowest price Great place to work, co workers are great. Very understanding management. Fun place to work. Lots of free food and perks. Beautiful facility. Very secure. Exciting and technology is on the edge. working  6 days a week at least 8-12 hours depending on workload. had to learn as you go after trainingmanagement wasn't very dependable when it came to  answers to questions about workhot in summer and cold in winter hardest part was no time to self and familythe coworkers were the best part I enjoyed working at Ingram and really enjoyed the different people I came in contact with including Ingram employees as well as the customers I supported in the field. In my role there I was able to provide suggestions on hoe to grow the business as well as effect the way we shared our solutions. Because of the travel nature of the role, attending the many Ingram events, I was exposed to many different solutions the company offered. Overall I enjoyed working at Ingram and was excited about the sales strategy we put in place before the purchase by HNA. Job is not what you as a person would wanna do  i hated the job wish i never wasted my time at that place management is terrible and the staff and leads are no good Ingram Micro is a good stepping stone to start your career and move to a higher paying job to a reseller or vendor. Each department has their own views and follow their own criteria. Fairly okay for a start. But the pay was a bit small to keep a family up.I know by know things must have change. They really need to work on this but this is a good company to work with Ingram Micro is great company and I would recommend someone to work there.  I am looking for more growth which is why I am looking elsewhere.  The company has good 401K, PTO benefits but the salaries are generally low and corporate lifestyle is real there.  I'm looking for something faster paced and more challenging. With so much technology and so much of it changing rapidly, this is the center of it all. The focus is entirely on the customer and you get all the support imaginable to make their experience the best. From top to bottom (although you're never treated as if there were a top or a bottom) you're working with great people. Nice place to work . Provides opportunity to grow with the company. Always taking suggestions and improving for the employees and to satisfy all their customers. The opportunity to learn and grow is amazing with great resources.  Depending on your superior you will have a great or bad experience. The people are great to work with. During the time that I worked here.  I was just so happy to be working here, it was a good job to have at the time and plus it was close to where I lived at the time.  This was a good job to have and also a good experience, but it was a temp job only.  The job was not hard at all. The site of the said Organization in Manila provides limited selection when it comes to food. The nearby establishments are also expensive. Food cost average ranges from 100-150 pesos. Great company with passion for its employees and customers. Easy picking path the hours are crazy thoughA lot of over time mostly on peek season.Not too suitable for people with families you work all day.If you like the money there you go. Overall a good place to work, however each year seems to bring about a new direction for the company. Worked in a couple roles that allowed me to see how many areas of the business operated. Production place..good communication between boss and employees. Need to respect a little the workers life because sometime forget that..the people there try to do the hours on time but sometimes need like a minutes range en case arrive late. pockets of capable and strategic thinking people, but the other 'lifers' quickly drag them down for fear of change or losing power. Terrible or non-existing policies and rigors of how things are done so everything is a firedrill. I can only speak for the location I worked in. It was inconsistent the management team was unprofessional. the morale of the employees was low. Managers sleeping with employees. This is the worst accounting dept I have seen in my life. There are way too many people touching the same accounts and way too many duplication errors. The management team leaders are very poor and unprofessional with a lot of favoritism which leaves the moral very low. And on occasion be prepared for random people to come yell at you in a very unacceptable work environment manner and management doesn't do anything about it. That should be grounds for them being fired. No one in other depts seem to know how to do their jobs or they are just all very lazy and so there is no support from other depts to resolve issues. Very poor working environment with people who don't care to help anyone else. No team work at all. Would not recommend anyone to work here! This is very much a learning organization - consistently sending out surveys to employees for feedback and insight.  Information is searchable internally - you should be able to find answers to your own questions.  However, with that being said - you will appear to be an idiot if you don't know how to use all the tools at your fingertips. The interaction (million scheduled meetings/activities) between superiors and entry-level employees seem a bit robotic/forced.  This company still needs to find an authentic balance between our advanced tech-communications and our actual human resources/interactions. Great job to work, clean place to work, fun work place, big break room with real cooks, enjoyed working with Management, got to buy Products at lowest price Great place to work, co workers are great. Very understanding management. Fun place to work. Lots of free food and perks. Beautiful facility. Very secure. Exciting and technology is on the edge. working  6 days a week at least 8-12 hours depending on workload. had to learn as you go after trainingmanagement wasn't very dependable when it came to  answers to questions about workhot in summer and cold in winter hardest part was no time to self and familythe coworkers were the best part I enjoyed working at Ingram and really enjoyed the different people I came in contact with including Ingram employees as well as the customers I supported in the field. In my role there I was able to provide suggestions on hoe to grow the business as well as effect the way we shared our solutions. Because of the travel nature of the role, attending the many Ingram events, I was exposed to many different solutions the company offered. Overall I enjoyed working at Ingram and was excited about the sales strategy we put in place before the purchase by HNA. Job is not what you as a person would wanna do  i hated the job wish i never wasted my time at that place management is terrible and the staff and leads are no good Ingram Micro is a good stepping stone to start your career and move to a higher paying job to a reseller or vendor. Each department has their own views and follow their own criteria. Fairly okay for a start. But the pay was a bit small to keep a family up.I know by know things must have change. They really need to work on this but this is a good company to work with Ingram Micro is great company and I would recommend someone to work there.  I am looking for more growth which is why I am looking elsewhere.  The company has good 401K, PTO benefits but the salaries are generally low and corporate lifestyle is real there.  I'm looking for something faster paced and more challenging. With so much technology and so much of it changing rapidly, this is the center of it all. The focus is entirely on the customer and you get all the support imaginable to make their experience the best. From top to bottom (although you're never treated as if there were a top or a bottom) you're working with great people. Nice place to work . Provides opportunity to grow with the company. Always taking suggestions and improving for the employees and to satisfy all their customers. The opportunity to learn and grow is amazing with great resources.  Depending on your superior you will have a great or bad experience. The people are great to work with. During the time that I worked here.  I was just so happy to be working here, it was a good job to have at the time and plus it was close to where I lived at the time.  This was a good job to have and also a good experience, but it was a temp job only.  The job was not hard at all. The site of the said Organization in Manila provides limited selection when it comes to food. The nearby establishments are also expensive. Food cost average ranges from 100-150 pesos. Great company with passion for its employees and customers. Easy picking path the hours are crazy thoughA lot of over time mostly on peek season.Not too suitable for people with families you work all day.If you like the money there you go. Overall a good place to work, however each year seems to bring about a new direction for the company. Worked in a couple roles that allowed me to see how many areas of the business operated. Production place..good communication between boss and employees. Need to respect a little the workers life because sometime forget that..the people there try to do the hours on time but sometimes need like a minutes range en case arrive late. pockets of capable and strategic thinking people, but the other 'lifers' quickly drag them down for fear of change or losing power. Terrible or non-existing policies and rigors of how things are done so everything is a firedrill. I can only speak for the location I worked in. It was inconsistent the management team was unprofessional. the morale of the employees was low. Managers sleeping with employees. This is the worst accounting dept I have seen in my life. There are way too many people touching the same accounts and way too many duplication errors. The management team leaders are very poor and unprofessional with a lot of favoritism which leaves the moral very low. And on occasion be prepared for random people to come yell at you in a very unacceptable work environment manner and management doesn't do anything about it. That should be grounds for them being fired. No one in other depts seem to know how to do their jobs or they are just all very lazy and so there is no support from other depts to resolve issues. Very poor working environment with people who don't care to help anyone else. No team work at all. Would not recommend anyone to work here! This is very much a learning organization - consistently sending out surveys to employees for feedback and insight.  Information is searchable internally - you should be able to find answers to your own questions.  However, with that being said - you will appear to be an idiot if you don't know how to use all the tools at your fingertips. The interaction (million scheduled meetings/activities) between superiors and entry-level employees seem a bit robotic/forced.  This company still needs to find an authentic balance between our advanced tech-communications and our actual human resources/interactions. Great job to work, clean place to work, fun work place, big break room with real cooks, enjoyed working with Management, got to buy Products at lowest price Great place to work, co workers are great. Very understanding management. Fun place to work. Lots of free food and perks. Beautiful facility. Very secure. Exciting and technology is on the edge. working  6 days a week at least 8-12 hours depending on workload. had to learn as you go after trainingmanagement wasn't very dependable when it came to  answers to questions about workhot in summer and cold in winter hardest part was no time to self and familythe coworkers were the best part I enjoyed working at Ingram and really enjoyed the different people I came in contact with including Ingram employees as well as the customers I supported in the field. In my role there I was able to provide suggestions on hoe to grow the business as well as effect the way we shared our solutions. Because of the travel nature of the role, attending the many Ingram events, I was exposed to many different solutions the company offered. Overall I enjoyed working at Ingram and was excited about the sales strategy we put in place before the purchase by HNA. Job is not what you as a person would wanna do  i hated the job wish i never wasted my time at that place management is terrible and the staff and leads are no good Ingram Micro is a good stepping stone to start your career and move to a higher paying job to a reseller or vendor. Each department has their own views and follow their own criteria. Fairly okay for a start. But the pay was a bit small to keep a family up.I know by know things must have change. They really need to work on this but this is a good company to work with Ingram Micro is great company and I would recommend someone to work there.  I am looking for more growth which is why I am looking elsewhere.  The company has good 401K, PTO benefits but the salaries are generally low and corporate lifestyle is real there.  I'm looking for something faster paced and more challenging. With so much technology and so much of it changing rapidly, this is the center of it all. The focus is entirely on the customer and you get all the support imaginable to make their experience the best. From top to bottom (although you're never treated as if there were a top or a bottom) you're working with great people. Nice place to work . Provides opportunity to grow with the company. Always taking suggestions and improving for the employees and to satisfy all their customers. The opportunity to learn and grow is amazing with great resources.  Depending on your superior you will have a great or bad experience. The people are great to work with. During the time that I worked here.  I was just so happy to be working here, it was a good job to have at the time and plus it was close to where I lived at the time.  This was a good job to have and also a good experience, but it was a temp job only.  The job was not hard at all. The site of the said Organization in Manila provides limited selection when it comes to food. The nearby establishments are also expensive. Food cost average ranges from 100-150 pesos. Great company with passion for its employees and customers. Easy picking path the hours are crazy thoughA lot of over time mostly on peek season.Not too suitable for people with families you work all day.If you like the money there you go. Overall a good place to work, however each year seems to bring about a new direction for the company. Worked in a couple roles that allowed me to see how many areas of the business operated. Production place..good communication between boss and employees. Need to respect a little the workers life because sometime forget that..the people there try to do the hours on time but sometimes need like a minutes range en case arrive late. pockets of capable and strategic thinking people, but the other 'lifers' quickly drag them down for fear of change or losing power. Terrible or non-existing policies and rigors of how things are done so everything is a firedrill. I can only speak for the location I worked in. It was inconsistent the management team was unprofessional. the morale of the employees was low. Managers sleeping with employees. This is the worst accounting dept I have seen in my life. There are way too many people touching the same accounts and way too many duplication errors. The management team leaders are very poor and unprofessional with a lot of favoritism which leaves the moral very low. And on occasion be prepared for random people to come yell at you in a very unacceptable work environment manner and management doesn't do anything about it. That should be grounds for them being fired. No one in other depts seem to know how to do their jobs or they are just all very lazy and so there is no support from other depts to resolve issues. Very poor working environment with people who don't care to help anyone else. No team work at all. Would not recommend anyone to work here! This is very much a learning organization - consistently sending out surveys to employees for feedback and insight.  Information is searchable internally - you should be able to find answers to your own questions.  However, with that being said - you will appear to be an idiot if you don't know how to use all the tools at your fingertips. The interaction (million scheduled meetings/activities) between superiors and entry-level employees seem a bit robotic/forced.  This company still needs to find an authentic balance between our advanced tech-communications and our actual human resources/interactions. Great job to work, clean place to work, fun work place, big break room with real cooks, enjoyed working with Management, got to buy Products at lowest price Great place to work, co workers are great. Very understanding management. Fun place to work. Lots of free food and perks. Beautiful facility. Very secure. Exciting and technology is on the edge. working  6 days a week at least 8-12 hours depending on workload. had to learn as you go after trainingmanagement wasn't very dependable when it came to  answers to questions about workhot in summer and cold in winter hardest part was no time to self and familythe coworkers were the best part I enjoyed working at Ingram and really enjoyed the different people I came in contact with including Ingram employees as well as the customers I supported in the field. In my role there I was able to provide suggestions on hoe to grow the business as well as effect the way we shared our solutions. Because of the travel nature of the role, attending the many Ingram events, I was exposed to many different solutions the company offered. Overall I enjoyed working at Ingram and was excited about the sales strategy we put in place before the purchase by HNA. Job is not what you as a person would wanna do  i hated the job wish i never wasted my time at that place management is terrible and the staff and leads are no good Ingram Micro is a good stepping stone to start your career and move to a higher paying job to a reseller or vendor. Each department has their own views and follow their own criteria. Fairly okay for a start. But the pay was a bit small to keep a family up.I know by know things must have change. They really need to work on this but this is a good company to work with Ingram Micro is great company and I would recommend someone to work there.  I am looking for more growth which is why I am looking elsewhere.  The company has good 401K, PTO benefits but the salaries are generally low and corporate lifestyle is real there.  I'm looking for something faster paced and more challenging. With so much technology and so much of it changing rapidly, this is the center of it all. The focus is entirely on the customer and you get all the support imaginable to make their experience the best. From top to bottom (although you're never treated as if there were a top or a bottom) you're working with great people. Nice place to work . Provides opportunity to grow with the company. Always taking suggestions and improving for the employees and to satisfy all their customers. The opportunity to learn and grow is amazing with great resources.  Depending on your superior you will have a great or bad experience. The people are great to work with. During the time that I worked here.  I was just so happy to be working here, it was a good job to have at the time and plus it was close to where I lived at the time.  This was a good job to have and also a good experience, but it was a temp job only.  The job was not hard at all. The site of the said Organization in Manila provides limited selection when it comes to food. The nearby establishments are also expensive. Food cost average ranges from 100-150 pesos. "
                },
"encodingType":"UTF8"
}
