{
"document":{
"type":"PLAIN_TEXT",
"language": "EN",
"content":"This is a great company with excellent management. Incredible technology and great leadership. I was part of one of their acquisitions and they are a company that rewards the people that are willing to work like it's their company. Fast paced working environment but do not treat contractors well. You learn a lot but you're only there for maximum of 18 months. No benefits...no paid time off As a contractor you eill immediately find Intel segragates its Intel employees from its contractors.  Great culture right?  Blue badges are Intel green badges are contractors.  I consider it racist and segregated myself hense green card.  We are immigrants.  Intel employees recieve free beverages gym use and general sence of superiority.  Most blue badges wont even acknowledge you if you say good morning to them.  Real nice right? They have safety NCO training before you start.  Where they inform you cant walk and text, chew gum, go 6 miles per hour in parking lot, not use hand rails using stairs without being written up or walked to the gate/ terminated.  No second chances here.  You better be perfect everytime here even a momentary lapse in judgement and your gone.  No job security here unless your inhuman and perfect.  Its been a real dissapointment.  I believe in safety and im glad Intel does too.  Unfortunstely my company does not.  They send me out to diagnose ewuipment at Intel here  without going completely through their safety training risking termination by Intel.  If your thinking this is a good place to work your wrong.  Move on.  Ill save you the embarresment on your resume. Intel is a performance driven company that puts work life balance above work politics. A typical day would start with a review of the current project at hand and the data analysis from the team. From there, actions would be created to continue improvement upon the current system. Any issues encountered would be met with individual as well as team efforts. Management was super supportive and technically savvy. One didn't have to move away from management to get an idea on how to solve a problem. With that, the culture of the company was outstanding. The people initiated friendships and camaraderie amongst each other. The hardest part of the job was an outstanding issue that needed resolve beyond the capacity of the team. The most enjoyable part of the job was solving any and all outstanding issues. The most enjoyable part was seeing the customers face after we completed our installation. I did get boring traveling to customers houses that lived hours away from the company. Not a full time employee. I was a contractor. Not sure what type of review you were looking for but I was a contract employee. I did my job and worked hard to maintain the schedule so I really can't say much. It's easy to get comfortable. Might be my job but Intel isnt as aggressive as other tech companies. Flexible under the right manager, but some people have nightmare jobs. A typical day at work begins with stress about who will be targeted at the morning meeting for not meeting the expectations that were altered overnight.  This is followed by the meltdown of the department over what comments or foul language management used to inflame the department.  Then there is the quiet brooding as the department grinds the workload to meet expectations set in the morning that the department knows will change over night creating a phantom target that even when hit with a bulls-eye the management calls a miss the following day.  occasionally there is the epic employee melt down where anything from screaming and yelling obscenities to drawing weapons and threatening peers occurs.  All to be capped off with an end of shift meeting that establishes the department was not communicated the proper expectations by management that morning.Beyond learning much about semiconductor capital equipment, I learned from this experience many red flags to look for in a corporation with many deficiencies in it's culture.Management was a reflection of the corporation espousing values but not able to enact them.Workplace culture was the worst.  It was often times many hours of waiting for a task to fulfill and being given unreasonable expectations on time to fill that task.  That when fulfilled within the expectations were still found wanting.  The stress mentally broke down many previously sane peers to the point of needing psychological assistance or medication to endure the work environment.  Most ended up leaving on disability.Hardest part of the job was stomaching  the aggressive and demeaning behavior, the backstabbing, and violent outbursts all in the name of a 'culture of conflict'The most enjoyable part of the job was the weekend. Despite 10+ years of successful reviews, I was blind sided and fired and told I could never work at Intel again. I had spent my entire technical career there and was extremely qualified for other jobs at Intel but not allowed to seek out any of them. About 70% of the employees feared losing their jobs every focal process. We knew that 5 - 10 percent of the people we worked with would get demoted or fired every year regardless of performance. Somebody had to get nailed leaving managers forced to pick employees that did a great job and in no way deserved it. This forced the culture to be cut throat and caused peers to rat out each others to increase the odds that they would not get fired or demoted the next focal cycle. worked there for 17 years, loved it! great environment and worked with super great people, I would totally do it again and always keep a lookout for opportunity. its definitely an 'inside' culture and maybe not for everyone, but it worked for me and I recommend it. Big company, lots of growth opportunity.  Competitive work environment.  Workplace culture takes a little getting used to.  Did I say big company already? My last program was great, taught me a lot and allowed me to grow significantly.  2 others had poor management each were disbanded.  Management is key Management changes frequently. An unstable work environment is often an occurrence. Interaction with others isnt F2F very often. the pillars expected arent practiced by the company executives. Feeling of isolation is often frequent among workers. Unappealing day to day work environment. Good comp + benefits.  Diverse workplace.  Good work/life balance (after a few years).  Challenging work in a fast-paced industry.  Good relationship with front-line manager. Most software I've worked with at Intel is 'home grown, patched together' software that hasn't evolved with the company. IT folks spend the bulk of time fixing programs that should be outsourced to a company that specializes in it. I'm personally looking to find a company that uses relevant tools and focuses on employee growth. Intel has the best technologies in microprocessor and at least a decade ahead of its competition. Depending on which group you are, your experience can be a pleasing one or a nightmare though. Intel is a great place to work. The staff and management is great. Although the work can be challenging at times, its great for a career advancement. You learn a lot hands on and there's a ton of help if needed. But since you asked...if you're a minority or woman or both, just know that what you'll be sold on isn't what you will experience there. D&I is not a real priority for middle management who likes things Great, just the way they've always been. There are a lot of things that Intel Finance employees do that are unnecessary and the organization is working to eliminate these activities but the process is slow. If Intel can work to improve its overall culture and financial accuracy and planning, it will be a much better environment to work in. great communication with leads and supervisors. 60+ member crew. just miss the job. too bad our contract was over. the last part of our job was working right under blue badges. assisting on the foups being cleaned and placed in the stockers. The employees at intel are great people.  very intelligent and passionate.  The culture of a large corporation can be challenging at times with a lot of meetings and ongoing projects, but over all an exciting place to work. This is a great company with excellent management. Incredible technology and great leadership. I was part of one of their acquisitions and they are a company that rewards the people that are willing to work like it's their company. Intel was a great place to work. I would recommend others to work there and would gladly accept a job if there if it was a right fit. I had excellent work-life balance and all my managers were great. There are a lot of meetings during the day and a lot of pressure to get work done. Most Engineers are there past 6 pm everyday and the average life of an engineer is pretty short. GREAT PLASE to work!!!!!!!has a good team good manager Intel is the top 10 company …I has work for company last 20 some years I total love it how ever I did retire at 2016 and I do miss working there.. Working at Intel was a good experience for me. I got the chance to work on different parts of the project, interact with many different teams, and learn a ton. The coworkers are intelligent and pleasant, and the culture is respectable. Successive CEOs had blown up generational opportunities being myopic! 10 nm fiasco is one that shows no hints of a timely resolution. Earlier, they blew off the iPhone opportunity in 2007, made suicidal sale of the XScale (ARM) division to Marvel for pennies. And then spent billions after a dead horse - the Itanium processor that was a still-birth.But, somehow it goes on - a sign of its super resiliency! Intel is a huge company, so it varies wildly from group to group.  For my first few years of working here, I enjoyed it a lot.  However, when the going got tough and we had a project that our management over-promised on, the true colors have come through.  Pushing employees to make up for managerial schedule mistakes eventually takes its toll. +Had interesting projects as intern that could actually lead to a product, unlike many other software related internship projects.+Decent food in cafeteria.-No assigned desk for interns, had to find empty room/desk every day Most enjoyable part of the job was learning new techniques with the tools I was being trained on and having the desire to wanting to do my best at the job I was given. Intel is a place that give you chance to grow. The management are very friendly and they participate in your needs. I loved my job there. All engineer that I worked with were very nice and  humble. There are always new things to learn and they don't stop you if you desire to learn. It's a great place to work. Very disciplined and results oriented company.Great place to workMany opportunities Exciting to be a part of groups when troubleshooting a difficult problem Operated, maintained and repaired Ion Implant machines by two different manufacturers. Trained new hires in operations and process of semiconductor products. Was a member of ERT team and great place to work team. I was a lead tech in the Ion Implant technology. Great team concept and strong goal orientated environment. Prepare to work hard and take ownership of your deliverables. Do good work , be thorough and make sure quality is best. Collaborate well and contribute to the overall good. Typical day involves coding, validation, working with different teams to produce a test tape for HVM.There are a lot of learning tools to broaden your knowledge.Management is pushes for a trade off between quantity and quality.Workplace culture is friendly, but with a paranoia for job security.The most enjoyable part of the job is producing a quality test tape for manufacturing that produces high yielding results High Pressure with much variety to the tasks at hand. Very Safe company to work for. Good system of standards, 5S and Lean manufacturing. Excellent software systems for data recording. Working at Intel, was a great experience, it was like working with family. we had good communication everyone knew there jobs and helped others that needed it. Intel is good place to work...if you aren't several tens of thousands of dollars in debt for degree you may or may not be using. The education requirements for a technician job is absurd, a high school grad could do the job just fine AND benefit from the education program. The benefits are great and management is decent.Workers should take care to not stay in one area for too long. A 'specialist' is a nice way to say pigeon holed and when you land there getting out become difficult.Layoff occur at fairly regular intervals and who gets laid off is generally random. One time it was 'if you've been here for less than five years', another time was actually based on performance(rare), and still another time was 'if you've been here for 15+ years'. I never got a promotion after 10 years of work,  i was doing the job role of a grade 56 Diffusion Maintenance but still being paid a grade 54. Explain that please Good place to work, nice benefits, paid leaves, courses offered to broadening my career, good food in cafe, nice co-workers, but very stressful and my last manager was a nightmare to work for. Admin Assistants are expected to be Jack of all Trades - calendar management, typing, scheduling meetings,  making travel arrangements, dealing with customers (internal and external), work closely with executive level admins managers, etc..Company does offer several benefits to employees and fun-oriented events.I enjoyed the people interaction and the days were never repetitive -- something new every day. Really enjoy working with the business teams and the subject matter. Really don't enjoy working with management. Very limited opportunities for development and for advancement. This is a great company with excellent management. Incredible technology and great leadership. I was part of one of their acquisitions and they are a company that rewards the people that are willing to work like it's their company. Overall  good  experiences and learnings. Take/give anything with respect. Take avarage of 100 reviews and make statistics graph. Hierachy's in project managements misrepresents and mis-leads. Conracting companies eat away profits. watch out carefully. Intel has been trying to venture into new market segments. However upper management doesn't seem to have the patience to wait for the outcome. Each time Intel spends millions of dollars to buy a new startup and then cancels it after few years. Same thing goes with products. In my previous team 3 projects in our department got cancelled in a year. It's a waste of resources and big tank on morale. Furthermore other companies like Google, Facebook, Alibaba and Apple are making their own chip and are heavily recruiting people (from Intel). However Intel doesn't match the compensation from these companies, so attrition rate has become a pretty big issue recently. The good part of being a big company is it is rather easy to move around the company to different job functions. I know a lot of people switched from backend to frontend to architect, from engineer switched to marketing or data science. However it seems that across departments there are just way too many meetings. There is no time for deep work. This is probably part of the down side of being such a big company. The supervisors are not really involved with the team and did not do much to gather feedback about leadership. The team was treated very badly. There was a lot of yelling and name calling during meetings and when the team members raised an issue with the HR, they were just dismissed without proper investigation. Workplace bullying was not only tolerated but promoted. Intel provides a competitive work environment while continuously placing ownership on each employee to self develop and advance.  They offer a top of the line Management training program and constantly are looking for creative ways to help each employee balance work and life. Amazing place to work. Fun and competitive tasks with innovative ideas. The best place to learn and improve the career. Would love to suggest my friends be a part of Intel. A lot of times you are multitasking with no help, but at times you can relax. The more efficient you are the less work you end up doing. You are accountable for your own work, get it done on time and there will be no problems. The company is the safest place I have ever worked. They value a safe work environment and stopping the job when you feel uncomfortable is not shunned upon. I appreciated that and having the open door policy to speak with any level of management is a plus as well. Cannibalistic work environment. Chaotic management with no real understanding of human interaction. Only work there if you have a desire to lose your mind. I knew it was a bad fit the first day. As a contract worker, I would say that the treatment is generally unfair, but not poor. Contract workers receive most of the blame when a project fails. Permanent employees are treated well, however, often with quarterly events and trips, free family events, and fruit and beverages. I lived the job that i did here but the management and training staff was very poor . i had so many different managers in such a short time it was hard to bond with them. there was favortism and retaliation anytime you would question actions that you knew were wrong.They weaponize your issues and use them against you.If you can get the right supervisor then the sky is the limit with the company. i have had several friends lose their job here just because there boss changed and they did not bond with them for one reason or another. I was hard to see peoples careers decided based on how much butt you kissed. My everyday challenge to meet quality and quantity made my job much more productive. The company included the contractors to some of their company event which was a great gesture and felt rewarding. Intel lacks planning, unrealistic deadlines are set. Always in deadline mode, always just try to get things make it work,Work life balance is present You'll hate every minute of work there, and feel dumb for hating it. Lots of time off, but the time you spend there is miserable. They preach safety but push work beyond safe limits. Instead of the carrot on the end of a stick model, they have switched to just bearings with the stick... while they eat the carrot. There is a good job work and life balance in the company. Pay is at medium range compared to other companies in Silicon Valley. In overall, Intel is a mid-level company to work for. Managers are not so great. Do not treat employees with respect. Some are not open for discussion and call employees to warn about to not discuss product related issues. The work days are 8-5 and you get an hour long break for lunch. The company has at least one cafeteria within their buildings. I learned what its like to work within a big company. The management is great. They provide help if asked or it, but try to make it so you can do it yourself. Intel is a very friendly environment and a safe place to work. Your fellow team mates is like family to you when you work a 12 hr shift in a compress work schedule. Intel is a great place to learn new technology, work with great people and deliver projects that are very rewarding. I enjoy my time there and would return if given the opportunity. Great place to work, would go back quickly if my fab in NM ramped up production again. I did not enjoy my time working facilities in Hillsboro OR, however... fab job in Rio Rancho NM was awesome tho Depends on the manager. If you are lucky and have a good manager, its the very best place to work and you will have many opportunities to grow in your career. This is a great company with excellent management. Incredible technology and great leadership. I was part of one of their acquisitions and they are a company that rewards the people that are willing to work like it's their company. I provided assistance to kids and their parent for on line schooling I aid them with enrollment and scheduling sessions with their school Guidance Counselor - flexible working schedule and friendly people- a great place to learn and develop career- benefits/advantages which big companies normally provides I worked in many different roles at Intel over my 13 year career.  I can't say enough about the people I worked with, the environment, the pay and benefits, etc. Always changing and many opportunities to try new things. Challenging environment, where you are asked to do more. This can build you up or knock you down, so be prepared to know what you do and do it with confidence. Pretty exceptional career for anyone looking the go into the Tech field. Excellent Benefits, Pay, PTO, Culture, Flexibility, Long Breaks. Highly recommended. Reviews at the end of the year or beginning of the year are have no transparency and meritocracy does not exist here.  You get promoted if you have been there for years and if you haven't angered management in some form or another. This was my first job in the semiconductor industry.  Some of my co-workers complained about the pay, but it was a big step up from electronics.Intel takes pride in their procedures being written by experts for experts.  Which makes them incomprehensible by anyone who is new.Three 12 hour shifts one week, followed by four the next week.  I liked those hours, but some found it tough.Intel is a big company, so this is my personal experience in one area:  the senior people that were supposed to train me ignored my questions, even to the point of walking away from things we were supposed to work on and ignoring written procedures that required 2 people.  Then, when I inevitably made mistakes, my manager wrote me up as if I was deliberately ignoring procedures.I would not go back to that area, but I would work for Intel again. Lost engineering culture. Does not value people. Pays lip service to valuing employees. Executive team killing company through self centered actions.. First is the best.  My first job in US was at Intel.  I learned a lot.  Technology, environment, team, management, cost of living, compensations, team building...etc., are great.  They treat contractors good. Management leans towards people who are more expressive or talkative even though the person is not delivering much. Being social would be a good score. I worked evenings in a bunny suit.  The suit took me awhile to put on and take off up to 8 times a workday.  You walked a lot and stood a lot.  Daily meetings were in the work area and started before I could finish getting the suit on.  Some of the Intel employees themselves could be a real pain to work with as a contractor.  One liked to intimidate and through his weight around.  I have seen this same employee recently at a grocery store, doing the same to the cashier... probably his nature. My review is simple okay through until I was actually working for brycon and I had some personal family issues that collided with the job it's through their top safety advisor I got 4 days off a PTO he signed my PTO papers allowed me to take four days off in that four days off I got terminated which is illegal in my standings and by law it is illegal to terminate someone on PTO Excellent place to work with professional & open culture, results driven organization.Great technology company to work for, flexible work hours and ability to work from home. Intel should hire local resources rather than hiring cheap labor from global markets, who are not very qualified to perform many of the functions, which impacts the quality of the products. Intel is great place to work and a pioneer in many engineering technologies, Simply put all the junk hired at Google is just graduates who know how to code in book style but they don't have a skills to design product. I have worked here for many years and learned a lot about design and how design win happens. Awesome workplace and has great potential to succeed if mgmt can really recognize and reward talent. Performance management is not fair and old ways of doing reviews still exist. Very good place to work. I would recommend it for others. Great learning and training. Culture is very open. Lots of opportunities for advancement. Management is good. Smart people is what counts at Intel. No job is secure any more but jobs are not secure anymore no matter what level of contribution one makes.  Job work/life balance is demanded but employee can manage that. Hard working culture that demands results. This is a very old and studious workspace with very little time and availability to have a decent work life balance. Not sure what the entire experience was but my manager was extremely work intensive. I liked my job, it could be very stressful at times,but it was very satisfying. I would get a pass down from previous shift about priorities for the day. I would see my boss for about the first hour of the shift and unless I had any issues through out the day I would rarely see or talk to him again. I worked with Eng. department to work on priorities needing attention. I feel like Intel was my second family, I worked with many of my peers for close to 20 years.The hardest part was just the uncertainty of job security towards the end. Intel always had some kind of function or celebration for specific events or Holidays, some of which would include families. This is a great company with excellent management. Incredible technology and great leadership. I was part of one of their acquisitions and they are a company that rewards the people that are willing to work like it's their company. Intel was a very fast paced culture while always focusing on safety. I learned so many things in the 33 years I worked there. I grew up at Intel since I started as a teenager. I learned to operate many types of electronic equipment and disposition material as a process technician. I learned to work well with others. I also enjoyed working with a team and striving to complete daily expectations. i learned alot and ever one at intel was very helpful and motivational the managers were really helpful and the mentors made sure we were comfortable. and they provide you with all the help you need The day started with meetings and continue with meetings throughout the day in different topics that were expected to be the expert. The job still needed to get done at the end of the day somehow. Great Place To Work,Great home and work balance, with extensive consideration to private needs,Intel embraces individual initiatives with a lot of support and assistance assembled, inspected and tested computers on the high volume line, supplied materials for the assembly line. I filled in wherever the need was. attended seminars and, learned the different aspects of the computer industry.was able to work in a high stress environment, the hardest part was being the new person and not knowing anyone.I enjoyed the work, it challenged me to expand my horizons. encouraged me to learn more about the process and programing. Working at Intel as a technician will never make you rich.  After working 18  years as a technician it's time for me to look for outside of Intel.  Intel will certainly give you the needs to raise a family and live a comfortable life but not make you rich.  You can get rich by investing and stuff but with the training you get from intel, you can use that experience and skill to find a more high paying job. Intel has a great environment to work at. Dealing with HR when your sick or calling in sick is a little confusing. But overall working here as been a great experience. I got to learn lots of new technologies that will help me in future jobs.  I got to learn OpenGL 1.X and Python working on real projects and products for delivery. Almost everyone that works at Intel is smart, motivated, and helpful. The company offers employees flexible schedule options, a paid sabbatical, competitive salaries, plus good bonuses and perks. Given many opportunities over the years to grow and learn. Great networking and hands-on learning. Focus on delivery and innovation. This is industry leader in manufacturing. Intel used to be a highly desired company to work for. The culture has now become fairly toxic. Hard to recommend as a great place to work. Advancement is hard to come by, even with management support. Intel has been a great company for me to work for overall. I enjoyed the work/life balance, the compensation and benefits are competitive, and the job culture is adequate. For the most part, I have had good experiences with management, with a few hiccups. Really enjoyed working at Intel, lots of cool projects and smart people. I enjoyed being part of a large team across many countries.Intel resources are fantastic and anything you need they can get. Intel is a great place to work.  At first glance you will see employees in relaxed attire but hard at work on their next project.  Intel offers plenty of opportunities for a chance to grow personally and professionally.  The most enjoyable part of working for Intel are the quarterly team building events and milestone celebrations. Five stars, great place to work. They really know how to take good care of there people. It s fun work environment.  They balance work and life well. They offer lots of programs to help you out with your day to day and discounts almost every where just for working there I've worked at Intel for 22 years. I have been afforded every opportunity to develop and advance my career and have been rewarded for personal and business unit successes. Interesting work IF you are on the R&D side of the fence, slave labor if you are in manufacturing.  Capable of being enjoyable, if you have a good manager.  Nightmare review process.  Workplace culture is extremely Machiavellian.  Extremely stressful, high rate of engineer turnover, due to burn out.  Not worth the benefits they offer. It was a good place to be as an intern. Found out big companies weren't for me, but don't regret the experience. Exposure to a lot of different teams and kinds of work. Great place to work with opportunities to grow/advance. Positive culture. Good bonus and annual shares. good work schedules. plenty of vacation time. Sabbatical program is awesome. Intel has a very unhealthy culture. Typical day is 10-12 hours. Meetings are endless. Management only cares about their next promotion. Recommend you not consider employment there. This is a great company with excellent management. Incredible technology and great leadership. I was part of one of their acquisitions and they are a company that rewards the people that are willing to work like it's their company. At Intel, I had a chance to work on cutting edge semiconductor technology. The company supports innovation, team work, creativity. I enjoyed my time in Intel. Intel is a great place to work.   Spent twenty plus years there...you do work hard there, but there are always opportunities for growth.  Multiple sites offer the potential for relocation. Lack of direction for future programsOnly one cpu productvery hard to branch out to other productsManagement team had very high egoI was there for 15 years and no promotion, stayed there in Grade 7 all time.People i taught how to hold wafered moved up quickly because they had right color. I worked in SORT manufacturing area within a team environment where my main responsibilities included high volume manufacturing, material disposition, and peer training. I assisted and trained new employees on equipment operations and troubleshooting resulting in efficient workers with self-sufficient knowledge to produce the daily goals. I also represented the team with involvement in the Safety, Improvement, and Spec Audit teams. I did several presentations to management and co-workers and was responsible for material disposition for the Etest area. Great company until your project gets killed then they say 2 mos to find a job but all reqs internal are frozen so it's like a catch 22 other than that not bad Great culture & environment. Excellent development opportunities and a high standard of work. A brand They have diversity & equal opportunity. The business is respectful of different personalities, cultures & working styles Working at Intel has been great. I really enjoy the people that I work with at the Fort Collins site. Everyone is flexible and willing to answer questions and help. Has 2 month bonding leave and a sabbatical program. My experiences at Intel continues to challenge me positively in every way one would want to be challenged.  I've had the lucky fortune to have excellent managers and a culture that fosters individual development and encourages free thinking among all my colleagues.A diverse workforce from all over the globe, you get exposed to many cultures and ultimately find how similar we all really are. I haven't worked at Intel for nearly 20 years, however I do have good memories of the company. Intel offered unlimited computer training for employees; it was a great benefit to have constant training at your fingertips! Intel is a fast passed and cutting edge company that provides challenges and growth opportunities. They provide great benefits and flexible work environments to allow you to maximize your results. Intel was stable for a while, but eventually the company went through massive layoffs when it was clear they were not making progress in mobile computing. Great Place To Work with Outstanding People.  Sometimes long hours when working on projects.  Lots of opportunities to be involved on different programs. Its a corporate atmosphere, I grew up with my Dad working for Intel 35+ years, so I got on with Intel. Promoted quickly, the first 10 years, learned alot and contributed alot. When stock prices fall, they love to 'streamline' work force, if you make a good wage or are near sabbatical, you better be an essential player. or prepare for voluntary and involuntary seperation notices. A good place to work.Quite frequent in terms of organization changes.Be prepared to handle ambiguity and navigate across organizations to get things done I am pretty neutral with the work environment. It is neither good or bad it is pretty much right in the middle. Just really wish I could put my education to work with the company. Surrounded by good people who all started from an equivalent role. Salary and health insurance benefits are very good, not to mention good stock compensation. My experience was overall good, however had issues with my immediate supervisor supporting my need or FMLOA with caring for my terminal ill spouse, was forced to take early retirement I have nothing bad to say about my time at Intel.  It was one of the best places I ever worked.  Maybe the best.  Management was good and they gave me the freedom to do my job without any oversight. Typical workplace. I worked as contractor and nothing much to say about bonus and other benefits. Work culture is good and they treated people very well. Intel started doing lay offs more and more often where large groups of employees were walked out of the building.  This created a stressful environment This is a great company with excellent management. Incredible technology and great leadership. I was part of one of their acquisitions and they are a company that rewards the people that are willing to work like it's their company. Excellent company to work for. Excellent benefits including bonus, medical, vacations and many more. Provided employee path for advanced. Tuition fee reimbursement...….. and more. Intel is a serious old boys network.  Notwithstanding the hype about their diversity programs, the environment can be challenging if you're not one of the boys. The working environment is a clean room setting.  You are wearing a bunny suit, with hoses and air filters connected to your helmet.  The uniform was very restrictive in regards to your head and neck movement.  You must stand all day.  This job was hard on my body. I worked my behind off for the department I worked in only to get laid off and taken away the chance to ever work there again. So I have absolutely nothing helpful to say as far as working at Intel.  Wish things would have ended differently but they obviously don't care about their employees just the bottom line.  The least they could have done, was give prior notice to the layoff.  Not every company does this, but in my mind, a truly ethical one does. Mixed levels of good and mediocre managers.  Tend to restructure teams and priorities a lot.  Very fast paced.  This opens up great opportunities to learn new things and challenge yourself everyday.  Workplace is generally laid back and easy to work in. No comment.  Apparently there is a minimum number of characters required before this comment is legitimate, and since I have nothing to say, I am just going to fill this box with mindless stuff. The typical day was smooth and very structured base companyI have learned about leadership, ownership, thinking of the box mentality. The management are vey knowledgeable about  semiconductor business. The culture was interactive, vibrant, and team base culture It was a laid back company . Make sure you do your work core correct and you can move up. They give you alot of purks with the job and it is a fun and ergonomic place. GPTWWell managedgreat technologyexecution orientedproductive largeglobalcompany jet, great facilities, great location, 50 years in business, well run. Intel is a great place to work. You are recognized for your services. Family life was encouraged for all emplyees to balance their work life.There was always other people that will help you when  you have difficulty in finding solutions to certain problems on your project.Managers were willing to guide you with your project. I loved it here. It was cool. I did contract work but it was awesome. I am sure as a full time blue badged employee the benefits have got to be good..... Good place great benefits, management not in touch with maintenance personal.  They would rather manage from a desk than out on the floor in real time.  Question you about everything, and expect you to memorize hundreds of procedures and follow them to a 'T' during a crises. Intel is able to hire more than other employers in the area.  it hires a large number of employee from outside of area.  If candidates find a good manager and a good team (that is hard to find at Intel culture) it is a very good place to work.  It is very competitive and at times can be very stressful (compared to other employers), but good team and a good manager can reduce the stress significantly.  Intel needs to promote teamwork (use successful teams as example) by developing a more effective focal reviews for employees.  The existing process creates more competition within teams that works against teamwork reducing team synergy and thus productivity. The best part about working at Intel was the technical ability of all of the team members. From team members in Israel to team members in Arizona all of them were top notch. Scam - bad management, no promotions, poor raises, no meritocracy, very political, dying company due to no-good leadership; coasting on old achievements. I gained a lot of great experience at Intel.  At the end of the day, I struggled to find relevance in what I was doing and how it really contributed to the performance of the company.  However, it is a great, stable and generous company. A typical day at Intel is a basic routine of checking work email when I come into my lab and then check incoming work loads to see what electronic components have failed during testing and ensure if the electronic components are legit fails. After the 3 years of working at Intel, I have learned how to operate x-ray machines, how diverse Intel with people from all around the world, and not knowing what my work load is going to look like each day. Some days the work load is very small and other days the work load is immense. good place for self-starters who know how to navigate corporate politicslearned: how to be autonomous by interfacing with colleagues and properly documenting all stages of decision process I have had good and bad at Intel.  However, it is a very political organization and you can find your performance go from 'exceeding' to 'Improvement Requirement' within weeks to months of leaving an organization or getting a new manager if there is a hiring freeze.  After leaving, I found that Intel appears to lay off a lot of people prior to the 7 year anniversary, when they would have accrued a paid sabbatical. All in all, it's a mixed bag. I was a contractor for Intel Corp through an external agency. The environment their was upbeat and the full-time employees, did not treat me as less than an equal. Great place to work! This is a great company with excellent management. Incredible technology and great leadership. I was part of one of their acquisitions and they are a company that rewards the people that are willing to work like it's their company. Safety, Quality, Output... a good mantra. It was a great company, but the downsizing of experienced technicians may prove it loses more than it gains. I was lucky when i volunteered to leave, not so for many others Very good company and benefits, there are many challenging projects and opportunities to learn new technologies.Benefits are excellent and HR is better than other places. Management can be less than flexible. Pay is not great and advancement is highly political. Often times you feel unappreciated. Because of how you are rated and ranked, there's a lot of backstabbing in order to secure your 'satisfactory' review. Intel lay off good employees frequently. Their annual review requires peer reviews, which is useless because manager's review determines all. Culture is too aggressive. Some amazing leader and some not so good at all.They continuously hire from within which I found to truly limit their collaboration and disruptive thinking.  its a bit unnerving.Current leadership is a mess - CEO removed mid 2018 for an internal relationship.CMO moved to special projects for reasons yet to be explained publiclyLeader of Cloud departed for the competition - may be returning in light of the CEO hunt...not great - too big Intel is one of many Fortune 500 companies that provides or encourages a GPTW (Great Place To Work) environment. Each quarter, each team member of an org is entitled to spend $25 towards an event to build Team/Org camaraderie, enhance team energy/spirit and/or have fun together as a team. They encourage folks to participate outside or on campus in an activity that fosters team building and to get them to collaborate more together. This is very beneficial especially if the org is new and/or as a result of restructuring due to head count reduction. Intel Corporation is truly a Great Place to Work and they strive to continue to put employees first with positive reinforcement.Great annual reviews with promotions and salary increases.Lots of room for growth within, The focus on performance reviews has devolved the culture at Intel to encourage a 'teach the test' like mentality. The great work creating wizbang quality products designed by industry innovators has slowly died to one where scared children following recipes make commodity ho-hum products. Great people to work with, opportunity to advance, cutting edge technology. Challenging and drives learning. Allow me to expand personally. Some late nites but I enjoyed the work so much that it was not a problem. Hired through acquisition, was very good experience.  Since it is a large company it had much bureaucracy to contend with.  They do have the finest equipment and engineering disciplines though.  Their managers are fair and culture is pretty good. Intel is an excellent place to challenge yourself and grow.  The hardest thing about working at Intel is 100% owning your own career.   If done right, you will have the opportunity to be innovative and have your career grow.It is also an excellent place to work with some of the brightest people from around the globe producing products that everyone uses, even if they aren't aware of it.The downside of Intel is that it will work you as much as you will allow.  Rarely does management tell you, you've done enough, take time off.  More often the case is people burning out and suffering in their health by not drawing the line on how much is enough. Best Place to Work  , Open to experiment with new technology , gives more importance ew new skills  and technology. Lots industry experts  to lear  from Good Salary and Benefits , A solid company that is still in the mist of change.  They went from a memory to processor company, and now seem to be moving back to a memory company.  And where do drones fit in? There are several pockets of good teams within Intel, with highly motivated people. Great company which allows employees mobility cross functions and organizations It was actually an excellent job environment, friendly and protected. I really like the 12 hrs shift. You will have to deal with people with type of work in life Intel really spends time growing and developing leaders not just for Intel, but for the Corporate world.  Fast paced, but exciting and fun environment.  A lot of benefits that most companies do not offer. I enjoyed my time at Intel.  As a contractor I was given autonomy to write my own code and test it well.  The work could be demanding as my team was spread all over the globe. Intel encourages lateral and upward job moves within the company, making it a great place for long-term employment because as your job become stale or you are ready for a change, you don't have to leave the company. Great work environment.  Find a good manager and make them happy and you will do well.Stock, quarterly and annual bonus add up to much better pay than some other companies. Bad management, no trust between teams, average pay and poor leadership. Overall work here for a couple of years if you want to and move on to better opportunities. This is a great company with excellent management. Incredible technology and great leadership. I was part of one of their acquisitions and they are a company that rewards the people that are willing to work like it's their company. Working there for so long was a fantastic run.  Under BK they chose to burn the place down and that's unfortunate in many ways.  Can it be recovered ? Amazing learning platform. Groundbreaking technology and very supportive team. Intern management could have been better though. Work culture is really good. It's a great place to work - I should know, I worked there nearly 15 years! A lot of promoting from within, and usually worked with a lot of smart guys and a lot of great people. I did not work for Intel. Intel paid for my flight and my hotel to play professionally after qualifying for a video game major all the way in Poland. This experience is only given to a handful of people as it requires intense competition. I am involving several projects, and had chances for challenging new areas. I have a lot of  good colleagues for  discussing and  helping each others. Had to operate a fork lift to get orders down from the shelves.  Did lots of walking to the fab to deliver silicone wafers to the departments. Job was easy. A place that does not see the employees at all but as unskilled worker only. The managers are not empowering, they are always hurting and pressing. There is no personnel HR management at all. Everything should be done by the computer directly to Poland, no one looks at you and the managers do what they want Management arrogant. Management not employee friendly, and does not take employees side into account. Management looking for reason to express there power over techs. Engineer are no open to feed back from module techs, they also like to impose there position and power over the module techs. Intel Cooperation is one of the more fundamental companies is silicon valley. They have a little ways to go before they are able to compete with the newer culture of technology and its employees. It is still a good launching platform for most individuals starting their IT career. A typical day at work involves working on projects with my team members, going to the cafeteria to grab a cup of tea/coffee or fruits with team members while discussing ways to move forward with a project, going to the gym during my break to stay healthy, and meetings with my manager and team members.I learned the value of having experienced team members willing and ready to share their knowledge and understanding without hesitation. A great place to work for if one is willing to work hard and succeed. Work schedule is sometime demanding but very rewarding. Bonus and salary is also good. You get to work with one of the smartest minds Great company with competitive benefits. People are nice, however career advancement is a non starter without at least a masters degree to even move into low level management. That said a typical day is spent behind a computer for 12 hours. The hardest part of the job is the time away from family, especially on night shift, with no option to move shifts without doctors direction. Management is also hit and miss. The best part of the job is the people who work at Intel. For the most part they are a great community of folks from around the world with very few bad apples. The company overall is very strong among the Semiconductor industries. Semiconductor innovation happened here. This is a cutting edge technological company for the future.However, as far as culture is concern, this is not the company that keeps the balance between work place and home. It expects more that what it should have been. Job security is close to zero. This is not the working environment I would prefer. Good place to work if they could make you feel secure. Layoffs are the norm and the culture has suffered due to the instability. Company culture is all about the bottom line and employees don't matter as much as they once did to them. It is common place to lay off long time employees and then hire them back shortly thereafter as contract employees to make their headcount numbers look better to appease shareholders. Under BK, Intel got rid of a lot of senior people and had the people that remained do the job the senior person was doing, plus the one they already had. There is no way to move things along quickly at Intel because of the number of layers of management that prohibit nimble evolution.  To save money Intel laid off their most knowledgeable managers and then over allocated those that were left.Workplace culture - isolating I enjoyed the diversity in the workplace. There was never a dull moment. However, I see people work their head off, but doesn't get the recognition they deserve from management. Project based layoffs were always on people's minds. Excellent benefits along with middle of the road pay structure.  Intel tries to be a conscious employer and not over hire to try and protect what permanent employees they have so when a downturn happens they don't have to lay-off to many people.  Just like most companies as they move from being small/medium nimble they have grown to be large and sluggish...Risk taking in the younger years has been replace by caution and a bit of bloat.Over all still an excellent company to work for. The management system is a different than what I had been exposed to prior to Intel. It was at times confusing but overall it always seemed like an invisible force guiding along. My peers were more flexible and open to conversation. There were a lot of former military service members employed there. The job culture rewards honesty and commitment. There is something to be said about the 'work-life balance' as the long work hours allow for corporate work weeks to be split evenly between shifts so half the week is to working and the other half is to relaxing. I have worked at Intel as a direct employee and eight times as a contractor. They treat contingent workers as second class citizens but working as direct employees has its neagatives as well. This is a great company with excellent management. Incredible technology and great leadership. I was part of one of their acquisitions and they are a company that rewards the people that are willing to work like it's their company. Up until the layoffs in 2016, I thought Intel was a good place to work but the layoffs were a complete betrayal of the hard-working people at the company.You can do well but don't get complacent.  Good advice for any work situation but especially true at Intel. I loved working here was just so far away and was only a temp job, if it was closer to my house I would love going back also it just happened to be a temp job so it didn’t last Intel for me has been a great place to work. I love the work I do. I am happy with the salary that I get and I love the quarterly and annual bonus. With Intel, you never know when layoffs will happen. Great place to work ! collaborative workspace. As an intern I learnt  a lot, but  as an intern I did not receive much work allocated to me. But over all it is good place to be ! slow workplace during the summer hours; management was away a lot on vacation as is their right but made work for an intern hard to accomplish and feel proud of High expectations with high pay. Great opportunity for advancement. Fast paced work environment. Great perks like team builders, bonuses and free tickets to events. Intel is a good place to start a career. Workflow is built for improving employee skills. There are pieces of training, open-minded managers and scientific-related projects. Learnt a lot during my time as an intern; Worked on new and upcoming technologies as well as built up knowledge about current software and technologies being used in the team Great place to work. Had a good experience working there and would do so again. Worked doing crosstalk on huge microcontroller designs. Very difficult. Great place to work. Flexibility, safety. Monthly ergo. assessment. on-site full size gym. with showers, trainers and yoga classes. Great perks, discount tickets to parks, events etc. On the first day you arrive, you discover that over your cubicle hands a huge green sign that says 'CONTRACTOR'. It serves no purpose other than to apply the corporate social stigma. It might as well say 'Leper.'Permanent employees get free coffee; you have to buy yours. If they have an 'employee appreciation' event, you aren't invited. If there is a team meeting regarding your project, you will not be invited. It is a big company which has its own good and bad.The training in Intel is good. The system there is efficient. The working environment is nice compared with some companies. If management is good things will be peaceful to work for.That is the only concern and due to which no work life balance. If you like the work better to continue My manager had an outdated management style; which primarily entailed workin his underlings to death & taking all the credit for their hard work.  The group had no clear focus and/or purpose.  In fact several other groups were able to offer much better training options for the Validation community.  Tragically, my boss was really focused on keeping his job long enough to retire with rich Intel benefits & threw many, many people under the proverbial bus in order to secure his retirement. Challenging and team oriented environment the atmosphere is positive and very challenging. The reviews make sure you are fulfilling Intel's progress in making you an uplifting employee. The rewards are great at Intel if you can stay focused and positive. With Intel it's all manager discretion. There is a high over turn with managers. There is a change every two years or so. If there is bad management you can't grow properly and there can be a great deal of judgement. Working for intel had its perks, but did not allow for any family life. Worked 80 hours a week. Pay was good, but no benefits were offered to anyone that hadnt been with the company for over a year. Job was only a temp. You won't find slides or bowling alleys here, but if you want to work for the best company in the world for bleeding edge hardware. This is the place. It has many tools which one can learn to achieve the best results, good training programs. I have good leaders and good team members so that goals and objects can be achieved. Interesting and diverse place to work, management and atmosphere is supportive of career development, good balance of work and family life. The environment is a healthy mix of peak work load and time for interaction with colleagues and personal development. This is a great company with excellent management. Incredible technology and great leadership. I was part of one of their acquisitions and they are a company that rewards the people that are willing to work like it's their company. They were a great company to work for, very professional, seemed to really care about employees. very supportive and flexible regarding career path. Excellent company to work for. Fab Engineers have little to no work life balance. severe on-call schedules with punishing hours and work load. Not a friendly place for returning or new parents I still have friends that I met at Intel in 1993.What more can I say?Intel is a great place to work because of the people that work there.This is my highest compliment for a company, and I have worked for a lot of companies starting with RCA back in 1977!  Before CMOS was in mainstream electronics.James Lindsay Great place to grow and gain experience. Must be tech, analysis, and number crunching interested. Had an overall good experience but also felt the pay wasn't up to chemical industry standards. My role and project were not explicitly outlined when I was hired. I feel like I could have benefited from code reviews and more guidance at times. Usually, I liked how much independence I was given with the project as I was able to test and prototype features freely. Intel offers you free medical,vision and dental Insurance.Work and life are balanced at Intel.Teamwork is their main motto to overcome any road block. Started here, they helped pay for school, had good benefits.  But they sold off our division so we all ended up working for a different company with less benefits, etc. Intel used to be an awesome place to work, but then was clouded by repeated, brutal layoffs which killed the culture.  Intel lost it's competitive advantage of process leadership recently and seems to be floundering on where to focus next, with no real leadership driving the company forward.  The culture is suffering due to those reasons. Nice work culture. Management is typically on point and very helpful. I enjoyed working closely with other Senior Developers and there were plenty of resources to get me up to speed. Good Safety and good compensation. Manufacturing means the same thing every day just faster and cheaper.  Be ready for this.  boredom and intensity can occur simultaneously. Good people to work with. Stress is there, but manageable.The work place culture is trying to make it a place where people want to come to work, and feel connected. I was lucky to be able to be in a great team with great coworkers. They are great people who constantly challenges you to help you improve and goal. They respect your comfort zone but were able to push you to your best. I enjoyed the work culture and especially the professional and fair management.  All employees work hard and also get great employee perks. Ideas are welcomed and diversity is plentiful. excellent company with wonderful people, its a good place for young people to start and learn, there are so many smart people at intel that will surprise you !!!! Intel is a company that changed Work Life Effectiveness to Work Life Balance. It is a company that believes on the importance of family and that there is life outside work. HR policies have made huge damage to Intel culture and ability to move forward. It is hard to find a decent group within a company, which I would recommend anyone. Good company where you can advance. Very long hours and demanding, can burn you out if you let it. Challenging technology and culture. Safety is very important. Intel is a great company to work for. It's very demanding but it's a great feeling to be involved in new projects. Something is always different about one project to the next, and the team is driven to excellence. Intel has changed in the last few years. They no longer invest in end user influence. This has a large impact on intel's culture and budgeting process. I've worked graveyard for 15 years, which is my entire employment at Intel.  There are 2 shifts for grave, each is 12 hours long.  Night shift is a small community, and I really enjoyed the autonomous work.  Plus, night shift work is an extra 16% in the paycheck.  However, you miss all that Intel offers to people who work during the day.  There aren't any special events for night people.  There are no special classes and even the 'special meals' in the cafe are second rate compared to days.  Intel has a huge picnic for most of the employees during the summer.  I say most because some departments, unknown to the employees in it, opt out of the picnic to save money, only to offer an alternative that isn't quite as good as the picnic.  My career opportunities were limited within my department, and transferring departments was a pain.  If none of that matters to you, then it's a good fit and the benefits (medical, dental, vacation) fit the industry standard. This is a great company with excellent management. Incredible technology and great leadership. I was part of one of their acquisitions and they are a company that rewards the people that are willing to work like it's their company. While Intel does not provide the highest pay, they do have wonderful benefits and other perks. This makes for a very safe and secure environment for those looking to develop skills or to secure a comfortable retirement. With the policy of hiring from within and the multitude of business groups, there is a lot of opportunity for lateral movement allowing one to better figure out on what they want to focus. The company does offer great benefits to their employees.There are many levels of management which can cause stress and slow productivity.The largest issue with Intel is the politics! Great place to work. The support is very positive to help you get focused to do your job. Its alway a challenge working. Management is very supportive. I worked for Intel over 25 years as a full time employee and as a contract employee.  Great, safe place to work.  Lots of friends, training great.  I hope to return some day. Great training and employees performance review rated on merit.Had a great time in my 25 year career.Advancement was always steady and company reward you for 'thinking out of the box' Intel used to be a much better working place. Now most of the work moving to low cost geological areas (mainly Asia). Employees in US severely affected by this. As Intel's grip loosing as the number one in chip manufacturing, management try to reduce employees in unethical manner. Good company overall. I was working as a graphics hardware engineer, responsible for both ROM design in CAD, and RTL/VHDL releases. Being a big company, a lot depends more on which team you work with, immediate collaborators Pleasant  work environment, nice sharp employees from all over the world, nice to see some diversity in OR. Everything is running by scheduled meeting, no add-hook collaboration. Everything was great about working at Intel. A task-oriented company. Working with many brilliant folks helped to learn new knowledge and widened my exposure to technology. good company for technology development, career development, benefits, team work is good, mission needs to be more realistic, politics getting in the way The work and environment was good but I didn't learn much beyond the specific tasks I was given.  The people I worked with were nice and helpful.  I encountered some pretty bad micromanagement.  The process to get document access was very long. A typical day at work for myself was working the night shift at the factory, usually inside of the clean room. We have a pass down twice a day, once coming on shift and once coming off shift with the day shift personnel. We are made aware of any testing or changes made during that time and make sure the on coming shift knows what has been done and what is remaining. I learned a lot about what goes into the production of microchips that Intel uses as well as how the process is managed from step to step. The culture at Intel is relaxed and pleasant, most of the people that you work with are great and none of the managers have offices, so if you need to meet with one of them, you can go to their cubicle and meet them. The hardest part of the job is two fold. One is to be sure to utilize the publications for all troubleshooting and maintenance procedures, even if it is something that you have done before. The second is the hours, a typical day is a 12-hour shift with 1 to 2 breaks for lunch and to stretch outside of the clean room. the most enjoyable part of the job is the fact that they do a lot to keep employee's happy. There are lounges, games, drawings, onsite medical and cafeteria's. Intel is a good place for higher PAY and benefits. But the planning and resource management is poor. People are assigned jobs randomly and one cannot have focus on a particular domain thus leading to unsatisfaction in the work environment. Very much into promoting teaming.  Good culture to work in with flexible hours to promote work life balance.Good benefits and stock options in addition to stock participation plan.  2 month sabbatical every 7 years. Great benefits, paid sabbatical.Many capable engineers willing to mentor if needed. Facilities are updated and well maintained. Great break rooms and work out rooms. Great place to work with awesome Benefits and compensation. Can be very stressful and chaotic at times but overall Intel is a great place to work. I like the extra time I get off from working a compressed work week. Intel was my first real job.The whole experience was incredible. From ops, to maintenance, to chemical control, to training, safety, this is an employer that provides just about everything you need to be successful. I was on a contract assignment to learn the new program that would handle all billing for all attorneys worldwide.  I was given the help I needed if I had questions, but was also able to fly on my own and the project went faster.  I input two years of past due bills for attorneys worldwide and set up system for all secretaries to be able to take over and continue using this billing system. I worked a number of contracts at Intel before being converted to full  time. The contracts were interesting and challenging and I greatly enjoyed them. Once I was converted to full time I continued to enjoy the work I was doing, but I noticed an increase in the number of meetings and general office politics that I had been shielded from as contractor up to that point. I understand the interplay of employees in a work environment is largely not reflected in most contracting situations. Intel is like any other company in that sense. The challenge that was most notable is that Intel is a meritocracy, which tends to pit teams against each other and sometimes team members as well for recognition, raises and bonuses. The people at Intel are generally very professional and do not let this interfere with their work relationships or performance (in most cases it pushes them to try harder.) I enjoyed my time at Intel and the knowledge gained from the experience. it was a really good job. I learned how to cook new things. I really enjoyed having a new culture experience with food and trying out various cuisine from other countries. This is a great company with excellent management. Incredible technology and great leadership. I was part of one of their acquisitions and they are a company that rewards the people that are willing to work like it's their company. Intel is a better place to work. and the people, managers, staffs are great. And employees are treated very well. Looking for to come back and work there again. Thanks work life balance with good productive work. but management fails at utilising all the sources and  skills of the employees. 	RecommendsPositive OutlookPros: Good benefits, Big company, Good coworkersCons:Stressful, Politics, work life balance replacing new equipment which reduces labor and time, and also send some of old tools to china, lay off, contractors,volunteer early retirement/leave, etc.... The products we worked on where difficult, challenging, and as a result, enjoyable and rewarding.  Unfortunately, there was not a proper business plan to commercialize these products.  Eventually, the desire to fund products that do not provide a return on investment, is bound to wane.Intel is known for building teams up, and then shutting them down when they don't turn a profit.  Its a cycle that puts good people in employment jeopardy continuously. For the most part Intel is a very fast paced job and I enjoyed that. Do not like to be bored or sitting for long periods of time. My job was very manual and physical and I really miss that lifestyle. I felt accomplished when I would leave for the day. This company promotes manager that lack people skills. This company has a high turnover rate. HR allows racial discrimination to occur, retaliation and workplace bullying. Intel says it a company of morals, but the behaviors of the individuals put in place to uphold the company standards lack character. A typical day could be very stressful and demanding along with a high volume of work. The learning curb is very strict with no room for error because loss time is revenue out the window and that is not acceptable with management. Really friendly environment, the office is really nice, and the food is good. Everyone working there are humble, and smart, they are willing to help all the time. Intel was a great place to work for.  Their compressed work week allows for a good work/life balance.  They have great benefits.  The only downside is numerous lay offs throughout my career. Excellent pay & benefits but difficult to get to the next pay grade. Most years most everyone gets a good raise and bonuses who meet their expectation, which most do meet. I worked at 3 different sites spending a few years at each one and found each site to have very nice intelligent people thru out each site,  I really liked the 12 hour shifts the manufacturing has that rotate 3 to 4 days on then off. Most of the time most of the employees have a heavy stressing work load. I like staying busy because the shift goes by quickly, but  3 to 4 hours out of the 12 in the manufacturing part the work load will get to be stressing.  The company word wide has big layoffs on the average of every 4 years. If your willing to move you have a good chance to get picked up again at another site. Effective management requires a wide range of skills, and each of these skills complements the others. Your goal should be to develop and maintain all of these skills, so that you can help your team accomplish its objectives efficiently and effectively. Read on for ideas and resources that you can use to do this. Company has a difficult time in visualizing a strategic direction that will work - and then sticking to it. Even in today's world, it is too volatile. Works well with the core team members 10 - 12 engineers. Plus he focuses on Intel external customers too.  This helps promote teamwork for the whole group. Great work-life balance. Great place for TD jobs. Pay and benefit are ok. People are friendly. Culture is good too. Care about employee. Recommend for people. The decision making process is always speedy and data driven. People are very smart and they understand things very quickly even if situation is complicated. Flexible working time as long as you get things done. There are many opportunities at Intel but not always the easiest to navigate.  Expectations are high and the environment can be highly competitive, and not always supportive.  The best part of the job is if you like a challenge, there is plenty of opportunity. The caveat is that opportunities can be limited depending on how supportive your management is. Engineers collaborating to solve issues. Teleconferencing with suppliers occurs. Meeting rooms to collaborate onsite. All within walking distance to interact with groups I'd recommend Intel to anyone simply because it looks great on your resume when you apply to other companies. Otherwise, it is a pretty cut-throat company to work for and you better plan to be working when you are off the clock because your phone will ring day or night with co-workers who want answers. Very relaxed culture with good amount of work, but supporting and friendly management. Management is very much supportive and understands your requirements and concerns. It was fun when you find your group of people to hang out with - great perks and the GPTW program do make it a great place to work. Ping pong tables, great gyms, great cafeterias, great outdoor areas and facilities make it feel homey and nice. They want you to work hard, and like any big corporation, management can be pretty bad. It was not a bad place overall, but equality, especially with women, still has yet to be seen. Typical patriarchal sort of place. This is a great company with excellent management. Incredible technology and great leadership. I was part of one of their acquisitions and they are a company that rewards the people that are willing to work like it's their company. Management had alot of favoritism and unfair annual review process. Very high volume company with overwhelming amount of work not evenly spread throughout four shifts. Major PM's and maintenance was selectively scheduled or left for certain shifts rather than helping educate all shifts to be able to cover all maintenace types. Fast paced environment working with a lot of smart young people.Lots of fun.You get to work with the latest in computer technology.Good employee perks. I was not afforded good training, as I expected I would get.  My trainer was very impatient, and when I asked for a new trainer, I was told no.  I was working nights, and not sleeping well on days.  I was very frustrated and sleep deprived. Intel is a great place to work to continue your education, and gain valuable information about the semi-conductor industry.  Intel culture focuses on Safety, Quality, then Output.  I definitely feel safe working in the fab. Full Hours, Good Benefits.Competitive Rates.Career Training for Future Opportunities.Supportive Management.Competent Co-workers.Helpful Co-workers. Its good to be part of intel, nice workplace with nice people but its time to expand my wings and search for more better opportunities. as I grow up in career. Hi tech work environment.Great co-workers.Requires a Masters degree to advance to Engineer positions.Management needs some help with people skills.Could be a very great place to work if you are from another country. In general very fast paced and stressful work, but most people there are very nice. However advancement is very difficult for Techs (IE non-engineers), and most techs will never get better hours beyond a 12 hour condensed shift, many of which are swing or night shifts. Management can also be pretty obnoxious in the labs since most managers are just senior engineers forced into management positions. This means they tend to know very little about anything outside the scope of their own world (ie, hours, vacation time, timecards even...). Intel is the best workplace to work for. Intel provides equal opportunity and excellent work environment. An innovative company that allows employee to expand their expertise, knowledge and skill levels. Amazing place to work, learnt the most in my entire career in this work place. Everyday is fun learning and working here, management is very transparent Intel Used to care about the employees, but there new interest is get it done no matter what the cost, they constantly lay off people regardless of how much effort or work they have put in to the company, and if they don't like you or if your ideas push them to new heights of thinking they are quick to dismiss you. Intel is a great company. Unfortunately, the manager and team were a bad fit for me and I was over qualified for my job. I did love the fab and working on wafer and learning new things. I just hope to find a more challenging position. The workplace environment is easily changing from day to day.Individuals were getting burnt outMore New College Graduates entering field and older employees are being removed from jobs Being a new hire in 15 years and a huge age gap, it was difficult to fit in.  The coworkers were friendly at first but became unreasonably difficult to work with. A reasonable place to work.You learn a lot about improving your processes - and your reporting skills.Sometimes it's hard that the process becomes the main thing - it rarely happens - but then it's annoying.It's nice to have team events quarterly or so. Good work life and nice environment. Had a good internship experience, learned a lot, lots of smarts people and lots of interesting projects and opportunities. Intel corporation is transitioning with a different set of job skill required for the next generation. Good opportunity  for local and  international travel. Management will change, your project will be canceled.  You'll be laid off, or tossed into the pool.  And GOD help you if you're not a minority, as that's all they're interested in these days. Original mission forgotten. Old boys culture. Good first job but look for better. They tend to corner you in one skillset which limits your marketability to do other things outside of Intel Great time off but the company lacks fair compensation and advancement. I feel like I am under valued as a experienced technician. I wouldn't say its a bad place to work but i feel like I am worth more. This is a great company with excellent management. Incredible technology and great leadership. I was part of one of their acquisitions and they are a company that rewards the people that are willing to work like it's their company. Fun workplace with TV room and Computer access where you stay during breaks. Sometimes I will spend my breaks walking around the Parking lot for my exercise. We also have pool table, football table, a room to relaxed. I would go back again if asked, but would be more cautious towards that areas layoff process and timely occurrences. Atmosphere of the people you worked with was very good. As a contractor, you get to sit around and watch as 'goodies' are spread around to employees. Parties, gifts, other benefits. It's depressing to watch. Flexible work time, a lot of opportunities for career training, good work balance, but the functionalities of each team might not be every clear. So complex project management can be improved. Atmosphere is pretty lax, you definitely need to learn to work and be a self learner.  A lot of project management work.  The bonuses were amazing, the workplace culture was very diverse which pleased me. Depending upon what job you have at Intel, it can mean a great work life balance, especially if you're very efficient.  I could easily do two people's workload in 30-35 hours a week, spending 1 1/2-2 hours a day in the gym.  Unless something has changed, there are quarterly bonuses, which is a nice little chunk of change.  RSUs restricted stock units are given annually too, which, with raising 4 daughters, I cashed in each year to pay off credit built up for various purchases.  They have very efficient, streamlined processes that are typically the same no matter what site you work at and, if a process is not working properly, they are big on fixing it, using Lean Methodologies to identify the root cause(s).  I know management has changed since I left and some people are unhappy, but, overall, based upon other places I've worked since then, this is still a great company to work for. Great place to work, great benefits, decent pay, lots of growth potential, I worked compressed work weeks 3 on 4 off then 4 on and 3 off. Would love to go back but I had to relocate for wife's career . - Working environment very industrious- Manufacturing Technician - Managed Bay Area- Workplace culture steady- Hardest Part system errors- Most enjoyable part of the job was feeling welcomed great place to work, fast pace, always changing,  excellent health benefits, extra company perks, free gym, cafeteria on site, safe parking areas, comfortable break areas. I like to work every time I work is that Acacian to meHow work is the pay off And while you’re working you have to have forwarded you have to know what you’re doing to like your job so I’m comfortable with my hands and working hard I enjoyed working at Intel. The Campus, security, and people overall were top notch and never had an issue. The management was very flexible to individuals needs which I liked a lot. Never had any problem support or the infrastructure and would recommend Intel to anyone wanting to work in the high tech industry. Visibility counts more than merit.Management is disconnected and inept. Expectations are that an engineer should know everything about everything. Ownership and accountability is very poorly managed. I start working at 9 am till 5 pm. THe work culture is not that great but it depends a lot on the team in which you are in. Bonus and salary are very competitive. I was lucky in the fact that I was able to do my college graduation project for Intel as my “foot in the door” to a paid internship, becoming full employment upon graduation.  But for people directly applying for positions, external hires have to compete as “last ditch choices” as Intel tends to focus on allowing current employees first dibs on new job postings, followed by internal referrals to personal friends and family.  If you are lucky enough to get in, the pay, benefits, and flexibility is pretty top notch.  Managers sometimes struggle with differences in their posted role tasks and responsibilities and the tasks actually performed depending on the manager’s experience at the technical level on what their direct reports do on a day to day basis.  Be sure to save technical questions during interviews to people that will be your equal footed coworkers, as managerial descriptions may not be accurate. Intel has the desire for change for as long as I can remember.  However the ability to trust, have open honest communication without retaliation, the will to listen to new ideas that have been tested/proven without discrimination will put Intel on the elite list again. Intel is a fast, challenging environment with high expectations from management.  They offer a good benefit package and plenty of opportunities to learn and grow. Stressful, although they promote life/work balance, unable to attain based on projects and deadline.Fast pace, competitive, stressful.   Pay is comparable based on Bay area standards.    Hardest part of the job was to keep work/life balance.   Overall, very good company to work for and total compensation is on part. coworkers are helpful and caring but managers mostly are either not experience or too political. The work itself is easy, it is just hard to get a job with the company due to the political and biased selections and recommendations. I wish not to comment too much on the company. They tend to not allow you to express your true feelings.Only thing great about the place is the people. Great place for work life balance. Also gives opportunities to change roles within the same company. The sabbatical program is also a great benefit offered to employees. This is a great company with excellent management. Incredible technology and great leadership. I was part of one of their acquisitions and they are a company that rewards the people that are willing to work like it's their company. I loved working here. They really took care of the employees, Great bonuses, very good pay and benefits, great opputinities for advancement. They hired people of all ages, No predjedice Well Intel is the poster child for chew em up and spit em out but if you can hang in a company full of A type personalities and can hold your own in constructive confrontations you wont be disappointed with the experience you gain by working there. none,  the Intel Labs New business initiative group was laid off.  Meltdown virus probably scared them into retreating to chips only, otherwise the rest seems great Encouraged RCGs to create scripts for product and tool health monitoring and provide the customized output in daily managerial . Intel is not a good company to work for. typical day at work, what you learned, management, workplace culture, hardest part of the job, most enjoyable part of the job and etc and more of this stuff Small teams of people who work hard at the job, intel offered various incentives for doing a job well. Night shifts were paid extra as the 12 hour shifts could be taxing. Working at Intel Labs required teamwork and a great attitude. While working there I was handling their deposits, setting up appointments, bringing in new clients, and giving the technicians their daily equipment in the morning as well as when they were done working at the end of the day. The people awesome to work with from all backgrounds. If need training in semiconductors, Intel is the best. The Start ups were an opportunity to be creative. Was advanced very quickly and well appreciated. Accomplished a lot with a rapidly growing company. Had very knowledgeable coworkers and managers.  Technology was rapidly changing and was exciting. Flexible time for work life balance, you can work from home in case you need one. Your job always works on new technologies and products which keep put your experience in advanced position. Intel is usually a fun place to work. Like most places, it depends on the department, shift and so on. I have not had any bad experience with the company. I really enjoyed working there. My time at Intel was pretty uneventful. Nothing great as there was lots of day to day pressure as a 1st line manager in a high volume manufacturing environment. Many accomplishments went un-appreciated as it is a huge company and most people are looking out for themselves vs. creating a real team 1st culture. Lots of opportunity to learn.Great benefits.A little bit slower than other tech companies.Work day depends on role.Learnt how to work cross team and with senior management. Great company to start career, good work-life balance, supportive management, not too many meetings, opportunity to travel within the United States and even abroad Their work weeks were condensed which gave me more time to spend with my wonderful family. Which gave me time to unwind and obtain a more balanced life. Managers seemed to be honestly concerned about my career goals and helping me to achieve them,  I was given the tools & training I needed to succeed.  I was given the opportunity to decide what I wanted my career to be, and assistance in making that happen.  All-in-all one of the best places I ever worked at. Good people, just not a secure place to work, lay offs are common. But they never put you in unsafe working conditions which is more than I can say for most places. And people are friendly. Im just used to high pace 24-7 manufacturing, so anything other than that, feels a little on the slow side. Day-to-day, I collaborate with manufacturing technicians, equipment technicians and engineers to ensure Fab operations go smoothly. There's lots of opportunities to grow and mentorship for career advancement. I love the work culture too. Intel is a great place to work!! The culture is awesome. Everyone is polite, respectful and professional. Definitely my favorite place to work!! I hope to return there soon. Maintaining Work life balance with extensive travel.  Projects tended to be often approved by Senior  management without discussing with task owners prior to acceptance and understanding the risk factors.  These type of issues usually were solved with large amounts of money that could have been avoided in a better planning phase prior to acceptance without input form key stakeholders. This is a great company with excellent management. Incredible technology and great leadership. I was part of one of their acquisitions and they are a company that rewards the people that are willing to work like it's their company. Work was fast paced, many employees do as little work as possible and expect a lot in return. My last year I cycled through 5 managers (I was working the same position the entire time). Hard workers go unrecognized. Great company to work for. Great perks given to employees for entertainment outside the work place. Great team building from within. If you have a degree apply here. Wish I could work here again.  I enjoyed my internship with the company.  I learned a lot through my mentors and supervisors.  We had a lot of team building and bonding experiences.  Upon the completion of my internship, Intel was kind enough to pay for my education. Intel has a unique culture in that you feel like family even though there are over 100,000 people world wide. You have the ability to take your career as far as you want to go. In fact, it is encouraged for employees to change jobs every 18-24 months to diversify their career at Intel and learn more about all areas of Intel. If you get a great manager, you can work together on accomplishing your goals for a work/life balance, taking classes at ASU, or even teaching classes held at Intel. The 4 week and 7 week sabbaticals are definitely a plus. It's a challenging work place but employee's are encouraged to take risks. Multiple groups restructures in little time, not chance to adapt, management only takes decisions based on their fillings not real productivity taken into consideration Good collaborative environment in which to work and develop professional skills necessary for personal growth. Meaningful discussions during meetings. I spent 14 years at Intel. It was a great company but very stressful to work at and once you get high enough on the food chain it becomes impossible to take a day off. Compensation is very good but you will not have a life outside of work It is an OK company to work for. In general It treats its employees well except for the ACT fiasco in 2016. But the benefits and perks have definitely reduced over time Culture shock and thrash due to what has become annual large layoffs, but management remains mostly transparent and supportive of other opportunities.  No checking in with manager when you come and go as long as the work is getting done. Responsibilities included ording supplies for office, planning office meetings, filing, making appointments, answering phones, catering, setting up interviews..Awesome company to work for I could not say enough about working for Intel!!! It was a place to work. Most people were all right. If you're a contractor you don't get much in the way of perks or respect. My working conditions were just fine with little interference. I had a chance to work with very high skilled engineers in this company. It is very good environment for career advancement.During work with a challenging project,  I got full support from my co workers. Intel has a good work ethic environment.The company takes good care of the employees and provide great facility with cafeteria, gym, health nurses, etc... Intel is a great place to work, employees get respected and have good benefits. While some employees take advantage of some policy to get more benefits. There are more meeting and complex process on decision making. I've been here for 21 years.  Benefits are good.  Environment is challenging enough to keep things interesting.  Employees need to be able to flow with a frequently changing environment. Intel used to be good company to work for but it turned into very toxic environment of backbiting and back stabbing. Moral was hit hard, management were clueless and helpless Tough environment on bleeding edge, but good company overall. fairly compensated. good work and life balance. they have been squeezing out bonuses and stock compensation for the past 15 years, but they tell us we're still average/on par with peers. Great place to work.I have worked for Intel Corporation for over 14 years. It is a very good place to work and they treat their employees well. I would recommend this company to others who are considering Intel for a place of employment.' I was one of the workers. Enjoyed working on the Equipment. Received lots of training, and worked hard to keep the equipment running. I guess working nights 12 hour shift got old after 10 years. the differential was fair, but after awhile you cant afford to go to a day shift. I had 8 different supervisors in 10 years, So how are they suppose to Rate and Rank you when they haven't had any experience with you. My last Supervisor work days and I worked nights. Very lopsided. But I enjoyed my time at Intel and would go back if asked. Lovely place to workthe staff are nice, ideas are shared, creative environment is supported, coworkers are ready to help pass on a great idea. Support is fantastic This is a great company with excellent management. Incredible technology and great leadership. I was part of one of their acquisitions and they are a company that rewards the people that are willing to work like it's their company. It's a great place to work at. Work culture is amazing.  You will learn about more opportunity in your field at Intel.  In addition you will learn a lot. While I am a loyal Intel customer, their internal workings are so bloated and congested that decisions end up being made by people who have no authority to make them. This led to constant work problems and management was incredibly petty and poor. Everyone at Intel is very professional.  I work there as an intern and nobody treats me like 'just an intern', I felt my integration to the team was seamless.  Benefits from day 1, work quality over work quantity is the focus, safety is paramount, and work/life balance is also prioritized.  The advancement opportunities are endless.  My manager is very professional but not a robot, he has a good personality and encourages everyone to have fun while they are at work.  Easily the best work culture I have been a part of.  Intel is flexible with school schedule also and encourage continuing education.  I can't find one negative to say about the company. Nice place to learn and work. Staff and Manager very cooperative.Work for software testing.Learned to install operating systems and drivers.Management helpful.Workplace culture good.Nothing hard part.It was a fun job. I did chip manufacturing in a cleanroom. I learned a lot of electronic troubleshooting skills. Intel used the team concept in their work environment.Intel's concept was different than other chip manufacturers I have worked for. Previous companies that I work for used to have operators run the equipment (robotics) and maintenance techs to fix the equipment. Intel had the maintenance techs run the equipment, so if there is an issue the tech can fix the problem themselves. Typical day at work: Not stressfulWhat you learned: Learned a lot of new technologiesManagement: Very politicalWorkplace culture: Easy going and promotes work/life balance Learned management skills,exhaustive training, to think on my feet, ability to wield power, lead teams, seek quick and efficient fixes to issues. Long shifts were sometimes too much. Great teamwork atmosphere. Intel treats their 'employees' extremely well.  They treat their construction contractors very poorly.  I was a contractor worker. That is just the way it is...end of story. The place is full of young H1-B hires, I suppose fresh out of college, many of who are women, that Intel desperately needs to meet a self-imposed deadline of around 2020 to meet some kind of a 'diversity target'. OK place for tech work, but there are better ones. Not recommended for serious techies. very busy and less work life balance. Some of the managers are good and some are not. very fast pace. the few years there were knowledgeable and leaned many skills. Good place to work. Work life balance is good. Can work independent.A wonderful work culture where we can reach people at any level without any restrictions and share our Ideas productively. I was always able to continue to learn and develop my skills and knowledge.  Intel provided opportunities to cross train in different areas, finance, engineering, planning etc to allow growth in your career Good Learning ground for fresh graduates who put in the time to   get rewarded. Can feel like old boys club sometimes. Need an advocate/mentor  in management. Intel was a great company to work for.  They train and mentor you so that you have the skills to traverse multiple job types and industries.  I would go back to working for them in a heartbeat.. Intel offers a business environment to sharpen my international business skills. In sales & marketing area, I would constantly face the challenges from different geos, markets and countries, which was fascinating! Work life balance is great though the package itself is just industry average in tech world, not supreme. if your ready to be stressed an love that sort of thing this is the place for you. another thing if you love safety so much you cant do your job this is the place to be Performed validation testing and troubleshooting of Intel’s processors and chipsets prior to being released to the public market. Testing included 3rd party vendor hardware, software, and peripherals to be compatible with Intel’s processor architecture under all Windows operating systems. Assisted with install and management of Windows 2000 file server for testing programs and personal documents folders. Benefits were definitely good, better than most but the overall culture at Intel was not appealing to me. Poor leadership and management at the higher levels for sure. Lots of exciting projects and hence plenty of opportunities for learning, growing and diversify career path if connected to the right people at the right time. Been with Intel for 15 years.  Great place to work, but consider your career base pay as that which you get hired with.  Promotion opportunities are incredibly difficult when you get 2+ managers per year deciding your fate.  I could be jaded, but believe this is the norm. This is a great company with excellent management. Incredible technology and great leadership. I was part of one of their acquisitions and they are a company that rewards the people that are willing to work like it's their company. I let work take over my life. Some people are good at balancing their commitments with their lives, but not me. I frequently worked 7 days a week, holidays, nights, early mornings, etc. Totally not worth that.Pay was good, pressure is high. great place to work with lot of benefits. Lot of smart people to learn lot of interesting things. lot of perks with a flexible work timings. overall you wont regret joining intel Perks include lot of fun activities, GPTW programs and quarterly team events. Get to interact with lot of smart people and develop an overall picture. Good team of people and exciting new projects. Worked with top architects in the industry and learned a lot about CPU architecture and design process. Very fast paced environment but employees were treated very well when I worked there.  Downside was there was an expectation to work long hours which is hard to do if you value work/family balance. Pros. Intel promotes a good work life balance and encourages vacation and sabbaticals.   Very sharp and competent work force.Cons. Too many meetingsProduces a lot of software but doesn't understand how to sale and market software.  We rely heavily on our CPU business and look at software as almost second rate.Lots of silos and duplicated work going on through different groups can be very frustrating. There are big ideas. There are a lot of ideas. Any of them could become true at any time. So do everything you can to do everything the best you can.All time favorite management motivation is 'Do More With Less'. All around great place to work. If you are willing to learn there are many different directions you can take your career. The certifications and opportunities to expand your field here are unlimited. I wish I had never left this company. My last assignment at Intel Aloha was fraught with harassment and lack of proper training from my colleagues. Unfair accusations! Managers are not H.R. savvy. Good salary and benefits. Good team mates, smart people. Free fruit everyday. Depending on your group, you will speed ahead in your career or languish without a promo for years. The irony is that they say you're not there yet for a promo, but then they will lay you off for staying in the same level for a long time. But then if they promote you, you might get laid off for not performing. The bell curve grading of employees is bad. Intel Corporation provides many supportive and responsive actions in several areas of the company. There is lots of internal assistance available on the company's Intranet. Somewhat of a mixed bag around the business in terms of performance and approach, but I would count my years with Intel as some of my best.  If you are patient and attentive and prepared you will do well there. Lots of areas to improve, the company focuses on self development training and encourages advancing and moving every a few years. sometimes work is a lot to take in Great Work/ Life balance for contractors and certain departments. Management is encouraging and understanding. It is a big company and it has its own flaws. Overall, people are very happy here. I worked for Intel a little over two years.  My first experience was in corporate legal and it was absolutely wonderful, I liked it so much I ran to work everyday, I am also a little bias because I enjoy opportunities where I can learn and in legal because the atmosphere changes so often I learned something knew every day.  I also worked in Global Tax, the VP's of Global Tax and Trade were phenomenal, but my direct manager in finance was not.  I have never met someone like him and he broke me down a little every day. Intel was a great place to work. I worked in a Development and Production Fab. People are great, Management very good. They have a lot of rules. Pretty much all of them had a reason. Safety, Quality, Production in that order. Fast paced, Attention to detail. The work is very structured preventative maintenance is scheduled daily. For corrective maintenance you follow procedures that have been written from lessons learned on previous failures. The hardest part for me was working nights. Most enjoyable is working with the people that work there. There are some very nice people that work their. Management for the most part is very good. Miss working there.  Enjoyed my job.  Enjoyed the people.  Enjoyed the challenges and learning top of the line equipment. Can home to take care of my father. My initial assignment was at a separate facility that was well worn and considerably smaller than the main site.  The project was a proof of concept that felt like a start up.  Lots of talented people, long hours, milestones that were expected to be met.  We didn't have the usual perks that trendy silicon valley startups had, but it was still fun. That project eventually had to relocate to the main site where every effort, it seemed, was made to dismantle our micro culture and bend us to the prevailing group culture.  The project fizzled, people left, and our department was eventually shutdown.  Lots of talented people, really talented people, were lost and it didn't appear to me that Intel cared. A world class organization and manufacturer. Hard to document all that I learned over the years, other that is was appreciated that they provided for employee improvement. This is a great company with excellent management. Incredible technology and great leadership. I was part of one of their acquisitions and they are a company that rewards the people that are willing to work like it's their company. Intel has a lot of best practices that make their way into the day to day activities and help things go smoothly. The people are really nice and the company had moderate perks. Intel is a company filled with very smart people who want to do their best.  However, the company seems to change priorities on a 6-12 month basis, leaving some employees frustrated. This is a fine place to work.  Nice cafe, good managers, lots to learn.  Good work / life balance.  Good benefits.  Lots of really bright people work here.  Top notch talent. They'll work with you to develop your future. They take care of you, and your family beyond expectations. The culture is relaxed and most management does a formidable job. Nothing bad can be say. Keep EVERYTHING you do documented and do not perform work without documentation OK'ing the jobs. Some teams are great, others are junk. Evaluate carefully which team you are joining and what the management structure looks like. If you end up in a good team, there are infinite possibilities. Also, a bad manager can ruin all the good. Make sure that your manager has your best interest in mind. Some managers are good people, but so dull and demotivated that they will become an impediment to your career growth. i worked for intel in rio rancho from 1997 to 2009. at the height of my employment the headcount was around 5500 people on campus. now it is hovering around 1200. they've had layoffs since 2007 that decimated the lives of many past employees. now they have been advertising for manufacturing techs. for the past year. obviously past employees have moved on with their lives and no longer want to work in such an unstable company. The drive and passion from each individual within Intel and their willingness to help those around them achieve the same success was outstanding to see. My internship program could not have been better and I loved every minute of it. My manager helped me to learn new programming language through work (AngularJS). It was very challenging to learn a new language and at the same time experiment that at work. It worked perfectly well for our application development at Intel. Even after I quit after my internship I can relate to those learning days and how that app has come along so well and used across different teams at Intel. In overall the company is good.projects are challengingnice environment and privilegesit all depends what group you work fornice cafeteria with free fruits! I was hired to be a Wafer Tool Technician, however upon relocating and starting the job I was reassigned to Quality Assurance Install.  There was little to no training on this new position and there was no option to turn it down. Intel has a large network of job opportunities. They have a hard time diversifying their product lines from CPU's and servers. They won't use industry standard tools such as cadence and calibre making employees less valuable in the job market. Not as friendly toward contractors even though they use them. The Intel campus is very attractive, and they offer good benefits and pay for an intern. However, there was a lot of pressure to work long hours and the area I was in was disorganized which made it hard to feel like I was adding anything productive to the team. Intel has you set up to always being doing better than your peers. If your not, you could be the next to go. Intel does have lay-offs every couple of years, so you better always out performing your team. Intel is a good company to work for. Culture is ok. Salary and benefits not comparable with other tech companies. Managements are not very bright. Going through transformation at the moment. Don't seem to know how good things are, too much focus on not being strong in mobile.Recently been treating long-term employees disrespectfully, in favor of outsiders coming from mobile industry Work from 8-5 then take a meeting or 2 at night to update counterparts in India.Latest technology for web development.Culture is a bubble.Time zone.Good Cafeteria. Boring and complete disconnect between management and developers. Managers relate to their employees and have little follow up on what employees working on. It didn't work well for me when I moved to Intel Folsom....The company went through so many change in managements and regroup which make the group unstable and many people left the groups. Definitely recommend it to work there if I get a chance to go back I will on same day I will learn And educate myself more to be eligible to work at Intel Typical day evolved through the years which required along hours engaging with customers as well as updating management and enabling teams in meetings.Learning was constant and unlimited on what you could learn from really a lot of people committed to technology. Culture at intel is meritocracy and the hardest part of the job is proving annually how well you compare to your peers in the eyes of management. This is a great company with excellent management. Incredible technology and great leadership. I was part of one of their acquisitions and they are a company that rewards the people that are willing to work like it's their company. The best thing I like about Intel is that it's super easy to network with people and there are so many activities always happening.I like the people are easy and they are support I learned a lot while working at Intel--challenging and interesting assignments made a wonderful ecosystem for a lifelong learner.  However, while the company has a goal of significantly improving diversity, in the 10 years that I worked there little to no progress was made and resulted in a revolving door for those not feeling included! Outstanding place to work .Very close to home . Excellent management. Great benefits. Fellow employees were diverse and experienced. I would really love the opportunity to work there again. Intel/McAfee is a fun place to work at. But they tend to always look for a cheaper replacement. So its not new for them to get work done elsewhere on the globe. That sucks because you may end up loosing your role to some one on the other side of the globe. CompetitiveAggressiveLess work life balanceToo much meetings and alignment between teamsLack career growth opportunitiesNot friendly environment.... Great place to work, I started right out of High School in there manufacturing plant in Livermore CA> That was shut down because it was out dated . I transferred to Folsom and it was the best move for my family. Intel was good to me. Sure it had its stress, but I got to see the world. train employee globally. I learned so much from Intel. I was in the test lab doing 12hrs shifts. It was not stressful as long as you are knowledgeable of how the equipment works and are responsible. Relaxed environment. Smart people, lots of opportunity to learn and grow, cutting-edge tech and a lot of cool amenities like most tech companies. It is extremely competitive, but once you're in, it's a place where climbing the ladder is what's expected. Not for everyone, though. If you need a paycheck and don't mind keeping your head down, then Intel is a good place for you.If you want to be able to affect change with your work and actually solve problems, then it will depend a lot on what organization you are in, but it could be rough.If you're a freshly-minted PhD and they want you to work in the fab, don't do it unless you have absolutely no other options.   Upper management is largely focused on what's best for their division, not the company as a whole. This is a great company to work for.  Great pay, great benefits, and lots of opportunities for job growth.  You get to work with a lot of smart hard working people. Great place to work but Intel IT is not under good management.Lot's of lay off going through so Can't relay on management.But have good work life balance. Job was easy and exciting but management wasn't so great. Two time  I've worked for Intel, one at Octillo site and other at Chandler. Both were completely different jobs, one was production and the other wasn't. All jobs are pretty easy at Intel and a lot of walking. Intel is an amazing place to work - just be mindful that they are continually going through reorganizations. Finding a good manager is paramount. Remember that most people will leave their manager, not their job - very true at Intel. Intel is such a large company with dozens of different product lines.  My experience as an intern could hardly cover the company as a whole.  What I experienced was a very large amount of freedom to explore my own problem-solving methods.  I had ownership of the tasks and systems I worked on, and people depended on me and trusted me to be an expert in my little corner of the company.  I worked with a small team of 8-10 people, and hiring decisions were up to the team leader.  I had frequent opportunities (but infrequent compelling reasons) to work with people outside my team, so my time there felt more like working for a small independent company. Poor Management, rest everything is good.Work life balance is great. Hardest part of job is getting things done on time due to slow movement. Enjoyable part is great people to work. it really depends on which group one is in.  Certain groups would have innovative and creative design environment that is attracting many engineers who are eager to learn and expand their career path Good overall but many bad managers.  overall there are a lot of good people trying to do the right thing.  Many people get caught up in just checking the box type management.  TD engineering create an almost hostile work environment where you can work 20 hours straight and still get yelled at for not completing all your work. I enjoyed working with my bosses. Never a dull moment at work. It's always busy so the day passes quickly. Computer system is up-to-date. Location is nice. Busy but depend on groups and manager.Good learning resources.Deadline driven.Average health benefits.Bonus depend on levels and large group performance. Too much pressure due to manufacturing; the money/benefits are not worth it if you end up in a team that does not act professionally towards each other. This is a great company with excellent management. Incredible technology and great leadership. I was part of one of their acquisitions and they are a company that rewards the people that are willing to work like it's their company. Company has changed a lot since I first started, but Intel provided great opportunities to grow skills, experience and to contribute, if you take the initiative. It's an interesting industry to work in. Intel is filled with A-type personalities so there's a lot of people wanting to do things their way and get all the credit, which creates a less-than-ideal environment to work in for those that aren't a-type. Although there was a Work/Life Balance program, we would also say 'how do you spell Life?  Intel.  Working at Intel isn't just a job, it is a lifestyle that you commit to.  I loved it and it worked well for me.  If you commit your Life to Intel, you will be rewarded and promoted for doing so.  You will grow in your chosen field, they will help you achieve your goals and the benefits are great.  The major risk, Intel is pronto massive layoffs during bad economic cycles which starts with time in the Redeployment Pool, often followed by the layoff during cutback times.  Intel is a great place to work, but there are serious trade-offs. One of their values and often quite true.The company gets confused about how to leverage companies and technologies they buy and they get confused about how to distribute their workforce. served in various roles supporting multiple organizations within the company as a finance analyst, team lead, and then as a manager. The company is very successful and has an excellent rotation program to develop their finance organization. Worked with a team of people who self managed each other by when to take breaks and when people who were out of vacation helped pick up the slack if needed.  Environment was very positive and everyone tries to help each other. Intel used to be great, but their model changed and they treat their employees like a number and not a person.Rough environment to constantly watch your co-workers get slashed just to hire in younger and newer blood. There is a layoff every 2 years Intel was once a progressive, growth-oriented company.  Over the years the corporate attitude has changed and the workplace culture along with it.  There are tremendously talented and hardworking people there however, in my opinion, the management culture has migrated to be less personal and supportive of employees. Working at intel as a contractor was an amazing experience. I was part of the testing team for the Valleyview SOC being developed at intel. It was a pleasure to work with such a diverse and credentialed group of workers from around the world. I can't say enough about what a terrific company Intel Corporation is.  Employees are expected to perform at high levels and are recognized and rewarded for their efforts.  Work/life balance is honored and Intel supports each community with a variety of ways to give back.If you have earned the opportunity to work at Intel - take it, run with it and never look back! The company is very top heavy and as an engineer you will reach a point where you are either waiting for someone to retire to have career opportunities or you change to a different organization which usually requires throwing away your expertise and starting over again.  Salary starts off good but then begin to stagnate after 10 years which is a good time to look for another company to work for. Collaborative And fun to work with. Colleagues are also kind. I like the way company treats its employees and had a good time working there. Wish to have many success in the future. I believe the high-level management and human resources are trying to improve the diversity conditions. There are good hiring practices however, retain is an issue.  I have experienced during my career cases of bias, unfair treatment, etc. There is a lot of room for improvement to make some organizations to retain their diverse force and employees.  Middle managers and directors have to be not only educated (many policies are trying to correct this) but, properly audited when employees leave to understand why certain groups are not able to retain their general employees, minorities or women. Retaliation policies should be guaranteed with audits and not taken for granted since company policies are not always executed as they should. Many managers are using review cycles as a way to retaliate against employee when employee is trying to change jobs. intel is a great place to work,very fun to work with great people.employees were treated professionally,and they had open door policy. company was given out profit sharing,bonus, This position allows me to enrich the lives of those who normally do not know the difference between an AMD processor and an INTEL. Education of a product is the key to entice the minds of those who normally would not buy because they lack the knowledge of what is being presented to them by the INTEL Rep. A typical day consist of Checking your Inventory to make sure you know what's available before the client asks questions about it.What I've learned is the INTEL technology trend and how it has benefited technology along the way.Management for both 'store' and 'Agency' is nice to work with. The more you know and able to present it...the more sales to be made.Workplace culture is fantastic. You are working with all cultures which is a great learning experience to see how other's relate to customers.The hardest part of the job I would say...is the frustration behind going after a client in the store who is absolutely 'not interested' in what you have to say or sell to them...only when they are ready.The most enjoyable part of the job is the feeling behind leading a person to made an educated choice on an item they had no interest in at all and not only do they now BUY...they buy based on the clear understanding of the advantages the product will give them.That's a great feeling and you feel as if you're position has value to it. Intel base pay is low, but makes up for it in 4 quarterly bonuses and 1 annual bonus. The also provide you with some golden handcuffs. Each year, you are given x shares but vests over 4 years. There is no 401K matching, but Intel will contribute x% yearly of your total compensation. This will vest over 5 years. Benefits are great, compensation is also great...if you're looking to coast. Not a great place to work if you're a millennial looking to hustle and move up or quickly. Career advancement is slow and very political. Intel has changed in the last few years from a company that cares about products and production to one which is more concerned about quarterly reports and short term savings. Great place to work and great people. People from all over the world was cool to work with so many different nationality's.I was promoted and was looking forward to years of a great working career. But the lay offs killed that idea. I can honestly say that I wouldn't be in a better place without the training and day-to-day operations I learned at Intel. Great workplace culture and multiple opportunities. The hardest part of the job for me was crafting a brag sheet every year during Focal in the 3rd person. Most enjoyable was team building events, Quarterlies, traveling to other Intel Locations. Intel holds high expectations for employees, but compensates fairlyThe work is fast-paced and challenging.The environment is very open, and collaborative This is a great company with excellent management. Incredible technology and great leadership. I was part of one of their acquisitions and they are a company that rewards the people that are willing to work like it's their company. Management had hands-on experience and all the time they are developing the employee.  Data is the driving motor of the Organisation and everything must be documented and analyzed with data. Management is more concerned with precision than accuracy. This waterfalls through the whole organization. This means getting on the boat late.  E.g. Intel didn't think the Internet was important until 2000. Great company and great place to work and build career. The most enjoyable part is access to plethora of resources, great career prospects, unlimited advancement happening everyday and great talent pool. Disclaimer: I'm not sure if I ever integrated into Intel culture during my nearly 4 years there or I ever truly embraced corporate culture. I also no longer work there.Typical day: Wake up, try to get to work on time. Try to make the meetings on time for our daily scrum. Get into meeting, have another meeting with teammates later to go over requirements that we need to implement. At least two meetings a day ranging from 1 hour total to 2 hours a day.  Worst case during the busy periods we'd do 3 hours a day. Nearly half the day gone on just meetings and the rest left for full stack development work.I learned to manage my time better, to redirect work or say 'I don't have the bandwidth to do it right now can I get help?'  I learned that there, I needed to do whatever it was to get the job done.  Deliver something and work out the kinks later.  I learned that work is not everything and that I should take the time to appreciate things outside of work even if the business unit culture I worked in didn't truly embrace the idea.I learned that collectively the people that work in a business unit form the culture and the overarching corporate values only serve to influence or guide us. Sometimes the cultures are rough to digest, people strung out all the time or yelling at each other. Maybe they were more worried about yearly performance reviews than I was. I only cared at minimum about delivering a satisfactory.The hardest part was dealing with all the 'negative energy' from people in the business unit.  All the stress, all the 'if it works don't change it'  mentality, the yearly performance reviews that felt emotionally draining, the constant 'fungibility' of job role switching that was encouraged to 'get the job done.'Most enjoyable part of the job for me after the first year: The benefits, the work experience and the pay. They got sued, and lost, a few years ago for hiring H1B visa candidates in order to suppress wages. This is a prime example of the anti-worker culture at the company. Good luck getting support. Pros:- Lot of projects to learn and work with- Good pay rate- Work life balanceCons:- Too much time in meetings and emails- A lot of politics good for beginner  It is not for senior engineer, too much restriction  not much freedom to do the work, But it is good for new graduate lots of methodology to learn. Your going to work very hard not for the lazy people. Most individuals are type A personalities. The evaluate everyone against their peers. They are very much about the bottom line. I had two internships at Intel. You might love or hate your job depending on your team and the projects. Overall, I had a positive experience and would like to go back to Intel. As a Technician, atmosphere was generally relaxed to slightly competitive over-all. Corroboration was necessary since equipment components could be large and PM/ repair needed to be highly effective and efficient. Management varied, but the over-all culture was one of encouragement to learn and be excellent, so if expectations were not met, it could get stressful if learning did not go as well as management expected. Enjoyed my time working at Intel.  Good pay and excellent benefits. Poor Management over the past few years has made the work environment toxic and has brought down employee morale. My overall experience at Intel was good. It was very fast paced, and I was never, ever bored there.  As a contractor, I was given many opportunities to showcase my skills. A pendulum is the best way to describe management. About the time you implement what they wanted last week it changes. Projects became a popularity contest where employees would run towards projects that might gain the most visibility whether they added value or not. Intel is an amazing place to work - highly recommended!  The employees are all very intelligent and educated and make for an excellent work environment.  Compensation packages are competitive.  Work is all-engaging. By far this was the best company I have worked for and the best environment I have worked in.  The culture really does seem to revolve around its employees, which is rare these days. •	Selected by senior management to be the core Lean Administrator within manufacturing.•	Saved $82M annually by introducing quality control specs into the reticle process.  Conceived the idea, designed the documentation and taught the process to the Quality Engineering team.•	Reduced a single technician’s steps by 13,000 per day and costs by $235k/year by recommending process improvements for resist bottle changes.•	Improved the team’s safety by 20% through direct observations and recommendations.  •	Provide a voice for technicians by utilizing constructive confrontation to resolve conflicts, escalate issues as needed and improve team morale, alliance, and trust.  •	Managed quality events for the area, conducted direct observation activities, wrote improvements and performed the 5-WHY principles       •	Increased productivity and safety improvements by 47% by engaging the Team in Lean Improvements and assisting members to deliver results. The teams are very competitive but the work is very interesting and you get to learn on a daily basis, The team work could be better and the interaction with managers could be improved too. work is dynamic. constantly change the direction and focus. management changes frequently also. new technology, new thinking, new skillset. i want a stable environment with career advancement. Intel is a challenging and professionally rewarding workplace. It's well managed and well positioned for future growth opportunities. You can expect to grow and learn new things and there are many opportunities to advance. Poor Management that leads to frustration and good people leaving either the team or the company. The experience is very dependent on the Head of the Team so the generic Intel culture does not trickle down. This is a great company with excellent management. Incredible technology and great leadership. I was part of one of their acquisitions and they are a company that rewards the people that are willing to work like it's their company. You have the ability to create and grow tour job. Very good support for entrepreneurial  spirit.Company's technical capabilities and innovation are unequalled. The management wasnt all that good it was a couple issues with pay checks. somehow my taxes was messed with when i didnt even go in. Clean room environments are always good places to work it not too loud and everybody is on task. I enjoyed working there lots of communication and outstanding team work. This was years ago, it would not be fair to try to recall specific details.  Intel was a good company to work for with wonderful benefits.  It was a difficult decision to leave the company but being able to start my own business won over. Poor Management that leads to frustration and good people leaving either the team or the company. The experience is very dependent on the Head of the Team so the generic Intel culture does not trickle down. Worked in the Technical Assistance Center (TAC)job was to provide technical support to Intel employees wordwideremotely connecting to their computers as needed to perform tasks necessary to resolve issues.Recreating network profiles as neededgeneral troubleshooting Good learning experience. Exposed to lot of new technologies and tools. Attended several training and great source of wiki available. Colleagues and manager are very supportive. Great Place to Work was promoted and enforced.A busy and fast paced work environment that rewarded its employees for their hard work, and recognized members of the team. Working at Intel was a great way to break into my chosen career field.  What I did not expect was the number of employees on the FAB floor at any given time.  There were hundreds of us there, getting into each other's way and sometimes even making it difficult to get our jobs done in a timely manner. Intel is an awesome company to work for if you're passionate about hardware, or if you need stability.  If you want excitement though, look elsewhere. neverending meetings and emails and change that password on those 3 different email accounts but they can't be the same as any other password or the same as a previous password and must contain one letter, number,symbol........don't forget to hold that handrail on the stairs or you could get written up. seriously. Typical day:1) write code2) get demos ready3) investigate new technologies or methodsManagement:varies greatly depending on where you areWorkplace culture:Very driven, but very collaborativeHardest part:Not always believing in the value of what you are working onMost enjoyable part:Successful demos of new solutions, approval of demos for the next stage by management Cant go into this as I signed a non confidential agreement. All in all good benefits long lunches, safety orientated. Intel rules are great but depending on manager could leave things desired. Very limited career advancement opportunities. Workplace culture is not positive. I do not enjoy coming to work because I do not feel valued and adequately compensated for the work that I do. Intel Labs Europe have some really smart people. A lot of management and a lot of big company process which can slow things down. A good manager who can help you move past this is key. If you get a good manager, its a great place to work. A bad manager, and forget it. Intel has been a great place for a long term career.  Compensation is adequate and there are many opportunities for advancement and learning in new areas. Intel Finance is a competitive but helpful environment. The teams are very high performing (for the most part) and are quick to join other teams to solve cross-organizational problems.Advancement is difficult and expect 10+ years of rotations before being eligible for a management role (even with an MBA). Recent layoffs have flattened the organization, but also created a logjam at higher grade levels. I worked for a subcontractor and the pay was not as good as an Intel employee.  My benefits were based on the subcontractor.  There was not an opportunity to become full time under Intel. Employees at Intel- Make Intel a Great Place to Work, that is why we stay and the Intel provides great health benefits. The job, in manufacturing, is stressful. You are on call at night and the weekend, you are filling out forms, in addition to trouble-shooting and it is always needed now. Intel is always changing and if you do not change quickly enough, you become a liability and you become tired. The question from managers is never how can we help you succeed- it is more like Why can't you succeed. The culture, if you are lucky is great but if you do not mind the hours, losing time with your family and always under the microscope then this job is for you. They treat their employees like cattle and have no interest in making the employees have a life outside of work.  I found the management to be mostly focused on deadlines with little regard for the workers. Large company that presented lots of interesting work opportunities across diverse cultural backgrounds. Learned to maximize operational efficiencies and deliver great results across many manufacturing areas. This is a great company with excellent management. Incredible technology and great leadership. I was part of one of their acquisitions and they are a company that rewards the people that are willing to work like it's their company. If you like fast paced, innovative, challenging work while having work life balance, career growth and being well paid, then Intel is a great company for you. Was a fun and financially pleasing internship. I learned a lot of group collaboration skills and made a lot of personal contacts during my time there. Corp Culture of methodical, data-driven approach to problem-solving and product development.     Many great tools and processes  to facilitate working across organizational lines.      Strongly enforced policy of meritocracy while also rewarding teamwork. Was a good place to work but felt pressured to take a separation package even though I had an extremely good work history.  Do not feel they care about their individual employees as they often boast. Good company overall. The compensation at the tech level is not adequate for the workload. Focal reviews were unfair and disappointing, which leads to no incentive to work hard. In fact, overachieving is frowned upon because if you do not beat previous years achievements, then you will not last. I overachieved, and got an average focal....lose lose situation. I do not have access to any of this information as I am a contractor.  Working as a contractor is tough as I do not have access to things I really could do for the company.  I get it . While working at Intel many people were ready to throw me under the bus to keep their jobs, I had to train myself on many of the actions and job roles I had there. The ONLY redeeming quality was working the 3 days on, 4 days off, 4 days on 3 days off (12 hour shifts) allowed me to have twice a month a 4 day weekend. A culture of paranoia and fear prevents capable people from doing their best work. No one takes responsibility or makes decisions. Everything must be decided by some ad hoc committee or follow some 'by the book' 'plan of record'. Initiative and creativity are stifled. Not always the best, but a good place for a career. The work pace can be hectic and interrupt your work life balance. The company continues to grow and reduce headcount. The culture in Folsom campus was challenging.  The company was wonderful however, the Folsom campus wasn't a live place to work. People weren't cultivating. Working in IT at Intel is stressful.  Constant reorgs and threats of being laid off every year!  Intel is a good place to work if you are in one of the product units.  Avoid IT. I truly miss being a FTE. No matter CW or FTE, I always give Intel my all.  Love Intel.  I would love to work once again for Intel. Best Company I have ever worked for! Intel is a great company to work for and I would recommend working at Intel. There is a lot of OJT and tools/resources are readily available to ensure you are successful in your role Intel provided the best training experience of my career. I took advantage of their extensive and intensive in house technical training courses as well as instruction in supervisory skills, public speaking/presentation skills and work/life balance initiatives. No work life balance, I would work about 60 hours a week and required to be on call as well. I was unable to NOT think about work during my time there. Intel is an intense, competitive company to work for.  It's great to be part of a company that is on the cutting edge of technology.  Highly recommend jobs at Intel. Busy from start to end, 1:1's w/manager, check calendar for meetings, set up meetings, travel arrangements, etc.Learned from the classes I took such as ERT (Emergency Response Team), ERGO (Ergonomic training)...Management in my group was caring, sensitive and had a good understanding with employees.Great place to work, had quarterly team events, volunteer opportunities.Most enjoyable part was working with the employees (our group), a caring bunch of people who offered help if needed. I was able to create new job positions for myself by identifying gaps and creating solutions; this only works at Intel if you can find someone high enough up in the food chain that cares about the problems and solution you are offering. I had over ten managers in 12 years, and most of them were only a step or two above terrible. If you are hard working and you like to experience new challenges and new skills Intel is right place for you. They have diversity and smart people. Also free snack. This is a very demamding environment yet the chances to learn are huge and if you  like challenges of that nature, you will be thrilled to be part of the organization. This is a great company with excellent management. Incredible technology and great leadership. I was part of one of their acquisitions and they are a company that rewards the people that are willing to work like it's their company. At Intel, results are the only means of measurement that matters. Expect to provide operational results or be cut from the production line as soon as they can find someone else to fill your position. There is no excuse in their book as to why a goal cannot be met, regardles of outside influnces. Good place to work.  Good benefits, good people to work with. Long shifts (12 hours) though.  I like having 3/4 days off per week.  I was able to choose day or graveyard shifts. Good and productive work place. Collaborative, competitive and good work life balance. Good compensation, quality of work needed is very good. Learning is significant. Intel can be a great place to work. I learned a lot about microprocessor engineering while I worked at Intel. I worked with a whole bunch of incredible engineers. While I was a contractor, I was on a New Devices Group team, and really enjoyed the culture and environment. Intel periodically tries to purge out excessive levels of contract employees, only to wind up hiring more, but if you get on one of the teams, it can be really fun. I worked at Intel as an intern, but even so I found myself working outside of work hours. However, your workload depends on your manager and unfortunately I got I a very strict one. Used to be a company that encouraged new and innovative thinking.  Now it's a place to become a VP and have many employees only follow you down a path.  Free thinking is not encouraged.  Reviews are set up to targets for the next layoff.  People are very territorial, as if someone else can do their job, they are at risk in losing it.   Soon Corporate Affairs and Foundation work will be eliminated.  Engineers can thrive here, others should move to another company.  Sad times for this former leader. It is difficult to rate a department that no longer exists.  It was a great team while it lasted.Presently I'm working in the Corporate Affairs Group in H/R. Intel is a somewhat stressful place to work with a big emphasis on creating disparity within the employees. They expend an enormous amount of management effort to pull people into low performance bands to hit arbitrary quotas. During review time, employees are highly encouraged to say negative things about their peers to give the management some ammo to justify bad ratings. This tends to create a culture where cooperation is difficult. If management would focus instead on treating people fairly and working to mentor or help those with low performance instead of trying to brand good performers as poor performers, Intel would be a respectable place to work. Nice team, Good culture, Enjoyed my experience, learned a lot, lots of great activities in the office, great place to work, great cafeteria, learned a lot My manager is uneducated in the field. Other better-qualified peers could have been named/promoted to the position. She is void of substance and ethics. She plays the political game well but not someone who anyone should trust to do the job right or on time. I have no response, at the end of my career I was in a Hostile work environment and I was mot able to report any hostility I was risking my job and future at Intel, so I left my job. management lays off people right before Christmas to get an extra bonus for lower head count.. they call it lean manufacturing but actually means they lay off full time workers and hire temps to get trained to do the job.. then instead of hiring those trained workers they kick them to the curb and make the full time perm.employees train another group of temps again and again.  This is not the Intel it used to be... thanks B.K. Compensation; benefits; freedom to come and go as you please as long as you get the job done; lots of different job opportunities with a company so big. Tons of smart people to work with and no lack of money to complete projects. Felt they did TRY to make life good for engineers but the nature of the beast is just 24/7 go-go-go-go and that will never change. It's too expensive to have down time. Intel really takes care of it's full time employees - stock options, very generous bonuses based on company performance, very flexible schedules, free coffee, fruit, etc., and a long list of other perks. Contractors are locked out of all of this.  They can't even post comments on the company's social media and are not allowed to participate in many company functions. I worked at a startup and it was acquired by Intel. Part of the acquisition contract was that the Softcom Employees would be integrated into jobs at Intel for at least 3 years. Intel gave me a great job skill that can be used anywhere.  I received a lot of training and traveled when it was needed. I was able to finish my college education while working at Intel. Very much the title summarizes it. Company lack the direction and vision. Management lack empathy. Diversity program was a marketing stunt.. there was really no intention of becoming a fair employer. Provides optimum exposure on how different specifications came into existence based on changing needs of computer peripherals.Focusing on actual hardware based activities gives better returns on effort spent. Everything is so automated that new employees have no idea where  to get the tools to get things accomplished for their job or personally. There is no employee feedback for management so they aren't accountable for their actions or outcome to those employees.The general statement around town is that Intel doesn't recognize how valuable your past performance has been, there is no research in to 'why' an employee's performance may have waned,  it's all about 'What have you done for me lately?' This is a great company with excellent management. Incredible technology and great leadership. I was part of one of their acquisitions and they are a company that rewards the people that are willing to work like it's their company. A typical day was reviewing data from video driver tests from spreadsheets and seeing what the issues were and how to fix them. I learned quite a bit about video drivers and how Microsoft certifies them. Also the different ways that videos are composed such as how the interlacing is and is it top to bottom or bottom to top. All these things can affect how changes to the video are rendered on the system. The management was ok explaining what the goal was and how to get that done. But when I was there the company was going through many transitions and laying off many people and closing some of the buildings. The team we were on was not a money maker for the company so we were always in flux about how much the team is needed. The most enjoyable part was the people and working on new interesting things. The hardest part of working there was just the way everything was in flux for the employment. The position was not that difficult of analyzing the data but the stress of actually staying late and not being paid many times was not good. If you have the ambition and fortitude to survive in a fast paced Type A company, Intel is for you.  You must possess high energy and drive, the internal competition is fierce and review cycles brutal.  The pay is competitive and benefits excellent.  The sub cultures vary across departments/divisions, there is something for everyone.  Intel provides fun and interesting extras for their employees such as event tickets, hosting various activities and events, and discount programs. Intel is a money making company and has no loyalty to their employees.  They lay off employees that have worked there for over 20 years just so they can bring in younger employees.  No criteria is set just laid off because. Aside from that they have you sign a waiver stating that you're not eligible for rehire and if you don't sign it you don't get your severence package. You're not even allowed to return as a contractor.  This makes it very hard to seek another job as one of the questions asked when employers call for a reference is, are they eligible for rehire.  Well that sets a question in mind when Intel says no. Challenging and competitive environment at a crazy fast pace. Results and assertive aggressive problem solving are essential. Collaboration and open teams where ideas get challenged and tested. Do not wish to respond, all answers to all questions null and void.I would rather speak to people in person about my time at Intel.This is not an accurate representation When I started at Intel, Intel was the epitome of an amazing company to work for. It was fun, they really appreciated their employees, and rewarded them handsomely. Fast forward 20 years and it is all about the bottom line. Fun workplace. I like the office hours schedule. Flexible managers, easy to get along. learning new things everyday. Challenging task to make you successful. A typical day at work involved operating and maintaining critical HVAC systems supporting production, working with vendors and other teams like construction and safety. I learned a lot about wet side mechanical cooling systems. Management was good overall. The work culture is fast paced, you are required to be on top of things, the work life balance is not very good. The most difficult thing about the job was being on call. The thing I liked most about the job was operating various HVAC systems and getting to learn about them in the process and working with vendors and other teams. When I started working for Intel it was a place where people had pride in working for a company that made amazing things possible while looking out for its employee's best interests. It was a time when employee morale was relatively high. In the last few years under BK things have been shaken up which has resulted in success for the company but employee morale is extremely low. I think that Intel can find a way to be successful while caring for its employees but that will probably not happen until there is new leadership in place. It's a pretty rigid place - after all, they make chips. Their values include things like integrity and collaboration, so those sorts of things are really really strong there. If you don't mind having a lot of structure, it's great. If you thrive in structure, it's awesome. There's a lot of flexibility in some of the orgs and a lot of opportunity. I had the misfortune of being in an org that came to be very political, and my job was kind of redundant because of the senior fellow who basically ran around convincing various VP's to sign up for commitments before the planning got done. It saved a lot of time, but it left a lot of annoyed people in the wake and my job was smoothing things out. Benefits are amazing they take good care of employees, but the sacrifice is great on your family/work life balance. Heavy price paid to stay employed. Intel has a weird work environment and culture.  While the engineers are all very awesome people, the people in the non-engineering departments are challenging to work with. Hours in the design team are flexible and it is possible to do much of the work off site. My team had great technical support and many opportunities for further in house training in design methods and engineering applications. Meeting aggressive deadlines required excellent communication with team members and timely feedback to management. Long hours and very competitive. They have a great culture for the new hires out of college. They tend to have layoffs every few years. That alone was very stressful Good benefits but now career advancements. Ready to put at least 12 hours a day without any work-life balance. Management does not care about employees at all. Employees are treated as a machine. Good opportunity working on the advanced technology for microprocessor and SOC products.  Good benefits and stock option plan. Long working hours averaging 45-55hours per week. Position to develop thermal solutions using numerical validation. People are friendly and eager to help. meetings are constructive. management is easy to reach Allowed virtual work, small and close knit work teams working from different time zones. They also had a good work life balance. They would encourage you are good at/. Lots of opportunities for those who are willing and flexible to try something new.   Easy to work all hours to stay involved with discussions/decisions happening in other time-zones/geos.  Note that the extra hours are considered 'part of the job', particularly if you want to advance.  On the whole - excellent coworkers & excellent benefits.   Environment can be stressful. The best part about working at Intel was the opportunity to learn from smart colleagues.  Sharing was encouraged, and my lead was fantastic--hands off, but always available with a pearl of crucial insight. This is a great company with excellent management. Incredible technology and great leadership. I was part of one of their acquisitions and they are a company that rewards the people that are willing to work like it's their company. Intel always was a very isolated place. Surprising for a technology provider that depends on other OEMs to integrate their products. They completely missed the boat on mobile because of this. I worked for Intel for 13 years and had many opportunities to advance and shape my career. They offer great benefits and you get to work with some of the best and brightest mind in tech. very good company to work for. 3/4 days of work per week.with 12 hours shift every day. I was working night shift and had a very good supervisor. the hardest part of the job were FAB excursions and the easiest was failure analysis. Great place to work, lot of talented people surrounding, it's really a good learning experience to see how the people interact and have strong technical discussion. Intel was a great company to work for.  Fab 17 sucked.  The management team did not adhere to the Intel culture.  Communication was guarded, upper management was defensive and deflective with information. The site was in a constant state of cost reduction. Upper management flat out lied to employees' specific questions during MUMs, BUMs and FUMs.  This was unfortunate given that other sites were a joy to work at.  Fab 17 shutdown in 2013-2014 and is now a design/development facility. Most of my design work at Intel was 'design by committee'. They had  very strict guild line and methodologies that where heavily enforced. Many design reviews. Wonderful team members in a clean environment.  Opportunities for growth and learning new skills.  It is the best place that I have ever worked because there is always something new happening. Working conditions are generally flexible, but management is not always adaptable to your needs. It's generally easy to get along with most of your colleagues, but the annual review process involves ranking you amongst your team members, which hinders collaboration.There are plenty of interest groups available for you to find colleagues to connect with, and it's a very social company. However, management culture and policy could use an overhaul. I worked at Intel for 20 years.  Made great friends, learned many things, grew in many ways.  I liked the respectful culture we had at Intel.  Respect for the job, the people, the company and respect of oneself. Intel is a cutting edge technology company so provides an environment with a constant learning culture. It also provides opportunities to be in multiple roles I started with Intel before the building in Riverton was built in 2000.The HR and managers really lived by the company values and were excellent mentors.We worked hard but could play hard as well.They cared about their employees and always offered additional training realizing everyone learns in different ways.I had the best 10 years as far as my working life for Intel, unfortunately the bubble burst and sadly they left Utah. Excel sheet driven management decisions. Numbers are predetermined and whichever criteria allows them to get to the number, they use it. Lack of transparency between all levels of organization. Able to tackle new projects and learn new technologies very often. Collaborative work environment. Management is inept at times and not great at communicating. The company is a great company to work at.  Unfortunately the manager I have is quite a challenge to work under. Intel is expanding it's product base and changing their direction which opens up opportunities for employees to grow. No training program to get the 'ball' rolling! They say you're on your own,  but seriously lack training infrastructure. Have to figure out what's happening to understand the overall processes. Intel has some really smart talented people and great products, the only down side is that employees are forced to compete with each other and they hire and fire employees at the drop of a hat.  Expect to work hard and always be in a position to defend your worth, managment will change a lot and you will often need to reintroduce yourself and your work to new managment and a changing org enviornment. As an intern, I have learned a lot about software and hardware testing/validation and networking protocols. I have also developed great programming skills. A great job with a cafe in the building. A lot is expected of you, requiring you to balance multiple projects at once, and to deliver high quality work. A great social environment, with work parties and social events happening at regular intervals. An overall good place to work, even as a contracted worker like I was. There is a cafe in the building, only a short walk away from most places with GREAT food. There was a good social environment, with occasional parties and events. A lot is expected of you, so don't think you can slack off. You will always be busy, balancing multiple things at once to make sure to manage your time well. Intel was ok but since I worked for a Temp. service while working there I didn't have a chance to actually experience all the benefits of such a great company. I worked through Kelly Services and they were very disorganized and they didn't care about their employees whatsoever. This is a great company with excellent management. Incredible technology and great leadership. I was part of one of their acquisitions and they are a company that rewards the people that are willing to work like it's their company. You will learn and benefit a lot from the company. Glad i was able to start my career there. It gave me a good understanding of what to expect while in corporate america. Safety first and reliable employee who pays attention to detail. Careful process therefore minimal scrap of product. Always a team player and always willing to assist in other departments. A lot of bureaucracy, constant change in priorities.As a software engineer you may feel like a second-class citizen at Intel. You job requirements may change at any moment. Good place to work and really liked the way team was working.Not that great pressure and always seemed nice to work there.Lots of on campus perks available. o	Management of HVI (high value inventory) developing infrastructure to maintain CPU traceabilityo	Manage daily operations and execution of material to internal and external customerso	Provide Focal review assessments for my team to senior management o	Responsible for quarterly and yearly budget to sustain operationso	Hire contingent workforce to support product “peak” times The last few years, Intel has been scrambling to re-invent itself as its primary market, PC / laptop processors has morphed with the rise of smart-phone use.I believe they are successfully making that transition but the groups that I was part of were not the chosen priorities. They also have been freezing hiring so transitioning was no longer possible.I am seeing new positions posted so it looks like management believes the transition has been successful. That gratifies me because my time at Intel was one of my favorite jobs in my career. Great collaborative environment. The pace is proactive and 100 mph. Solutions happen daily! Management is always available for guidance. I would definitely go back. Working at Intel was an incredible experience and as a student, I learned far more there than in a lecture hall. I was given the resources to innovate and this gave me the ability to grow as a programmer and become not only better technically, but also in my ability to work within a group. I highly recommend it to any prospective interns or workers. The compensation and benefits are good.In terms of work life balance, career development, and some company culture, it certainly has room for improvement. I enjoyed my time at Intel, however, it seemed as though Intel never had any interest in developing our group's products.  They basically let the product go as long as they could without any investment and then closed the business unit once keeping the service going was no longer tenable. Great work-life balance and casual atmosphere. Professional and friendly coworkers. Good compensation and benefits. Top notch research on the latest and greatest technology, innovative. Great people, benefits and perks! The atmosphere is amazing and its nice to know that everyone you work with is smart in their own way and worked hard to get into their own field and the building in general. Very cool knowing you work for a company that pioneers in tech and has chips in just about every computer int he world! At Intel, I was able to work in the Human Resources Department and figure out what type of work I wanted to do in the future. It was a good way to get into the job world as a high school student. Intel - is a great place to work if you understand that you are going to get paid based on your performance.  For those that don't put in the effort will not be considered for continued employment or advancement. This company is a fine place to work. Typical day is 8am to 6pm.Management is management.Culture is standard. Employees are happy to work at the company. I had the opportunity to design pentium, i3, i5 and i7 chips.  The work was challenging and I really loved the work.  There was a culture change my last 5 years that went in a direction I didn't agree with which resulted in high stress. was a good place to work. Fast pace environment. This company had great benefits. The people that were working there were there forever in parts of the company and had been set in their ways forever, however were learning new ways as new people came into the departments from other companies. Overall it was a good job. A typical day was to arrive for a pass down meeting and pick up where the last shift left off. The only time it was stressful is if a tool went down and production stops and you might have to try to fix it real fast while engineers are constantly asking if it's up and do their wafers first. Working at Intel comes with many challenges (professional growth) and many benefits (medical, dental, 401k, stock purchase, discounts, and culture).  Most teams are fun and encouraging with a strong dynamic. Leadership is flexible and encouraging. Owning your own training is recommended. Don't be afraid to learn at your own pace. Fast pace office environment with high expectations of productivity,  Because of that the Health Centers and gym with various classes throughout the day are very beneficial. This is a great company with excellent management. Incredible technology and great leadership. I was part of one of their acquisitions and they are a company that rewards the people that are willing to work like it's their company. Intel is a great company to work for providing lot of opportunities in different fields. I learned a lot about agile, lean processes interactions between different engineering groups to deliver a product. They have open door culture where management takes feedback from employees on a regular basis. Learning is fostered by providing lot of internal training opportunities. There are multiple avenues for employee mentoring. Overall Intel was a good place too work, but the biggest downside to working there was that it is a very large company which makes it a little more difficult to make changes or get things done.  They have great benefits and bonus plans. Over all,  great place to work . Good benefits and time of paid with sabbatical every seven years. As a senior technician , skill bike yo and is well paid. Great place to work.  Pay and benefits are great.  However, Intel has over 100K employees and not growing as fast as it once did.  Opportunities for advancement are limited. Monday - Friday and 8:00am - 5:00pm. Lab environment. Management is flexible, assignments are per project's priority.As a contractor my fun was very limited. In spite of all that, I had my fun and outstanding performance per my contract terms. Very busy place with constant changing priorities and standards as well as procedures constantly changing.  Required constant focus due to all of priorities. Good pay & benefits but you earned your pay as very tired by end of work week. Very stressful, No guidance for new comers, Location is rural, Too many people, Manager doesn't care. Lack of training equipment, Unable to change job profile. Intel culture does not empower collaborating... The focus on costs creates high level of job insecurity. Enjoyed all my co-workers. Trust issues with the executive leadership This company is determined to go overseas and shaft the American worker. The managers are out to fire anyone with high pay or long term experience.  This company does not have a future. Working environment was great. Projects were interactive and changing in a positive manner. Best tools always available to complete work taskings. Management always very supportive. Intel is a good company to work for. The environment can be very competitive where each team member is supposed to figure out a way to outdo their fellow team members in some way by the end of each year in order to be ranked successful. The yearly review process is unhealthy and needs to be abolished similar to other large companies. The hours offered for work are extremely fair, usually consisting of 12 on 12 off for three days a week, and four the next week. Night shift employees are also offered extra compensation. My typical day at work is checking and answering email, checking mail, taking care of tasks/requests, placing orders, checking office supplies, answering calls.I have learned so much, time management, working well with others, understanding cultures, policies and procedures always room to grow and learn.  I managed office supplies, setting priorities, company credit card, time management, people management.  Intel's workplace culture is relaxing, non stressful flexible hours, being able to work from home as appropriately needed, great open door policy.  The hardest part of the job was leaving to retire.  The most enjoyable part of the job is working with great people, having a great boss, being able to work independently  always learning, great benefits. Embrace multi-cultural environment. Good place to work good benefits, and stock options but poor raises and salary compensation. Overall all my 20 years have been a good experience expect for the Big lay off in June of 2016. Very exciting work environment with costant changes.Huge work load and expectations of working long hours to delver products.Cut throat work envirnment. I did a little of everything.  I worked long hours and was in constant communication with my manager and our TA.  Heavy scheduling for the manager.  Event planning for our group. Ordering supplies.  Handling legal docs. Hardest part of the job was working the long hours.  I would be online early in the morning until late at night. Best part of the job was the people I worked with and the culture. The company is great to work for and has high standards. The teams that work there are willing to work with you and willing to teach you things that you have never seen before A lot of walking and mandatory overtime, No down time or perks, just don't miss work or want to take a day off.  You are asked to work non stop and are frowned on if you don't. If you tend to work more than 8 hrs a day at your job, then Intel might be a good fit for you as most employees work beyond the typical 8 hrs a day. If you don't like working after you get home for a few hours and more than a few hours on the weekend, then don't work here because all your coworkers will out pace you and you'll look like the lazy one. There's a strong corporate culture here geared towards many things I admire, such as striving to continually improve and innovate, not resting on one's laurels just because something is going well (let's *keep* innovating in other words) and to be willing to take risks and work hard to achieve new things. I enjoyed many things about my time here, but overall, it was intense to work with so many workaholics. All that being said, I left the company several years ago and perhaps the culture has softened, but I don't think it has. Working at Intel use to be fun and rewarding. However, with changes over the past several years, it has become grueling hard work with limited resources needed to get the job done This is a great company with excellent management. Incredible technology and great leadership. I was part of one of their acquisitions and they are a company that rewards the people that are willing to work like it's their company. The lack of support from mgmt for retention of employees and lack of respect for the engineers/technicians who completed the work that was necessary are severely lacking. Other Intel sites may be different but both the Occotillo site and the Hillsborough sites push people to the limits and people are leaving with management not caring. Intel is a great place to work, all employees are treated at the same level. The work culture is the best, lot of experienced people around to always help and guide This was a relatively secure job but I craved intellectual challenge. There was opportunity to get promoted but not much opportunity to get to a more challenging carreer setting. I enjoyed my time with Intel. There were plenty of people that wanted to see you excel, and who were willing to offer their time to make sure you did so. Interns are given meaningful projectsChallenging workExcellent team cultureSmart and collaborative peersGood leadershipGood learning experienceheavy emphasis on innovation I worked in the capacity as Construction Superintendent for Turner Construction. Intel was a client of Turner Construction. I managed interior fitment and upgrading of Intel's offices. Every morning come to the office at 8:30 am.The kitchen is small and not well stocked. Colleagues and the work environment are wonderful. Leave the Office at 6pm. I would strongly recommend Intel as a place of employment.  Management is very engaged and ties the work of every employee directly to corporate and organizational goals.  Intel strives to create and excellent place to work for all employees. Intel gives employees a lot of responsibility, but also the freedom to take informed risks,and make decisions at lower levels within the company.   There are lots of opportunities to move around and try different roles and functions within Intel, and the company promotes heavily from within.   Intel rewards employees well, with recognition and financial bonuses. Annual reviews are competitive, with employees ranked against their peers, and an expectation that a % of employees who rank at the bottom of the list will receive a 'needs improvement' review.  This process can be cut throat and harsh; managers that are very assertive do well for their employees whereas timid managers do not. we start morning meeting. then we assign a task for each member Intel is a big and great place to work in and company to work for.they value their employees.I spent over 5 years with them and had a great time Good startup kind of work culture. Fast paced company and employee friendly. I will definitely recommend this company to any job seeker. I would strongly suggest to negotiate salary. As a Product Engineering Manager, I was responsible for helping high valued customers to meet their hardware architecture and performance (timing, latency, and throughput) and solve technical issues at different design stages (development, RTL freeze, PnR, taped-out chips). Solid Company. Good Leadership. Good work / life balance. Lots of innovative projects. Lots of development opportunities. Engineering driven company. Good pay / benefits. It's a great place to work.  Just hope Intel can stay relevant as time goes on and the PC becomes less and less important.  CEO is more interested in political antics than leading the company toward something. Lately there seems to be a lot of uncertainty for Manufacturing Technicians at Intel. We keep getting told different stories from management. It would have been nice to get a consistent message. Intel media was a great run while it lasted. They were doing new dynamic things with OTT set-top boxes, and some of these were so new they still don't exist in the market.Alas, Intel decided that because they weren't good at innovating and kept getting critiqued that they only 'make chips,' their response was to take the most dynamic and interesting part of their business that wasn't selling chips, and sell it off to someone else so that they could focus more on their chip making.Good luck Intel, but bad move... People are very nice and willing to help each other. Have been meeting people, setting one on one meeting with people in different departments to learn more about their role. People are very helpful and willing to talk about their jobs for career development. Free drinks, fruits, holiday drinks, snacks every other Friday. Amazing managers and team. Got to work with emerging technology.  Grew higher up the rank in the team based on performance very quickly and management. As an intern, I did not receive the normal Intel benefits. The work was frantic, but stable. Intel is a job place where you have to be part of a team, yet you have to be pro active in owning your learning. Intel was a great place to work and provided excellent benefits and stock options. They offered great chances for groeth and advancement and I would recommend taking a job an Intel to anyone I know. This is a great company with excellent management. Incredible technology and great leadership. I was part of one of their acquisitions and they are a company that rewards the people that are willing to work like it's their company. This was my first real job after transitioning from the military. It was a great ride. I went from Technician to Engineer to management. This opportunity gave me the inside look at how a True tech giant operates from conception, to development, then mass production. Intel is a great place to work.  It is employee friendly and I enjoyed my years there.  I would recommend it to anyone asking.  In fact, I have many friends and family also there. This place was great!  I loved the people and the work.  There were so many opportunities for growth, both in breadth and depth.  Career advancement was expected and encouraged. Worked at Intel for over 20 years.  1987-2007. It was fun to work on highly effective teams.You could speak directly to the'top' management of your group. I worked with VP's on several occasions. It was also a place of learning and clear support for employee development. Has the best technical training in the industry. Innovative and advanced in technology. Intelligent employees in a collaborative environment. Great experience. Very competitive, stressful, cut-throat work environment - Difficult to switch to different roles without risking career with company.  Training and management mentoring/training poor.  Too much change to maintain work/life balance. Working compressed work week has advantages, but can be hard on a new family. You will learn to work with people from different cultures which I have found rewarding. Highly motivated A type employeesFast paced exciting environmentWorkplace culture empowers employee base.Hardest part was competitive / cut throat  environment. Well Intel is a great place to work. I enjoyed working there. The tools are great. The diversity is good. Work depends on the team you are in. The food is good. good place to work. great work life balance. self paced and relaxed work environment. great coworkers. managers are great and care about your well being Company has tremendous resources available and tries to be inclusive, but occasionally middle management gets in the way and it can be difficult for a technical woman to be recognized. Intel has a tremendously talented workforce with great assets, but with very poor senior management.  The culture is very  limiting in terms of capturing the full potential of the employees.  The management culture is very political and internally focused.  Informed risk taking is not rewarded which makes for very cumbersome decision making, where the management often makes the wrong decisions Overall Intel is a great place to work. It is very fast-paced there and you will work with some great, very smart, people. You will have a lot of autonomy there. You will have the opportunity to try and learn new things. It will help you grow as a person.What is not so great is that if you are a work horse, that will not be respected. Intel rewards people who work successfully on the 'bleeding edge,' that means  if you take on something new and succeed--- Great! If you do not succeed, it will mean that it will be a long time before you get your next opportunity to shine.Management can be hard to influence and move ahead and it is very much a good old boy network even though there are a few people really trying to change that. Go look at the Board of Directors: you may not see anyone who can relate to you: newsroom.intel.com/biographies/board-of-directors/If you like to compete, work hard, have an opportunity for recognition, and are willing to sacrifice home, family, relationship for a time, then this is the place for you-- what they give you will be enough.  Conversely, if you value the work of teams, working hard to hit the goal, sharing the glory, and you want work-life balance, then this may not be the place for you despite all the glimmer of the Intel name. I am a contractor .I really like my job. This is a truly great company. I would encourage someone else to work for the company.The culture is very open and very results oriented. I do have a flexible time frame. Intel is a great company, has great benefits, and a lot of very smart people. For all of those reasons, Intel is a wonderful place. However, you have to be the right fit. I was used to work environments that were more open, fun, friendly. My personal tastes in the job culture and environment just didn't fit that space.If you find a good fit with the environment, you are in a great place. I was a lab tech intern there. Organized the mess left by the engineers, cleaned the lab areas, and did a bit of inventory and soldering. It was pretty easy, as there was nothing to do most of the time. You learned to work on the weekend as if its a part of your normal work week.  When you leave the company you find out other employees are not as dedicated to work the 60-80 hour week. Overall, Intel has been a grate place to work; demanding but fair; Result and customer oriented, value and respect diversity. Very process and system oriented Typical day depends on the organization you are part of and varies from relaxed to fast-paced environment. If you have the drive and a supportive manager and mentor you can achieve great things in the organization. Fast paced work environment. Employees are rated and ranked and  if you are a bottom performer you will be forced to leave. High stress, highly competitive work environment This is a great company with excellent management. Incredible technology and great leadership. I was part of one of their acquisitions and they are a company that rewards the people that are willing to work like it's their company. Contractor - assisted with IT Service CenterWorked on PC's and DesktopsProvided customers with information on how to get their systems fixed in a timely matter. Best idea Intel ever had was the Freelance Nation Program. this was basically an in house contractors group. the employees were determinant employees for Intel but would be contracted out to other Intel organizations to help complete tasks and deadlines. It was a hugely successful program, but due to the placement of Freelance Nation with in another org, we were cut. Intel is a good company to work for.  Can be stressful and intense  They pay well and provide good benefits.   You do work hard but are compensated well .  Good bonuses. Productive, innovative, people friendly, The diversity and company policies are up to a high standard, food and Beverages offered are very good. happy place to work. This was where I demonstrated my project management skills with a wide range of teams on a complex work project, improving the chip manufacturing in a clean room while still in production Enjoyed the time spent getting to know Intel as a company and learning Engineering skills with other Interns.  The work was engaging and enjoyable, and management was supportive. A typical day at Intel is full of ideas, innovation and enthusiasm. One always learns something new and much opportunity to move around within the company based upon a match. Workplace culture is great and constant learning at the job brings most fun As with most large, established companies, there's a rigid, corporate structure, which tends to block open communication. Management is okay, but career advancement is extremely difficult as a new grad. great place and people, Issue isin IT support is the constant push to move service to other teams leaves huge loads on employees who are challenged with work life balance conflicts while the focal process only measures a employees project work rather than operational duties which involve on call of after hours work finance has a rotation program so you try something different every 2 years. Its a large company so you get to try many jobs supporting many groups that make or sell many different products. The bad is that the culture is up or out so even if you find your nitch, you will get pushed to rotate. Don't even think to make friends at work. Especially within the same group. Culture is 'your failure is my success.  Not necessary I really make lots of contributions to project success. As long as I know how to BS or shoe polishing will secure my position'. Great place to work, workplace culture is very organized and focused on daily, weekly and quarterly goals. Work collaboratively with other departments/customers to achieve a common goal. Constant learning-type environment. Although I worked for a terrific manager and worked on a very innovative product launch, the overall corporate management was too unfocused.  Has amazing resources and technical expertise but poorly managed from a strategic standpoint.  Company is still fundamentally a 'chip' house but wants to be all things to all customers. Continuously pushing the boundaries of silicon manufacture and design and expanding into complimentary areas means there is many opportunities inside the company to grow and learn. A Positive experience. I thought of it as being on a technologic volleyball team. Working together to create great products and learn new operating techniques. Intel provided great opportunities, but after many years of service was let go. Never had a poor performance review. Decision made at the executive level with no feedback from manager. The workplace culture of Intel is very casual but the workload is highly intensive. It is the combination of the two which promotes camaraderie between all employees, truly making it a great place to work. I didn't work here long enough to develop an opinion and this survey is getting on my nerves. I really hope I am not expected to do a review on all of the companies I've worked for. It is a great Place to work. The people are great. Very exciting technology. Healthy food offer as snacks. The technology is respected by customers. Offices have an awesome view. It is in general a good place to work. Team of smart and hard working people. Work life balance is a the main issue. Otherwise it is a great place with benefits. This is a great company with excellent management. Incredible technology and great leadership. I was part of one of their acquisitions and they are a company that rewards the people that are willing to work like it's their company. You can learn a lot about your job and there is never a dull moment. The best part of the job is going home. But some days I did feel like I had a sense of pride in knowing I was working on one of the most high tech operations around. I always felt close to my managers but not anyone that was not on my shift. Intel is a great place to work they pay you fairly but expect a lot out of you, especially if you are involved in a process transfer.  It can be stressful but the paid vacation is good. The company is more Baby Boomer to Gen X in its workforce, and the culture reflects that. Executives are almost always older lifers, and the few new faces are equally old. No possibility to advance if you aren't from tech's preferred demographics. If you want a job that isn't challenging that you might be able to keep for 30 years while being rather average, it's a good place to be. I'm not overwhelmed with the skill or intelligence of the leaders, but most of the tech companies are like this...lots of hype and not a lot of substance. The benefits are great and the people are easy to work with.  Each day is a new day and each has its challenges.  I have learned a lot in my years at Intel and having the ability to get further education and access to professional certifications is a plus. Work  happens at a relaxed place. It helps in striking a work life balance, but on the other side, can be demotivating. Good perks & benefits. Offers paid Sabbatical, which quite rare these days. The salary is not competitive at all. Intel has always been a great company, and is doing great things. But increasingly it's more about operating margins and getting more done with less than investing in people and their careers. Excellent 'Total Compensation' Pkg. Very competitive. The site support (CS) group has truly developed a support infrastructure that makes Intel a 'Great Place to Work'..as other industry leaders have done, like Google, Facebook, etc. Health facilities with onsite doctors, nurses, physical therapists, gym facilities with locker rooms, full service cafeterias, banks, rec rooms, etc. etc. This is an awful place to work, with just plain too many managers.  There are too many employees that lack the very basics their job requires, one would think that this is a place filled with highly motiviated and very smart workers, its not. Stay away!!!!! Intel was a great place to work with the pace of new technology unrivaled in the industry. The benefits are great, with a Sabbatical every 5-7yrs as an example. Great place to work, great benefits and diversity.  Excellent place of employment.   Very desirable place to work, numerous place to move up to and various types of jobs Intel keeps their finger on the pulse of the mental aspect of management. they are always get data on how to train their managers to be better and get more out of the employees. right now is no more in Puerto Rico.  The company is close.  But in my eight year I have a great time with my co-worker. The job is fun and the employee learn new knowledge every day Intel has been and will continue to be successful in its main industry, but struggles to find new areas of growth. The company is too slow when responding to the market, and does not do a good job of attractive young people. There is an absurd amount of bureaucracy, and they pay their engineers on the low end of the average.However, the company has a great work life balance, and has many of the perks that come with a large company. There are a multitude of internal clubs/organizations, and the food is pretty solid.If your focus is on hardware or low level OS/drivers, Intel is a great place. For up-and-coming software engineers focused on other areas, I would recommend looking elsewhere. It is a great place to work, it has a culture but the company is too many employees it may be difficult to change a position if you are not very happy Great pay & Benefits. Very relaxed atmosphere, with long shift hours. good time off. co-workers very competitive. Can be chaotic at times or instructions may not be clear. Great place to work. I had some bad managers and some really good ones. Pay was good. The culture was great. I would go back if I saw the right job. you get 2 months off every 7 years on top of your other vacation days. It's OK at Intel if you are not in hardware but they don't compensate as well as other SW companies. Typically my days are jam-packed given long compile times. Engineers seem over-worked all the time. Business side does too. Poor treatment of military veteransDiscriminatory of people over 50 years oldHigh stress and poor peer to peer relationshipsMicro Management in factory Temp position working with Kelly Service at Intel for a special project at the Ocotillo Campus.  Hoping to get on at Intel as a blue badge.  The work is not difficult and the hardest part is getting over the negativity that co-workers have.  It is a relatively safe place to work considering the amount of chemicals that are laying around and unfortunately Kelly didn’t do any MSDS training so most of the people that are contingent workers at least are unaware of the chemicals they are working around.  Kinda scary since they use a lot of acids during their manufacturing process.  The management seems to be in the dark about what actually happens on the manufacturing floor but that is no different than any other manufacturing facility.  If management would take more time to see the process they might be able to see how and why to make their product better and or cheaper which is always the bottom line. I enjoyed working for Intel. Started as I manufacturing technician, worked hard and moved up. Learned many different tools and techniques. Promoted to Corporate Quality Engineering This is a great company with excellent management. Incredible technology and great leadership. I was part of one of their acquisitions and they are a company that rewards the people that are willing to work like it's their company. great place to work, nice people. good pay and benefit. the management group is fair and nice to talk. the working condition is good. they will give you all the assessment to provide ergo office Being an intern at Intel was an amazing experience. I typically got in at 8:30 and work till 4:30 or 5:30. During the day I worked on software tools for the engineers. I learned several scripting languages. My manager was amazing she checked in with me a lot to make sure I was making the progress that I wanted to. She was always helpful. Good pay, but it is stressful, you will work hard for your pay when called on. You need to be proactive in your own advancement. SAFETY is not an option, some things may seem silly but they are there because someone messed up... so be safe...;) Quite at times, people aren't always friendly. It's stressful at times as well. The only good thing is that it pays well and the benefits of it. Another bad thing is that once you graduate you can't intern here. I still consider my internship at Intel as one of the best jobs ever. My manager was especially awesome, he really fought for his people, Friday's he would kick us out of the office to go out and have a life Intel has excellent benefits and a work environment that seem to care about the health and well being of the employee.  If your desire is to advance your career, with a little hard work it can be accomplished at Intel. As with any job if your manager is supportive and fosters an atmosphere of inclusion and growth you'll have a chance at a great future there.  Otherwise you're sunk. I had a great time working for Intel. I learned a lot along the way, Great team environment on campus. Everyone one works together to get the job done. Corporate environment with excellent pay and benefits. This company goes through a lot of restructure to focus on current customer initiatives, which can affect job security. Need to have transferable skills and market yourself. Stressful at times but mostly rewarding.  I spent more than 20 years with the company working my way up from operations.  I didn't think I would miss the job when I left but I do. Working at Intel was like something out of a dream. I was challenged to learn new things every day and everyone I worked with was both brilliant and collaborative. Intel commands a massive market share lead over competitors. This is due to advanced semiconductor products. Working in some of the recent acquisitions will be interesting as they continue to have a start up culture. Traditional microprocessor groups are allow good work life balance. its a great company.  they protect they employees and has to many benefit.  Im so sad that the company decide to move to other country and leave Puerto Rico. I enjoy the core of my job, but middle management have created an environment which has driven out many good people, reduced funding while increasing requirements, and generally made work stressful. I still think the company can be a great place to work, but I am not particularly happy in my current group, and broad hiring freezes have made it difficult to move within the company.Also, while it is great that our products are cutting edge, our methodologies are cripplingly bad, to the point where almost half my job over the last few years has been debugging the tools that I was supposed to be using to be productive. Intel was the best company and the best job that I have worked with in my career. I was treated fairly and my management team was second to none. The culture and drive to succeed helped me to develop my skill sets and empowered me to improve as a person and as an employee. Working at Intel was one of my first Jobs held. The culture and environment at Intel was very friendly and overall comfortable. It help with my professional development . Good learning and nice team. Enjoyed learning at work. Team was awesome. We can have good work life balance.People are encouraged and appreciated well for the work I love working at Intel.  Intel is very good company to work for it.  I wish I have a chance to come back to work for Intel. and I also love my job at Intel.  Thanks. Very strong compensation benefits. Marketing roles require travelling. Every campus in Portland has the gym, exercise related facilities in it.Cafeterias are amazing Great team and wonderful work environment. Nice cafeteria, basketball court, gym and may other perks on-site at Intel.There are often times job openings that allow employees to move up in the organization.Great benefits including tuition assistant This is a great company with excellent management. Incredible technology and great leadership. I was part of one of their acquisitions and they are a company that rewards the people that are willing to work like it's their company. Great place to work and employees seem very happy most of the time. The work is hard but rewarding .I have worked as a contracted worker for at least five times each time it may have lasted for only 18 months (DUE TO CONTRACT LIMITS). Also I have been recommended twice by my direct Intel GL at the time and still was not hired?. I feel I have all their requirements to do  a great job at Intel. I have a AOS degree and over 30 years within this industries . Competitive environment that pushes collaboration and excellence.  The work/life balance was great.  Many new tools were introduced to me during my time at Intel. It was challenging experience for me. I worked on some important projects. Although I struggled with work-life balance but I enjoyed my relationships in intel. Hard work but great  money.  Great coworkers.  Not always 8-5 as many folks work with other sites in other time zone around the world.  Sometimes too many meetings, depending on the role. Intel would raise the bar every year on the expectations of your job performance.  If you do a great job in your current role, you get a satisfactory or better rating on your performance.  Do that same job the following year, and you get a below expectations or an improvement required rating.  This type of evaluation only works for a few years, unless you change job positions. Working for Intel Corporation  was the hardest fun I have ever had, team work where everybody did their job and and it would all come together on the due date and a functioning product would come out the end. 20 years was like snap of the fingers. so much fun the 8 week sabbatical (paid 8 weeks off not part of regular vacation) every 7 years came and went at the blink of an eye. Company is aware of people having family, a long as there's good communication on both sides it will work for both parties. Be ready to work overtime as you always have deadlines and projects that fall behind due to constant delays Intel is a great place to start your journey as an engineer coming in from college. There's so many people from all kinds of backgrounds that can pass on their years of experience to you. I would say that it tends to be an older company with people that are in the middle of their career. Networking internal is possible with initiative and work is based on position or drive. A typical day can be filled with meetings or just engineering development based on your role. Intel did some strategic mistakes but the company is strong and has a culture. Most people are friendly and willing to help. Intel has to be careful about future plans because it has strong competitors Intel offered many employee perks, including an on-site gym, but were only available to full employees not contractors.  A great place to work to learn new technologies. Intel is an excellent company that helps you develop as a Professional. A s a collaborator you own your development and Career path. Senior leaders help you open opportunities and clear roadblocks as needed. Having a manager who knew nothing about my position, and I was new and they relied on me to help them understand. To much finger pointing, and throwing people under the bus They advertise it's such a great place to work, while in reality, they have a toxic work environment. Funny thing is that among coworkers we always refer to the management as 'They', as if the management they are not with us as a team. And I heard on the spot during the worldwide BUM meeting by the CEO, there was one brave sole in the live audience who brought up a question about Intel's toxic work environment, which the CEO of course dismissed the question, no, our environment is not toxic. I am pretty sure that employee was shown the door right after that meeting. wonderful place to work. Relaxed, laid back culture. Fun people to work with. Very creative and intelligent people.High level of intellectual exchanges. Intel is a good place to work; however, co-workers may have difficulty understanding interpersonal relationships. I was fortunate to have very professional supervisors to support. Too much time wasted due to co-workers lack of knowledge, supervisor's lack of support, slow responsiveness from team in China, constant layoff of key team members in the middle of a project, unethical supervisors impose retribution for employees disclosing safety concern, HR team and upper level managers support dysfunctional manager and further victimizes employees, too political and some favoritism, self-preservation tactics exist 'start up' business model does not work in a big, bureaucratic company like Intel.  Upper management and VPs are not accountable for their bad business decisions....employees are their scapegoats. This was an easy job with lots of perks. It was awesome to work for a company that would let you sell back your PTO hours for an extra paycheck. The only thing is, every 5 years the job gets more automated and your job is on the line. As I mentioned the company keep changing no one can predict whats next, although overall its good place to work at............................................... My job at Intel paid well.  However, the plant was closed and the work was sent to China.I worked as a Maintenance Technician.  The work was very busy and repetitive, but paid well. It was my dream company, but unfortunately I had a horrible experience. The management miscommunicated from the beginning. 98% were people with 20 years of experience on an average and were partial towards new people. Bringing up concerns/issues was looked down upon by the management and not taken in the right spirit. My manager started having 1:1 with me from once every 2-3 weeks to every single day, to criticise my work on a daily basis. The manager even started pressuring me in multitude of ways. I eventually had to leave. This is a great company with excellent management. Incredible technology and great leadership. I was part of one of their acquisitions and they are a company that rewards the people that are willing to work like it's their company. The company is well orientated in looking for the well being of the employee during working hours as well as after hours. Family oriented, and dedicated to the progress of the individual. Intel solid company. Management not very good.  They don't listen to employee concerns.  When issues are escalated they tend to sweep things under vs dealing.  Team members are stifled from making significant advances.  You have to hire in to get paid more, the employees that have been there are not paid the best.  Frequently they can be overlooked for the new hires being brought in. always a procedure for everything with everything 'copy exact'  Meetings are a source of information passing and there is a strong sense of cut-throat around the working environment Get to work with smart people, lots of meaningful projects and roles, managers tend to value work-life balance in finance at least, can be competitive when it comes to annual reviews, unclear career path going forward given CFO changes and recent finance re-org Being an Intel employee isn't for everyone. You have to be a high caliber employee and sincerely adopt the culture or else you will not make it. Intel drives towards success and success starts with you, so you must always be striving to become a better employee and you are rated yearly on this basis. Intel is an awesome place to work.  I felt like I had great opportunities and was both expected and able to make a different.   I have had huge jobs and have driven great cost reduction as well as having the opportunity to help with product strategy. it was a job work life balance was not compensation was not better than the industryno advancement but had security management had no clue what was going on Intel provide many outside events for employees. Such as picnic, quarterly diners, group team building, movies, baseball games, football games, basketball games, and much more. Work is intense but the outcome is worth every bit of its rewards.Training is offered through vendor school or OJT with a sponsor. The responsibility on yourself is how to blend in with others and become trainers to others if needed. Hours are long but the time off made up for it. Three days on (12 hrs.), three days off, four days on, four days off. Also depends on which shift, Night or Day.  Best part of this job was, everybody became your second family. A challenging role. I have learned DAX. The culture was mot bad.  Supervsior was great. I wish they considered permanent. role and contracts. Learning DAX was fun. A great company offers stock options, health benefits, yearly bonus and pay days off.  Very competitive, high stress job.     Management is OK at lower level, stock option policy changed in last few years. Good work get recognized and awarded well. The environment is work overload and it is not a great place to work.  the compensation is below industry standards for most all employees except sr. management. Management for the group in which I contributed was extremely poor, failing completely to read the market place and move accordingly. (The minions at the bottom, myself included, those that did all the work, created the products, and nurtured them to release and mass production, where great, highly skilled and competent people. They were the complete antithesis of the top management.) The result: significant layoffs (>65%) in August, '17; the group will most likely disappear completely at the end of the 2017. The group's top management will most likely be reassigned to other parts of the company where they can continue to wreak havoc and destroy other product groups. The Peter-Principle is alive and well! Excellent company, awards for top performance and collaboration, many advancement opportunities, with a strong focus on worklife balance and flexibility. Aside from my film work, I have developed web design skills and produced graphics through creating websites for several small businesses and restaurants. Intel is a highly competitive company - with a tremendous value placed on technical skills and background.  The office environment is an open cube environment for all employees.   There are 4 primary states with multiple buildings at each location.  2 in California, 1 in Phoenix and 1 Oregon. I learned many skills while an employee with Intel. I learned how to process wafers in a clean room setting as well as performing daily and weekly PM's on tools in my area. I later learned to disposition material that had not been processed according to process on record. Very competitive company. Lots of new technology to learn and Management have improve communication since I started in 1988. Very diverse and in spite of other cultures, employees knows how to get along. yes I likes for intel corp, it very interesting to work thereand there more friendly environment place to work and have a lot bonus benefit, I strong suggest recommend to all my friend. The projects keep getting cancelled and overall morale is low. There is no scope for growth for the first 3 years. Hardest part is working on scripting which doesn't challenge you or make use of your skills acquired in academia. One of Intels values is Great Place to work. When looking at the things that matter, I agree with this value. The pay is fair, the benefits are great, the 401K and stock options are a nice to have as well. This is a great company with excellent management. Incredible technology and great leadership. I was part of one of their acquisitions and they are a company that rewards the people that are willing to work like it's their company. Intel is a Great Place to work with great benefits. If I were a long term employee i would still be there. I would recommend employment at Intel to anyone. I've worked for Intel Corporation for over two decades, and I've seen various pros and cons.  I'll say that the pros outweigh the cons significantly.  I'm proud to say I work for one of the most ethical corporations in America today, and I'm also happy to be working on the cutting edge of technology. I have worked for several managers and three different groups at Intel. Your experience varies greatly on the management and group you are in. It is hard to generalize. Overall the company and benefits are great I really enjoyed my time at Intel. I had a long commute which really took the stuffing out of me. It was 45 miles and when it got to 2 hours each way I had to look for another job closer. There was always something new coming out to test and try out. People from all around the world with many experiences. Great place to work. Not very flexible on hours. Being present is important. Excellent management, clear and concise work instructions and expectations. Good team to work with. they promote segregation and an atmosphere of disdain between their blue badge workers and their green badge workers almost like the old jim crow era but for badge color •Planning, coordination of projects between department, vendors, delegated work to 33 + employees, generated rough drawings, assistance in transition into Auto Cad 2003, seismic anchoring, relocation, assembly adding equipment,  seismic anchor,  lab table, lab equipment, environmental units, laser optics, server racks, cabinets, installation new/used cubicle compression, decompression, furniture repairs, trouble-shooting sit stand and repairs, managed cores and keys, ordered parts, ergo evaluations recommendations, to ergonomic standards, OSHA, State regulations,  reported, updated projects, deadlines in some cases costs to management. Liaison with various vendors involved in projects, assistance in the execution of other department projects or related, hands on in some case to compete work deadlines as required.•Following up on completion of a project, requests large or small with customer, solve customer’s issues, tracking, supervision, delegated work, processed, data entry work order system 360, responded to emergencies or last minutes events in a timely manner and cost efficient, hands on anytime any day or when required. La fábrica Intel de Puerto Rico fue una empresa muy dedicada y respetuosa con el trato hacia el empleado, y siempre con un trabajo eficiente y de calidad. Expectations are high but so are the rewards.  Constantly challenged, but management helps you build your career.  Also always looking for creative ways to reward hard work. Integration of new employees and finding best person for each job falls short of expectations.  There is limited upward mobility and the majority of people are satisfied with not taking on more responsibility. Excellent Company to work for, unfortunately the shut down the plant in Colorado Springs, Co. They were very good to there employees as far as pay, benefits, vacations, sabaticals. If you like the American Dream go for it. This is a completely soul sucking cultureless company. Go work for Amazon, google, Microsoft. All pay better and have better company culture. They still believe in a culture that weeds out the lowest performers and that's based on peer evaluation (yes you all compete).  My first year was my last...incredibly unfair as I had just started!  After my manager found out I was going to take paternity leave, that's when she started the process to get me out. Great place to work. Very Flexible in terms of hours.  Excellent management, clear and concise work instructions and expectations.  Good team to work with. Great Place to work at the team level.  Upper management roles ignore the rules of HR guidelines when convenient, often crossing legal boundaries as well as good sense. Overall, the company has great benefits. The semiconductor business by nature, is subject to business down-turns more frequently than most. But all-in-all, Intel has good job security and advancement potential. However, the management structure is made up of engineers. A true manager and an engineer can at most times be mutually exclusive titles, even though they are one in the same at Intel. They provided a very fun environment for inters, but still provided many resources for interns to get a lot of work done.  Managers were very understanding and worked with interns to make sure they weren't overwhelmed with work, but also had enough to do. The team at Intel was always helpful. I loved that they placed special emphasis on volunteering in the community, donating blood, etc. When first hired, the group's manager came in and personally talked with all the new employees. He was a knowledgeable guy who seemed to take a personal interest in everyone that worked for him. I experienced incompetent managers, people who took credit for your work, harassment, 'do as I say, not as I do' managers, managers who were quick to deny issuing the orders they issued, and unclear instructions on what to do. The Intel culture is now defined by the pressures of external politics, popular social ideologies, and legal scrutiny from the FTC and SEC.  The machine is driven very much tops-down leaving little room for dissent, creativity, and empowerment.  Intel is a national treasure and truly is a unique force that can compete internationally with China unlike any other US semiconductor company, but be aware of the challenges this company presents culturally. This is a great company with excellent management. Incredible technology and great leadership. I was part of one of their acquisitions and they are a company that rewards the people that are willing to work like it's their company. Remove trash, sweep, dust, in designated areas. When tasks are complete, help others as needed.Learned how to set a routine to get everything done in a timely manner. If you need help, the supervisor will assist you and explain to you how to do a specific task if needed. The hardest part of the job is when workloads are added due to call offs. Most enjoyable part of the job is when everyone works together and help each other. Communication is key working from home allowed depending on position.  The opportunity is weak to grow due to reorgs every quarter.  Change is constant and security null for upward mobility. Generally a good experience working at Intel, and the majority of coworkers and friendly and relaxed. There are issues during fire drills and current cutbacks, which affects the overall mood and creates stress. 12 hr work days., Great place to learn new skills, lots of opportunity to cross train or advance job skills. Management on board and involved but not over bearing. Great people to work with, co-workers willing to help and assist when necessary. Friendly atmosphere, great reward and recondition system,  Great pay and bonuses.  Job is not hard but offers challenges such as getting tools from green to green. We take that personally we want passing PM's. Working at Intel and working with Intel culture is the greatest, The people are great, fun, and hard working.  Always willing to help share job knowledge to help you become a better Tech. Easy place to work and the people were really great.  The work was not hard just tedious at times.  Managers were respectful of my knowledge.  The free fruit was nice and the break room with the large TV was nice.  The floors are arranged all the same. A world class company.  It doesn't get any better than working at Intel.  Salary is not as competitive as some other companies, but the benefits are top notch.  I thought they were the best, but my opinion was tarnished when I found that they were found guilty of conspiring with other tech companies to keep wages low.   The $4000 class action lawsuit award I got was probably just a fraction of the pay I lost due to Intel colluding with other tech companies to keep wages low. Intel is a good company to work for with many opportunities to continuously learn and develop, a solid compensation package, and the ability to work with many talented people around the globe. working here will be bad for your health. The Management here have been in power for over 10 + years, despite what the company preaches they do not like change, they railroad or setup for failure anyone who seeks to change the way things are. bad communication and passing tasks on to others never wanting to do their jobs and lots of professional disrespect to go around the management is beyond bad and are nothing but drones, they cannot make a managerial decision without getting approval from above them and so forth. Many employees so severe signs of stress from weight gain, agitation, drinking booze in access after work, etc... if you need the money go for the job here but if you value yourself and family more do not work here Poor communication and hierarchy structure creates bottlenecks and micro-management environment, Decisions are fear-based and best practice is not followed. No concern for meaningful results. Great Place to work if not in TMG. Management is not missing the AI train it seems and if you are on that Train good for you. If you plan to be involved in the traditional PC/Server look somewhere else. Good work-life balance. My job wasn't challenging enough at the start, but then it picked up, I wish I had a mentor assigned when I initially started out. Evaluate manufacturing tools for key production metrics, ensure all inline data was in process parameters. Managed teams of technicians to ensure tool availability was meeting goals for output, reliability and quality production. - started at this company 1988 and left 2016 speaks for itself that I like working for this company. In grew up at this company- management have made a lot of improvement over the years that I was working there. Transparency thru great communication is one of the best improvement they made and listening to all employees needs.- very diverse company- have a lot to learn especially with the new technology, but my age is creeping in that I feel I don't have much time to learn all of it.- great place to work due to diversity, great team work within each group and can easily talked or converse with management. Working at Intel was my first job, starting as an intern junior year of high school. The pace of work was very relaxed and enjoyable. Would recommend to anyone. Many opportunities for those who work hard and open to constructive feedback. Technology is always on the cutting edge, great benefits and fair salary. Very challenging, highly motivated and intelligent employees.  Culture can be intimidating if you are unable to take constructive confrontation (ie - have your ideas challenged without taking it personally).  Company will take as much as you give it so YOU need to establish your own worklife balance. I can honestly say I was proud, to work for this company.  We worked a flex schedule, the pay was decent compared to the cost of living, multiple bonus, unmatched educational benefits, discounts and perks are insane, and there's a huge family atmosphere amongst the work teams. Its even a company masseuse, and personal trainer onsite. Fun,I learned different tool sets a total of ten, management is excellent, good culture environment. No hard parts on the job,most enjoyable they give you a debit card which money is applied to it for helping each other. Good plae to work with lot of opportunities specially for new graduates. Poor management is one major drawback. Promotion are very hard to get. Overall good Over the course of my 17 years, I observed the cultural shift from local control of personnel and management structure to the corporate/institutional control leading to impersonal relationships which alienated a large portion of the workforce. This is a great company with excellent management. Incredible technology and great leadership. I was part of one of their acquisitions and they are a company that rewards the people that are willing to work like it's their company. Good company with lots of opportunity. No longer a growth company though, so budgets aren't what they once were. Fairly flexible with work-from-home and work hours, but there are lots of hours required... whenever you put them in. Working to develop software tools as well as collaborate closely with team. Good learning and team focused culture, very receptive management, challenging work but interesting. I enjoyed my time at Intel. Although it was a Temp Position. I enjoyed the working environment and interacting with my fellow coworkers and supervisors. After multiple re-orgs in a single year, I'm fed up with this place.  Management can't agree on what is and isn't important so the entire organization is in constant chaos.  The people that really suffer or the rank and file employees. Great place to work. Great benefits, good people. Sometimes favoritism gets in the way but that holds true for most jobs. I wish I could have gotten a transfer as I wanted to be closer to family in texas Intel is a great company, but be advised that that you have no long-term job security. Due to the nature of the business, layoff occur every 2-4 years. It is a young culture, and they have eliminated the majority of people aged 45 and above, per the last layoff... INTEL is a great company to work for, the basic package is normally directly middle to upper-middle for like companies. Vacation is accrued at @ 80.5 hrs a year with personal absence at the same rate. All the benefits are beyond most companies. Working nights was stressful but being on compressed work week was cool as we had 3 nights off 1 week and 4 nights off the next. I had multiple managers with verying backgrounds, this made for some difficult times but also some good learning as to how to build relationships.All in all I enjoyed working there and would again. Great place to develop skills and management. Good work-life balance to maintain. Competitive working environment. The hardest part of the job is to learn time management. Intel is a very large organization with facilities and offices all over the world.  While I enjoyed the people I worked with immensely, the management at Intel was and is some of the most out-of-touch, overly intrusive, dismissive and critical in the tech industry.  Forcibly, employees, especially contractors are regarded with less respect and advocacy than some of the equipment in the hallways.  While hard work is appreciated, mistakes, even small ones, are not tolerated.  Quality expectations do not align with reality of error rates in such environments, and my group did not make many.  But, on the rare occasion when one did, it was treated as an extinction event.  In the little more than a decade at my job I learned not to invest time getting to know co-workers, not knowing if they would remain employed there for more than a week.  And those were the good ones. Intel is a great place to start a career as I did.  Many brilliant coworkers means the job gets competitive at times.  Work given is very meaningful, challenging, and impactful to the entire tech world but the pay does not match the value of work that we bring.  Management is average for a large corporation.  I've never had management issues but I see that they are more worried about pleasing their own bosses then keeping their employees satisfied. learned 40gig/100 gig switch technology.inter-operability switch with TOR switches from ibm, arista.great managermost enjoyable team of engineers with plenty of support Boss played the fiddle and drank while the billing dept burned. Was given full time status but then when others quit as soon as i was full time every task was given to me. Only coworker was in his 70s and slow worker. Others in department but kept tasks to minimum and literally went to lunch all day with boss. I enjoyed my time at Intel and loved the work environment.  Would recommend this company to anyone the qualified and was interested. Very clean, health conscious, and takes care of the employees. Great pay. Day to day is pretty mundane, but sometimes excitingI learned a lot about new technologiesmanagement was fineThe employee culture was goodThe most enjoyable part of the job was the occasional team building days and days where we completed major projects Working for Intel you are exposed to cutting edge technologies and methodologies.  It is an ever evolving environment so you must be comfortable with change.  My management was very supportive work life balance Great company, nice coworkers. Everyone is trying to help you be successful. Lots of perks, good pay for engineering (not as great as the big 4 though). Work wasn't really that interesting for me (validation), sometimes there was a lot of work (overtime), sometimes there wasn't enough (bored). I was lucky to have a great manager and team so that was a good experience. Fun events at work sometimes, free ice cream whenever something good happened. People were always talking about how things have downsized, cuts were obvious. Recent huge cut on employees (ton of layoffs), so I don't know how great job security is. Folsom is so boring though, don't recommend for young people. Amazing benefits.  Great culture.  Seems like the company really cares about you other than some of the bigger layoffs that got rid of the lower 10% of workers. It was a great place to work in the beginning. Then it got too big and not employee friendly. The hours and benefits are worth it though. It is hard on the body though. On the development side of Intel, it is a very competitive environment. Sometimes that competitive side makes it difficult to enjoy and excel. Intel is great about giving employees healthcare, and different incentives to attempt to excel. Currently working in a split team with two managers, but the power dynamics are very apparently in the other half's favor. Because of that imbalance, tend to get stuck with grunt work and diminishing headcount as other half grows in opportunity and workforce. This is a great company with excellent management. Incredible technology and great leadership. I was part of one of their acquisitions and they are a company that rewards the people that are willing to work like it's their company. A very competitive environment where everyone watches out for themselves and does not promote on hard work and skills.  More political than proper leadership. Loved working here. Surrounded by so many great people to teach you everything you need to know. Be resourceful and you can go far. Hours are flexible. Working from home is always an option. I enjoyed working at Intel until they merged several development groups and took the good parts of my job and gave them to another group.  Once that happened the managers in our groups went down hill and so did the job. Excellent opportunites to advance. People were very friendly. Great work culture. Great work team atmosphere. Managment and Engineering worked very closely with you too develop new process and valued your input. If you are on a process engineering job in a factory, know life-work balance can be non-existing depending on the group you are with, but the group you end up working with is not necessarily the same one you interviewed with, so very hard to tell how it will be before getting there Fast paced, challenging enviroment with benefits that are unparelled.  Coworkers are all very loyal and smart about how to conduct their jobs.  Ability to directly influence operations of the company which is great given the size of the company. Good workplace, good mentor ship and team. Encouraging and positive attitude.Better compensation and salary should be provided as people are passionate about their work. Intel gives you option to either fast pace your career, take on multiple roles, hop from one group to another doing completely different products and roles, OR, take it all in a relaxed way with great work life balance. Its your choice. Well established tech company sometimes slow to react to the direction of the market.  Otherwise, a good company to work for with good work-life balance depending on your org. This company is a great organization.  They are always on top of keeping top notch trained employees.  I dislike their rank and rating system.  It causes employees to suck up tp their management. Surrounded by smart, motivated people. Working on leading edge technology with a free licence to innovate. Excellent pay and benefits. Could benefit from better work-life balance. Overall they treat their employees well and offer a lot of benefits.  Manufacturing world is competitive.  Job security suffers as factories age. You can have a long career if willing to re-locate. intel was a great place to get my start.  I learned a lot there.  the benefits were good.  I met great people there. stock option were enticing, but fruitless Can be challenging depending on the group you are in.  There is always something to learn and the company is at the forefront of changes that will be impacting our world. One of the best places I have ever worked! The best managers I ever had the pleasure of working for!  Awesome place to work!  'd work here again if the opportunity ever presented itself. On the good side, Intel pays well (and very well depending on the location you are in). Benefits programs are generous. On the downside, management focus and direction in various business units has become muddy - especially since 2013 or so. And much of the technical innovation in the various areas where Intel competes in are being driven by others (like Google, Amazon, FB in the server space, QCOM, Apple, Samsung in mobile, ...). So Intel has a feeling of being a supplier and not really at the center of the action. If you are a motivated & talented engineer, you may find the company frustrating. This used to be a very good company to work for.Currently jobs have become very insecure and there is no sense of loyalty like it used to be. Employees dont have a sense of belonging. I hope the CEO does something about this. Good company to start the career. They have one of the best 401K benefits ---Sabbtical holiday is a great perk offered by Intel. Poor career advancement.Decision making is slow Intel is a company driven to succeed.  As such, employees work hard.  Intel provides great benefits and pays well.  Definitely need a degree to get into the door. Intel provides many opportunities for diversity and inclusion - even though it is difficult to enjoy these benefits due to the drive to get product out the door.  Intel is a large company - as such, management is as diverse as the individual manager's personality. Lots of opportunity for advancement, until you hit your 50's and you've topped out in many of the jobs.  I would recommend looking outside of Intel to advance your career, once you are approaching 45 - 50, otherwise a great company to get your career and earnings jump started. This is a great company with excellent management. Incredible technology and great leadership. I was part of one of their acquisitions and they are a company that rewards the people that are willing to work like it's their company. Fun, yet challeging. Stressful at times but the offtime and friendships made up for the long hours. Benifits are amazing and having now worked in the REAL world, wish I had never left as most people do. One of the best most relaxed place to work. Not one day goes by and you dont learn somethong new. many friends made and everyone is willing to help out. Compensation need to be more competitive compare to other similar company. The caliber of managers need to be enhanced to have a very dedicated work force. intel had many great benefits and during the first 10 yrs I worked there was very secure. during the last 13 yrs it was increasingly insecure.. lay off seemed like an every other year thing. never knowing for sure how the next lay off would effect you. Maybe it's because I started prior to the Pentium birth I don't know, Intel is missing laughing in the corridors -  i found at the end of my time ... there just wasn't enough friendly and its a necessity for some of us out there Career growth and learning is slow. Apart from that fact, it is a great place to work. Management always consider hardware jobs as best work and software engineers are not acknowledged. Even though this was a very demanding company and position, I very much made a lot of friends and had fun with great co-workers. I was saddened to see Intel leave the state of Washington. Fast paced environment were learning work/life balance is a necessity to have a successful career. It is very easy to feel lost in your first year but management does a good job with providing mentors to help overcome these feelings. a lot of work.  extra work and stay late!   A lot of good  engineers working late.   Multi worker from all over the world. Free coffee and snack if you come early! Intel was really a great place to work. There was a great work/life balance and the benefits were awesome and competitive. The hardest and most stressful part of the job was during downsizing and times of uncertainty from location to location. The most enjoyable part of my jobs over the years was working within the great teams and the people I worked with. Over the years I learned the benefits of teamwork across all types of job roles (operations, maintenance, engineering,management and training) to provide a productive and quality work environment. As an engineer, you are given a lot of freedom, your work performance is based on what you do, how much you do, and how it compares to your peers. If you want to make the most money, keep looking, but if you want work/life balance with okay compensation and top benefits, work at Intel. company is good over and has many teams and features and products and focussed on electronics processors. good benefits and insurance and medical and staff and management. Every single day is a new adventure.  You work hard, your manager never gives credit for your hard work.  You'll work hard and many hours.  Someone will always take credit for the work you do. Very competitive and challenging place to work.  Overtime is expected.  Greatest feelings of accomplishment were earned at Intel.  It was great working for an industry leader. Organized work day, how to work with engineers, great management, good culture, challenging work place but learnt alot about modems, how engineers think and work. Problem solving. Intel culture forces each engineer to against each other.  There is no team work.  At the end of the year, whoever gets the lowest performance grade (within their group), the one gets booted. Thus, no one wants to share anything.Managers are old school, believe that everyone must be at company office, sitting at their desk to do the work.  No WFH allowed what so ever, even during emergency. -Working w/ multiple teams in different timezones-Bringing teams together into a cohesive direction-Development teams may not understand UX, the PM needs to be the voice of the customer Its gets crazy as the day starts and things get back to normal at the lunch time and day ends at crazy high again. Management people are workaholic, all they know is work, there is little to none possibility of failure, Manager supports you in your decision and if you fail, it might take a while to get another shot of trust from management. I loved to work at intel and I have gained a lot of knowledge by working at intel.I had to complete my task and resolve the ticket by daily bases, learned new technical skills and hardware knowledge . Electronics, Components, and Semiconductor Manufacturing Engineering Department with replacement parts and supplies building FOSB Silicon Semiconductor Wafers in a Clean-room Environment. Tasks include Inventory Management, and the handling and disposal of chemicals and hazardous materials. This is a great company with excellent management. Incredible technology and great leadership. I was part of one of their acquisitions and they are a company that rewards the people that are willing to work like it's their company. -Provided administrative support and project management to the Public Affairs department which included seven staff members.  Assisted with large-scale volunteer projects and community events including the annual United Way campaign which raised in excess of $8M.  -Managed the annual Supplies for Students program which provided backpacks and new school supplies to Title I schools.    -Processed expense reports, made travel arrangements, scheduled complex meetings involving the general public and elected officials. This was my first job after college. It set the bench mark for me nothing else has been able to measure up the fast past environment at Intel. Still looking Competitive. It motivates you to work hard and smart. Intelligent and smart people Just need to be at right place at right time. work culture depends where you work as it may be high or low depending on the area. Very fast paced and always something to work on.  Intel provides a lot of great benefits and Pay is also good.  12 hours shifts in a clean room fab environment. As long as you are well and good, this place is best to learn. It will help you to develop your debugging skills. Exposure across different protocols. Learned process of making a computer chip.Free sodaQuarterly Events..  anything from Breakfast somewhere to going to the $3 movies.Hardest part was some managers do not know the tools or the process fully so makes things hard to explain when having issues.Was a good first step in the Industry and some managers are great and hands on.  Had fun with coworkers and working on Safety Team! Intel provided a great place to work for me for 20 years. The culture is relatively laid back, but there is competition. Chances for advancement for non-technical people is limited. Great place to apply if your are a technical female. You will be in high demand. Intel has outstanding processes and work ethic. Generally speaking, people are smart, hardworking and honest. There are limited opportunities to grow because it is a mature company. I can't give an honest opinion about working at Intel. They discriminated against employees over 50 in the massive layoff and retirement packages they issues back in 2015. High pace productive work, busy working schedule, a lot of developmental learning, typically 10-12 hrs a day at work, needs a lot of programming and management skills. challenging environment, from the CEO down, not a company that values employees all that much.  Many job cuts every year and isn't worried that the employees asked to do the work don't have the needed knowledge of the technologies, it's all about cost... There is plenty said about Intel and I don't have interest right now in adding to that volume of content. I will continue here until I meet the requir Intel is a great place to work and achieve your potential career aspirations and goals. With benefit packages,that include stock options, medical, dental, and excellent 401K  match. long hours, little recognition, poor managementInteresting at times looking into new tech stuff but rarely these days as moore's law is dying regardless of what they keep saying to themselves The opportunity was a positive learning experience for me . The group I worked with had a great team spirit. The integration  between all business levels was  positive . good job. just never know when you will get laid off. its hard sometimes. people here are really nice. the management was really nice also. I would work here again Intel has been a great company to work for but I am glad to be retired.  Keeping up with the latest technologies and developing new ones is exciting but requires one be constantly learning.  Additionally, balancing the needs of the customer with the needs of the company requires the wearing of multiple hats. I was hired at Intel as an intern. It has been a great experience so far and they are flexible with my school schedule. I have been in 3 different teams and have gotten to work with a lot of tech. Intel was a great place to work years ago. However, they have changed over the years replacing seasoned employees with inexperienced workers on visas and/or in other countries. I was laid off due to Obama increasing the number of Visas for Intel. Intel then hiring many people on Visas to pay them way less and laying off us that had dedicated our life to Intel for 20 years and longer. My responsibilities varied from day to day, however never a dull moment.  Sometimes there would be emergency deadlines for filing documents with the S.E.C. which could create panic in many employees.  I learned how to co-exist with Attorney's the seemed to have unrealistic expectations with little acknowledgement for my efforts or accomplishments, but working with other Admins made things a lot better during the stressful moments in the day.  The door is also always open if I ever decide to return to the company. This is a great company with excellent management. Incredible technology and great leadership. I was part of one of their acquisitions and they are a company that rewards the people that are willing to work like it's their company. Overall good place to work. Shift work is not conducive to work life balance. Good benefits. Very diverse workforce. At time they take things way too seriously which causes unneeded stress.  Upper management doesn't listen to its people. Plenty of avenues for suggestions, but they get overlooked. Incredible benefits, flexible work environment, dynamic growth opportunities.  Through my career I working in manufacturing, engineering, and management roles. Intel is a good company to get a view how a fast paced tech company works. The company is currently going through business transition and it is putting a lot of thrash on its finance employees. It truly was a great place to work, but there was no job security at all. Yu were constantly under the threat of a layoff and eventually you would get snared in a layoff. No one is imune Intel is a cutting edge technology organization transitioning to a cost competitive environment in the manufacturing space. The compensation packages are amazing. The environment can be toxic at times, with emphasis on individual vs. team achievement, pressure to continuously rise in ranks or be targeted for removal, and doing more with less resources with no clear path to resolve the dilemma.The people are amazing. The opportunities are awesome. But it comes with caveats. Pretty stressful at work since it's very fast paced and during critical project delivery time, working hours can reach 15-20 hrs a day.other time, it can be relaxing compressed work week, monitor and repair tools in my area due for pm or in need of repair. Every thing that I needed was there for me to be able to due my job efficiently and timely. Loved working at Intel. Knowing a lot of good friendly people.Great opportunity to experience on differential advance new test equipment.Very good team work.Many opportunities to work on different products. Need to discuss mentality of managers.  Managers also needs to handle or own technical areas.Manager(s) dictates what they like, instead of what team favor.Manager(s) likely threaten employee's performance, instead of find way to truly help people and help product to success. Stressful, cut-throat, and desperate.  It's a company where your friends stab you in the front.  Great financial compensation but at the expense of losing your soul. I remain neutral in my comments about employment with Intel. I had some great experiences with the company however I can also say that I had some not so pleasant ones. It was a good place to work, if you had a good manager. Since managers were often rotated, that was a bit of a gamble. what made me leave was a combination of back surgery (making much of y job extremely painful) and burnout (you had to be on your toes 100% of the time and after a while Dilbert wasn't funny anymore :) ) In the past 20 years working for this company, I've made quite a significant contribution to the company to finish my work on schedule.I enjoyed my job and adapted the workplace culture.  Unfortunately in 2016 the company went thru big layoff.  My job was effected. As the result I left the company.  It was very sad !! Perform scheduled and unscheduled maintenance on large chip manufacturing equipment. Strict safety culture that actively promotes and enforces a safe work environment. Everything is done by following written specs or procedures. A fast pace and constantly changing situational work environment. Technicians have to respond quickly to address equipment issues. So every day is different, base on the current production conditions. You have 2 breaks and a lunch break every day. There is a lot of time standing on your feet, so it's best if you are in good physical condition. Which Intel promotes by having their own site gym. Management communicates what the priorities are on a daily basis. Overall there are some very nice manager types that follow processes to the letter and don't let anyone else fool around and think they can get away with otherwise. Others break the rules quite often and break not only processes but also basic Intel policies of being able to track every release. A lot of new projects and exciting things to work on. Easy to change groups and try something new. Upper management was supportive of career growth and self improvement. Great place to work. Meritocracy with positive incentive culture and made to feel like a valued member of the company. Engineering led so most management understands the needs of technicians doing the job. Poor work life balance on call even during vacations.Culture is very fast paced and confrontational.Generous bonus and stock options.Quick paced and results oriented. Intel semiconductor fabs are fast paced and challenging. The ability to move up is nonexistent unless you are in engineering or management. SPTD division is a poorly managed and a frustrating place to work. All the equipment is junk and there are leaks everywhere. 90% of the employees are engineers and the other 10% are the technicians that are running the factory and keeping things running and taking orders from the 90%. As a general manager, I often arrived at ~7a and spoke with Europe on any situations or problems concerning my product lines. After 8a most of my time was spent in 15-minute chunks, walking around talking to the people in our teams or having them drop in to my office to chat. Meetings took the remaining time (my staff, my peer group of managers, technical reviews, etc.); there were more lunches eaten at meetings than anywhere else. After 5p I began to receive the calls from our Asia Pacific region, with issues similar to those from Europe. I learned that I had to keep learning; our peer group generally agreed that we all had to completely cycle our technical knowledge every two years, as nothing stayed constant longer than that. The workplace culture was hard-charging, schedule-driven, financials-driven, yet we all took care to work with our people to ensure that they were satisfied in their work. If an employee had problems, it was up to the line managers (not HR) to resolve them. The hardest part of the job was getting the work/family balance in place - it was too easy to justify putting more time into the job and letting family obligations coast until the weekend. It was also hard to disband groups as we re-organized, which happened every year or two. The most enjoyable part was seeing individuals and small teams succeed, which we celebrated enthusiastically with parties and recognitions. This is a great company with excellent management. Incredible technology and great leadership. I was part of one of their acquisitions and they are a company that rewards the people that are willing to work like it's their company. Intel prefers the use of contingent workers to fill full time positions instead of hiring people.  This is to keep 'head counts' down and satisfy shareholders at the expense of people who want jobs. Good benefits, schedule, pay, & management. Very structured, focused, safety and quality oriented.  Excellent place to work at.  Company culture offers impartial advancement opportunities, as well as recognition with compensation for employee efforts.  Extremely enjoyed working there.  Always fast paced, demanding. Good use of engineers in project planning and execution. Project teams were run well. Had access to management. Worked on a number of valuable projects. I am not sure what I should have expected. I have heard good and bad. I enjoy my position and the environment. I do not dislike any aspects of the role, but I cannot say I am home. I still feel like an outsider even after 3 months. #cubelife Management is lacking people skills!  Daily goals are very high ! As for the staff, they can be helpful if they want to! I learned that you have to get involved with problem solving daily Worked for 16 years and enjoyed every minute of it. Worked 12 hour shifts, 4 days on 4 days off, 3 days on 3 days off. Work life balance was great. Sabbaticals and more. Loved it. Some days were very long depending on the time of year. I worked in Intel's Great Place to Work program. Planning and executing the events for our campus could be extremely rewarding and seeing the happy employees and their families  made it worth the long hours. My manager was very difficult to work with and we not always acknowledge our teams skills which made work more difficult. Awesome company.  Very innovative.  You definitely want to work here!  Awesome open door policy, great teamwork!  Fun and inspiring activities, many opportunities to learn and grow.  Great place to be!  You gotta work here at least once in your life! Very rewarding and fun place to work.  Very results oriented environment.  Everyone is very knowledgeable, and do not tolerate incompetence.  If you are going to work at Intel, you must put in the extra work to learn your organizations products, goals and future plans. At the time of employment, the job was fast paced and very rewarding. Worked with many people in different areas as well as management. The work culture was great and ended with being he best fab in Intel. This company really has a strong culture of treating everyone equally. They have very strong rules against harassment in the work place with a strong emphasis on diversity. Extremely good people with very good knowledge.Highly supportive and provide the right resource materials.Helpful in technical growth as an individual.Good play environment and work life balance. I worked at a FTE for 4 years then worked as a contractor. I was an equal contributor and peer among my team (as an Intel employee-FTE). I enjoyed working across teams to manage many facility related projects. Management care and concern began to decline with outsourcing activity that resulted in eliminating my role altogether. I thoroughly enjoyed my time as FTE.As a contracted employee I was paid far less than my experience was worth (40% went to the contract employer). There is a stark difference in the way management and employees treat contractors. We were made to set in an open desk plan with low walls so we can be easily observed. The contract employer did not provide vacation or holiday pay for personal appointments or time off like FTS's enjoy. This is a reflection more on the contract employer than Intel but I think it is work noting. There were 2-tiers of contracted employees, those that could interact with Intel employees (like my position) and those that were nameless (faceless). I enjoyed working with my customers as an efficiency lead and know I contributed to the Intel team that oversaw my effort. Competitive high volume work load , good benefits, time off, Vacation, floating holidays, pool tables video games, time off, BBQ ball games, no parking complete with relaxation amenities. people are a friend to each other. management is approachable. we are all sorry it has to be closed down, and we did not want it to be closed down, we have no choice. Excellent place to work.  Love coming to work and being part of a team that engages in challenging tasks.  A great place to come in and learn and be productive Miscommunication, byzantine management structures, overworked employees too busy to do more than 'good enough', and a kill-or-be-killed career outlook among Intel lifers make this a frustrating and stressful company for creatively-minded technical millennials.Intel is an old company struggling with a colossal burden of technical debt and retro-utopian management abstractions straight out of the panels of Dilbert. The company is cutting fat everywhere it can in an effort to stay vital in an ever-leaner industry segment, and these pains are felt everywhere in the company, but nowhere as much as in internal support divisions like internal computing infrastructure and facilities services. Everyone is too busy bailing the boat to be able to patch the holes.My experience was in the internal computing services division, supporting infrastructure for various labs and design teams. The experience among the design groups is likely to be different, though maybe just as stressful in its own way. If you end up in computing, be sure to brush up on your IT history from the 1980's, because at Intel, history comes to life. Intel is a great place to work as long as you are not a contract employee. Contract employees are not treated well; even if you provide above average work. Very little Growth, Poor SalaryLittle Learning,Too much politicsBad grading structure,Poor OrganizationLot of free time.Can pursue other activities......................... I loved my job. Wish I could stay! Wish the company had a place in Idaho. I would stay with them. They take care of their people. You work hard and play harder. This is a great company with excellent management. Incredible technology and great leadership. I was part of one of their acquisitions and they are a company that rewards the people that are willing to work like it's their company. I was working as a programmer, and I left because it was not working out. They wanted stuff done fast, but when I finished it, they would change the requirements. Then, they would complain that I was not getting my work done on time too. I think I just had a bad manager, and maybe the rest of Intel is just fine, i don't know. Also, I was getting in trouble for using the restroom too much. You own your career at Intel.  It is a great place to work.  They value a diverse workforce.  They have great benefits.  They provide relocation for some roles. Intel is a pretty good company with good balance of work and life. The work is not very urgent and push, just medium. You have many free time to enjoy the life. The most enjoyable part of my job was being able to engage with the community and employees; flexible days that aren't typical, work culture can be a challenge for women, and people of color as is in most tech companies. Overall, not a bad place to work this is an old company from the 70s that needs to get into the new world and needs new executive leadershipneed more women in management and exec leadership This has been a great company to work for. You can learn all about smt, running machines, rework, inspection, packaging shipping. going to college would be a big help if you want to get ahead. Managed projects and oversaw operations. Monitored and reported out on internal contracts, finances, and expenses. Performed administrative functions including; records management, assessment of data, and file maintenance. Handled project schedules and quality control to ensure the work met timeliness and accuracy standards.Provided administrative and business support to department managers by managing shared drive set-ups, audits, budgets, and ensured IP compliant. Maintained department managers’ calendars; planned and scheduled meetings, events, teleconferences, and travel.  Promoted Corporate Services; utilizing multiple forms of communication, newsletters, postings and meetings.  It was wonderful job with lots of challenging experiences. joined intel as a college graduate. worked my way up to a staff engineer position. plenty of opportunities to learn and contribute, excellent compensation. would recommend company to any new college graduate. employees have to adhere to company rules and regulations, intel keeps a black list of employees/ contractors that company will not hire. Lead engineer for developing a set of global data center and creating a management ticketing system in Remedy for global purposes, hands on hardware and software systems engineer. A Intel valoriza a meritocracia, e incentiva seus funcionários a estabelecer e atingir resultados. Great place to workMerit basedHighly ethicalLow level of politicsResults oriented - employees are encouraged to set and deliver significant accomplishments generally ok work environment.  Typically you need a lot of cooperation between different sites to work efficiently. There are also lots of overhead to do work. The product and the work I did was good. It helped me gain knowledge and apply my skills as an intern. Being their only for 3 months as an intern it is hard to judge the entire company but I had a pleasant experience. Worked at Intel as a consultant for over 3 years. Intel provides great work atmosphere along with work life balance. Highly recommend this place to work for.. I love the company. Just ready for an opportunity to grow and earn more but finding that difficult. I have had plenty of good memories and worked with some brilliant people. Would love to retire at Intel if the right job came along. I participated in an Intel sponsored program that included a stipend. It was a big boost to my early engineering studies and exposed me to what engineers do. Challenging work and interesting topics explored. Demanding On-Call that can interfere heavily with work life balance. Competitive benefits and good stock options. An absolute wonder to work in.  The technology in mind bending and the staff is incredibly intelligent.  The work days are long but seem to go by quickly. great place to work out of college or post military.days are long but weeks feel short rotating days off on weeks 3 days on 4 days off and vice versa. friendly folks. I was an intern at Intel SSG and it was a really great experience. I got to work with people who are really experienced and know the in and outs of how and why software behaves poorly. This is a great company with excellent management. Incredible technology and great leadership. I was part of one of their acquisitions and they are a company that rewards the people that are willing to work like it's their company. it is a good company- very challenging - dynamic work place. I word on the shut down for the tools -trouble shooting the stick shutdowns and the controls for seimens and the TAS system as well as the controls for border states - I supported the tool qual process . One of the best company to work for in the United States. Benefits and pay are great. Employees are an awesome team. Bonuses year a round. Intel cares about their employees. A lot of job enhancement with Intel providing finance for education @ 100%. I will work for Intel for ever if I could. It was an amazing experience. People were encouraging and there was so much to learn.To be on such a team was a great privilege and a great opportunity.They are extremely encouraging towards growth and are very nice people Great job, high school internship. It has been an amazing experience for me to get into the industry young. It has helped boost my personal confidence and as well as my overall knowledge of the industry very productive . Learned the program very well . Did complete end to end Management .Loved the people & culture . Everyone is nice and work hard to achieve the goal . Management is very good . Learned a lot here with exceptionally good employees. Intel invents interesting things.  The technology is fun and challenging.  Lots of smart people to work with.  I enjoyed the team and learned a lot from engineers and lawyers alike. Working for a world class micro chip manufacturer has its ups and downs. When things are going good for the company the mood is relaxed, the purse strings are loosened up and life is good. When things go array the tension builds to get the company back on track. The focus is turned 100% to getting the company back into profitably as quick as possible. Long hours and short tempures abound. good opportunity for RCG but stressful with less importance to work life balance and career growth for process engineers is hard. management requires the engineer to work on weekends as well. on call system is drains the energy out of the engineers. on the other hand companys benefits are good. The pay is less than some but the culture is better than most and the work life balance is better so it is a bit of a trade off it depends on what you are looking for. Pays well.  The company is going through a lot of changes so it is a very dynamic environment.  Work can be stressful but a lot of mentorship available. Hours of meeting combine with manufacturing process issue resolution. Training provided was adequate to do my work easily.Benefits and pay was superb. Terrible backstabbing and cutthroat. Security Managers are angry, hostile, and mean. The old school employees are unskilled and incompetent, however they know the art of the thirty second commercial in reporting work that others are doing as their own by reading work from weekly status emails, and attending meetings just to listen to the hard workers and act like they are doing the work. Intel is one of the highest paying companies in my area, which is why I am still there.  It is a global company and in order to advance, which I have done several times over the years, you have to be available in every time zone.  This means work life balance is extremely hard to manage.  If I could afford to leave Intel I would. I was at Intel as a contract employee - which is basically a second-rate citizen.  Contract employees have no benefits whatsoever, nor are they allowed to any of the perks on campus, including free coffee.   The management treats you like a lesser, unimportant person.   I enjoyed my actual job, and the work I did, but I never felt respected or important.  When my contract ended, I was just gone - no goodbye whatsoever. Super intelligent people who missed the mobile revolution and now are on a slow moving ship.  Try as they might, it's a has been company that offers steady but not upwardly mobile opportunities. There was many learning opportunities within different areas of the company if willing to find them.  Great work culture and most co-workers were easy to get along with. The very best people I have ever worked with are here. I like to management and Intel core values. I actually liked showing up for work everyday at Intel. Intel is an excellent company to work for. It provides global perspectives for employees. The open door policy, work life balance, career path training and culture diversity are great values that allow employees to grow. overall this job requires patience you must take your time but be able to be fast efficient and finish the tasks correctly it is critical to following rules when cleaning Including usuing correct chemicals and cleaning solutions on the correct products and furniture to prevent damaging or staining furniture woods tiles different types of granite etc.prevent from staining carpet to keep yourself and others safe including cleaning around and no where near electrical  wet floor signs are critical when using must have up at all times while mopping or dealing with any chemical spill or drink spill Great opportunities to grow and create success, an excellent workplace where dreams can come true! Competitive compensationQuite stressful workload, especially when time nears end of the project. This is a great company with excellent management. Incredible technology and great leadership. I was part of one of their acquisitions and they are a company that rewards the people that are willing to work like it's their company. This was a good company to work for. The benefits were great and the name help open doors to places that would not have been opened without it. The teams were not really cohesive. Very good company to work for, the best thing was the compressed work week which gave employees enough time to get things done without having to use so much PTO. I would love to work with them again. The manager I had was one of the best managers I've had. The benefits were great. The people were great. The atmosphere was great. Would definitely consider going back some day Large enterprise company with great internal systems and procedures and that makes it easy to get lost in the fray. The Focal system is discouraging, Established Methodologies - implementing change can be difficult. Cultural discrimination is been seen at the time I was working with the company. 12 hour on 4 on 3.  MT under manned I believe the are trying to do to much with to few technicians all about saving money the bottom lne is what matters Intel is a great company that fosters a safety first culture. The work is fast-paced and can be challenging more often than not. Many great benefits as well as fair pay. Responsible for the equipment, to repair, to troubleshoots and do preventive maintenance. Support production team to attain production goal with zero safety and quality issues. Releases report on machine status to update the module engineering. I still love Intel and consider it the best company I have had the privilege to work for.  The culture is great, and the products are cutting edge, giving you a great sense of pride when you see your contributions publicly distributed and in the hands of friends and loved ones. A typical day at work, very stressful. I learned somewhat the 10nm finfet Intel process. Management was good and the workplace culture was great. The hardest part of the job was learning, understanding and applying the Intel 10nm finfet process. The most enjoyable part of the job was my co-workers. Intel is made up of a number of business teams.  Depending on which one you work for at any given time, they are a pretty good organization to work for however, they do tend to layoff their most senior people every few years to save a buck so it's not a place you want to work long term.  Work life balance is talked about however most everyone puts in 50-70 hours a week depending upon your role. Great technical shop to work and learn new skills. Poor management directionWorkload is always very highvery competitive Fast pacedLess micro managementHard to manage work life balanceGood for initial growth and learningLess job stability BK and his vision for Intel is poor to say the least. He and the board don't care about vision they only care about stockholders. Which makes Intel not a leader in the world... but a failure.... lead by example not let the stockholders control the research and development of what used to be the very best products in the world. Worked on several strategic projects.  Office environment was dark at times.  Working in such a regimented environment prevented strategic productivity. Very FUN and productive workplace with ping pong tables, in-house Gym with complete weight sets of dumbbells, barbells  and weight machines. Employees are encouraged to take walks on the nature trails  in the surrounding nature of the Agoura Hills. Really good work life/balance. Working from home is an option as well. the hours can vary week to week but overall managers understand that employees have lives outside of work. Good amenitiesProductive work environmentCooperation and collaboration are keyLearned the importance of communicationIntel stresses the importance of getting up and taking a break once in a while (admirable) Loved working at Intel.  Recent years had the company struggling to find its niche and overall position in the industry as it tried to catch up with all things Mobile (hardware and software).  It is attempting to lead the business regarding Internet of Things but seems to struggle where to actually play (from servers to sensors).  The company is plagued with millennials who may be the intelligent and most desired in today's age of relentless need for connectedness as the company takes a grip on these new hires lack of work ethic, advocacy, full enrollment, deep assimilation, loyalty as compared to previous generations like the one I belong who fully embraced the culture and stayed and believed in the company for decades.   Intel is lucky if they can keep new hires to last longer than 5 years, it seems. Diversity is the mantra, but ageism is the issue, like with most high tech companies these days. Just remember if you should get a job here is that it is risky long term. Do not expect any type of loyalty, even if you are loyal and work outrageous hours your whole career. This was a contract position but I enjoyed assisting Intel's educational departments and organizing company events and seminars. Intel cared that their employees were well informed about their products and gave tours of the manufacturing and assembling areas. Very stressful and under appreciated in some jobs, in the 24 years I worked there, seen many changes. The employees tend to make the job much more enjoyable. This is a great company with excellent management. Incredible technology and great leadership. I was part of one of their acquisitions and they are a company that rewards the people that are willing to work like it's their company. in the 10 years I worked for them was a great experience and the job was very technical.  I worked on machines that were very expensive and easy to fail, but following specs the job is fairly easy. I telecommuted my entire employment, which was nice. My immediate manager was great. Far less advancement opportunities than one would expect. Way too much 'big company' politics for me. Intel employs a great team of diverse people.  They have a great work life balance program and great benefits. I would suggest a ne Grad looking to begin their career in Business or Engineering; Intel should be one of their focus. Intel is a great place and culture to work for. As a group, we work very well together and with a family atmosphere. Very flexible schedule and no micro management style. Excellent atmosphere to work with.  Independence and career advancement is not an issue at Intel.  I enjoyed every minute of working there.  Good company to work for Flexible work schedule, A lot of learn. Great work environment, pays good. Get to work on new stuff before release Sometime you get to work overtime to meet deadline. Issues with middle management; otherwise a pretty good place to work.  Would recommend to a friend.Good opportunities to explore different job types and career paths.  Paid education!! It is the world's largest and highest valued semiconductor chip makers based on revenue,[2] and is the inventor of the x86 series of microprocessors, the processors found in most personal computers (PCs). Intel supplies processors for computer system manufacturers such as Apple, Lenovo, HP, and Dell. Intel also manufactures motherboard chipsets, network interface controllers and integrated circuits, flash memory, graphics chips, embedded processors and other devices related to communications and computing Most of the people at Intel are very friendly and helpful people to work with.This promotes a healthy work environment and people that want to come to work and do a good job at their work. Great company to work for, good benefits, good work life balance, sometimes management does not support everything you bring up for a change, to better your job. Fun place to work with exiting opportunities to grow and explore. Work culture is very healthy and friendly. Opportunities for learning many new technologies. This job has moderate physical demands. Techs will average somewhere between 12000 steps and 22000 steps a shift. Some of the parts are both heavy and awkward to lift. However, these parts are 2 person lifts. The best part of the job was the virtual option for professional employees. Also, there was no 'dress-code', which was nice. Plenty of room for growth. The engineering force in this company is one of the best in the industry with very respectable and hard working culture. One can learn and have much personal growth working in this work environment. Leadership lately seems to have lost some core values and wisdom that sustained the health of the company and ensued great successes in the past. I learnt a lot and the team is very professional. State of the art technology. Got to learn about some new and interesting projects that Intel is working on. Its the place to be in if you want to learn new methodologies and best practices. Intel allows you to enjoy your life outside of the workplace. However, the company cuts costs at every corner, often sacrificing some quality  of their products with these decisions.The workforce has to pay for these mistakes with large headcount cuts the past few years, while decision makers often remain unscathed.Overall the company can be enjoyable to work for, but job security never seems guaranteed. Management was very in tune with what was going on as well as deadlines and ongoing projects/issues. Internal opportunities were available and tele-commuting was an option. Productive years for me, as I learned a great deal about supporting laptops and desktops running multiple OS platforms. The IT Support Center was an ideal setting for learning technology and interacting directly with customers. It was great when I started. Amazing technology, very fast paced, a bit of an aggressive culture. It grew too big too fast on the labor force side, lots of redeployments eventually got old In general Intel has been a good place to work.  My experiences are in corporate services. The work has been challenging at times, and different most days. This is a great company with excellent management. Incredible technology and great leadership. I was part of one of their acquisitions and they are a company that rewards the people that are willing to work like it's their company. Everyone I worked with was great, but the overall feeling is that the ship is heading in the wrong direction and can't be turned around quickly enough to avoid a crash. This was once a great place to work. Now it has become obvious that they do not value good employees. It is all about the bottom dollar. You are expected to exceed goals on a daily basis even at the cost of effecting the line and forget about safety. The company once valued safety first, and now hides behind a veil of what it once was. The most enjoyable part of working here were the relationships with good people. Hardest part of the job was not being appreciated. I felt good about the positions I held at Intel and my ability to learn my jobs and then perform them flawlessly.  I became the lead technician on my shift and the primary trainer.  Intel did not hold anyone back if that individual wanted to advance professionally and personally. Intel provides its employees opportunities to learn and grow, makes it easy for the employees to move around to help with their careers. However, work life balance is not always there. Work is balanced but the inconsistencies and layoffs happening makes it very stressful. Good place to work, work/life balance is maintained well. Volunteering opportunities are fun. Well established presence in AZ.  Intel has certain ways of doing things, and though on the surface may seem odd- work quite well.VPN access was key for me in a consulting role. Great place to work. I retired in 2016 due to a family emergency. Now that it has been resolved I am seeking new Employment Opportunities and would live to return to Intel. Great place to work. I retired in 2016 due to a family emergency. Now that it has been resolved I am seeking new Employment Opportunities and would live to return to Intel. I worked at Intel for over 15 years. It was a great place to work. I retired in 2016 due to a family emergency and now that it has been resolved I would love to return to Intel. Had a great 20 years until they ended my employment during a downsizing 6 months short of retirement eligibility.  Not a performance problem and was replaced by two lesser paid people.  The company is a one trick pony and the CPU market overall is shrinking.  They have few if any alternatives in the pipeline, so layoffs will be a regular thing. The opportunity that Intel has to grow within this company is one of the best I've ever been apart of.  Once you are an Intel employee the Jobs on Line link will help you grow through out this company. An intense and productive environment, working with others who are driven to improve and succeed.  High ethics and low politics.  Rewards success well. Extremely large company that doesn't make you feel as if you are just a number.  Management was great, responsive, and fostered a team environment.  Great company. The culture at Intel is deteriorating, and the pay is slower than market.  Unfortunately it's the symptom of a company that is slowing in its growth.  I used to enjoy working here, but nowadays, it's very stressful and the hours are excruciatingly long.  Pay raises cannot even keep up with inflation in the Bay Area. Very good company to work for. Excellent opportunities to learn and grow intellectually. Management is very good, for the size of the company. I had to resign for family relocation reasons. Excellent Investigations conducted with confidentiality and integrity.  All investigations are conducted and completed in a timely manner, and they remain impartial to each investigation. Get with a good team and you will be successful in learning and have a good benefit package. There are opportunities for POC projects that are risky, but interesting. This companies work practices are top notch. Safety is the number one . The work was always clean and dust free. It had so many different types of tubing and pipe for its various chemicals and gases. They teach you new methods and ways to work with their technollogy. The hardest part was remembering all the safety proceedures during an install. Most of the time we got to take our breaks in cafiterias and the workplace was air conditioned most of the time. That's all I like about this place and that's pretty sad.Big time manager bullying goes on here; unless you're friends with the manager then you're fine. Intel provides continuous improvement for each individual that works there.  You are treated fairly and have a path for escalation when issues occur.  I just wish that the corporation helped the NM site stay a large production facility. This is a great company with excellent management. Incredible technology and great leadership. I was part of one of their acquisitions and they are a company that rewards the people that are willing to work like it's their company. Intel is in a constant state of flux. For a long time, you could expect redeployment (layoffs) to happen every four years or so. It is happening much more often now and sometimes we have multiple layoffs in the same year. Intel tends to over hire and then over fire. The theory is that you weed out the people who don't have the type A personality. Another theory is that you are good at your job, you have nothing to worry about. Both of these theories are flawed. Type B personalities have their place in the workforce. Not everyone needs to or is interested in climbing the corporate ladder. Also, even if you are very good at your job, you will still be affected by the constant layoffs because someone needs to deal with the workload of everyone who was laid off. I see more and more talented people leaving Intel for better companies. I'm on this site because I am one of those people. it has cutting edge technology. Work environment is friendly. This is an awesome resume builder. They hire a lot of top level programmers. I enjoyed working here. Really slow, inefficient work culture. People use nothing but PowerPoint and meetings are generally fruitless and no action taken, no decisions made afterward. Most of time people are just spinning their wheels, not going anywhere. good benefits and okay pay, to much management and they don't always know what they are managing.  Friends of bosses tend to get up not necessarily the hard workers. I really enjoy working here, professional environment. Unfortunately I do not believe I will get hired on permanently. I have tried repeatedly to no avail The pay in San Diego is great, but the culture is tedious.Too many cooks in the kitchen when decisions are made. Lots of fits & starts on product features. Internal turf wars among executive leadership. Product & sales teams are not very in tune with customer demands or evolving market trends. They only listen to each other.Intel is an ok company to work for for a short time period. The people are generally nice and the daily work environment is decent. Think of it as a very well-paying lilly pad -- someplace to land for a while before moving on to a better, more enriching career opportunity. The extraordinary amount of bureaucratic red tape, slow decision making and narrow job responsibilities means that working at Intel long-term tends to degrade employees' skills, marketability and morale. This is NOT a place you want to work for years and years. excellent place to work and grow professionally. this was a 12 hour shift and i was working from 7pm to 7am. excellent facilities. two hour break with a live-in health and fitness post. I loved to work at Intel. Everyone was very helpful. The management is very relaxed. I was given stocks from Intel after a couple of months which was a surprise. Lack of visions and effective leadership from management, major conflicts between groups, weak technology strength at the new development, lack of confidence from individual contributors, in-health communications, I had a lot of fun here. the people made my experience here feel like a second family. The bosses were great too. passionate about what they do there and what they accomplish. Intel is a great place to work. You will work hard and you will be compensated accordingly. There are many smart and talented people at Intel and it is a great experience to work around these type of people. You will learn to be accurate and quick. You will be exposed to much technology and the opportunity to expand your skill set and experience. If you ever get the chance to work at Intel, take it. I loved this fast paced company and how I felt driven to continuously improve myself.  Even when they lay people off, they typically treat them well.  I do miss my job though. Offices are incredible. All of the administrative staff very respectfull and very happy to assist you with anything you need. All of the general experience was great! A very well rounded company that is always looks for ways of innovation. Intel is challenging and rewarding all at the same time  I truly would not change that thing. Work place is flexible. Project orientated, not hour oriented.Workplace culture is not very good.  Too many outside culture influences information sharing. Troubleshooting, testing, and maintenance of systems.Learned technician work of cutting edge technology.Management is very intelligent and professional.Smartest people in the world work here.Hardest part of job is being converted from contractor to permanent technician without a bachelor degree.The work and experience was enjoyable but test technicians are mostly contractors and short term work. Intel is a company that is moving away from the desktop and laptop computers due to the changes in the industry.  Intel is trying to figure out the new products and technologies that will carry them forward as a top company. Don't have anything to say - unfortunately site is forcing me to enter something here.  It was over 15 years since I worked at Intel and I do not think it would be fair/relevant to do a review of this company Big company yes, but overall strives for the best of customer first, great opportunity, performance and advancement.  Very diverse products and footprint, you can really find your niche. Future is not quite defined as PC's decline. It will continue to be a large chip manufacturer and is looking at IOS and other potential markets .Lot of great innovation and product groups, somewhat top heavy in management. Tend to over engineer and be slow to market with non manufacturing innovations. "
                },
"encodingType":"UTF8"
}
