{
"document":{
"type":"PLAIN_TEXT",
"language": "EN",
"content":"Typical day at consisted of morning follow-up calls, setting up appointments for the weekend, and making sure previous day's work was completed correctly.  I learned how to multi-task as well as approach random customers with no fear and to talk to them not about cars, but about why they are really here.  The workplace culture was very engaging and everyone was willing to help each other out.  The hardest part of the job was customers forgetting who they worked with before and inquired on the Internet; thus causing the deal two be split.  The most enjoyable part of this job was the fact that I was able to see the greatest and newest of car models. People used to work very hard to get things done, and collaboration was smooth. Starting from a bunch of re-org's, there are lots of politics around. Admittedly, some teams are awesome, and driven to get things done in the right way. However, some teams are just playing favoritism, and people got promotion for stealing other members' credits. The best company you can ever imagine to work for. Lots of perk, good salary, CEO and Leadership is incredible, Microsoft might be sinking it up - pay attention Many perks, including complimentary breakfast lunch and dinner, game rooms and gyms. Free time to collaborate with team members. Long breaks.Beautiful campus. I think everyone should go to LinkedIn to just even experience the environment There’s is so much to learn and they teach you how to grow with in the company and out I cannot speak highly enough of LinkedIn, a company from whom I have no doubt we will be hearing so much more in coming years. Standing at the intersection of a changing workplace and a rapidly globalizing workforce (current events notwithstanding), LinkedIn has what it takes to substantially improve the everyday work experience of people everywhere in the world.The staff know this. They feel the mission, and they are an exceptionally bright crew of motivated, goal-oriented professionals. The company leadership has had some missteps, but the carefully slow motion merge with Microsoft has not yet been fully appreciated for the strength of the organization that will come from the joining of these two global powerhouses. We need not fear LinkedIn being changed by its business in China--but China might need to fear being changed by its business with LinkedIn. Us? Only good can come of LinkedIn bringing its social workforce tech to a country like China.People at LinkedIn are unusually sociable in the workplace, have a bright and optimistic attitude in all things,and adhere to polite and professional mannerisms in an extra-meticulous way; it is as though the propriety and crispness of professionalism and diligence we imagine was true in the 1950s corporate world, was brought to the present, minus all the retro downsides, and plus the niceties of today's diversity, civility, and social advances.This is a place anyone can shine. I would gladly work at LinkedIn again. I had a limited-term contract of several months, but I cannot speak highly enough of the organization, its  people, or its potential. With Microsoft bringing the tools and LinkedIn bringing the social tech, look out. The workplace of tomorrow looks like something being sketched this minute on a whiteboard in Sunnyvale, California by an Indian programmer, a skateboarding project analyst, a retiree consultant from IBM and a marketing wunderkind just out of some Parisian salon, all of them working together seamlessly and with use of the latest tools and tech.Such an awesome place; so good to know, a workplace can be that great. LinkedIn makes it very obvious that they value their employees. They have developed an awesome culture allowing all of us employees to be self expressive, to grow as individuals and as teams, to give back to our communities, and to just have fun in our workplace. I do not wish to publicly review Linkedin.  This is not my style, if anyone has questions about the org or my time there please reach out to me directly. I never worked at Linked In. I don't know why they are including this on my application. I only use LinkedIn to apply for jobs and network. I'm sure it is a great place to work. Wish I could have stayed were I was as a contractor. The management staff was excellent and gave me everything I needed for success. I loved my time working for LOS A lot of initiative to have every employee to grow while at LinkedIn. There isn't a whole lot of people that look like me or come from my socioeconomic background. So I spent a lot of time isolated because I didn't/couldn't relate to my team mates Free meals, bikes, gyms and gym reimbursement. The wrong people get promoted time after time and poor decision making on the promotions make it hard to keep working here. The company was filled with ex-contractors from Apple and they treat as if you are an unwelcome entity. My manager was Asian guy who has zero respect for senior consultants like me. Your suggestions and ideas do not matter as you should do what an FTE employee tells you, even if your suggestions/ideas were to improve the quality of the product. Day in and out you were treated with disrespect. I worked in other companies like Facebook, HP etc and I was treated with respect. My manager was micro-managing me and criticizing is the only thing he excels in doing. Zero appreciation from any quarters. Good that it ended soon and I am back to where I loved to work LinkedIn is a great company with many nice professionals who are willing to help at any time. They provide free breakfast, lunch, and dinner. They also have many online training classes to take for free. Worked as a contractor. Great place to work at. Free food, snacks, and drinks. Contractors are treated fair unlike other big companies. I highly recommend working at LinkedIn. I was fortunate to be part of this wonderful company, whose business actually helps improve the lives of people around the world. As a Systems Engineer Intern at LinkedIn, I was part of Compute Engineering team. I had the chance to learn and understand how LinkedIn operates with its Data Centers around the world. I had a wonderful mentor who would help me understand my job well. I also had a visionary manager whose intentions actually inspired me to work more passionately. My typical day would include, writing python scripts for an application development, weekly meetings with mentor or manager or the entire team. The encouragement I received, never made me think I had a hard job and I enjoyed every part of my time as an intern here. One thing that LinkedIn taught me is that to build strong relationships. LinkedIn was a great culture and company to work for. The learning aspect was amazing and training provided was superb. Management was coherent for the most part and helped when needed to align workforce to attain the goal sought after. I would like to work abroad as mutch as i can and as long as i am single.I prefere to work in tunnels , caverns and to learn new professional things.I like sport as skiing,kitesurfing and footbal. I worked for this organization for about 3 years. They will push you and challenge you every day to get every bit of talent you possess out of you.Perks included $2,000/year reimbursement for gym memberships or day care for your child. Its taxed so you get about 75% back.Free lunch at all the offices. Annual trip all expenses paid to Las Vegas.Once a month you have the opportunity to give back to your community and bring your parents and kids to work.The office shuts down the whole week of July 4th and the week of Christmas. This is paid!Take advantage of all the training opportunities(LinkedIn Learning and Trainings offered to your specific LOB. Very positive environment where people feel truly appreciated. The perks are amazing including the food, gym access and InDays. I would highly suggest looking at LinkedIn. All the processes at LinkedIn were really well thought through, so I experienced zero barriers to doing the best work of my life. I think toward the end of my time there, there was concern about the lack of quickness in my work, which is a shame, because things should be more about quality than about quantity. They were pressuring me to work 10-hour days, and I had a 2-hour commute. But it is a business after all.My division used an agile development process with mandatory daily standups, so it was hard to come up with enough things to justify the day's work. Other agile departments make daily attendance optional, so you can work on things as needed, and seek out updates as needed. Typical day at consisted of morning follow-up calls, setting up appointments for the weekend, and making sure previous day's work was completed correctly.  I learned how to multi-task as well as approach random customers with no fear and to talk to them not about cars, but about why they are really here.  The workplace culture was very engaging and everyone was willing to help each other out.  The hardest part of the job was customers forgetting who they worked with before and inquired on the Internet; thus causing the deal two be split.  The most enjoyable part of this job was the fact that I was able to see the greatest and newest of car models. Great if you're in engineering. I left prior to their acquisition into Microsoft. The workplace culture was amazing, Speak Easy Rooms. In-House Theater. Ping Pong. Foosball. Rewarding Culture. Great People. The most enjoyable thing is that its a 8 hours shift and under management all the team members work simultaneously and enjoy our work and we are praised for what we cook. I like when the employee praise my food. Management is awesome. I got off when there is public holiday. Uniform is another plus. Dental vision and other insurance is included. No stress at job.Over all its a five star. I bought a house in Manteca, so i need a job around there. Great culture which makes the day to day a lot of fun.  Company is going through a transition from hyper growth to stable growth and is trying to find its identity as it goes from disruptor to incumbent Linkedin had great and smart employees to work with.  The work was documented so you were set up to succeed.  Management cared about you and cared about your career growth. Upon hearing about this position, I expected it to be another typical customer service position -- boring office culture, drab building, poor interactions with customers.My opinion was completely turned on its head.The culture is amazing, with great benefits, and a great work environment. I am eternally grateful I had the opportunity to realize that even a customer support position can prove to be a worthwhile and meaningful job. LinkedIn really does care about its people and culture.  There are also plenty of groups with particular focus's one can join.  There are always changes going on so you have need to be focused on what's relevant to you and your group. Work life balanceFree FoodDirect interaction with your Business UsersBusiness User community is pretty hands on and they know what they need vs what is nice to have See Review Summary. I worked for the HR VP, who was new and she needed someone with Sales Comp experience on the HR team.  I was a contractor for a 6 month and enjoyed working with the Sales Organization as well as my VP. The company is a great one, management could use better training. Hope the company puts more training into their mangers, they make employees quit and i dont blame Continuously striving to improve the products and services they provide to a changing workforce, which takes talent and courage. The drive to be at the cutting edge is apparent within the culture there. Excellent benefits and some great people to work with; lack of career growth due to poor management; constant turn over results in a repetitive and uninspired culture, but the benefits (gym, free breakfast and lunch, unlimited time off) help to make up for downfalls in management LinkedIn gave me an amazing start to develop my skills and really understand what I was interested in pursuing further. Everyone is open to sharing their knowledge and helping you really find what you're passionate for. Fast paced environment fun at work. Work was challenging but people were supportive. There was ample opportunity to mold the role as per the business. Overall great experience Free foodFriendly place to work atFast paste, stressful, lots of pressure Colorful delicious foodClean and sanitized organizesBelieve in perfection I was a contract employee for LinkedIn.  Learning what a internet company and culture is like was eye-opening and I'm happy I did it.  The environment is extremely quiet, because everyone is on a computer.  The work was all email queue, so not exciting or rewarding.  But the culture was fun, young and helpful.It was truly the most beautiful and ergonomically designed place I have ever worked.  It has to be because the work is dull. Everyone seems to like it there and that alone says a lot for a company.  They are doing lots of things right! Never have I been in a more supportive and collaborative environment than here at LinkedIn. From the first day people I didn't know walked up to and wanted to know what team i was working on, where I was from and extended help with getting acclimated. The experience was great. liked working here. Learned many technologies at this company like My sql, JAVA development, designing, network , switched, routes and rest development Worked there for almost 5 years. The stressful job and heavy travel is mostly in the account/relationship management space. The offices are great. Benefits are the best you'll find anywhere and make up for the lower salary in terms of market value. Leadership was great but that was prior to MS acquisition. CEO awesome. Work/life balance was just ok - If you need to work remote, there is not a lot of flex on this, they want you in the office for collaboration. As long as you don't mind going to office, I would recommend. I didn't care about free lunches, game room, etc. I needed more flex for family which I think is a bit of a miss here. Great company, executive leadership is top notch. There is a lot of high growth marketing programs with interesting work. Past few years there's been several additional layers of management and team expansion. Company is definitely shifting into a large corporate environment. I really enjoy the combination of flexibility, and competitiveness that this workplace offers. The perks are great and they have the best benefits as well! Typical day at consisted of morning follow-up calls, setting up appointments for the weekend, and making sure previous day's work was completed correctly.  I learned how to multi-task as well as approach random customers with no fear and to talk to them not about cars, but about why they are really here.  The workplace culture was very engaging and everyone was willing to help each other out.  The hardest part of the job was customers forgetting who they worked with before and inquired on the Internet; thus causing the deal two be split.  The most enjoyable part of this job was the fact that I was able to see the greatest and newest of car models. The company culture for Linkedin is phenomenal. Coming to work doesn't feel like actual work, more like a university feel. Collaboration is fairly simple and everyone has a 'move forward' type of mentality. This mindset alone makes the workplace fun and allows an analyst like me feel like I am making a difference in the company! Very good company with nice culture and tons of cool benefits. Lot of career opportunities and very competitive. Leadership exactly knows what they are doing. everyone is amazing and so is everyTHING. food is amazing and so are the perks. You'd be crazy to not take an offer here. They care about their people Fast passed and you learn a lot. It is the tech industry so you never know how long your department will survive. Not a very diverse work environment but a very fun environment. In general, LinkedIn is a great place to work if you fit a certain mould. It has an excellent engineering & product team, and engineering and product management work closely together. With over 30 years in Silicon Valley, this is THE BEST place I have ever worked.  Our CEO Jeff Weiner is one of the best corporate leaders in the world.  Now being part of a revitalized and resurgent Microsoft, LinkedIn is even better positioned to help build the new global workforce. LinkedIn is an amazing place to work in any role. You will literally be surrounded by the smartest people you've ever worked with which will help you to become better in your career. Get the opportunity to work with really bright people but analytical teams tend to have much longer working hours. Otherwise the benefits are great and you will definitely learn a lot. This place is great...the people are excellent and the leadership allows you freedom and autonomy. Never, have I felt belittled, punished or micromanaged. LiknedIn provided a great opportunity to grow as an account manager and sales professional, as well as great clients to help grow their businesses - I would recommend the role! Saw terrific opportunity early in my tenure but then it got incredibly competitive, cut throat and political as the company grew quite large. That's really the gist of it. LinkedIn is great! makes my life a whole lot easier to connect with people etc. I haven't worked for LinkedIn, i am simply a user, where i connect with high up people and source candidates to match jobs that we have A great place to work, with strong values, commitment to perform.The work environment is easy going task oriented with strong possibilities for career development Typical day starts at 6:30am where I respond and read emails. Create payment batches for Employee Expense reimbursements and Supplier payments scheduled for the day.Reach out to concerned teams and requestors to help resolve any payments that are due but are on system holds.Learned a great deal about work enhancements & enjoyed doing system testings.Fun days as well as Flexi-hours provided to help maintain work/life balance. Never worked here, not sure why this is being asked? So I'm fillling it out so I can get my awesome resome posted. I need to look into Linkin though. On my job hunting list! :) LinkedIn has a great work culture that integrates peers and makes sure that you also get to have a good time at work - while you work! They want you to be the best version of you - they truly care about their employees' happiness. Great location, perks, good people! Linkedin provides an atmosphere that allows you to stay on point and be productive. They provide excellent meals, snacks, and healthy treats! Great company to work for. Surrounded by innovative people.  You must work hard to get where you want to go. Best food in town, wonderful barista, and great snacks. Working for LinkedIn was a really great experience. The work life balance was great and the team that I worked for was awesome. They offered free breakfast and lunch which is awesome. The flexibility to work at different office locations was also great. Pros: People super invested in the company and their jobs, transparency, unlimited time off, free food, understanding managers.Cons: Underpaid, overstressed, overworked. Typical day at consisted of morning follow-up calls, setting up appointments for the weekend, and making sure previous day's work was completed correctly.  I learned how to multi-task as well as approach random customers with no fear and to talk to them not about cars, but about why they are really here.  The workplace culture was very engaging and everyone was willing to help each other out.  The hardest part of the job was customers forgetting who they worked with before and inquired on the Internet; thus causing the deal two be split.  The most enjoyable part of this job was the fact that I was able to see the greatest and newest of car models. Linkedin is a great opportunity and very easy laid back place to work,  all the managers are great and people in general are great.  Linkedin has a lot to offer for new comers and a lot of opportunity to grow for any level employee. LinkedIn is a really good site to work at.  People are really friendly and there are many job opportunities.  I worked there as a contractor, but left because the contracting company I worked for did not have many advancement opportunities. Just got hired so don't have much feedback yet.Simply adding words to get to the minimum characters that I need to pass this stage that for some reason I need in order to move on to the next page. LinkedIn has a great culture and benefits. A lot of smart people work here and I have enjoyed my time here. I would definitely recommend LinkedIn to my colleagues. LinkedIn has the standard tech culture that defies traditional, conservative professional culture.  No dress code. Employees skateboard, play around, etc in the middle of the work day.  There's food everywhere, etc.  I didn't have that positive of an experience because I didn't fit into the culture well.  It was too much fun (never thought I would say this).  Also it wasn't diverse.  They claim they want you to bring your full self to work; however, they more so want you to bring their interpretation of what your full self should be to work. i get to talk to so many people, each a kind of their own. Being a leader is really amazing. i get to chair general body meetings and also participate in various other events. it is a truly enriching experience. It builds confidence and a sense of satisfaction after interacting and helping the students that come to us. Very relaxed environment but everyone takes their jobs seriously and are very committed to member data protection and privacy. Management is very approachable and helpful. •	Received daily incoming packages from UPS, USPS, FedEx via scanning each item into computer to generate a log of when items came in and for who.•	Verified location of recipient or recipient’s admin and cataloged item in corresponding delivery bin separating by building, floor, and area. •	Recorded number of parcels and time delivered by carrier, in conjunction with as out bound parcels by department. •	Delivered sorted parcels to corresponding recipients using a handheld scanner to obtain a signature or mark as left at desk.•	Inventory of LinkedIn high value items This role was a non-technical role but allowed me to apply my organizational and planning skills to help LinkedIn expand globally through Sales and Marketing offices. This was my first entree into the Sales world. I learned how to work through setting up facilities, employee contracts per country, IT needs and other specific requirements for setting up offices based on the region. This was very, very different than my past roles in technology based groups.  This also required data analysis to determine which countries we should open office s in and when. The hardest part of the job was the large amount of international travel and this was at times, the most enjoayable part as well as I was able to have in person meetings with employees in various regions around the world. LinkedIn offers high pay and state of the art tools, but the culture is competitive.  I would recommend for people who are polished, but not for people who are insecure. From the mission to the lunch everything LinkedIn I have nothing but great things to say.  It's interesting that LinkedIn holds itself accountable to the caliber of offices/benefits in an area versus holding itself to it's own LinkedIn standard and that may be my only slight criticism. Great Job, especially for entry level people. Downfall was the outsourcing. If you do a contracted job, be there to work hard and try to have some fun while doing so. Too many competing priorities. Management does not enforce any discipline. Need to develop some top - down prioritization and create standards for the work that is done across the teams. I have learned a huge amount at LinkedIn from many exceptionally smart leaders and colleagues, and have had the chance to take advantage of many opportunities, including an international transfer, which is demonstrative of the emphasis the company puts on 'transformation' as a key value. A healthy work/life balance is encouraged, but is not always realistic, especially in some smaller teams working across multiple regions. The company was a great place to work for. Unfortunately, the division I was in (Sales Systems) was not a good fit.Being as LinkedIn was a social platform, management preferred personality over qualifications. Everything is fun and games until the company culture is in question. Food everyday, most are friendly however billing dept is very questionable. Not what a person would expect of this company. I was harassed badly on a daily basis. Everything from having my belongings gone through, my business and personal email watched, my car keys were copied. It was reported and nothing was done about it. They like to make fun of peoples situation (health, whether you own a home or not etc). Basically if youre not on their clique, you will be pushed out of the door. I love working with Linkedin, and I love promoting for them as well. They are a great company to work with and work through, and I have made a ton of valuable connections. Great place to work and network with colleagues/professionals. The food is amazing and they provide outstanding benefits, from: paid gym membership, paid transportation, and health coverage. All the perks of preeminent millennial workplace. Food, space, open culture, fun-loving. Editorial function nascent; this remains primarily a tech company. the left hand definitely does not know what the right hand is doing I like the work that I do but the company is merging and it is chaotic at this point. Typical day at consisted of morning follow-up calls, setting up appointments for the weekend, and making sure previous day's work was completed correctly.  I learned how to multi-task as well as approach random customers with no fear and to talk to them not about cars, but about why they are really here.  The workplace culture was very engaging and everyone was willing to help each other out.  The hardest part of the job was customers forgetting who they worked with before and inquired on the Internet; thus causing the deal two be split.  The most enjoyable part of this job was the fact that I was able to see the greatest and newest of car models. LinkedIn is a great company to work for! The perks are amazing and the culture is young and progressive. There's a good reason people want to work for them. Working at LinkedIn has been one of the greatest blessings in my life. My colleagues and are are certainly spoiled with the amenities offered here but beyond that the connections that are fostered by the culture at LinkedIn are incomparable. This company has an open office environment where attorneys, paralegals and assistants all share an open space.  There are not offices or dividers and this can cause a great proactive environment where all levels share equally in discussions and projects. LinkedIn has created a great culture for their employees. It's fun, laid back and has great benefits from free lunch everyday, breakfast on fridays, and an array of snacks/drinks. LinkedIn has so much to offer. It is a great place to start a career especially right out of college. The management there is amazing. I love the culture and the environment LinkedIn has. It's more about teamwork than a boss in a separate office. I absolutely loved my team lead. She was everything anyone could ever ask for. She was helpful and supportive in every aspect, whether it was life or work. LinkedIn EMEA HQ is great international team of professionals, great opportunity to touch different cultures, markets as well as open and honest envirionment. I started working for LinkedIn about 15 months ago.  My onboarding wasn't as thorough as I would have liked.There are lots of smart people who I work with and overall the culture is pretty good.  I have found that work-life balance has been a little harder to achieve than I'd like, but overall moving across the country to work for LinkedIn has been a positive experience. - Work hard / play hard sort of environment- Great coworkers, everyone works hard to achieve company's objectives- The missions we are on is crystal clear from CEO down. - The best part about LinkedIn are the people / talent. You can be the top performer in all areas and get a rating of 'exceeds expectations' at each review, and still get laid off.  They tout their 'culture and values' but do not really exercise them. Great place to work, awesome people, compensation is on the lower end but off set by unbelievable perks. No longer a start up, becoming very corporate. My main job is running the Marketing/Sales Staff. I also travel and find key new locations for the owners of the company.I work hand in hand with the Director of Operations for each sister clinic. Great company to work for but need to work on hiring contractors and keeping people that have really added a lot of value to the company in genera. I was a part of incredible change in the recruitment and advertising landscape, really appreciated the opportunity to do so for almost 6 years. I feel like the sr executive leadership has a fantastic vision and mission. Start up that grew to a multimillion dollar company. Good environment. Low turn over rate, located in the heart of medical center. Free parking. Benefit package. Link takes the security of their clients very serpious. This company is also willing to train those who have no previous  experience and have a flexible schedule. it might grow greatly through Linkedin Connections, Followers and endorsements of skill. Focus on your own skills, expertise and demonstrate yourself personally. If you think that your connection or endorser has not revealed something that was valuable, then you can always recommend them to state it. The endorsee will be able to see those skills on your profile. http://buylinkedin.com/ Great organization, amazing perks and benefits.  Generally speaking the people that work here are some of the best in the business and of very high caliber.  Leadership / Management was often inexperienced and or lacked longterm vision. Every day was a learning experience.  That's what I loved most about my career.  I am a very good manager of people and look forward to helping each employee grow and improve every day.  I consider co-workers as family.  The hardest part of the job is letting someone go/firing someone.  The most enjoyable part of the job is completing each day safely, productively and with a short term and long term plan that the team has communicated. Working here as sales manager. Role involves, - finding prospects in the market- fixing meetings with the decision makers and influencer- meeting customers and understanding their  business objectives and challenges- Proposing LinkedIn Solutions - Closing deals Learned concept sales, collaboration with team and cross functional partners globally and owning your own business. Linkedin culture is very positive and cordial. Everyone is very helpful in creating a stress free enviroment. It is a joy to come to work Typical day at consisted of morning follow-up calls, setting up appointments for the weekend, and making sure previous day's work was completed correctly.  I learned how to multi-task as well as approach random customers with no fear and to talk to them not about cars, but about why they are really here.  The workplace culture was very engaging and everyone was willing to help each other out.  The hardest part of the job was customers forgetting who they worked with before and inquired on the Internet; thus causing the deal two be split.  The most enjoyable part of this job was the fact that I was able to see the greatest and newest of car models. Resolved mobile device tickets using Service Now ticket software to fulfill LinkedIn employee needs and challenges.Manage Linkedin's mobile device assets. Friendly co-workers that are open and willing to help out others.Hardest part of the job is keeping up with the fast pace environment.Most enjoyable part of working at Linkedin is coming in to work and being welcomed by everyone. By far 1 of the best companies I have ever worked for.The perks are Awesome.Employees work together to help each other succeed.Management works with the team. Great Place to work. Great People. Nice environment with gyms to workout. Lots of food Healthy Breakfast Lunch & Dinner. LinkedIn is an awesome place to experience. It has a lot of perks, and there is a lot of support for your growth. It is a larger company, which makes movement difficult. With that said, in my experience, if an opportunity is not open here, LinkedIn managers, will help you find the next play that will set you up for success. There are no dead ends. I had a good insight into the one of the most popular social network companies and saw how they dealt with big data. It was awesome! LinkedIn is an amazing company to work for, you are encourage to take intelligent risks. My co-workers are amazing everybody works together to achieve the company goal. It is a fast paced company, so be prepared to be on your toes all the time. Work/life balance is dependent on everyone but the company always has events and encourages their employees to have that balance. Worked as a contractors for a 4 week project and found the team to be very energetic and intelligent, and the company culture to be supportive and and fun. I came to LinkedIn on a 3 month contract that ended up being extended a full year. Unfortunately there was no headcount to keep me. I would love to come back someday and work for LinkedIn again. Company as whole is great to be apart of. The culture is one that is considerate and nurturing to their employees. They are a company that really focuses on their employees and their ability to maintain that is incredible. Down to earth team, they demand integrity, cooperation, and results, but make sure that everyone has fun on the way.  Excellent place to work Working at LinkedIn has truly been very rewarding, the culture there is truly amazing. Everyone there is friendly, willing to help others out, although it's a fast pace company everyone knows how to make someone feel at home. LinkedIn is Great! I have been working at LinkedIn for about 10 months now.  I love my team and have learned so much from having worked with them.  At LinkedIn, we aim to create avenues in which people can transform their lives.   In my role as a Recruiting Coordinator, I have received opportunities to explore my interests and desires outside of my day-to-day role and own projects.  My manager has been very supportive of my career development and personal goals.  We have a fantastic culture and I would encourage any one who is interested in bettering themselves to apply. Though its known for great work/life balance and you get great benefits,great food and interact with friendly, smart co-workers, the work/life balance part does not really hold true if you have a bad manager. There is a side to this company that really needs to improve - it has really inexperienced middle level management and almost no accountability for the manager - they can pretty much do what they want and no one holds them accountable. Unfortunately, your life can be difficult at LinkedIn if you have a bad supervisor. Upper management is great though. Investigate prospective manager and team thoroughly before accepting an offer. Awesome place to work at. Helpful and smart colleagues. Nice location, Bang opposite Google. Wide campus and free bicycles to go from one building to another in the campus. I have been at LinkedIn for just over a year now. My current position is a Dance Fitness Instructor for the Health and Wellness program, that is now managed by Plus One. Since I have been working at LinkedIn, I have received nothing but a welcoming and energetic experience. I am impressed by the Health and Wellness Program's initiative to take care of the health of the company's employees by providing creative dance and fitness classes. This is where I have been able to find my opportunity to connect with the many employees at LinkedIn. I have found it efficient to communicate with management, receiving prompt responses to any questions or concerns. The communication is well organized, keeping all instructors knowledgable of the program's progress. One of my most enjoyable experiences was when I initiated a choreographed dance fitness video for the Health and Wellness Department. Through diligent communication I was able to get employees to participate in the video to represent our team. The Health and Wellness team fully supported our video. It is through these opportunities that I find LinkedIn's culture to be forward-driven and supportive of the employee's well-being. High tech, Good place to workGood benefit,free gym, free food, free drinkGreat place to learn, the training system in Linkedin is good I developed many KPI dashboard for all product lines and worked a lot on management reporting. I also worked on many valuation cases. I work for about 5 days, 8 hours a day. I learned many things in the field of data research most specially about online business using social media. I become punctual and organize because I imitate others I learned from my co-workers and also they learned from me about my work of ethics. The hardest part of the job is, if the client is requesting to do additional work on weekend. The most enjoyable part of my job is conversation and meetings. Co-workers are outstanding-folks really want to see you succeed. People work hard but do so voluntarily. Very positive environment, you feel like an owner and have the ability to make an impact. -I learned how to manage up in my position. How to prioritize tasks and become extremely detail oriented Typical day at consisted of morning follow-up calls, setting up appointments for the weekend, and making sure previous day's work was completed correctly.  I learned how to multi-task as well as approach random customers with no fear and to talk to them not about cars, but about why they are really here.  The workplace culture was very engaging and everyone was willing to help each other out.  The hardest part of the job was customers forgetting who they worked with before and inquired on the Internet; thus causing the deal two be split.  The most enjoyable part of this job was the fact that I was able to see the greatest and newest of car models. Awesome CultureGreat PerksFlexible Work EnvironmentGreat exec teamCollaborative environmentNovel Purpose Summer I spend at LinkedIn was one the best work experience I have so far. People are helpful and friendly. Co-workers are nice, opportunities to learn new skills. Testing org overall is most hardworking set of folks in the org always meeting the demands of the business Day to day duties include admin work, such as uploading new hires into the Wellness portal, processing gym waivers, and troubleshooting portal/gym access issues.  I'm also responsible for maintaining the global budget for special events.Bigger picture items include coordinating Wellness initiatives and events.i.e. Coordinated a Tough Mudder for 130 employees, The Bay to Breakers for 350 employees, and organized an epic hike to the top of Half Dome for 12 employees which produced a corporate photo that went viral.Started an onsite running program here at LinkedIn and now working on partnering with a local climbing gym to host climbing classes for our employees.Most enjoyable part of the job is having a job that doesn't feel like 'work.'  And all the free food. LinkedIn embraces the culture what most tech companies in California have.  The work hard - play hard mentality. I learnt a lot working on some cutting edge technologies! I enjoyed working there. great place to work, knowledgeable people..Very professionally ran company, and communication is good. when I came to Le Moyne College, I immediately applied to IT.  I have always enjoyed a challenge with my at home business of building and selling computers, but I wanted the opportunity to experience a network - like a college.  I have received training on how to navigate, improve, restructure, and maintain a network for over 3,000 students, and 500 faculty members.  I have had the pleasure of working with virtually every laptop on campus, train faculty - even the president of the campus - and establish myself as a trust worthy and hardworking individual.  Because of my workmanship at Le Moyne in IT, I have been hired freelance a number of times to do work at faculty homes, other cooperations have hired me temporarily to troubleshoot issues, and I have helped aid in the upgrading of Le Moyne's VM network that replaced our old Win Xp machines. loved this company. Best place to work EVER. Awesome team environment Enjoyable place to work with great co-workers, great benefits and wonderful perks. The Company has many offers and keeps the employee involved and Corporate communication is always available. Great organization with an amazing culture and wonderful mission. Love LinkedIn!  A great place to work, grow and learn.  A company that's highly diversified, global and a leader in the social media domain for professionals.  Seeking a permanent or a contract position...nice work environment,, You have to be extremely dedicated and motivated to work. Fun working environment and a lot of room to grow in the company. Very independent job Excellent Benefits, great culture, lots of potential. Fast paced yet they often found time to do fun activities. Free food, salary reviews, great co-workers, etc. I enjoyed my time at LinkedIn. With free food everyday and free snacks, everyone puts on the 'LinkedIn 15'. It's a great company that values their employees. The coworkers are fantastic, nothing like working with inspiring people every day. Thoroughly enjoyed learning the internet industry. The company works hard to attract top talent. Typical day at consisted of morning follow-up calls, setting up appointments for the weekend, and making sure previous day's work was completed correctly.  I learned how to multi-task as well as approach random customers with no fear and to talk to them not about cars, but about why they are really here.  The workplace culture was very engaging and everyone was willing to help each other out.  The hardest part of the job was customers forgetting who they worked with before and inquired on the Internet; thus causing the deal two be split.  The most enjoyable part of this job was the fact that I was able to see the greatest and newest of car models. People used to work very hard to get things done, and collaboration was smooth. Starting from a bunch of re-org's, there are lots of politics around. Admittedly, some teams are awesome, and driven to get things done in the right way. However, some teams are just playing favoritism, and people got promotion for stealing other members' credits. The best company you can ever imagine to work for. Lots of perk, good salary, CEO and Leadership is incredible, Microsoft might be sinking it up - pay attention Many perks, including complimentary breakfast lunch and dinner, game rooms and gyms. Free time to collaborate with team members. Long breaks.Beautiful campus. I think everyone should go to LinkedIn to just even experience the environment There’s is so much to learn and they teach you how to grow with in the company and out I cannot speak highly enough of LinkedIn, a company from whom I have no doubt we will be hearing so much more in coming years. Standing at the intersection of a changing workplace and a rapidly globalizing workforce (current events notwithstanding), LinkedIn has what it takes to substantially improve the everyday work experience of people everywhere in the world.The staff know this. They feel the mission, and they are an exceptionally bright crew of motivated, goal-oriented professionals. The company leadership has had some missteps, but the carefully slow motion merge with Microsoft has not yet been fully appreciated for the strength of the organization that will come from the joining of these two global powerhouses. We need not fear LinkedIn being changed by its business in China--but China might need to fear being changed by its business with LinkedIn. Us? Only good can come of LinkedIn bringing its social workforce tech to a country like China.People at LinkedIn are unusually sociable in the workplace, have a bright and optimistic attitude in all things,and adhere to polite and professional mannerisms in an extra-meticulous way; it is as though the propriety and crispness of professionalism and diligence we imagine was true in the 1950s corporate world, was brought to the present, minus all the retro downsides, and plus the niceties of today's diversity, civility, and social advances.This is a place anyone can shine. I would gladly work at LinkedIn again. I had a limited-term contract of several months, but I cannot speak highly enough of the organization, its  people, or its potential. With Microsoft bringing the tools and LinkedIn bringing the social tech, look out. The workplace of tomorrow looks like something being sketched this minute on a whiteboard in Sunnyvale, California by an Indian programmer, a skateboarding project analyst, a retiree consultant from IBM and a marketing wunderkind just out of some Parisian salon, all of them working together seamlessly and with use of the latest tools and tech.Such an awesome place; so good to know, a workplace can be that great. LinkedIn makes it very obvious that they value their employees. They have developed an awesome culture allowing all of us employees to be self expressive, to grow as individuals and as teams, to give back to our communities, and to just have fun in our workplace. I do not wish to publicly review Linkedin.  This is not my style, if anyone has questions about the org or my time there please reach out to me directly. I never worked at Linked In. I don't know why they are including this on my application. I only use LinkedIn to apply for jobs and network. I'm sure it is a great place to work. Wish I could have stayed were I was as a contractor. The management staff was excellent and gave me everything I needed for success. I loved my time working for LOS A lot of initiative to have every employee to grow while at LinkedIn. There isn't a whole lot of people that look like me or come from my socioeconomic background. So I spent a lot of time isolated because I didn't/couldn't relate to my team mates Free meals, bikes, gyms and gym reimbursement. The wrong people get promoted time after time and poor decision making on the promotions make it hard to keep working here. The company was filled with ex-contractors from Apple and they treat as if you are an unwelcome entity. My manager was Asian guy who has zero respect for senior consultants like me. Your suggestions and ideas do not matter as you should do what an FTE employee tells you, even if your suggestions/ideas were to improve the quality of the product. Day in and out you were treated with disrespect. I worked in other companies like Facebook, HP etc and I was treated with respect. My manager was micro-managing me and criticizing is the only thing he excels in doing. Zero appreciation from any quarters. Good that it ended soon and I am back to where I loved to work LinkedIn is a great company with many nice professionals who are willing to help at any time. They provide free breakfast, lunch, and dinner. They also have many online training classes to take for free. Worked as a contractor. Great place to work at. Free food, snacks, and drinks. Contractors are treated fair unlike other big companies. I highly recommend working at LinkedIn. I was fortunate to be part of this wonderful company, whose business actually helps improve the lives of people around the world. As a Systems Engineer Intern at LinkedIn, I was part of Compute Engineering team. I had the chance to learn and understand how LinkedIn operates with its Data Centers around the world. I had a wonderful mentor who would help me understand my job well. I also had a visionary manager whose intentions actually inspired me to work more passionately. My typical day would include, writing python scripts for an application development, weekly meetings with mentor or manager or the entire team. The encouragement I received, never made me think I had a hard job and I enjoyed every part of my time as an intern here. One thing that LinkedIn taught me is that to build strong relationships. LinkedIn was a great culture and company to work for. The learning aspect was amazing and training provided was superb. Management was coherent for the most part and helped when needed to align workforce to attain the goal sought after. I would like to work abroad as mutch as i can and as long as i am single.I prefere to work in tunnels , caverns and to learn new professional things.I like sport as skiing,kitesurfing and footbal. I worked for this organization for about 3 years. They will push you and challenge you every day to get every bit of talent you possess out of you.Perks included $2,000/year reimbursement for gym memberships or day care for your child. Its taxed so you get about 75% back.Free lunch at all the offices. Annual trip all expenses paid to Las Vegas.Once a month you have the opportunity to give back to your community and bring your parents and kids to work.The office shuts down the whole week of July 4th and the week of Christmas. This is paid!Take advantage of all the training opportunities(LinkedIn Learning and Trainings offered to your specific LOB. Very positive environment where people feel truly appreciated. The perks are amazing including the food, gym access and InDays. I would highly suggest looking at LinkedIn. All the processes at LinkedIn were really well thought through, so I experienced zero barriers to doing the best work of my life. I think toward the end of my time there, there was concern about the lack of quickness in my work, which is a shame, because things should be more about quality than about quantity. They were pressuring me to work 10-hour days, and I had a 2-hour commute. But it is a business after all.My division used an agile development process with mandatory daily standups, so it was hard to come up with enough things to justify the day's work. Other agile departments make daily attendance optional, so you can work on things as needed, and seek out updates as needed. Typical day at consisted of morning follow-up calls, setting up appointments for the weekend, and making sure previous day's work was completed correctly.  I learned how to multi-task as well as approach random customers with no fear and to talk to them not about cars, but about why they are really here.  The workplace culture was very engaging and everyone was willing to help each other out.  The hardest part of the job was customers forgetting who they worked with before and inquired on the Internet; thus causing the deal two be split.  The most enjoyable part of this job was the fact that I was able to see the greatest and newest of car models. People used to work very hard to get things done, and collaboration was smooth. Starting from a bunch of re-org's, there are lots of politics around. Admittedly, some teams are awesome, and driven to get things done in the right way. However, some teams are just playing favoritism, and people got promotion for stealing other members' credits. The best company you can ever imagine to work for. Lots of perk, good salary, CEO and Leadership is incredible, Microsoft might be sinking it up - pay attention Many perks, including complimentary breakfast lunch and dinner, game rooms and gyms. Free time to collaborate with team members. Long breaks.Beautiful campus. I think everyone should go to LinkedIn to just even experience the environment There’s is so much to learn and they teach you how to grow with in the company and out I cannot speak highly enough of LinkedIn, a company from whom I have no doubt we will be hearing so much more in coming years. Standing at the intersection of a changing workplace and a rapidly globalizing workforce (current events notwithstanding), LinkedIn has what it takes to substantially improve the everyday work experience of people everywhere in the world.The staff know this. They feel the mission, and they are an exceptionally bright crew of motivated, goal-oriented professionals. The company leadership has had some missteps, but the carefully slow motion merge with Microsoft has not yet been fully appreciated for the strength of the organization that will come from the joining of these two global powerhouses. We need not fear LinkedIn being changed by its business in China--but China might need to fear being changed by its business with LinkedIn. Us? Only good can come of LinkedIn bringing its social workforce tech to a country like China.People at LinkedIn are unusually sociable in the workplace, have a bright and optimistic attitude in all things,and adhere to polite and professional mannerisms in an extra-meticulous way; it is as though the propriety and crispness of professionalism and diligence we imagine was true in the 1950s corporate world, was brought to the present, minus all the retro downsides, and plus the niceties of today's diversity, civility, and social advances.This is a place anyone can shine. I would gladly work at LinkedIn again. I had a limited-term contract of several months, but I cannot speak highly enough of the organization, its  people, or its potential. With Microsoft bringing the tools and LinkedIn bringing the social tech, look out. The workplace of tomorrow looks like something being sketched this minute on a whiteboard in Sunnyvale, California by an Indian programmer, a skateboarding project analyst, a retiree consultant from IBM and a marketing wunderkind just out of some Parisian salon, all of them working together seamlessly and with use of the latest tools and tech.Such an awesome place; so good to know, a workplace can be that great. LinkedIn makes it very obvious that they value their employees. They have developed an awesome culture allowing all of us employees to be self expressive, to grow as individuals and as teams, to give back to our communities, and to just have fun in our workplace. I do not wish to publicly review Linkedin.  This is not my style, if anyone has questions about the org or my time there please reach out to me directly. I never worked at Linked In. I don't know why they are including this on my application. I only use LinkedIn to apply for jobs and network. I'm sure it is a great place to work. Wish I could have stayed were I was as a contractor. The management staff was excellent and gave me everything I needed for success. I loved my time working for LOS A lot of initiative to have every employee to grow while at LinkedIn. There isn't a whole lot of people that look like me or come from my socioeconomic background. So I spent a lot of time isolated because I didn't/couldn't relate to my team mates Free meals, bikes, gyms and gym reimbursement. The wrong people get promoted time after time and poor decision making on the promotions make it hard to keep working here. The company was filled with ex-contractors from Apple and they treat as if you are an unwelcome entity. My manager was Asian guy who has zero respect for senior consultants like me. Your suggestions and ideas do not matter as you should do what an FTE employee tells you, even if your suggestions/ideas were to improve the quality of the product. Day in and out you were treated with disrespect. I worked in other companies like Facebook, HP etc and I was treated with respect. My manager was micro-managing me and criticizing is the only thing he excels in doing. Zero appreciation from any quarters. Good that it ended soon and I am back to where I loved to work LinkedIn is a great company with many nice professionals who are willing to help at any time. They provide free breakfast, lunch, and dinner. They also have many online training classes to take for free. Worked as a contractor. Great place to work at. Free food, snacks, and drinks. Contractors are treated fair unlike other big companies. I highly recommend working at LinkedIn. I was fortunate to be part of this wonderful company, whose business actually helps improve the lives of people around the world. As a Systems Engineer Intern at LinkedIn, I was part of Compute Engineering team. I had the chance to learn and understand how LinkedIn operates with its Data Centers around the world. I had a wonderful mentor who would help me understand my job well. I also had a visionary manager whose intentions actually inspired me to work more passionately. My typical day would include, writing python scripts for an application development, weekly meetings with mentor or manager or the entire team. The encouragement I received, never made me think I had a hard job and I enjoyed every part of my time as an intern here. One thing that LinkedIn taught me is that to build strong relationships. LinkedIn was a great culture and company to work for. The learning aspect was amazing and training provided was superb. Management was coherent for the most part and helped when needed to align workforce to attain the goal sought after. I would like to work abroad as mutch as i can and as long as i am single.I prefere to work in tunnels , caverns and to learn new professional things.I like sport as skiing,kitesurfing and footbal. I worked for this organization for about 3 years. They will push you and challenge you every day to get every bit of talent you possess out of you.Perks included $2,000/year reimbursement for gym memberships or day care for your child. Its taxed so you get about 75% back.Free lunch at all the offices. Annual trip all expenses paid to Las Vegas.Once a month you have the opportunity to give back to your community and bring your parents and kids to work.The office shuts down the whole week of July 4th and the week of Christmas. This is paid!Take advantage of all the training opportunities(LinkedIn Learning and Trainings offered to your specific LOB. Very positive environment where people feel truly appreciated. The perks are amazing including the food, gym access and InDays. I would highly suggest looking at LinkedIn. All the processes at LinkedIn were really well thought through, so I experienced zero barriers to doing the best work of my life. I think toward the end of my time there, there was concern about the lack of quickness in my work, which is a shame, because things should be more about quality than about quantity. They were pressuring me to work 10-hour days, and I had a 2-hour commute. But it is a business after all.My division used an agile development process with mandatory daily standups, so it was hard to come up with enough things to justify the day's work. Other agile departments make daily attendance optional, so you can work on things as needed, and seek out updates as needed. Typical day at consisted of morning follow-up calls, setting up appointments for the weekend, and making sure previous day's work was completed correctly.  I learned how to multi-task as well as approach random customers with no fear and to talk to them not about cars, but about why they are really here.  The workplace culture was very engaging and everyone was willing to help each other out.  The hardest part of the job was customers forgetting who they worked with before and inquired on the Internet; thus causing the deal two be split.  The most enjoyable part of this job was the fact that I was able to see the greatest and newest of car models. People used to work very hard to get things done, and collaboration was smooth. Starting from a bunch of re-org's, there are lots of politics around. Admittedly, some teams are awesome, and driven to get things done in the right way. However, some teams are just playing favoritism, and people got promotion for stealing other members' credits. The best company you can ever imagine to work for. Lots of perk, good salary, CEO and Leadership is incredible, Microsoft might be sinking it up - pay attention Many perks, including complimentary breakfast lunch and dinner, game rooms and gyms. Free time to collaborate with team members. Long breaks.Beautiful campus. I think everyone should go to LinkedIn to just even experience the environment There’s is so much to learn and they teach you how to grow with in the company and out I cannot speak highly enough of LinkedIn, a company from whom I have no doubt we will be hearing so much more in coming years. Standing at the intersection of a changing workplace and a rapidly globalizing workforce (current events notwithstanding), LinkedIn has what it takes to substantially improve the everyday work experience of people everywhere in the world.The staff know this. They feel the mission, and they are an exceptionally bright crew of motivated, goal-oriented professionals. The company leadership has had some missteps, but the carefully slow motion merge with Microsoft has not yet been fully appreciated for the strength of the organization that will come from the joining of these two global powerhouses. We need not fear LinkedIn being changed by its business in China--but China might need to fear being changed by its business with LinkedIn. Us? Only good can come of LinkedIn bringing its social workforce tech to a country like China.People at LinkedIn are unusually sociable in the workplace, have a bright and optimistic attitude in all things,and adhere to polite and professional mannerisms in an extra-meticulous way; it is as though the propriety and crispness of professionalism and diligence we imagine was true in the 1950s corporate world, was brought to the present, minus all the retro downsides, and plus the niceties of today's diversity, civility, and social advances.This is a place anyone can shine. I would gladly work at LinkedIn again. I had a limited-term contract of several months, but I cannot speak highly enough of the organization, its  people, or its potential. With Microsoft bringing the tools and LinkedIn bringing the social tech, look out. The workplace of tomorrow looks like something being sketched this minute on a whiteboard in Sunnyvale, California by an Indian programmer, a skateboarding project analyst, a retiree consultant from IBM and a marketing wunderkind just out of some Parisian salon, all of them working together seamlessly and with use of the latest tools and tech.Such an awesome place; so good to know, a workplace can be that great. LinkedIn makes it very obvious that they value their employees. They have developed an awesome culture allowing all of us employees to be self expressive, to grow as individuals and as teams, to give back to our communities, and to just have fun in our workplace. I do not wish to publicly review Linkedin.  This is not my style, if anyone has questions about the org or my time there please reach out to me directly. I never worked at Linked In. I don't know why they are including this on my application. I only use LinkedIn to apply for jobs and network. I'm sure it is a great place to work. Wish I could have stayed were I was as a contractor. The management staff was excellent and gave me everything I needed for success. I loved my time working for LOS A lot of initiative to have every employee to grow while at LinkedIn. There isn't a whole lot of people that look like me or come from my socioeconomic background. So I spent a lot of time isolated because I didn't/couldn't relate to my team mates Free meals, bikes, gyms and gym reimbursement. The wrong people get promoted time after time and poor decision making on the promotions make it hard to keep working here. The company was filled with ex-contractors from Apple and they treat as if you are an unwelcome entity. My manager was Asian guy who has zero respect for senior consultants like me. Your suggestions and ideas do not matter as you should do what an FTE employee tells you, even if your suggestions/ideas were to improve the quality of the product. Day in and out you were treated with disrespect. I worked in other companies like Facebook, HP etc and I was treated with respect. My manager was micro-managing me and criticizing is the only thing he excels in doing. Zero appreciation from any quarters. Good that it ended soon and I am back to where I loved to work LinkedIn is a great company with many nice professionals who are willing to help at any time. They provide free breakfast, lunch, and dinner. They also have many online training classes to take for free. Worked as a contractor. Great place to work at. Free food, snacks, and drinks. Contractors are treated fair unlike other big companies. I highly recommend working at LinkedIn. I was fortunate to be part of this wonderful company, whose business actually helps improve the lives of people around the world. As a Systems Engineer Intern at LinkedIn, I was part of Compute Engineering team. I had the chance to learn and understand how LinkedIn operates with its Data Centers around the world. I had a wonderful mentor who would help me understand my job well. I also had a visionary manager whose intentions actually inspired me to work more passionately. My typical day would include, writing python scripts for an application development, weekly meetings with mentor or manager or the entire team. The encouragement I received, never made me think I had a hard job and I enjoyed every part of my time as an intern here. One thing that LinkedIn taught me is that to build strong relationships. LinkedIn was a great culture and company to work for. The learning aspect was amazing and training provided was superb. Management was coherent for the most part and helped when needed to align workforce to attain the goal sought after. I would like to work abroad as mutch as i can and as long as i am single.I prefere to work in tunnels , caverns and to learn new professional things.I like sport as skiing,kitesurfing and footbal. I worked for this organization for about 3 years. They will push you and challenge you every day to get every bit of talent you possess out of you.Perks included $2,000/year reimbursement for gym memberships or day care for your child. Its taxed so you get about 75% back.Free lunch at all the offices. Annual trip all expenses paid to Las Vegas.Once a month you have the opportunity to give back to your community and bring your parents and kids to work.The office shuts down the whole week of July 4th and the week of Christmas. This is paid!Take advantage of all the training opportunities(LinkedIn Learning and Trainings offered to your specific LOB. Very positive environment where people feel truly appreciated. The perks are amazing including the food, gym access and InDays. I would highly suggest looking at LinkedIn. All the processes at LinkedIn were really well thought through, so I experienced zero barriers to doing the best work of my life. I think toward the end of my time there, there was concern about the lack of quickness in my work, which is a shame, because things should be more about quality than about quantity. They were pressuring me to work 10-hour days, and I had a 2-hour commute. But it is a business after all.My division used an agile development process with mandatory daily standups, so it was hard to come up with enough things to justify the day's work. Other agile departments make daily attendance optional, so you can work on things as needed, and seek out updates as needed. Typical day at consisted of morning follow-up calls, setting up appointments for the weekend, and making sure previous day's work was completed correctly.  I learned how to multi-task as well as approach random customers with no fear and to talk to them not about cars, but about why they are really here.  The workplace culture was very engaging and everyone was willing to help each other out.  The hardest part of the job was customers forgetting who they worked with before and inquired on the Internet; thus causing the deal two be split.  The most enjoyable part of this job was the fact that I was able to see the greatest and newest of car models. People used to work very hard to get things done, and collaboration was smooth. Starting from a bunch of re-org's, there are lots of politics around. Admittedly, some teams are awesome, and driven to get things done in the right way. However, some teams are just playing favoritism, and people got promotion for stealing other members' credits. The best company you can ever imagine to work for. Lots of perk, good salary, CEO and Leadership is incredible, Microsoft might be sinking it up - pay attention Many perks, including complimentary breakfast lunch and dinner, game rooms and gyms. Free time to collaborate with team members. Long breaks.Beautiful campus. I think everyone should go to LinkedIn to just even experience the environment There’s is so much to learn and they teach you how to grow with in the company and out I cannot speak highly enough of LinkedIn, a company from whom I have no doubt we will be hearing so much more in coming years. Standing at the intersection of a changing workplace and a rapidly globalizing workforce (current events notwithstanding), LinkedIn has what it takes to substantially improve the everyday work experience of people everywhere in the world.The staff know this. They feel the mission, and they are an exceptionally bright crew of motivated, goal-oriented professionals. The company leadership has had some missteps, but the carefully slow motion merge with Microsoft has not yet been fully appreciated for the strength of the organization that will come from the joining of these two global powerhouses. We need not fear LinkedIn being changed by its business in China--but China might need to fear being changed by its business with LinkedIn. Us? Only good can come of LinkedIn bringing its social workforce tech to a country like China.People at LinkedIn are unusually sociable in the workplace, have a bright and optimistic attitude in all things,and adhere to polite and professional mannerisms in an extra-meticulous way; it is as though the propriety and crispness of professionalism and diligence we imagine was true in the 1950s corporate world, was brought to the present, minus all the retro downsides, and plus the niceties of today's diversity, civility, and social advances.This is a place anyone can shine. I would gladly work at LinkedIn again. I had a limited-term contract of several months, but I cannot speak highly enough of the organization, its  people, or its potential. With Microsoft bringing the tools and LinkedIn bringing the social tech, look out. The workplace of tomorrow looks like something being sketched this minute on a whiteboard in Sunnyvale, California by an Indian programmer, a skateboarding project analyst, a retiree consultant from IBM and a marketing wunderkind just out of some Parisian salon, all of them working together seamlessly and with use of the latest tools and tech.Such an awesome place; so good to know, a workplace can be that great. LinkedIn makes it very obvious that they value their employees. They have developed an awesome culture allowing all of us employees to be self expressive, to grow as individuals and as teams, to give back to our communities, and to just have fun in our workplace. I do not wish to publicly review Linkedin.  This is not my style, if anyone has questions about the org or my time there please reach out to me directly. I never worked at Linked In. I don't know why they are including this on my application. I only use LinkedIn to apply for jobs and network. I'm sure it is a great place to work. Wish I could have stayed were I was as a contractor. The management staff was excellent and gave me everything I needed for success. I loved my time working for LOS A lot of initiative to have every employee to grow while at LinkedIn. There isn't a whole lot of people that look like me or come from my socioeconomic background. So I spent a lot of time isolated because I didn't/couldn't relate to my team mates Free meals, bikes, gyms and gym reimbursement. The wrong people get promoted time after time and poor decision making on the promotions make it hard to keep working here. The company was filled with ex-contractors from Apple and they treat as if you are an unwelcome entity. My manager was Asian guy who has zero respect for senior consultants like me. Your suggestions and ideas do not matter as you should do what an FTE employee tells you, even if your suggestions/ideas were to improve the quality of the product. Day in and out you were treated with disrespect. I worked in other companies like Facebook, HP etc and I was treated with respect. My manager was micro-managing me and criticizing is the only thing he excels in doing. Zero appreciation from any quarters. Good that it ended soon and I am back to where I loved to work LinkedIn is a great company with many nice professionals who are willing to help at any time. They provide free breakfast, lunch, and dinner. They also have many online training classes to take for free. Worked as a contractor. Great place to work at. Free food, snacks, and drinks. Contractors are treated fair unlike other big companies. I highly recommend working at LinkedIn. I was fortunate to be part of this wonderful company, whose business actually helps improve the lives of people around the world. As a Systems Engineer Intern at LinkedIn, I was part of Compute Engineering team. I had the chance to learn and understand how LinkedIn operates with its Data Centers around the world. I had a wonderful mentor who would help me understand my job well. I also had a visionary manager whose intentions actually inspired me to work more passionately. My typical day would include, writing python scripts for an application development, weekly meetings with mentor or manager or the entire team. The encouragement I received, never made me think I had a hard job and I enjoyed every part of my time as an intern here. One thing that LinkedIn taught me is that to build strong relationships. LinkedIn was a great culture and company to work for. The learning aspect was amazing and training provided was superb. Management was coherent for the most part and helped when needed to align workforce to attain the goal sought after. I would like to work abroad as mutch as i can and as long as i am single.I prefere to work in tunnels , caverns and to learn new professional things.I like sport as skiing,kitesurfing and footbal. I worked for this organization for about 3 years. They will push you and challenge you every day to get every bit of talent you possess out of you.Perks included $2,000/year reimbursement for gym memberships or day care for your child. Its taxed so you get about 75% back.Free lunch at all the offices. Annual trip all expenses paid to Las Vegas.Once a month you have the opportunity to give back to your community and bring your parents and kids to work.The office shuts down the whole week of July 4th and the week of Christmas. This is paid!Take advantage of all the training opportunities(LinkedIn Learning and Trainings offered to your specific LOB. Very positive environment where people feel truly appreciated. The perks are amazing including the food, gym access and InDays. I would highly suggest looking at LinkedIn. All the processes at LinkedIn were really well thought through, so I experienced zero barriers to doing the best work of my life. I think toward the end of my time there, there was concern about the lack of quickness in my work, which is a shame, because things should be more about quality than about quantity. They were pressuring me to work 10-hour days, and I had a 2-hour commute. But it is a business after all.My division used an agile development process with mandatory daily standups, so it was hard to come up with enough things to justify the day's work. Other agile departments make daily attendance optional, so you can work on things as needed, and seek out updates as needed. Typical day at consisted of morning follow-up calls, setting up appointments for the weekend, and making sure previous day's work was completed correctly.  I learned how to multi-task as well as approach random customers with no fear and to talk to them not about cars, but about why they are really here.  The workplace culture was very engaging and everyone was willing to help each other out.  The hardest part of the job was customers forgetting who they worked with before and inquired on the Internet; thus causing the deal two be split.  The most enjoyable part of this job was the fact that I was able to see the greatest and newest of car models. People used to work very hard to get things done, and collaboration was smooth. Starting from a bunch of re-org's, there are lots of politics around. Admittedly, some teams are awesome, and driven to get things done in the right way. However, some teams are just playing favoritism, and people got promotion for stealing other members' credits. The best company you can ever imagine to work for. Lots of perk, good salary, CEO and Leadership is incredible, Microsoft might be sinking it up - pay attention Many perks, including complimentary breakfast lunch and dinner, game rooms and gyms. Free time to collaborate with team members. Long breaks.Beautiful campus. I think everyone should go to LinkedIn to just even experience the environment There’s is so much to learn and they teach you how to grow with in the company and out I cannot speak highly enough of LinkedIn, a company from whom I have no doubt we will be hearing so much more in coming years. Standing at the intersection of a changing workplace and a rapidly globalizing workforce (current events notwithstanding), LinkedIn has what it takes to substantially improve the everyday work experience of people everywhere in the world.The staff know this. They feel the mission, and they are an exceptionally bright crew of motivated, goal-oriented professionals. The company leadership has had some missteps, but the carefully slow motion merge with Microsoft has not yet been fully appreciated for the strength of the organization that will come from the joining of these two global powerhouses. We need not fear LinkedIn being changed by its business in China--but China might need to fear being changed by its business with LinkedIn. Us? Only good can come of LinkedIn bringing its social workforce tech to a country like China.People at LinkedIn are unusually sociable in the workplace, have a bright and optimistic attitude in all things,and adhere to polite and professional mannerisms in an extra-meticulous way; it is as though the propriety and crispness of professionalism and diligence we imagine was true in the 1950s corporate world, was brought to the present, minus all the retro downsides, and plus the niceties of today's diversity, civility, and social advances.This is a place anyone can shine. I would gladly work at LinkedIn again. I had a limited-term contract of several months, but I cannot speak highly enough of the organization, its  people, or its potential. With Microsoft bringing the tools and LinkedIn bringing the social tech, look out. The workplace of tomorrow looks like something being sketched this minute on a whiteboard in Sunnyvale, California by an Indian programmer, a skateboarding project analyst, a retiree consultant from IBM and a marketing wunderkind just out of some Parisian salon, all of them working together seamlessly and with use of the latest tools and tech.Such an awesome place; so good to know, a workplace can be that great. LinkedIn makes it very obvious that they value their employees. They have developed an awesome culture allowing all of us employees to be self expressive, to grow as individuals and as teams, to give back to our communities, and to just have fun in our workplace. I do not wish to publicly review Linkedin.  This is not my style, if anyone has questions about the org or my time there please reach out to me directly. I never worked at Linked In. I don't know why they are including this on my application. I only use LinkedIn to apply for jobs and network. I'm sure it is a great place to work. Wish I could have stayed were I was as a contractor. The management staff was excellent and gave me everything I needed for success. I loved my time working for LOS A lot of initiative to have every employee to grow while at LinkedIn. There isn't a whole lot of people that look like me or come from my socioeconomic background. So I spent a lot of time isolated because I didn't/couldn't relate to my team mates Free meals, bikes, gyms and gym reimbursement. The wrong people get promoted time after time and poor decision making on the promotions make it hard to keep working here. The company was filled with ex-contractors from Apple and they treat as if you are an unwelcome entity. My manager was Asian guy who has zero respect for senior consultants like me. Your suggestions and ideas do not matter as you should do what an FTE employee tells you, even if your suggestions/ideas were to improve the quality of the product. Day in and out you were treated with disrespect. I worked in other companies like Facebook, HP etc and I was treated with respect. My manager was micro-managing me and criticizing is the only thing he excels in doing. Zero appreciation from any quarters. Good that it ended soon and I am back to where I loved to work LinkedIn is a great company with many nice professionals who are willing to help at any time. They provide free breakfast, lunch, and dinner. They also have many online training classes to take for free. Worked as a contractor. Great place to work at. Free food, snacks, and drinks. Contractors are treated fair unlike other big companies. I highly recommend working at LinkedIn. I was fortunate to be part of this wonderful company, whose business actually helps improve the lives of people around the world. As a Systems Engineer Intern at LinkedIn, I was part of Compute Engineering team. I had the chance to learn and understand how LinkedIn operates with its Data Centers around the world. I had a wonderful mentor who would help me understand my job well. I also had a visionary manager whose intentions actually inspired me to work more passionately. My typical day would include, writing python scripts for an application development, weekly meetings with mentor or manager or the entire team. The encouragement I received, never made me think I had a hard job and I enjoyed every part of my time as an intern here. One thing that LinkedIn taught me is that to build strong relationships. LinkedIn was a great culture and company to work for. The learning aspect was amazing and training provided was superb. Management was coherent for the most part and helped when needed to align workforce to attain the goal sought after. I would like to work abroad as mutch as i can and as long as i am single.I prefere to work in tunnels , caverns and to learn new professional things.I like sport as skiing,kitesurfing and footbal. I worked for this organization for about 3 years. They will push you and challenge you every day to get every bit of talent you possess out of you.Perks included $2,000/year reimbursement for gym memberships or day care for your child. Its taxed so you get about 75% back.Free lunch at all the offices. Annual trip all expenses paid to Las Vegas.Once a month you have the opportunity to give back to your community and bring your parents and kids to work.The office shuts down the whole week of July 4th and the week of Christmas. This is paid!Take advantage of all the training opportunities(LinkedIn Learning and Trainings offered to your specific LOB. Very positive environment where people feel truly appreciated. The perks are amazing including the food, gym access and InDays. I would highly suggest looking at LinkedIn. All the processes at LinkedIn were really well thought through, so I experienced zero barriers to doing the best work of my life. I think toward the end of my time there, there was concern about the lack of quickness in my work, which is a shame, because things should be more about quality than about quantity. They were pressuring me to work 10-hour days, and I had a 2-hour commute. But it is a business after all.My division used an agile development process with mandatory daily standups, so it was hard to come up with enough things to justify the day's work. Other agile departments make daily attendance optional, so you can work on things as needed, and seek out updates as needed. "
                },
"encodingType":"UTF8"
}
