{
"document":{
"type":"PLAIN_TEXT",
"language": "EN",
"content":"Learned a lot at this job and looking forward to seeing how the place grows. It was a good atmosphere with bright people and engaging talks etc. Would recommend. I have been at Microsoft while releasing Windows 2000. Very exciting times, and very challenging. Feels like a small company with a real owner, but provides a lot of opportunities to grow I have never learned and grown so much as I have with my time with Microsoft. The pay and benefits are fantastic, and there are many resources to utilize to help further your career internally or externally. Culture is important to Microsoft, and I like that. I have enjoyed working with a diverse group of individuals. I feel like I have a voice, as large as the company is, which I think really speaks to just how much it values its employees. Microsoft is under a good leader which believes in people; however there are some managers that do not practice what the leader promotes. Very sad!I find people are the key to any company's success in the eyes of the public and with social media providing an avenue to share concerns, these managers should take their job more seriously! They never know when they will be the ones in that seat...I believe in Microsoft and its products and know they are doing good, it just needs to be done by more! You see Microsoft still employs some self-driven individuals with one thing on their mind...and they forget what is all about.Thanks! I loved my job at Microsoft.  I had a great deal of autonomy and flexibility in my schedule The constant change to our business processes provided a steady stream of challenges.  However, older employees who are not all about climbing the corporate ladder are not respected.  Unless you are changing positions every 3 years, you are not viewed as valuable. The standards are higher than any place else I have worked, which is both a great opportunity to grow and an obstacle to work/life balance.  Most successful people have been there for many years, ad the company is reluctant to hire from outside Management talks the talk, but does not walk the walk.  Talk of failure being a necessary feature of progress, but only success is rewarded or applies to career growth.  Looking good is more important than actually being good.  This got worse in the later years. Microsoft is a great company to work for, you have the opportunity to work on so many different products and make a big impact.  You also work with very smart people. Amazing people, great culture. A lot of action, opportunity to learn and advance. Travel is typically an option. Global ecosystem. Benefits are great as well. Great benefits. The company has made many changes in vision over the past few years and the change shows.  Internal engineering is a challenging department in which to work, but most other groups are solid. As an intern you go unnoticed unless you are from a high end school. They give you work and expect you to know how to do it. People seem to always be busy. The good thing about Microsoft is that there are so many different people that work there and you are bound to find someone that you can connect with and learn from. Microsoft is a great company to work for, both when you are a vendor and a 'blue badge'. Management is always trying to create a productive work environment. Success is acknowledged and much appreciated. I would recommend applying for positions here. The day starts with emails, calls, and meetings, Nowadays, Some parts of Microsoft provides breakfasts too so, you can have a healthy start of the day. People are nice, happy people. Believe in quality of work and not the quantity of work, great work ethics, and practices. I always enjoy working here. Diversity is at its best here, You can see people from everywhere. Changing culture, good work/life balance, and new growth with cloud investments. Moving towards open source and away from 'not invented here'. As you grow your career, politics and process can be limiters. Microsoft’s leadership around AI — Augmented Intelligence — is brilliant.  Augmenting the  capability of experts with thinking machines is a sustainable solution that will boost the evolution of humankind. If Microsoft offers you a job, take it and don't look back. Just like any corporation, it has its flaws, but they are minor and MS seriously tries to fix them when you point them out. The technology is always challenging (and interesting) and sometimes they get management wrong, but still, it was a great place to work. What the company gets right FAR outweighs what it gets wrong. Involved and interacted with various business user groups for gathering the requirements for CRMimplementation.Created profiles, Roles based on Organization role hierarchy and implement record level and fieldlevel security and configured their sharing settings.Created workflow rules and defined related tasks, time triggered tasks, email alert, field updates toimplement business logic.Created a sync of contacts, events and tasks between sales force to outlook and outlook to sales forcesuccessfully.Used Debugger making use of Breakpoints to monitor data movement and troubleshoot themappings.Worked with Data loader for loading the attachments into salesforce.com, related to objects likeAccounts, Contacts, Opportunities, and Activities.Create Email Templates and mail merge Templates and involved in doing mail merge for differentstandard and custom objects.Analyzing different business reports and customization of those reports in sales force.Use force.com developer toolkit including Apex classes, Apex triggers and visual force pages todevelop custom businessCreated and used Email templates in HTML and Visual force.Developed Case Queues which automatically assign cases to a specific user or group of users based onpredefined criteria.Working on record types, validation rules, triggers and page layouts Friendly environment, really good documentation to consult, very good training and preparation, excellent managers and leads. You can improve your knowledge every day. Love all team environments. Good location. Convenient for commutation.Not too stressful environment on most teamsWork the way you want culture.Great culture, flexible hours good to be with a global company that offers products and services many companies and individuals use. The culture and atmosphere s very professional. Everyone is courteous with one another. I worked with a team of developers and testers. Typically I would assess the upcoming releases based on the planning done and then create a release train along with other development and test team members. The most enjoyable part of the work is to work with most brilliant engineers from the world. Learned a lot at this job and looking forward to seeing how the place grows. It was a good atmosphere with bright people and engaging talks etc. Would recommend. Microsoft was a great place to work, but it really depended on the group you were in.  So long as the group was aligned with corporate culture, it was fantastic, but to the extent individuals were out for self promotion, it was not a cooperative workplace and became very political.  I had a great 17 years, but never would have stayed that long had I determined a better career path. Microsoft is an equal opportunity employer.Productive and funplace to work. place to learn new things, the most enjoyable part of the job. good work culture Since my inception to Microsoft Managment made everything possible to make me feel welcome and part of the team.  Work Environment and Office Facilities invites you to work with energy in order to achieve your personal a professional goals. Good environment, great pay. We have a friendly team of 4 where we are in a nice office space with other companies who are friendly and postitive as well. Microsoft is a great employer and everyone should take the opportunity if you should be so fortunate. I was in a travel poistion that was very consuming and eventually led to my departure. If you are able to work in hte HQ offices this would make travel less frequent and your role would require a driven individual that is up to the challenge of surviving the ever changing organization. I had 3 managers in 4 years, 3 of which were in my last 2 years of employment. Seemingly a big process engine that you have to want to grow with or get out of. There are great things at Microsoft and not so great things. Just like any other company. Working there was casual, no shirt and tie. Being employed there as a contractor is very much, “in your face.”  You are reminded multiple times daily that a contractor, you may not attend this meeting or that training. Which is a crime since my team was hired to support bigger customers moving to or trying to move to Azure and AzureAD. The two weeks of training consisted of two full time support engineers (one the first week, the other the second) reading a 50+ slide PowerPoint deck to new hires in Las Colinas and North Carolina. This was the most disappointing part of my time at Microsoft. There was little help from full-time engineers and the actual behind the scenes support of customers was often sophomoric. There were extraordinary engineers if you found you way to a “Senior” Engineering Skype conference.  If you could not find and beg someone to be your mentor, you had no chance of sticking around. I could add much, much more, both good and bad. I’m personally happy to have had the opportunity to work there. I do believe my expertise lies in building up a small organizations’ resources in order for them to grow their business, not in mega-Corp wackiness. Good company to work for. I was hired for an inside sales position which lead to other opportunities. Good culture I had to leave due to family obligations. Management is pushing cloud but the front line sales reps fear it and the change it represents.   So, while the brass is saying sell cloud, the legacy sales reps still just want to pursue license sales.  Disconnect from the top to the bottom. Excelente cultura laboral, la cual promueve integración de los empleados sin distinciones ideológicas, de raza, genero o preferencias. Es una empresa que mejora constantemente sus procesos, herramientas y que cuenta con el personal mas capacitado. Reacciona rápidamente según la tendencia macro económica y competencia tecnológica. Microsoft is amazing!!!!!!!!!! Their hours of work is amazing and they let you work from home with flexible hours which exactly what I need in my work at the moment. The staff is amazing and so welcoming online. It's simply great!!!!!!!! Microsoft had a 'Work Hard, Play Hard' philosophy, in my opinion.  You could put in a lot of hours and hard work to complete a project.  They would show their appreciation and gratitude for that dedication.  The pride you'd get when the product you worked so hard on is released, and receives great review. Microsoft is good company to work for but only at corporate level and not retail level. I learned a lot form some fellow employees. At store/retail level no one cares about you they just wants to get job done. Hardest part of the job is no one cares how their team gets job done, they just rely on one person getting the job done I had a mixed experience, and chose to move on after eighteen months due to lack of opportunity in my particular career path and little viable option to move elsewhere within.  No regrets.  I do, however, take bulk of responsibility for not managing my career in-detail at Microsoft: one must do this to keep the options option internally, too.They ask much of staff, and most rise to the occasion.  Excellence in delivery is not just a buzz phrase.  I found it exhilarating to work with some of the smartest people in the world, and would do so again.  In fact I have, on-loan to MCS as a 63-64 Sr. PM in the interim.All in all, I owe just about everything great in my career to Microsoft 1998-current.  I've earned every inch, but they provided the tools and opportunities and I will always respect that.Recommended, to work there once in your career if possible. This company is a very good company. They have a very good cellular service but they are very expensive because they are proud of their phones, including the iPhone. As the title says...You have a bad manager you can pretty much kiss your career goodbye!After 9 years of Microsoft i was forced out in less than a year because my manager and I couldn’t get along. He basically gave me no option other than to leave or get fired...No work life balance. I was working 80+ a week because i was constantly told I’m underperforming. Although my utilization and scorecard showed different. When I approached HR i was told to just let it be.Great cultural mindset some of these Indian managers have.A year later  he fas fired because he kept pushing people out simply to have good numbers. Great company to work for. Flexible schedule and great environment. Everyone is awesome and all about helping you advance in your perspective career.. They were worse experience  they gave us bad hours never cared for us when. We said hi they ignored us as if we were at the bottom I will never work for them again Microsolf é uma empresa que busca o bem e a evolução da humanidade . The division was terrible. The leader would have 'all hands' meeting.  Leader would show up late, unprepared and tie up people for half a day. Training poor and systems were bad.  I think there are some great departments in Microsoft.  I did not work in one of those departments. Despite being a contractor, the team I worked with treated me as a FTE - allowing me to work on a wide variety of satisfying projects.  I was able to interface with high level executives of various Microsoft partners to get our work done as well as build and deploy foundational tools and documentation to help Microsoft developers. Learned a lot at this job and looking forward to seeing how the place grows. It was a good atmosphere with bright people and engaging talks etc. Would recommend. Daily System Support and development opportunitiesLearned All MS Products and Technologies in depthRevolving managementCompetitive workplace with revolving ManagementRevolving Management made it hard to be successfulDeveloping Advanced Solutions job was tedious and lots of head changes in the company mostly in customer service. on the job training was mediocre. not recommended for non experienced very number crunching system MSF T is an intense environment with management that is very operations focused, business review and not focused on people development or career development. Microsoft overall is a great employer from a benefits and compensation perspective. The work culture is not as modern as you would expect and the management culture is still old school.  Having an impact can be difficult given that it is so heavily matrixed, it really depends on the team and individual management. Getting promotions can be very difficult. Excelente empresa que considera a sus empleados , fue una experiencia nueva donde atendí más sobre los programas de computadora Learned a lot of things using advanced machinery. I used automated measurement systems and programmable adhesive dispensing hardware to build very accurate test articles. Excelente company, top people and products.School of sales, academy.Overall, happy with the work environment and management style.Need improvement with creating more growth opportunities for employees and project managers. Great place to work everyone helps each other very understanding very uplifting great place to work free food free drinks gym cafeteria showers wish I could have stayed The data center work is extremely customer-oriented. The work is constantly coming in and at times piles up quite ridiculously. The work is sometimes very repetitive but does occasionally become problem solving which requires some very laborious work. Overall the work space is a good environment and the teams are friendly. Certain management personnel are not the best but overall its a great place to work. Nice to work there. They provide best technologies and training to enhance skills and implement ideas.Very dynamic environment to work on different projects. After working for Microsoft for awhile I have noticed how much politics position you in the company. I have no free time and I can never take days off unless they are sent 3 weeks to 1 month in advance. Management sits there all day and lets the product advisors do all the work. They also treat all of the product advisors like children. I don't recommend anyone working for this company. They have good benefits but that is pretty much it. I've seen about 20 employees come and go since the time Ive been here. What does that tell you? Also, the pay for product advisors is complete trash. They overpay the managers who just sit there and boss people around all day while they text and use their computers all day. If you are unliked in this company and don't suck up to management you will never move up. I see people work their butts off like myself every day and never get recognized but if you try to act cool like the managers do and just hang out with them all day, you may one day get a 25 cent raise. Lots of dead weight, overemphasis on culture instead of quality. A great company to start at, but not much of a career path if you do not live in Seattle. I would love to still be working there.  I was hired at a Temp when the store opened.  The company was very excited about the opening of the store...But over hired. Satya has brought in some leadership principles to try and make Microsoft a more collaborative, agile organization - but change is slow and in pockets. great place to work, very professional, great area, big  campus , lots to see and do. Lots of accommodations and apartments and studios. Seattle is close by. Microsoft is a great retail company to work for. They treat there employees very good. They offer alright health insurance but does provide you sneakers every season paid by the company. Overall, happy with the work environment and management style.Need improvement with creating more growth opportunities for employees and project managers. If you want to be contractor make sure you are working for managed position at least. Never work for unmanaged contract or your carrier will be in trouble and hard to adjust back on track. It is a fun working environment. On the days where the mall is slow the store is slow. Although I worked during the holiday season there were still some slow days. Management did show favoritism to some employees vs. others. We did research for Microsoft. It's a student-driven consultant project and our sponsor is the Azure team in Microsoft. They were supportive in providing us with guidelines and helped us succeed. Learned a lot at this job and looking forward to seeing how the place grows. It was a good atmosphere with bright people and engaging talks etc. Would recommend. Very diverse experience depending on where you work within the company.  Constant change - reorganizations and layoffs permeate the culture and sometimes reduce the experience to self preservation. I enjoyed working on a variety of teams during my time a Microsoft.  Microsoft has a wide variety of products and it is very easy to switch teams internally. This opportunity was a first step into corporate workforce.  The downside as a contractor is guaranteed layoff which can be tough pill to swallow for some. Very difficult company to integrate from the outside. No formal training or onboarding provided.  Commoditized selling approach, front line is completely disconnected from CEO or executive leader mission of solution selling. Working at Microsoft can be the step up in your career or a stepping stone towards the next step within another company. It is a good working environment. Worked remote to help analyze data for AI.Flexible Hours, Straightforward expectations.The position was contracted. We where told it was to last indefinitely and were frequently assured that we would probably be employed for a while and maybe even hire full time. Then abruptly where cut off. A role that provides an amazing salary/benefits with unattainable expectations. The tools are antiquated and manual, forecast calls with Directors/ Account Executives/Management on a bi-weekly/weekly basis that can take up half of your day and there is no room for a work/life balance. I was fortunate to have seen both the field sales and corporate office angle of Microsoft.  Both are extremely competitive as new people are constantly being brought in.  This isn't a problem if you feed off the competition and just do your job the right way.  There is definitely a dichotomy between corporate and field resources...and it's a wide chasm unfortunately.  Microsoft could do a lot better if it took advantage of resources from the field feeding back up into the corporate headquarters.  Unfortunately, there seems to be a bit of a group think going on at corporate that doesn't take into consideration the field activities as much as you'd hope for.I really enjoyed my time there.  It's phenomenal getting to work with the talent pool that Microsoft recruits.  If you enjoy technology sales and are good at it, you'll make a lot of money with the accelerators that kick in after exceeding budget. Among the top companies to work for in the world. Great products and very talented people. Business focus on cloud has benefited greatly the financial performance. The company is a giant, having said that there are business units that are strategic for the company and other's that aren't, ideally you'd be part of a strategic BU otherwise the opportunity for growth is limited. Microsoft is a great company to work for. They promoted a fantastic learning environment and encouraged us to get our certifications. I really enjoyed working at MS Lot's of politics. Executive leadership out of touch with vertical middle management bloat. aka. too many cooks in the kitchen to get stuff done. Empowerment is preached but not actually put into action. Really ask a lot of questions during your interviews.   The culture was important for me but I really should have asked more questions about work life balance which is important when working salary. Provided senior level desktop support at  Microsoft. I was promoted to be a member of a team called TRIO. This team was a collaboration of Microsoft and Entex employees that worked on issues that could not be resolved by our frontline site support team. This was a challenging and interesting position. A broad spectrum of exciting and relevant work -- from Xbox to Cloud, kind and diverse coworkers, and a work life balance that is untouchable among other top tech companies. I recommend Microsoft to anyone.They have great work environments and pay decently.Job security is pretty good too.There interview process is pretty no nonsense.Very direct and to the point. Microsoft has great benefits and compensation. The diversity is not completely embraced, but it is improving.Work life balance is getting better. The noise at the workplace is a little high. In seventeen years I had 17 managers. I constantly had to fight off co-workers that tried to either take my job from me or get our manager to view me as less then they were.Twice I was on teams that were dynamic and worked well, but most of the time I felt my job threatened everyday. When I worked all the time I was told I work to much, when I worked less I was told I need to work harder. Work life balance does not exist at Microsoft Started work there with a manager who was strict and demanded the best from his employees, but also did his best to support them. New Management came and  it quickly became about employees supporting management instead of the other way around. They offer great benefits (even to part time employees) but your experience there is going to depend on if you are lucky enough to have a great manager or a bad one. Empowering, Structured yet flexible. Goal oriented, Ethical,  As a field based employee, I had a great experience as an employee for 18+ years.  The Redmond experience may be different, but the field sales organization was great. While the team was very important, I was also given space to grow on my own at my own pace in order to be self sufficient when required with self learning, and training. Learned a lot at this job and looking forward to seeing how the place grows. It was a good atmosphere with bright people and engaging talks etc. Would recommend. Enjoyed the growth potential, working on diverse and aggressive projects and programs throughout the years.Variety of roles and ever changing environments keep excitement up.Vision driven and you can feel the excitement from teams and partners when driving toward goals that support company goals. I had a great review with Microsoft working 5 months with the company I'M been doing a great job working in the inventory are I learned a lot of process and system . Wonderful place to work if you are a direct hire employee, however there is a corporate business model that has essentially set up a cast system between direct hire employees and the contractors we bring in. We force them to take 6 month breaks in service every 18 months, which is bad for their careers (on paper) and makes it difficult to get work done if you are managing a large team of vendors that provide services. You can be successful at Microsoft, you just have to understand you are going to work with some of the smartest people in the world on bleeding edge technological problems - you have to be highly motivated to get 1% better EVERY SINGLE DAY. At Microsoft you get to work with very smart people and if you are driven and can collaborate well will help you grow better. It does require to be aware enough to be at right place at the right time. In the time I worked at Microsoft, I experienced a 'survival of the fittest' workplace. You either grabbed your seat at the table and made sure your voice was heard, or it it wouldn't be. No one invited you to share your opinion, no one was going to take you by the hand and show you the way. The best advice I received was in my first year from a woman I admired for her influence and confidence. She said, 'The way to be successful at Microsoft is to find a problem to solve that no one else is solving. Make sure solving it supports our mission, and then go for it.' I took that advice to heart, and in every role I had from then on I was a problem seeker, and when I found that problem I viewed it as an opportunity to make things better, have positive impact, and learn something new. I had to gather my courage many times to speak up about the problems I identified, I had to be tenacious, to come prepared with solutions, and to persist despite being dismissed or ignored. The lessons I learned in doing that serve me to this day, and I'm grateful for them. very collaborative in nature , People centric company , flexible work options, and respectful.One of the best workplace culture and great people managers . A very exciting and very informative place to work always changing and simply getting better products are always changing and the technology is far superior to any I've ever worked with I enjoyed working at Microsoft in Irving, amazing culture and delicious food.  They were constantly investing in employees to grow and mentor them, discuss career tracks, etc.  Work hard play hard mentality. The culture there is totally worth any cons of the job. They treat you like you belong there and it is a happy workplace environment. I looked forward to coming to this job every day, Microsoft is another fun place to work. Because it is project related you can make your own hours and may even bring your pet to work with you.The facilities are amazing, from the office space to the cafeterias expect beauty and confort.Good pay, good benefits good work environment. There is no such thing as job security.  Great benefits.  Performance process breads lack of trust and competitiveness within the organization unfortunately. Microsoft culture allows for personal and career growth and development. It allows you to pursue areas of professional interest.These include technical training on both software applications and hardware. Excellent compensation, world class benefits, especially health care.  Pockets of great, and pockets of bad within company.  Also has taken diversity to extreme - very limited opportunity for white males. Work loan is quite heavy and microsoft continues to cut the buget down which makes vendors even need to work overtime. Not a pleasant job to being as a vendors for microsoft. loved working there and really didn't want to leave but for my family we needed to.  I had to relocate to OH where I was originally from but I truly loved WA. Amazing company to work on a global scale on technology that will touch almost everyone in the world. As a marketer, Microsoft provides opportunities to work on large, very well planned programs. Work with very smart and motivated people. Working @ Microsoft was great - I only wish upper mgmt's decision to not renew vendor contracts would be rescinded.Smart People, Fun AtmosphereUpper Mgmt (not C-level) made decisions which killed morale.People making decisions with zero insight as to how those decisions will affect everyone. The management genuinely cared about the well-being of their staff, and made sure we were well taken care of. Workplace culture centered around personal growth and accountability. The hardest part of the job was the physical layout of the store; time warping and dilation were inevitabilities. Microsoft is a great place to work. Very loose, and open environment.  Laid back culture. Fast pace environment.  Colleagues are very helpful in helping out with issues. Learned a lot at this job and looking forward to seeing how the place grows. It was a good atmosphere with bright people and engaging talks etc. Would recommend. Fun place to work in great teams with very good work life balance. Provides you good opportunities to learn and grow in your career. Volunteer opportunities with team are great way to understand your team. Microsoft offers great benefits, flexible work schedule, lots of autonomy and a competitive compensation package. It remains a great company to work for The 16 years I worked at Microsoft, I belonged to many, very different groups that varied in culture depending on what the groups purpose was. I always enjoyed the people I worked with and liked being in a fast paced environment working for a large company that makes a difference in the world.2000-2013  MS FTE2017-2018  Vendor Working at MS was nothing but a positive experience. I have worked 4 different gigs at 4 teams. the work environment is productive. Employees are well Good job. Great for college students, not much room for advancement though. Learned a lot about technology in a laid back, fun, and professional atmosphere. Working for the Microsoft Computer/VR Specialist was a great experience. My manager was always in contact with me incase of anything going on. I was in charge of my own sales/data entries/reports. You really felt like your own supervisor all while still having to keep in contact with higher management. High presentation and story delivery cultureSmart people everywhereCompany re-imagines itself and every functionSometimes the work is mind-blowing! Working at Microsoft an individual will constantly learn. The workplace culture is very diverse. The hardest part of the job is staying focused on a technology due to the wide range of opportunities presented. The most enjoyable is the constant learning of new technologies. Microsoft Student Partner is a great student project around the world, Microsoft provide certain resources and help for anyone to realize their imagine in information technology and so on. Workplace environment looked very modern. Hardest part was catching up to deadlines due to my manager asking a lot of quesitons and setting up meetings. Micromanagement, zero autonomy, disjointed/sloppy sprint planning...Management didn't seem to have any idea in what direction the team should move. They knew where they wanted to go, but had zero idea on how to get there. As a result, we were getting randomized almost daily and the level of scope creep received was utterly insane. great team and fast pace work however lack passionate managers whom were there for team and not MS status. All management wanted was numbers. all the managers wanted was good statuses Like most places it seems good from the outside but very disparate in treating everyone the same.  Diversity is thought as well as the typical items and Microsoft cannot separate the two. I have worked on seven different teams, in different functional areas at Microsoft.  It is a great place to work - they hire great people, and have a very fluid, open organization structure where this is accountability and mission, but also freedom to pursue your objectives. I work for a Managed Microsoft Services partner and work closely with the MS teams here in the Northeast to position the Microsoft suite of solution to improve business processes and transition to the cloud. Great company to work for. Excellent place to start a career. To much bureaucracy in management.  Everybody wants to be a chief and nobody wants to be an indian. Great benefits packages, very diversity oriented environment. Microsoft is a wonder full place to play work and enjoy its an excellent place to learn, teach and share the knowledge and its a kind of learning school, collage and University for employees for continuous learning. I love this place to work and retire. I am not providing a review. My position at the company makes it inappropriate to do so. The people I worked with were mostly good, and at times not. That is all I can provide. Very involved setup, with employees demonstrating expertise in areas of inclusion.Supervision is available with training for improvement. Continue education is highly encouraged.Productivity is very high Old school management who knows how things have worked over the last 20 years, but don't have the same level of vision for years to come. Individual contributors should be listened to more when making decisions. Learned a lot at this job and looking forward to seeing how the place grows. It was a good atmosphere with bright people and engaging talks etc. Would recommend. Microsoft is a great place to work, if you can handle the pressure.  It's not just that your work is constantly being evaluated, it is, and that's fine, but you are also asked to constantly provide proof of your value to the company.  Constantly.   What I'm saying is that doing great work isn't enough, you have to be skilled at demonstrating to management the value your work brings to Microsoft (if you weren't a PowerPoint expert before working at Microsoft, you will be), you literally have to quantify the measure of your work constantly.  That may be easy to do in a sales or account manager role, but in an IT role, that's often difficult to do, but you HAVE to do it, and that, in my opinion, adds unnecessary stress to the role. In addition, as a vendor, when push comes to shove, you are hired help, and the FTEs let you know.   Even though they preach 'team' a lot, you are an outsider.  Period. A typical day at work would be handling taxpayers concerns/questions regarding their property taxes and how they could reduce their monthly or quarterly amount.  I provided them with great customer service both at my desk daily and on the telephone. I am very knowledgeable with a range of products to suit the needs of, Senior Citizens, Veterans, Widows, Widowers and even First Responders. I worked an eight hour shift, Monday thru Friday sometimes opening and closing the office. I worked well and closely with others to provide a very comfortable and relaxed atmosphere for all. I cross trained others, a fast learner and attended many compliance meetings that were held. I am a punctual and very flexible individual. When I parted ways with my employer I had almost nine hundred paid time off hours. Truly value their employees.  Very respectful.  Believe in career advancement.  Amazing people.  Needless to say they are constantly looking to make work more productive and efficiently. Too many layoffs where you almost expect it every quarter.  Not a healthy culture for people to have to live through.  It can really impact managers if they are consistently having to layoff team members. One of the very best employment experiences I ever had.  Microsoft gave me almost every opportunity to excel and I wasn't bashful about taking them on.  If you think you can thrive in one of the most intelligent, busy, and fast-paced companies on Earth, this may be the place for you. I don't want to seem ungrateful. I love Microsoft as a company, I support its mission, and I'm excited about the products it puts out.But working on the inside, I spent years trying to catch up to Google and Amazon (Cortana is a bona fide sci-fi technology but first mover advantage is a real thing, and it's hard to train ML models when all of the user data is being logged by your competitors who beat you to the punch), or trying to solve the mystery of helping customers to know whether or not they should update to the latest version of Office. (It's been around forever; everyone knows whether they need it or not.)Am I bitter? I'm sure it sounds that way. But really I just feel bored. I'd love to continue working with Microsoft products and services. And there are teams in the company that are building very cool stuff. But most people here are solving stale problems.Those benefits, though. They make it tough to leave. The work at MSFT is nearly always with current technology and interesting.  One downside is that MSFT does not use software that wasn't produced at and by the company - so when you leave, you don't have experiences that translate well to other companies.The most common experience at MSFT, and I worked many jobs over more than 20 years, is that your career is not yours to guide.  If you have a manager that is well supported by their manager, and this needs to go up several levels of management, and if your manager _likes_ you (has nothing to do with your work), you'll be well taken care of.But, if you are not in the lucky 1%, your work will have nothing to do with your career advancement.  The 'rules' are pretty extreme - HR has put down a web of policies that allow any manager to find flaw with something you did or said, or someone else complains about you (backstabbing is a sport), then the manager will give you mediocre review and provide a stock answer 'Your HOW is what you need to improve'.Microsoft has gone from being able to have ideas compete with each other and enabling employees to do their best work (circa 2005), to a petty, politically correct, policy bound bloated haven for incompetent managers.Workplace culture - Toxic.  Teams that intersect in their work don't cooperate with each other.  Active management sabotage is routine, and whole teams get walked out the door if your CVP goes out of favor.Average workforce age is shrinking as Microsoft actively culls older workers.  Once you hit 55, they offer you a pretty benefit  called 55/15.  Means  if you are older than 55 and have worked more than 15 years, you can keep your annual stock even after you leave.  What they don't tell you is after you leave, to get that stock, you have to sign a document that says you will not sue them for age discrimination.  At the current stock price, it often matters.I cannot recommend Microsoft to anyone at any age.  The prevalence of incompetent, political, and mean spirited mid-managers has grown to crippling levels over the years. Excellent company, excellent pay. However be prepared for the range of typical large company issues. While you may be well taken care of, it may be frustrating finding your way through large networks of teams to get your job done. Working for Microsoft is great.  Good work/life balance.  Compensation is not stellar, but benefits and work/life balance makes up for it.  In general, everyone wants to do the right thing and everyone is fighting the same fight. Working at Microsoft is an experience like no other. They provide and amazing culture and a fun workspace to grow and learn from. Overall great place to be in. It is still the same Microsoft. Benefits are still better than other companies.Work / life balance at Microsoft is a myth. You are just a cog in the wheel. If a cheaper cog is available you are gone in a heartbeat. Great store. Closed now, but I hope that a new store will open! Creates a barber shop like feel to the place. Employees are all very friendly. Great coffee shop at this location. It was okay, training insufficient for role being provided, they have trouble dealing with associates whom may have anxiety issues. How much more s hould i say? i regret saying yes to this at akk, Couldve been fun, but too remote, not enough people willing to dig in and work .  The work was fun, too much sales getting in the way of doing fun work with clients. had to travel in a very short notice for an onsite one on one meeting.  Then it turned into meeting with several different groups.  It was hard, but to the point and very productive. I love working at Microsoft--my boss is relaxed, we have a fun team, and I'm paid well for the work that I do. My hours are flexible, as I work from home most of the time, and the events that I run are very fun. The only issue that I have is that i'm a contractor and there is very little knowledge or education given as to how to break out of that role and find something full-time. From what I can see, most teams just reorder themselves to fill spaces or take on interns at a lower cost with less experience. I'd love to work full-time here...i'm just not sure how. There are pockets of great opportunities at Microsoft but I do not work in one. They have given so much autonomy to managers that there is zero protection for employees. Microsoft has the best workplace culture. They do make sure their employees keep up with the latest and greatest by providing them opportunities to grow thru hackathons and conferences as well as flexibility to work with other teams in different locations. I believe they choose the best people in the Managerial positions. They make sure that what they do is in accordance to best practices, programmatically, architecturally, ethically and humanly possible. I really enjoyed my time working at Microsoft.  They provided a rich culture to work in.  I was able to take advantage of many learning opportunities though on campus courses and tuition reimbursement for college classes. Quite Frankly, Store 0006 management has their heads up their butts. its all about the customer screw what the employee tells them. Microsoft retail sucks. Learned a lot at this job and looking forward to seeing how the place grows. It was a good atmosphere with bright people and engaging talks etc. Would recommend. Microsoft is just another company.Managers are chosen by loyalty and friendship.Contemptible people pass for smart ones. There are some genuinely smart people, but not as many as they think there are.Most projects start and end with no justification.Frequent layoffs kill morale.If you are lucky to be assigned to a good group, stay! Location in Wilsonville designed and produced Surface Hub products.  Work was exciting and challenging, but being a remote site from Microsoft headquarters brought limited support and changes which were not always communicated on a timely basis. Results depend upon which manager you end up with. Also, make sure to change positions after 4-5 years max. Another tip, make sure that you stay current in the latest coding style. C++ changed drastically from C++98 to C++17 and you can find yourself a dinosaur quickly if you didn't keep up to date. MS Advertising was a solid sales organization for most of it's existence.  Microsoft has given sales responsibilities to Oath (Verizon) now and does not have a true sales org. The Culture of Microsoft is one of Learning, Adapting to changes, working with Diverse culture and people form all over the world.  There is a strong bond within the business and it is a company of 'One Microsoft'.  Yes there are always challenges like all other companies, but the culture is one of change, adapting, accepting and awareness to do better. Satay is a prime example, he makes mistakes, but he learns from it, and moves on. I love working for a company with this type of values.  We are all equal! Microsoft is a great place to work. Buildings are pleasing, your beverage intake needs are met, from teas, coffees, sodas, coconut milk etc.. cost free. One thing that really makes me excited to work at Microsoft is that they are continuously evolving. There is no 'standard procedure'. Those are thrown out the window ever couple of months with re-orgs and re-focusing. Microsoft invents the next 'standard procedure' and moves on to better ideas in empowering it's developers. If you're use to business as usual approach that some companies use, diving into a company's culture like Microsoft can either be invigorating, or leave you grasping for some sense of normalcy in your day to day. But, that's the idea behind a growth mind set.Personally, I'm not a big fan of open spaces that Microsoft is moving towards. Either you love it or hate it. Collaboration has improved dramatically and all your peers, managers, skip levels are all easily accessibly right across the room from you. But loud conversations, people eating all manner of aromatic foods at their desks along with their eating habits (smacking, crunching etc..), leave much to be desired over traditional offices. Microsoft Services is the consulting, technical support, and customer service arm of the world’s leading Software Company. The organization helps customers and partners discover and implement high value Microsoft solutions that generate rapid, meaningful, and measurable results. With its global partner network and support infrastructure, Microsoft Services enables the successful adoption, deployment, and use of Microsoft solutions and technologies for all customers, from the individual to the enterprise. Microsoft Services is designed to provide the right scope of services at the right time, including localized support solutions for businesses and consumers around the world. Microsoft offers a good package but a hard working environment. The matrix organization is full of conflicts of objectives and interpersonal stress. So while well compensated surviving in the organization is very stressful. This can be a great place to work, but it is highly dependent upon your group or your manager. I found the people very smart and kind.Groups within Microsoft are still very fragmented. Making a lateral move across the company is just as difficult as looking externally, so why not look externally.Getting things done and finding opportunities is a game of who knows who. There are not good centralized resources to get things done within this company. Even for work projects you have to know someone who knows someone who might know about a database for the thing you're trying to do. The internal resources are a joke. I worked at Microsoft for 10 years and while there were ups and downs, I loved my job and team!  The new CEO, Satya is amazing and has done so much to transform the culture into a place people love to work. If you are contracting a Microsoft outside of an engineering role, don't expect to be treated as anything other that a warm body filling a need.  If you can find good manager you might stand a chance, but corporate culture for contractors is pretty unsatisfying.  Don't expect to be recognized for your contributions, don't expect to get paid a fair wage, and don't expect to ever be considered for a full time position. Honestly, don't expect to gain anything other than a recognizable name on your resume.That being said, the work life balance was very flexible, which I appreciated and the overall culture of Microsoft is one i admire.  It's clear that their Interns and Full time employees get 5 star treatment.  I trust the leadership and the mission of the company, and think that Microsoft is continuously working to be a great place to work - but only for Full time employees. I have never been treated so poorly at a job, horrible experience being a contractor at Microsoft. Management is horrible, and FTE's (full time employees) are valued more than contractors. A demeaning job that pays well. I loved working for Microsoft,  installing the original XBOX  in 50 stores was fun,  but explaining the system and all the features to different store associates was fun. It's Microsoft, so you have plenty of ways to get the job you really want within the company. Certifications are just about free, plenty of study guides and cheap textbooks to buy. The discounts have gotten better, but really it's retail. You DO NOT WANT TO WORK RETAIL forever! Get into an aspect of the business that you feel proficient in, and make lots of friends by networking. The more you put your plans and ideas out there, the more people will point you in the right direction, or even get you set up on their team. Retail is a pit, if you only want to collect a check it's fine. If you want to better yourself and make a play towards a better future in the company, go for it! Nice place to work , learn new things and also highly skilled people team. enough time will be given to all employes to work or research on new things great experience. Great place to work at. Work life is very balanced and flexible. people and management are very friendly. Everyone looks out for each other. Microsoft overall was a great company - people, management opportunities, benefits, but was sometimes difficult to get things processed because of the vast size of the company. At Microsoft, our mission is to enable people and businesses throughout the world to realize their full potential. We consider our mission statement a commitment to our customers. I felt the culture was amazing and the name definitely held up to the actual experience working with the Applications Team. Bellevue is right around the corner and it just felt like Paradise for a Programmer Management finds females, even of the highest caliber worthy of patronizing. To the point of calling other managers who are female by their FIRST name(s), and males by their LAST. In public setting(s).IOW, when at work...do business. Outside of work...it's pleasure. Learned a lot at this job and looking forward to seeing how the place grows. It was a good atmosphere with bright people and engaging talks etc. Would recommend. Very nice workspace with safety being a top priority. Microsoft management ensured my coworkers and I that our safety and well being was of top priority. They have a very nice no leniency policy when it comes to any form of harassment. Over the past few years most of the original Microsoftees have all gone and finally left the company.  With the major shift to the cloud, the company has been completely focused on their cloud offerings from a technical perspective, but also from a monetary and licensing perspective.  That pressure has come down hard on the various field teams and especially sales.  The turnover rate has dramatically increased and it's sad to see so many people leave the company because of their own volition or they were forced out.  It used to be a great place to work and maybe in some areas it still is, however the sales areas are not near as good as they used to be for potential employees. I spent over 20 years at Microsoft, and I still feel it's one of the best tech companies in the world. I have been able to work with the smartest people on the coolest projects, and create close connections that I've been able to maintain for decades. Microsoft is a great place to work if you thrive in ambiguity and are comfortable with mediocre managers.  The company seems to change strategy and tactics frequently resulting in major layoffs affecting many people. It's a huge company with tons of divisions/group/teams. The work experience largely depend on the the manager and skip level manager, even group leader. Overall great experience. Good to work here. Learnt cloud technologies. Good team to support challenges at work. good work life balance In the project. New things can be encouraged in the project. Many of the employees are engineers and they don't understand the Media business.  They are extremely good at what they do - providing enterprise software and systems, but they don't understand how clients actually use what the organization offers. My experience working for Microsoft was that it has all of the benefits of having a great job. The management was excellent, the staff was excellent, the benefits was excellent, the information learned was outstanding, and the experience is one of kind. However, the opportunity to grow and become something more than a product advisor seemed bleak. Throughout my 2 years as a product advisor, I only witness approximately 4 people grow from their position as product advisor with a staff of 45 individuals. For me, that shows that the company was not willing to lose product advisors for other opportunities, even within the company. Otherwise, great place to work if you have plans to remain in one position with little room to move up. For many, that may not be an issue. For me, that was the deal breaker. I worked for a start up that was acquired by MSFT and our sales team was absorbed into MSFT.  The company is very large and therefore decisions can take significantly longer than in a start up.  The people are amazing and most people work there for 6-15 years.  In general they expect you to have at least 10 years of experience prior to working there so by default the culture is very different from a start up culture. Great place to work but beware of reorgs and management changes as they can have a significant impact on our career and generally not for the better. Managers are either great and supportive of their teams or not...not much middle ground. Microsoft is a great company to work for. It is solid and you know what you are getting. The good parts include great culture and focus. The worst is probably regular reorgs. The first year is a steep learning curve, but definitely worth it in the long run.  Wonderful and unique experiences, working with smart and interesting people. A good experience until it wasn't. Not all aspects are ideal. Vendors are subject to layoffs without warning. I was outsourced three times. Two of those times, I was asked to train my offshore replacements under the false promise that I was training them only as a backup when I went on vacation. Working as a Product Advisor is not going to make you rich by any means but it's a great job with lots of fun opportunities for someone who is into computer technology and/or gaming.  It's still retail so the holidays can be very stressful but it's easy enough.  There are lots of different roles in the store so advancement is definitely an option if you do well. Was able to help customer's with learning about our products and services. Overall work environment was laidback. Staff, for the most part, were great to work with. Benefits were awesome and management were helpful and understanding. Hardest part of the job would be dealing with very upset customers. Great place to work with good benefits. Company invests in their people and spends money on the right projects.  Work life management depends upon your team and the department. One of the best places to work at. The people at Microsoft are extremely skilled & have a clear pathway to leading Transformation, the policy to empower its people; thus the customers, makes it a fun place to work with the creativity at its optimum levels Microsoft has great benefits but that's where the pros end. Management and movement into higher positions from your starting point is extremely political. Does not matter how good you are only how much you can kiss up to store managers. No work life balance as it is retail. They say its 'one Microsoft' but corporate gets a lot more stay fit benefits as well as they look down on retail employees so your chance of moving into corporate are zero to none. While you are working, the job is great, I've worked for Microsoft 3 times, but each time was met with random layoffs.  During one of my contracts, they did an evaluation every two weeks.  I received a perfect score for every evaluation and was told my position was secure.  A week after my last evaluation I was let go without notice.  They did give me a 2-week severance package, but it certainly was a kick in the teeth.  Previous times at Microsoft, they at least had the decency to give us a month-long heads up. Microsoft has done a lot of growing up in last 15 years.  The longhorn debacle is behind it, at software releases are faster, better, and more matched to customer needs. Learned a lot at this job and looking forward to seeing how the place grows. It was a good atmosphere with bright people and engaging talks etc. Would recommend. Grateful to have an opportunity to be apart of an incredible team. They offer quality care to their workers and compensate people appropriately. Management team is kind and effective. Overall the company values its employees. Training and advancement is available for anyone with the gumption.Benefits can't be beaten anywhere and the people were all great to work with. I was in a contract role at Microsoft, and it is a different experience from being an FTE. I was not part of the culture in the same way, but I was given opportunities to expand my skill set and freedom in how I completed my work. The schedule was flexible, which was ideal for me. Overall this was a positive experience and I would be happy to work there again. I would not recommend anyone to apply at Microsoft if they want to advance in your career. Microsoft tends to hire people for management roles from outside the company. It is a difficult class on Cloud Administration dealing with server management and all the facets of that as well as working with Microsoft Azure. Very fast paced and sometimes hard to manage. My manager was horrible !! I wish I had more support in developing me as an individual. If you want to be set free and never get any support from you direct manager this is your job. I was top 100 in the company and I was never appreciated for my hard work. This company thrives on change, so you are always learning new skills. Highly ambiguous workplace with diversified workforce. Employs a growth mindset. Your experience at Microsoft depends a great deal on your team. The folks I worked with under OSS were some of the brightest, most dynamic colleagues I've ever had.This was truly a highlight of my career.However, no amount of skill or ability will save you from internal politics and corporate cost cutting. If given the opportunity, you will be replaced by multiple, less-skilled, overseas counterparts. Microsoft on a whole seems like it might be a good place to work. The recruiting vendors that work with Microsoft do NOT seem to know how they should handle actual professionals or what the job requirements vs customer requirements actually should entail. Also, their insistence on not providing contractors equipment and having the vendors maintain and provide the equipment is completely ridiculous. It causes an extreme loss in productivity starting with setting up the equipment on to having equipment that is not properly tested and under-performs when using the massive amount of applications needed to work as an engineer for Microsoft. N/A to Microsoft Corp.as we are a managed team and managed teams have limited exposure to the Microsoft.campus,employees and other benefits.The limited time spent on Microsoft campus was, though, every much like a college of academics. I was hired as an Administrative Assistant.  When I got there, i was informed I would be coordinating an event for 100 top ales professional from across the U.S.  It was to be an awards dinner.  I was given no budget to work with.  My duties included arranging air and ground transportation hotel, catered awards dinner, selection and procurement of awards plaques and prizes, after-hours entertainment for sales teams.  The communication was somewhat lacking between management and employees.  My communication with  other department personnel was supportive and clear. Poor local management and a very poor employee retention make working at Microsoft risky. I love the organization and believe in where they are going but they are very politically correct and there is substantial change every year which destroys any job security.The company is strategically eliminating its older higher paid staff to promote millennials. Great place to work, everyone is helpful towards each other. Very casual upon dress attire. It’s really great having free snacks and lunch’s. If your a big gamer of the Xbox consoles then you’d love working here Microsoft is a great company, however, the Retail Stores are not a good place to work at.  Leadership is weak, unprofessional and career advancement is poor. Pros:Cutting edge product. Good talent. smart people.ConsCompany revolves around engineering and it will take a long time for outsider to build capital. Organization is more engineering driven and less strategy Microsoft offers some amazing benefits and advancement for opportunity - IF you know the right people. Unfortunately, my store had a racial, colorism issue, and you were unable to grow or move up in the store or farther, if you were black. Mostly everyone who worked there knew management from their previous roles at a close Best Buy location, and they were all promoted and have moved on to different locations and cities. None of the people of color got those same opportunities. At MS I grew into myself professionally. I had a really great manager and mentors that helped me develop my skills and grow professionally. Worked with some really great people. I learned to be flexible and understand that changes can happen at any time. You have the autonomy to make decision but must understand they must be within the plan. It was fun while it lasted, but then the stock flattened, Apple took over in several key markets, and Google now owns the Internet which made MSFT look more like a me-too operation than the global leader they once were.That said, I had a great time there! We were treated like royalty, essentially had drivers, cooks, maids and butlers - long before that became the norm for software companies.  Twice a year we got (merit-based) raises, bonuses, and stock option grants like clockwork, which quickly outpaced simple salary earnings.The work was always challenging, which is as it should be. There weren't too many bureaucrats, and cross-site and cross-team collaboration was encouraged. Like titles says, great company with great projects, just a few bad apples in between that tend to ruin it for a good chunk of people who actually want to do good in this world Learned a lot at this job and looking forward to seeing how the place grows. It was a good atmosphere with bright people and engaging talks etc. Would recommend. Everything depends on what team you have. I was fortunate to get a amazing team and people but work environment in Microsoft can be hostile. Especially with many people with long tenure. It was great place to work, just advancement opportunities were not available and working hours were not letting me to have a normal life. its a great starting point at an IT Career. The competitive nature tends to promote back stabbing.  If you excel at your job, you need to make up new stuff to do to put you ahead of others. Employees can get lost in trying to one-up their coworkers with useless projects, wasting time and money. very good company to work for. great people and cutting edge technology keeps everyone going. great culture as well in which people are empowered so they can deliver their best. Great exposure to learning, friendly work environment and flexible work hours. Overall, it was a great experience working with Microsoft. I thank Microsoft to work at such a cool company. Would work there again. Plenty of smart, motivated, professionals and many opportunities for career growth. New CEO is positioning the company for sustained growth. It has as any other companies very good things like flexible schedule, possibility of working from home, the team is very collaborative. Don't like the openness of the work spaces because you get distracted. My understanding is that the company is evolving with new leadership. The company has changed in the last 4~ years. There was some dysfunction at the senior levels when I worked there. I would Leave 5 star but the new manager has left an atmosphere that lead most of the team wanting to quit and find new opportunities.  I was say as a whole before the new management, it was and still is an amazing experience! Microsoft's exorbitant costs stifle business, prevent growth, and are a negative for people on reduced or non-existent incomes.Linux is a much better OS, with granular security, no need for defrag, and Open-Source full/complete testing. great benefitbad work\life balanceforever changing and fast environmentalways need to learn new products and technologies to keep upgreat training opportunities Fantastic culture and work life balance. The values the company stand for are amazing!! I was very proud of the time that I spent at the company with no regrets. Everything I have learned is because of Microsoft. Every shift I had to answer what I could have done better today.  Terrible!  Culture is terrible with retail store manager being sexist and abusive to employees. It was a great place to work with great people. Great learning opportunities with great culture. Work hard, play hard. There are travel opportunities. Microsoft is very focused on political strategy and if you dont play the political game you are generally outed and managed out of the company. There is a lot of fat in MS I had a short time working with Experis. I do not know so much about the management but employees had mentioned about frequent terminations of contracts while I was with them. I loved my work at Microsoft. I felt as though my opinions mattered with my work, and the team I was on was friendly and could work together to make our product the best it could be. enjoyed working with various ethnic backgrounds and strongly talented folks. team.  players that loved providing positive feedback.  Microsoft is truly one that gives back to the community. A typical day would involve reaching out across teams and geos. to discover programs, teams and business partners that represented opportunities for synergy and collaborative program development to reach mutual goals. The workplace culture really demanded a lot of initiative and persistence to push goals through the end-zone. The hardest part of the job was helping mitigate fallout to partner companies when top-down priorities and resource availability changed by upper management. The most enjoyable part of the job was constantly discovering and connecting with smart, passionate people that approached problems and opportunities with an open mind and were not afraid to present differing viewpoints but like-minded in terms of working towards common ground and practical solutions. Good mission, strategy, but sometimes not well implemented in some subsidiaries. Good work-life balance, a lot of online trainings, fine pay, but not excellent. Learned a lot at this job and looking forward to seeing how the place grows. It was a good atmosphere with bright people and engaging talks etc. Would recommend. The problem as far as I could gather was never Microsofts fault. They demanded a standard of excellence and convergys was unable to provide that due to the recruiters and upper management. My direct managers and the people sent over from Microsoft genuinely cared and tried to help. However, at every turn convergys upper management always seemed to be a problem. There was a lot of folks with ego issues within upper management that wanted to constantly flex control and micromanage even though things made zero sense. Due to this, the good talent left as soon as they could. Microsoft and the people that they sent over though were great and really tried to help. They always went above and beyond and most of the time felt sympathetic for us due to what we had to deal with. In the end the contract was canceled by Microsoft and rightfully so. Management seeks to blend the workday with success. I learned all aspects of business and technology as well business management.   culture top notch. This is a good company to work with but it also depends on the manager. Work culture is great. Team building is good. Highly recommended company to work with. Good moral, good team building. CEO was caring for his employees. HR was great. Work environment was good. This is a good company to work with. Highly recommended. I really enjoyed my job with Mosaic I let t stay home and spend more time with my daughter. This was a great job but my daughter needed me at home so it was time for a change, My daughter passed away and now I am looking for something to keep me busy and I do love to work. Had a bad work experience at Microsoft due to a boss who demonstrated passive-aggressiveness , favoritism, unclear direction and poor communication. When issues / concerns were brought up with HR - did not receive proper support. Good place to Work. Good work life balance.Good Work EthicsRelaxed environment. Self promotion is the hardest part of the job.I learnt Cloud, Networking and security fields. Microsoft is a company of smart individuals, but the team culture fails due to the compensation/reward system. While this system has been revamped, it still contains elements that reward individual rather than team success. This is an awesome company to work for.  I enjoyed the people and the place.  they are great people to work with.  Very smart and very helpful and miss working there Microsoft is a good place to work at, if you have a good manager. The only problem they have is that they do not evaluate managers. If you landed under a bad manager, this will end your career, if you did not move early enough. I was lucky for many years to have great managers Microsoft was a young and growing company when I joined. It was an awesome experience. As it grew though it became less enjoyable to work there. It became a stable company and so the types of challenges they face are very different now. Great place to work. Enormous number of opportunities to grow.Great benefits and compensation and full access to people at your level all the way to senior leadership Poor management, extensive politics.  If one person on your team doesn't like you, you are blackballed.  Almost impossible to navigate the matrix of players on your team. Everyone here is really smart, and wants to succeed both personally, and as a company. People collaborate and help each other, focus on data, and truly focus on the customer Microsoft is a great company to work for. The management was virtually nos existent.  Manager was not personal and always absent.  Periodically received hate emails> Manager was not sympathetic to individuals and relies on 'matrix reports' to run his department It is a great company but it is very big and complex now. This is the company that you can stay for many years.  You can easily change jobs to jobs. When you work in a different group, it can be like  working in a completely different place. They ask a lot of you but compensate you with benefits. There is no dull day and as is with any company, there can be red tape. But overall very worth the money. current role micro managed, manager prefers work over life. not all roles this wayhard to hired full time from a v- status, really hate the 18/6 rule you cannot be in their system longer than 18 months you then have to take a 6 month break. you lose good people, knowledge and the people lose pay and self-esteem Very technical and must adapt to new products and new do's and don'ts of the product as they evolve. You must stay up to date and be wiling to learn new products and old products that are no longer supported but customers still insist on having. I learned a lot from this it helps me on things in life. I know how to work on the microsoft hardwear nd websites. It was a required to take that as a course in school nd it took me to greater places Learned a lot at this job and looking forward to seeing how the place grows. It was a good atmosphere with bright people and engaging talks etc. Would recommend. Great company to work for and the new CEO definitely gets it.  Overall company culture is changing but the 'Redmond Centric' habits are hard to break. No matter how hard you work, it feels like out of site - out of mind. Do to work demand you feel that you can succeed and you are stuck in a fixed work space. Terrible work life balance. Worked extended hours, weekends and during vacations. The culture at Microsoft is marked by politics and back-stabbing. Getting the job done was more important than doing the right job or a good job. With opportunities to work at home and have an office that is open 24/7 is fantastic. I do the same work that I did at my previous job, but am compensated way better, treated more respectfully, and have management that actually knows what they are doing. Must figure out work life balance in the oncall cycles until automated system are matured. Loses good talent like every other cloud company because of this and too many reorganization’s moves. Work on the Office Experience Team loved it, it was my first contract with them and loved every minute I spent there, great team, great leadership and absolutely awesome work environment. Great place to work good learning experience great management up-tempo pace positive attitudes everyone was very helpful we all work as a team I would highly recommend it to anybody The company was deceptive which gives Microsoft a bad rep for continuing to do business with the company.  Lay with dogs, you get fleas. The CEO knew. Great team members to work with, got an opportunity to contribute and learn a lot. Overall project management experience on this project was super awesome. Loved the leadership team on the group I worked with. Able to work autonomously, but with great pressure to meet tight deadlines and daily/weekly online status reports.  Culture was almost entirely vendors, with only 1-2 FTEs to a project. All-hands meetings, benefits, and perks for FTEs only creates a upper vs. lower-class hierarchy between FTEs & vendors. The job helps you learn alot. Security precautions aren't as hard as they seem. Pay close attention. Nothing allowed other then what is asked of you. You must take your job here very seriously. Work life was great, colleagues made it very enjoyable. It is fast-paced enough for the time to fly, but not enough to be stressful. I would definitely recommend it. Wonderful place to work. Smart people. Lots of new technologies to learn. Managerial decisions and choices seem to be whimsical. Age bias exists but subtle. Good benefits. Work life balance Nobody else is looking after your career.  Create a career path and be careful of the land mines. Make sure your don't leave stones unturned with your manager. Refer to resume for responsibilities. Great culture. Work life balance is depended on team. Hardest part is always finding the right fit on a team. Great working environment, tasks are stressful, decent management, cubicle to yourself, laidback yet fast-paced, food in the cafeteria is very good, breaks are enjoyable with games. The mission has changed since my time at Microsoft, with a new CEO and direction. I appreciated working with very smart colleagues, and the company makes an effort to retain its talent. It's still a VERY big company, but for a company of that size, Microsoft really does care. The Ballmer-era thinking is slowly being weeded out, and the company is becoming more alive again. As always, though, it's about your manager—whether s/he will go to the mat for you, and whether s/he is appropriately connected.Make friends. It's how you get your next job and stay gainfully employed. A typical day:  Managing logistics for over 100 Project Managers and Engineers. Reviewed and submitted expense reports. Organized team moral events, etc.What I learned:  Team workManagement:  Very helpfulWorkplace culture: CasualHardest part of the job:  N/AMost enjoyable:  Working with some great employees and learning new things. It is a great place to work as the benefits are amazing and the opportunity is great.  The downside is that the direction changes constantly and they don't seem to know how to get there except expecting reps to just sell it with no real knowledge or understanding. There are a lot of reorgs that are causing fear constantly of losing your job. Learned a lot at this job and looking forward to seeing how the place grows. It was a good atmosphere with bright people and engaging talks etc. Would recommend. The company itself is among one of the biggest companies in the world. It has a great work culture and the people are amazing. It's unfortunate that I only had such a short contract, would have enjoyed it for much longer. It has been a great experience with great managers. There is a learn by taking in as much info as you can right out of the gate. But once you adjust to the work it was very manageable and I, as a contractor, was able to work from home. The managers in last position would respond quickly to questions, give advice or give extra projects in order to help growth. The downside is that, as a contractor, I had a limit of time before I would have to leave, if it was possible to keep rolling from contract to contract I would but having to take 6 months off before I am allowed to take a new contract is highly stressful and makes me look to other companies to reach my career goals. I never envisioned myself working at Microsoft - I've worked for competitors of theirs all throughout my career. I had an opportunity to join right before the current turnaround and it's been a great ride.Great benefits, good culture, they're still a little slow when it comes to reacting to change, but that's improving.Great upper management - easy to rally behind them. I enjoyed working there, the training could be better but they're are rings of additional resources to learn from.  Headcount is always their reason not converting contractors. Working at Microsoft can be fun. There are opportunities to network and work with people across the globe. But the training and knowledge needed to execute the job effectively are limited. Managers don't realize that employees need to train and learn the products that employees are working with. The constant re-orgs that happen within Microsoft make you a little worried for your job. If you're a vendor, you are very expendable. If you interview with a vendor, make sure you know the contract and ask lots of questions before signing. loved it. 	Researched feasibility, then established first West Coast office: office always operated above sales quota and ahead of plan.	Negotiated first sale of division’s new key product Pharmasyst, the industry leading Manufacturing Execution System (MES), in half the anticipated sales cycle.	P and L responsibility, including regulatory and Sarbanes-Oxley compliance. It was great working at Microsoft. I enjoyed the people and the work I did. I learned  a lot over the 15 years I worked there and made a lot of friends. I would highly recommend working there. Rather than going hour by hour through every day, focus on a few main tasks, and describe how you go through those tasks in a typical week. Be sure to focus on duties that are relevant to the position for which you are applying My experience thus far working as a contractor for Microsoft has been a pretty positive one.  The company is technically Experis / Manpower but it is a partner of Microsoft.  The job is full time as an Office 365 Support engineer. Working at Microsoft was fun, fast-paced, and challenging.  I worked  on teams in 2 different product groups and 3 different sales and marketing groups, including one global sales and marketing team.  Teams and divisions in Microsoft can have quite different management and some differences in culture and work environment.  All but one of my teams were full of great people and challenging, fun work.  The one team that was not was still enjoyable.  It's just once you have seen what is possible, the merely ordinary is less than satisfying.  Do some background work on the team and/or division you're interested in joining, but Microsoft has been reorganized almost completely in the last few years with the new CEO.  That has largely addressed the one average team I was a member of.  Overall, this is a great company that I could work for again! It's a great company with great products and lots to learn. Many teams still have individual offices for engineers which is much quieter than open office. Colleagues are generally smart and respectful. I had an awesome time at Microsoft over the summer as an intern. Everyone was incredibly friendly and helpful and they take really good care of their interns. I will say though that my work and the work of many around me didn't interest me and wasn't for me. It seems like there are a lot of places in Microsoft where you might run into a project that isn't the best, but the people really make up for it. Good company good management. Nothing else to add. Lots of opportunities. Fair compensation. Good life and work balance. Management proactive to listen to employees. Microsoft is a great company to work for, with incredible benefits and a solid company mission. Unfortunately, like most large corporations, smaller teams can lose sight of this, and get wrapped up in the day to day issues that may prevent efficient productivity and communication.Issues like favoritism, hostile team members, or apathetic leaders just focused on numbers are not unfounded, but as long as you find the right team that works best with (and supports) you, it can be a smooth and enjoyable experience that challenges a team to be its best. Sadly, I was only there temporarily for my intern project. I think the company is really transforming itself into a modern juggernaut. I would highly recommend working here. Great company to work for. Changing recently some things for the best, some not, but overall good place to work. CEO is moving the company in the right direction. My time doing contract work with Microsoft was fantastic. Good work experience, and Great People to work with. What I learned while working there was invaluable. I work remote no issues to complain the employees are my favorite to work with, This place is like family and as such you are happy to work here. There is no micro management everyone works well in unity. Each day is different learning experience. Great people to work for.Due to the high case loads, can be very stressful meeting previous commitments. Severity A cases take priority over scheduled callbacks.Some engineers do not notify the customer that they will miss a callback. Microsoft is a large company that provided a diverse set of skills and opportunities.  It is the employee that must drive their career path as most managers are focused on the tasks rather than employees. Learned a lot at this job and looking forward to seeing how the place grows. It was a good atmosphere with bright people and engaging talks etc. Would recommend. I moved from Seattle to Georgia. There were no offices for me to switch to in Savannah but I found a new opportunity in GoSoftware/Verifone. They moved the office to Florida so we had to move with it. Good working environment working at Microsoft, good mannagemnt and learning oppartunity...good benefts like drinks ,Juices, coffee and transportation. Microsoft is a mature, secure, and successful company. It continues to reinvent itself, while still growing on its trusted customer base. Best company in the world to work for! Great diverse bunch and love working with Europeans who envelope a good work/life balance. We were very efficient and deadline oriented. would have liked to worked onsite more if possible. I had the opportunity to learn new things. Work pressure is definetely on the higher side. Expectations are also too high. Lot of opportunities for challenging projects. Great place to work, great benefits, great pay, awesome culture and the feeling you are making an impact on the world. Could not recommend working there more! You spend a lot of one on one time with customers building a good relationship with them. Clean and friendly environment. Excellent relationship with coworkers and management. The best place to work. I cant say enough good things about this place! The environment, leadership and programs they offer! They are simply the best and everyone should run their stores like Microsoft just bad over all, management are not technical, technicians don't know how to interact with other,  it all  competition all the time. The only good thing was that there is not dress code Internship was amazing. Gain real-world experience in a creative and refreshing way. Work seem more like fun! Learn many new skills and was able to provide important feedback to improve future internship programs. Microsoft was a pleasant company to work at with very friendly employees. Although, this was a short term position for me it was still a place where I felt included and welcomed. Excellent place to work.  Lots of perks, great benefits including 50% retirement match for 401k.  Good food, great leadership.  Only downside is not a lot of training in Finance org I managed an accounting group that ensured GAAP reporting for the company. As such, I was involved in all aspects of most of the company's business lines. I learned a lot and enjoyed working with other managers in HQ. The company provides vast opportunities for advancement, - Days were either spent in the office, visiting customers or holding customer conferences in the Microsoft offices.-  most enjoyable part of the job was visiting and meeting customers Typical day: lots of emailWhat I learned: honing my skills in all of Microsoft's softwareManagement: my manager was excellent and supportive yet firmWorkplace Culture: acceptance; besides doing your job, you are to contribute to the success of others and further build on current technology. Very good benefits (401K with above average matching, vacation, health insurance, sick leave, and many others) , very hard working and talented colleagues and management. Microsoft provided a great opportunity to grow and expand my career.  Training is available in class and on demand, benefits are some of the best in the industry and compensation is solid.   They are changing their business and shifting to a much younger workforce. The company is great to work for. Lots of opportunities for different fields and technologies. Most teams respect work life balance. Management is hit or miss on quality. Career trajectory is highly dependent on team, some promoting faster than others. very fun to work for if you are into video games and computers or anything related to IT, you learn a ton of things that you use on a daily basis even if your everyday life. managers however play favorites A LOT and they only promote the people who they like, it does not matter what you bring to the table, if your manager does not like you personally, you will never get anywhere The company runs at a fast pace, not always able to think strategically.  Management can be very good or very bad.  As a sales organization, they focus primarily on IT, and have a hard time getting outside of that box. Learned a lot at this job and looking forward to seeing how the place grows. It was a good atmosphere with bright people and engaging talks etc. Would recommend. I learn many things here. Work was overwhelming but we got used to it. Their land case is challenging and they have one of the heavily customized solutions I have seen. Everything depends on your team. I worked with Microsoft Global Security. My Leadership team was superb! They worked very well with my transportation situation. And the benefits are great!I do wish that the department as a whole wouldn't be so biased toward individuals without degrees. My team wanted me to stay on, and needed me, however they did not have it in the budget this year. Good Company to work for, Bill Gates is top dawg! To be a Apple fan and see how microsoft is competing in the market is truly inspiring as a marketing expert I spent 16+ years with the company and was able to hold a variety of roles at corporate and in the field. Loved the passion and energy of the people and the roles were challenging too. Microsoft was a great place to work.  I was a contractor (as are 50% of their workforce), and as such pay was significantly lower than those employed directly by Microsoft.  The work environment was great and staff and management all great to work with.  I had the pleasure of serving under 2 great bosses there.  It was an interesting job and I did enjoy it.  However, vendors were definitely treated differently than MS FTEs, in that we weren't allowed to participate in morale events, and we were identified and singled out as vendors with a 'V-' in front of our email addresses. Unrealistic expectations for new hire sales, especially in limited opportunity area. First Line leadership not well prepared for new role. Lack of local management focus on such things as badging for appropriate customer visits, no follow through on mentoring, complete lack of respect from first line manager toward skilled and talented personnel. Attempting to raise awareness in leadership was to no avail, work environment was toxic. Best thing I ever did was leave. Alorica who handles Microsoft's Bing Ads Services and Support accounts, is a company that need more help than I am willing to tolerate. No concern for the worker who is treated like a disposable tool. Like many big companies, Microsoft suffers from illogical policies and practices and seems to be getting worse rather than better.If you can find the right team, it's a good place to work anyway, but with regular 're-orgs', it's unlikely that Microsoft allows a successful pocket to survive for long. Beatiful campus with nice buildings, offices and subsidized meals and drinks do not balance with long hours, tons of pressure and lack of leadership in the middle of the org chart. As a vendor, I enjoyed the team I worked on. My managers were intent on knowing if I enjoyed my work, if I felt it was challenging enough or not. I can't speak to compensation or benefits. Typical day at work is very relaxed unless there is a sales focus.I learned to build stronger relationships with customers.Too many managers for small roles. as an employee, you have unlimited access to information to get your job done. I learned a lot about the upcoming technologies and was able to implement it at customer sites. I appreciate my time that I was there. Microsoft is typical of any large companies.  It depends on the team you become a part of which can bring either success or frustration.  Overall, Microsoft has a strong leader in Satya with a clear direction for the future. This is a company where experiences are fully shown and all tech apps are known and placed on current tasks and duties.  It is a company will like to work again.l The company itself says they promote from within- however they are extremely bias. If your not part of the in crowd, there you are just a number and not recognized for your contributions to the company, further more you are not and never will be promoted- without being in the circle of close nit employees. I came to Microsoft as a level 62 (SDE II) engineer with about 3.5 years experience. I'm ready to leave 2.5 years later feeling like I haven't grown at all and actually have regressed. A large part of that is on me, but I do feel like opportunities can be hard to come buy. If you don't have the right personality type then you just end up lost in the shuffle doing tedious work for years. MSFT helped to grow my career and I loved my time there! My extended team and in particular my direct manager were supportive, smart and collaborative to me and made my time there a very satifying one! Microsoft was a good place to work until the implementation of forced attrition and having to constantly compete with your coworkers. Everything is based on review bullet points and no one I know who was successful worked anything close to just 40 hours per week. There is a lot of scope for anyone to develop and grow their careers. You have different departments and various functions across Microsoft to nurture and grow. Working at the Microsoft Store is unlike any retail environment. There is no commission, and everyone works together as a team to make the store a success. Learned a lot at this job and looking forward to seeing how the place grows. It was a good atmosphere with bright people and engaging talks etc. Would recommend. Great opportunities, great managers great everythingMicrosoft is the technology leader. So impresssed with everything they do.You can move around to any division with ease Doing technical and customer support work for Microsoft was one of the best jobs I could have ever snagged at 18. The management wasn't the best with the company we were contracted under, but Microsoft themselves were fantastic. Microsoft Store is a very amaizing place to work. They give you the tools you need to succeed. As a Product Advisor ,we had the opportunity to showcase the best products in the business while playing with every new technology available. Great finance leadership team that sets clear top down expectations for achieving business and organizational goals. Focused on digital transformation and forward-looking initiatives. I left for political reasons, but these things happen in all organizations. That's no fault of Microsoft. I had a great time while I was there and learned a ton from some of the smartest people I've had the pleasure of meeting. Genuinely didn't like my time there, I've been with three different teams in two different organizations and my experience has always been the same. Not really sure what more I could say. Sathya transformed the company and engineers are amazing. The company is a leader in azure business and everyday is filled with opportunities. MICROSOFT is the company of future for trusted partners and platforms When a company has a good culture, it doesn't matter the level, the employees will follow. I have never been sad to leave a retail job until I started working for the Microsoft stores. They provide all types of training from basic software to certificate training to their employees. Management is extremely supportive and will do all they can for you to succeed and reach your goals. Free drinks and snacks and on occasion we had free lunches. Great benefits which included free health care. All of this for a part time position. The only thing I would mention is that there is a divide from retail to corporate. I wish they could offer more opportunities or at least a 'bridge' for those who want to move up from retail to the corporate level. Microsoft has an admirable mission statement and lots of wonderful workplace culture goals an ethical standards. In my experience, there is a large disconnect between these lofty upper-management goals and application.  The bad:I experienced a toxic, sexist work environment where I did not feel I had the support of my managers and HR. The good:Excellent job training! I was given access to wonderful training materials which gave me the skills I needed to find a better job. A typical day at work is meetings in the morning, taking time to learn from our training online sites. Exceptional place to work. MSFT has won for five consecutive times the Best Places to Work Award for the three MSFT sites in the Island. I loved Microsoft, but I was only there as a contractor in an entry level role, so I was making nearly minimum wage with no benefits. I have some friends who work there as FTE's and they have great earnings and benefits and great job security. The hardest part of the job I had was staying abreast of changes, since we did not have a stand up on my team. The best part of the job was having the opportunity to make a meaningful impact in the world of consumer electronics.  Knowing that my contributions help make a better UX is the greatest satisfaction that I can get from a job. Great Company, set hours, good benefits, and leadership was open to feedback. Advancements were hard to obtain due to politics. Learned alot during my time from bright and brilliant peers. Paved my way 1990's when Windows first started... I was working here and I learned to use a mouse fior the first time at the best company using WINDOWS on a 386 system.  Learned to use the Microsoft Suite, actually was paid to play with it and get to know it since it was new to us.  This was an awesome experience for me and start of my career in the IT world. Microsoft offered a bunch of benefits for its employees and their families. However, work life balance was not as it was portrayed, and schedule specifications went unnoticed. As an intern here at Microsoft on a technical support team I've acquired amazing growth in my hardware skills. One of my best experiences here I working with MR/VR & AR devices. Microsoft HoloLens is the future! A typical day at work is always different we supported roughly over 1000+ people in our organization so requests vary from setting up New hires to inputting audio/visual support in conference rooms.Most enjoyable part of the job is the people and doing something different everyday!Workplace culture, amazing, fun, active, warm and welcoming. -Everyone here is very nice and includes you in on projects-Super relax and fun environment  -Management is great and get things done-They have great collaborative events Its ok for the younger group. Being in your mid to late 30's and working with 19-25 years old is stressful. Too childish for my taste. Your constantly doing workshops, which is alot of talking for 2 hours. But beware if your good that is all you will be doing. No one else wants to do it. No work life balance. Period. My manager in Microsoft is the best because she introduce me to all our clients and thought me tricks of the trade early on. I enjoyed the culture as well and the company has great benefits. They really care about the interns here, only thing is my project could have been better suited for me.Differs by team, but hours were very chill.No free meals unfortunately. One learns to manage time well hereOn boarding  can be overwhelming in the beginning, but if you have the support of your team the process can be an interesting learning experience Learned a lot at this job and looking forward to seeing how the place grows. It was a good atmosphere with bright people and engaging talks etc. Would recommend. I was with MS for 10+ years but an opportunity presented itself.  I was coached by my HR team that if i wanted to advance in my career I should leave and then return to receive a level and title increase. I feel this is the wrong message that should be communicated to employees. I was given ample opportunity to grow and learn. Scaling was factored into every design decision we were asked to make, and we were tasked to evangelize the direction we would choose. Good work culture.Opportunity to learn cutting edge technologies.I worked most of the MS technologies : MSBI (SSRS,SSIS,SSAS), Power BI, Azure Data Factory, Azure services, SQL , PowerShell, C# super fast paced, competitive, innovative company undergoing a shift toward evolvingf the corporate culture.  lots of momentum which is fantastic and a reason to believe. but headwinds over next 2-3 years. The culture is very diverse and they need to reduce the vendor count and see the strength of their employees. The contracts skew the growth potential of the company. Msft is a very good employer with great benefits and opportunities for career growth if you're favorable viewed in the political arena, which is important for advancement along with other criteria. l had a great experience there I just did not like the morning meetings and morning pep-talks to get you going. Did not need them at all. Would have liked if management did not try to burn me for doing the right thing. Would have liked if upper management and HR did their jobs a little better. Would have liked if there was not a buddy buddy system of hiring, promotion and just being a member of the team. Everyone looks to management for guidance and direction but when management is the problem, who is there to go to? That is my problem with Microsoft. Management sticks with management and not the employees. If you are there friend and follow what they like then you are good with them. If not, you are screwed. No matter how right you are. Microsoft corporation is a team inclusive environment that looks to better its employees as well as its clients. They are amazing to work for. Environment friendly and strong work/life balance.I did not work extra time every week for the pay or workload alone. I wanted to be there and be a part of something and something was always happening! I have learned a lot from various different teams. I have had the privilege to work in Supply Chain, Xbox Marketing, Sales, Intune, ISRM and other organizations and it has been a fun ride! This was a nice place to work. Lots of activities and opportunities to work on new things. part of an acquisition made it a bit of a challenge going from small company to big Teamwork is just a word thrown around to make newbies feel comfortable. However, it doesn't take anyone long to realize that the only way to succeed at MS is to back-stab your fellow employees (thanks to stack-ranking culture) and become a sycophant to management. Every department is in competition with each other, to the point that inter-departmental cooperation is non-existent. Butts-in-seats was more important than work actually done. It's no wonder every product MS pinches out is late and uninspired. Bottom line - if you're a good BSer, suck-up, and don't mind stepping on your fellow coworkers to get ahead, then MS is for you! It is very well managed in terms of time.Compensation excellenceJob security nillManagement goodJob culture excellentFreedom to workRelaxed timings This was a contract position. The terms of the contract were laid out clearly, and the contract was completed successfully. This was one of many contract jobs I have done for Microsoft, but this was the only long-term contract. I joined when the company had only 4000 employees and grew by 10 times. it was a vibrant, exciting, and well managed company that thrives to this day. Microsoft in general is a great company to work for as long as you get a good management team, get the wrong team and it can be miserable. Enjoyed the company, though I had ongoing issues with my direct manager. The full time job interview is hard for me to pass. I am not good at data structure and algorithm.The colleagues are very good. I learned a lot from my manager and coworkers.The tools and skills are cutting edge. You need to learn everyday. Supportive team and productive outcome as a result. Fun place to work and get to meet alot of smart people to talk to and learn from. I recommend this place to any one wanting to work in this industry with great mission. When I was there the culture was very cut-throat.  Stack ranking was used to pit employees against each other.  My understanding is that things have changed since the change in CEO's. Due to the fact that at the time I was merely 15 years old, midway through my GCSE’s; and that I was there for a short two weeks, I am in no place to give any in-depth details about the company. However what I can say is: it is and engaging place, an interesting place and an exciting place. The campus,  where I did my work experience, was certainly adequately equipped to provide a comfortable work space (in my opinion) and the people there are friendly aswell as reasonable (from my experience). The retail division of Microsoft has become more tightly knitted to the corporate side over the years, and as such the work-life balance has gotten better. The dedication to inclusivity is also a high priority at Microsoft. Developing a culture of growth mindset is also a huge focus for the company, and is something that is being worked on from top to bottom.Microsoft takes care of its people. In retail, I could not have asked for better salary, benefits, and time off.  The attitude towards volunteerism and charitable giving was also amazing. The biggest gripe I had was their policy of 'if the mall's open, we're open', which meant working on Thanksgiving. Learned a lot at this job and looking forward to seeing how the place grows. It was a good atmosphere with bright people and engaging talks etc. Would recommend. it was a growing and learning experience to work at Microsoft. I am proud to mention that Microsoft was my employer. Our supervisor was very clear on what he needed to be done and took the time to get together with the team for daily reports on progress. always there to provide the necessary tools to meet the project needs. The onsite culture is difficult to navigate. Microsoft fosters a culture of full time employees are upper class and contractors are a lower class even though there are more contractors. If Full Time Employees (FTE's) have a problem, its a contractors fault. i have done many different things from manufacturing to body modification. this job was by far the best thing i have ever been able to do. the environment matches one you would find at a best buy but the experience and the pace is extremely slowed down. customer engagement is at a level where you can sit one-on-one with a customer to truly figure out what they need. except during holidays of course............ The clientele was memorable and we had some good experiences between coworkers for the most part. Overall, it was a decent experience. I put in my two weeks notice before departing when I mov Great company and benefitsGreat place to work unless you end up with bad managers who seem to keep their position in spite of bad reviews.Unfortunately nepotism happens in the companyGrowth mindset help increase collaboration within the company I got this position to get my foot in the door and so far it has been a great time to learn new skills and hopefully continue growing my career.The environment is great and the people at the location I worked at are wonderful. If you learn your responsabilites fast, company can be flexible with your working hours. But management can improved. Its a bing copany so I'm sure not all management is the same. Always something going on at the campus. Give you a chance to always network. Teams are also very supportive. Have to be eager to learn because there is always something new going on and something new to learn. Good work-life balance with fun co-workers, but department lacked transparency and ability to challenge us as designers. Insight Global lost their bid to renew their contract with Microsoft shortly after I joined their team and said we would not have to worry about job security, but that was not the case. Long-term managed service contract as a Network Engineer in Cloud Computing at Microsoft Azure Networking - formerly Microsoft Global Foundation Services/Global Networking Services. I really liked my Manager, he was a good mentor and I learned a lot from him. all different kind of Microsoft technologies. also you can explore different opportunities in all different areas. it totally depends on your energy level. Fast paced job but environment was still conducive to a productive work day. The management was supportive and helpful with completing tasks. Hardest part is always dealing with clients but was handled in a timely and appropriate manner. I never saw anyone in Devices use the ping pong table or any of these things.  Most people worked hard with long hours and ate at their desks.Interesting place but hard to work there as a normal person and there was always limited information flows due to security.Great food and really interesting people. great place to work still a bunch of bad managers. the old culture of Windows was toxic. hope things are much better today.great place to work initially but with the down of windows business and reorgs politics took over Microsoft is a great place to work. They value and invest in their employees. They possess and instill a competitive drive. It was exciting contributing to leading edge technology products and solutions. They hosted employee events all of the time and included family members. It was an environment of innovation, inspiration, collaboration, teamwork, etc... I really enjoy my job. I was able to help customers with technical support concerns about his or her xbox game system. The information and training was great. The managers at Microsoft were either very good or very bad. There was almost no in between. There were literally five or six different managers all doing different things and if felt very stifling at times. Overall okay commission based job. Management did not seem vested in, or incentivized by, the success of all employees.  Objective success criteria for the role were never determined and communicated.  Expectations were only communicated after the fact when apparently they weren't met; and feedback was either vague or nit-picky.  'At your grade level you should know what the expectations are'.  Stack ranking still happens and is challenging when you can't see status of your peers and your manager isn't an advocate for you.  Annual reviews had too many negative surprises. Plenty to learn here with a lot of room for advancement or even just learning new roles within the company. Always kept busy and was able to learn plenty of new things. Learned a lot at this job and looking forward to seeing how the place grows. It was a good atmosphere with bright people and engaging talks etc. Would recommend. You get out what you put in to it.  Microsoft can be like drinking from a fire hose at times.  It is a great place to work.  Microsoft has excellent benefits.  The culture is fantastic. It's a workplace.  It was a good job until it wasn't.  Work experience varies widely depending on management.  A place of employment is somewhere you work. Microsoft taught me more about business than any other company I've ever worked for.  For a company with more than 100,000 employees, it thinks, acts, operates like a much smaller, startup kind of enterprise, always focused on innovation, being disciplined about every decision, no matter how small, and doing things because they're hard, not because they're easy. Working at Microsoft is somewhat an honor. That being said I would say to stay strictly away from the retail side. Most of the managers in that division come from other retailers and don’t really share much of the culture the company strives for, this is due to a lack of education and compassion. - Compensation isn’t ideal unless you are just starting out in the tech industry, they pay less than ideal wage to their service advisors ($33k - $45k/yr.) whereas a similar position in corporate is anywhere between $50k - $80k/yr. If you still want to work for Microsoft after reading this, please focus in getting a job at the Redmond or Bellevue Campuses. STAY AWAY FROM RETAIL. Originally apart of outreach programDaily MeetingsLearned various custom software for product proficiencyManage teams and performed with teams geared to learn the market and user's demand for products and solutions.Tedious work but  rewarding after completion Fun place to work, good culture.  I felt like contractors to all the work.  I was a contractor.  The FT folds get the window offices and are fairly clueless about details. Everyday so far has been uneventful. We really don't get that many phone calls. The training is really great and they have many training tools available. Nice place to work.Been working in the Finland location.Been lead for TFS application.Configuring TFS and the server architecture meeting the customer requirements. While my time there was short and project based, it was a very professional but fun. All work but you really enjoy working there. Great staff and a great work environment. If you like the job you will only get by. Expect to exceed requirements that will not be written and compete with peers. Management was only good while they were your manager, and they used position changes as a way to excel current employees while discarding people that no longer reported to them. I was a mobile employee and had extremely long days with a non-standard work week. 9 to 5 (or midnight) managers did their best to shield you but wanted you available during normal business hours. I absolutely love this company. We have a amazing benefits and the culture makes me feel at home. When you first start it is an excitement to see all of the technology advancements you get to be apart of. I'm very grateful to them for giving me many opportunities to learn and grow and help on many new and exciting projects. The culture was hard to get used to at first. I learned to be more self reliant and realized that it was sink or swim and I needed to reach out for help when I needed it otherwise I was on my own to solve the problems or tasks on my plate. Received a great opportunity to work for Microsoft as a contractor. I loved my teams and the culture. It was very flexible and understanding which was very nice for my family. I had a wholly positive experience in my 3 1/2 years at Microsoft. Great work/life blending with flexible work time and remote work. I highly recommend Microsoft as a place to target for those looking for new opportunities. No Review, I have so specific information to provide about the organization I have worked for. No information about the project or the organization and the internal practices of my department. It was a nice place to work for a while. I enjoyed working for a well known company and providing exceptional customer service. I learned a lot about customer service and professionalism in the position. The people were the most unpleasant aspect of the position.  Decisions were made without consulting the team & very little communication as to what was going on & why. I loved the work environment, culture and people at Microsoft. The job was both challenging and rewarding with each team having their own identity and team culture. This makes working in different roles at the company refreshing and exciting. Typical day at work is you grab your morning cup of joe, meet with your managers and partners. I learned more in my internships than all the classes I took in college. The culture at work is shifting more and more each year towards cloud computing and online software. Nothing really bad to say about the company. I was a contract production artist, so my time was limited at Microsoft. The upper management was very helpful, great culture and enjoyed my limited time at Microsoft. Learned a lot at this job and looking forward to seeing how the place grows. It was a good atmosphere with bright people and engaging talks etc. Would recommend. Employee benefits are AMAZING. Management was very disorganized, they made me feel like they were toying with me when it came to hiring. The general manager guaranteed me a permanent position but never got back to me. I called back, they said they're working on the paperwork. They had me wait around unemployed for a month and I just gave up. My time working on the Microsoft campus was incredible. Everything was clean, organized, and exactly how you would want an office to be.The fact they gave me a free ORCA card was incredible. It made my commute relaxing and stress free. Benefits were great, and it would be an honorable experience to work there again. Typical day at work starts with morning stand-up. Talking about the day's budget, giving out some 'kudos' to fellow employees that have done some great stuff lately. Talking about Microsoft in the news and the upcoming events and products. Throughout the day you work with customers and help resolve their problems with over the top customer service. In today's world, people need their computers. We are here to help when things go wrong! I enjoyed working here with such a professional team of Microsoft.Fun place to work and so many new things to learn.flexible and easy going people and env. I think with any company you will have a love hate relationship with different aspects of your job.  I was lucky enough to be in a role where i could interact with dozens of different customers every month to assist with solving some very easy but most very difficult problems.  I would recommend everyone to try out MFST, only you can know if it is the write fit for you. I left a senior manager role because my spouse got a job in another city. I wouldn't have left otherwise. It's a great place to work and filled with smart, driven people committed to the company's mission. Great competitive work culture, phenomenal work environment, great employee events and recognition, occasionally the work/life balance is off but if you can handle some long hours, this is a great company. I worked as an Intern however it was a great place to learn and grow. I was taught a lot and could see myself working for the company until retirement. gives an incredible level of exposure to people at the analyst and senior analyst role. It is an exciting company with lots of interesting projects happening across the various lines of business. There is generally a strong development culture, good pay, and a good work life balance. The McLean campus is adding a beautiful new building in summer 2018 which is a great perk. I worked alongside software engineers working on PowerPoint for the macOS/iOS platform and had the privilege of working on their projects.  The company moves fast, so you'll need to adapt on the spot. However, it balances it out with rewarding activities, paid vacations, and great social interaction. Great company. Fast pace. Demanding. Think on our feet and deliver. All depends on your team and manager. Pay is good for vendors. My last manager was great. I plan on going back after my 6 month mandatory leave for V-. your experience, and career growth will vary drastically based on the team.Most teams provide a good learning experience and tons of really smart people to work with. Fun workplace, allowed a lot of autonomy to finish tasks how I saw fit. Laid back environment.Good food in cafe.Very competent management who actually knew the technical side of tasks assigned. Loved the benefits and the additional education that they always provided me to help me develop my skills within my role. Really enjoyed my time working for Microsoft. Enjoyed working there.   Felt like a part of the team.   Always had plenty to do to keep me busy.   Hope to be back there sometime in the not too distant future Overall, I would be able to tell the people who asked me 'How do I like Microsoft?' and I would say that I loved it. I hated the management at the Retail level though. Something that I would have to tell a lot of employees wanting to start there is that you will not be able to advance in the big stores. Only the small ones will you be recognized for all the hard work that you do. It was all politics in my store and definitely some unfair decisions took place when it came to the people who was favored over the people who actually put in time and effort to make all experiences for customers worth it while bringing in money over a manager who would scream at the top of his lungs across the store making everyone think he was 'special' or customers uncomfortable. The benefits were amazing. The company was giving. But I ultimately decided to leave because from what I was getting paid compared to how much I was making, it was disappointing. I worked as production intern on live production sets. Great experience working on 2-3 different shoots each week. Gave me broad exposure to all aspects of the corperate marketing world. If you value a positive experience within the work place then you would absolutely love working for Microsoft! I have gained so much knowledge and experience with this company. It is very fun and enjoyable work place. People were very nice and helping each other when needed. I have learned a lot of new technology about the products. This was a temporary contract position at the old Bing office.It was a nice place to work at, but is no longer in business.There was some room for growth and was very driven by time management. Learned a lot at this job and looking forward to seeing how the place grows. It was a good atmosphere with bright people and engaging talks etc. Would recommend. Microsoft is the greatest company on Earth, I hope one day I will be able to return and work in such an awesome environment again.  If you get the chance to work here, do so. Nice relaxed atmosphere that supports a 'Growth Mindset'. Microsoft's message is to promote career advancement, but sometimes it also feels like your direct work group will not recognize your efforts to do so. I believe it's a solid place to harness your passion for technology,. Great opportunities for growth and learning in the job. Seek out for those opportunities by yourself within your team or across other orgs.Focus and manage your time wisely. The year I spent at Microsoft was one of the most exhilarating, challenging years of my professional career.  I was exposed to some amazing technologies, and was really able (and encouraged) to stretch myself technically. I joined here in June 2018; was very excited to be part of it.Met couple of talented people who are very good in their field. It has been a great learning experience. I joined Business Intelligence Center of Excellence team in 2017. Worked on emerging BI technologies and tools; e.g. data vaulting, informatica etc. Developed my passion for analytics with this team. Microsoft is the great place to work since you always work on latest technologies , timings are flexible , it provides free drinks , stationary no dress code, provides free shuttles , Orca card , Microsoft discounts on some shops Loved it here with some exception.  It really all depends on what organization you work for and if you and your manager get along and more importantly, if you love your job.  Some reviews I've seen about MS are mixed and at the end of the day its all a matter of perspective. I was a student for a transitioning military program that Microsoft hosted through Embry Riddle Aeronautical University.  It was fast paced and had lots of  really good material.  I enjoyed it thoroughly. The company culture encourages protecting yourself by avoiding any work that is not directly assigned by your manager, because any delay in your work will affect your review from your manager. Everyone also values time alone, often closing their offices and making themselves unavailable through emails and instant messages. It can be difficult to get buy-in on a project from other teams, even for small things like code reviews or short meetings. Additionally, the PMs responsible for handling these kinds of issues routinely leave the company or move to different departments.There is very little cross-team knowledge-sharing. Even within the same team, until you are sent a code review, you rarely know much detail about what your teammates are working on.The company is full of smart engineers who produce good work, but there is a collective resignation to the mountains of legacy code that will always be a thorn in their sides. No one is interested in improving the situation, because all of their assigned work is feature work and they don't have the time.There was a surprising lack of developer tools (aside from the standard public-facing tools like Visual Studio and TFS), with essentially no standardization across the company. Every team had their own ways of building, deploying, and monitoring code. However, this did improve noticeably during my time at Microsoft, with a new company build platform and some standardization of source control, code reviews, and pre-checkin testing. Lots of opportunity to manage your own career and explore areas of professional interest.  Politics and luck perhaps play too large a role in career trajectory.  Management needs a better high level technical understanding of the work engineers they support perform. Sometimes projects can take awhile to complete though, due to the nuances of working for a typical large corporation. The people are very smart, and hold you to a high bar, which is very motivating. Culture changes at Microsoft started before executive decisions were made for organizational restructuring. Restructuring started at the top with John Thompson and Steve Ballmer before the cascading throughout the enterprise began.  Great benefits and compensation, including bonus program. You feel that you're really making a difference, regardless of your role - front or back office. Plenty of opportunities to move into another role, especially if you're interested in working in Redmond, WA. Microsoft is an excellent place to work. There are so many products and services, and Microsoft’s stack empowers countless businesses to be productive in the modern Information Age. I am overall happy with the opportunities, the campus, and the lifestyle. The compensation could be a little better for a tech company, and not all buildings feel new and modern. This is something the company is actively working on though, it just may be a few years before some offices get renovated. Some old politics from the Balmer era persist, but overall it’s pretty cool to work at Microsoft again. I thoroughly enjoy working for Microsoft. I feel like the company does everything it can to make each and every employee feel like a valuable employee Microsoft Its the most enjoyable job i ever had lots of flexibility wit schedule and work life balance is highly taken in to consideration by senior leadership This company has gotten too big and cannot manage to recruit properly as well as poor management which is awful. They act like they are giving the world such a great product when they really have not changed much since windows 95 lol. They have a good work culture, nice environment and very quiet. There is a big opportunity to grow and you can learn a lot at Microsoft. The management is OK. The hardest part of the job is you have too many things to do. The most enjoyable part is people are nice and they have different communities allowing you to interact and get to know people. it is a nice job for me because they work with my school schedule. the health benefit is so amazing and not comparable. the hours are 12 per day for weekends, and 8 hours for weekdays Learned a lot at this job and looking forward to seeing how the place grows. It was a good atmosphere with bright people and engaging talks etc. Would recommend. Microsoft is an amazing company with amazing benefits.  You should check this company out if you are wanting to explore your growth in the hardware and software industry.  Not much room for growth in Oregon, but if you are willing to travel, you can go anywhere! Management experience varies across the company.  It is highly recommended that one focuses on managing their own career, establishes an execution plan, and then aligns with their manager on that plan to achieve all they want/expect from their time at the company. Great Place to work... They just don't have FTE slots for my kind of role.   One of the Best managers peeps I have had in a long time.Its Hair on fire for sure but that's why its called Work.   Want to stay but need benefits so nothing bad here.  All good just not an FTE slot for several of us. In general, the culture at Microsoft is effective, but there are lots of times that projects are not completed. Typical day at work would be two to three meetings and blaming of personnel for projects not being completed. Good culture for employees and work life balance, just lots of projects are constantly not delivered, delivered late, or delivered with bugs. Overall this was a great company to work for. The only problem is poor management. While I was there 2 head managers quit and several supervisors fired. Worked their during a very robust and exciting time, early 90's. PC use and growth on a huge upswing and starting to be apart of everyday. Constant employee support and encouraged growth. The culture at Microsoft is so bad that everyone tries talk bad about peers, back stabbing is prevalent, management have no experience to manage and they still thinks its 30 years ago at workplace. I worked with the Microsoft Resellers and assisted with their customers.  I enjoyed explaining the process of licensingfor Government agencies. Overall I enjoyed the sales process Microsoft is a great company to work for,  The technology, workplace culture and overall environment have been perfected,.  I would work again for Microsoft without hesitation. Started as a level 1 in a brand new datacenter. Amazing to see all the hard work put into create a data center. Great atmosphere and work culture. They take care of their employees and easy advancement. You learn a lot and they pay to advance your skills. This was a temp job at Microsoft and was a great experience.  I had a wonderful supervisor at the time we were never left hanging on anything.  There was always a team to help you if you had any questions with lots of encouragement and relaxed yet productive work environment. Great culture - work hard play hard mentality.  Management isn't very strong - they are unaware of larger hollistic organization & can't necessarily provide proper direction. Took a short contract position and enjoyed my experience very much. Lots of collaborative work with cross function teams across all americas markets. Great Org I was only temporary, therefore, my experience may be different than others.  However, it was a relaxed atmosphere, and with a cafeterian onsite, it was a great place to work. As an intern at Microsoft I was assigned to work that was quite similar to what a full time employee would have done. The sky seems to be the limit as to what you can do while there and the odds of being hired on seem very high if you show promise. Might have bad manager but you can transfer to different manager like fellow interns had to do. Management from an IT perspective was satisfactory until the company began growing. Once that occurred, then they began to attempt to micromanage and it caused communication to fall through the cracks. Everything was great at Microsoft except having to meet sales goals. I'm not an experienced sales person, so I didn't always excel at that. This led to me being released from my contract. A typical day is work, meeting and a lot of emails.You learn to use many tools for control complianceThe management is strict and requires a high degree of commitment and timeline and accuracy are the key to keep a job at Microsoft. Had fun at Microsoft. Smart people and excellent tools.You can get bogged down in the amount of email that gets dropped in you inbox each day. Things might have changed as Slack (or something like that) is now being used. Microsoft is a people organization. Great company, great benefits, unlimited growth potential. Microsoft pays very well.  Very active company that empowers thinkers and doers. Learned a lot at this job and looking forward to seeing how the place grows. It was a good atmosphere with bright people and engaging talks etc. Would recommend. it is very enjoyable working at Microsoft. it is friendly environment. We got all support from engineering when needed. Benefits are one of the best I have ever had. I enjoyed my position with Microsoft, even though it was a temporary gig as a contractor.  It is a good company with good solutions, and I only wish they had the same loyalty for their people that they expect from them. Customer service for X-Box online game players. Using a telephone headset, taking incoming calls from gamers who have gotten offline and helping them to get back online to play X-BOX. This was very high paced job, and it was also interesting because X-BOX was still fairly new and it was fun helping people get back on to play. A very nice place to work with a good work life balance. The employees here respect each other and are ready to help to enable people to be successful. This was a part time job that I did only weekends. The environment was very welcoming and the staff too were very friendly. The only difficulty I had was that I neither speak nor understand dutch and most visitors will always start with speaking dutch before changing to English If you are looking for a challenge Microsoft is where you want to be. Like any big company your work life balance will depend on what division you at in. Terrible communication especially with management, bad pay, not enough hours, etc. Your role here isn't worth the pay or the stres that this job comes with Bing allowed me to explore different aspects of my creativity and perform several successful experiments based on metrics and analytics to better serve the market I was assigned to. It was fun working for Microsoft, except for certain people working there like an acting manager that basically doesn't know that part of being a manager is also working and helping his people.Salary and benefits are great. Microsoft acquired Great Plains Software for 1.1 billion.   The culture was like family.  Pay was a little weak for the amount of commitment you have to make. I learned the culture and work ethics about this company.The work load is balanced between manager requirement and work progress. People are friendly and taking care of each other. Top heavy in certain organizations. The 'stack ranking' system which incentivized members of the same team to compete with each other was discontinued but the remnants of that still exist within the culture. Very challenging to get associates to 'think outside the box' because incentives tend to be purely tactical and any type of strategic thought and or initiatives are not recognized and supported by the local teams. It is safer to 'go along to get along'. In addition in order to 'survive' it is advantageous to move around to different jobs within the company. This seems to be encouraged. It was great to work at Microsoft. All around great culture and leadership. My only complaint would be the lack of upward mobility in my specific sales channel. Work hours are good, depending on your manager. Every group is different and has different attributes. I am unable to rank this entity as a whole as it is too big to put in a small box. Still need to make progress in customer centricity. Some of the best products are open source now with Visual Studio Code, Typescript. The Azure push is a genius move but relying on the existing Enterprise business. Working for the Microsoft Accelerator Group, exposed me to the Microsoft way and I must admit that it was the way to go. Although my location was independent of the main office the culture extended far beyond the Seattle headquarter walls. The level of autonomy I was allotted allowed me properly balance my home and work life. My quality of life greatly improved as I managed to successfully provide administrative support to 5 busy executives in SF, Canada, Israel, Japan, and Saudi Arabia. Working with customers to resolve their issue is the main part of the day.  We take cases and work on them and ensure that the customer walk away with a good experience and a fast resolution. Great place to work.  Amazing company, great leadership.  The culture is very supportive, fun team environment.  Great place to learn and grow from.  Great bennies too  :) Microsoft has a fun and friendly culture you'll really enjoy.  As a Product Advisor I enjoyed a family-like environment. You'll find yourself well-prepared, after training, to handle the quick-paced atmosphere. Growth mindset is mantra.  But for the audit practice growth mindset means, learn how we do what we do.  It is a dynamic environment with over 100 audits completed every year.  Fieldwork is limited to 3 weeks.  Although plagued by scoping issues, the group provides great opportunities to learn about the company, which is a solid house. Learned a lot at this job and looking forward to seeing how the place grows. It was a good atmosphere with bright people and engaging talks etc. Would recommend. You don't get yearly raises in this company. Managers give good jobs to friends. Managers blame you for their failings and expect you to coach failing techs for them. Excellent easy recognizable company with a tremendous record in software, hardware development, providing excellent services to customers, sponsoring young talents, philanthropy. My experience at Microsoft was none less than amazing.  Great people, great tools, fantastic resources, instant credibility.  Allowed me to grow and achieve new skills and develop higher and higher goals. Microsoft is a great company with very smart people.It has a very good industry strategy. Life-work balance can be challenging.It's a bit too Redmond centric its a great job, good quality of work and people, easy going and pretty much stress free, I would recommend to anyone for a job here. the benefits are outstanding as well Microsoft is an exceptional place to work, with crystal clear vision, driving the pursuit of excellence and the resources to change the world. The trajectory of the stock reflects the high trust the markets have in the executive team, but it doesn't stop there. Every group across the global company demonstrates a high commitment to excellence, customer value, and a passion for building a better future. What I like:- Pretty good challenges to keep you engaged- Also great collaboration and bright people around you- Good benefits and above average pay- Lot of variety across products, you can try and move within the company seeking different challenges or products.What could be hard:- Somewhat hectic work , 8 hrs per day is minimum to be average or close to above average performance. You need to put a lot more hours to be exceptional (because that's what other exceptional performers do)- Moving within the company could also prove challenging some times especially with all the review history Overall good place to work. Culture is both collaborative and competitive. Great benefits. Management hierarchy is layered which can lead to heavy bureaucracy. Interaction with other members of the team was hard to accomplish. This was in a small, noisy workspace where it was hard to get work done. I didn't enjoy contract work. Good place.  Too much promotion from within and too quickly for the young managers to gain the proper leadership and management skills.  As such, there was some aspect of a good old boys club.  Besides that, the customer experience focus for products, the cool technology and the smart people and great campus make a great work experience. Many great managersMany inspiring leadersSlowly addressing long-standing organizational issues from the top downOften called upon to make the impossible happenSalary not keeping up with increasing cost of living in Seattle areaMost beautiful place in the country to live - this makes up for many of the shortcomings of the company. Microsoft is a great place to work. I have had a great opportunity to meet great minds and learn a lot. Would definitely recommend to everybody. Thanks It was a competitive or even cut-throat place when I was there. I hear it's changed since then.Agile development process -- so there was a lot of what felt like piecework rather than an integrated test automation approach.It's both competitive and helpful -- rather than hands off.Coworkers try to help you fit in socially -- which is useful if you have relocated.Management seemed to have lazy and hard-working people at the same time -- may have changed since.The hardest part was dealing with the piecework aspect the agile pushes on you. Coming from a waterfall model (operating systems), you have to be very organized under agile and have a lot of different pieces of relevant knowledge in working memory at one time.Also, when you dump a manager, and then get put under him again -- it's strange. This does happen -- and in theory it should all be objective -- but who knows?Also, it was very hard to transfer across divisions. So a perceived foot in the Microsoft door into a division that was hiring a lot, but that you did not really want, may leave you stuck there. Or worse.The salary and benefits were great. Good pay and enjoyed working with a great team of vendors that took a real ownership in their work and were allowed to work very autonomously by the FTE management.  Unfortunately the experience was marred by constant organizational and management churn, eventually leading to outsourcing of my teams role in favor of cheaper overseas or local H1-B labor. I enjoy being on the cutting edge of technology and working at Skype was the cutting edge.  Working at Skype was a dream come true and I have learned a lot  from that experience. Since microsoft is such a large company, there are tons of talented people to learn from as a recent grad. There's a wealth of resources to tap into so you can continue to learn even after you graduate. Pay and compensation in general is top notch! Basically, your manager decides on your rewards based on their review.  So if you have a good manager then all is great.  One of the best things is that you can 'interview internally' for jobs and there are LOTS of interesting jobs. Demanding and challenging, but a fun place to work. The people you work with are extremely talented. Worked there for 18 years before feeling like I needed to take some risks and see what else was out there. Not a lot of room for advancement unless you're in the inner circle, which happens to be all male.  A lot of bad decisions get implemented because of the buddy system. I started my day with emails. The workers often forgot badges so I would make new ones for them. Another part of the job is scheduling meeting rooms. A tough part of the job is when multiple parties need similar rooms. The food on campus is great. Take time during your lunch or after work to explore the campus, it's beautiful. Learned a lot at this job and looking forward to seeing how the place grows. It was a good atmosphere with bright people and engaging talks etc. Would recommend. Microsoft is a unique company. In some ways, with 140,000 employees - one would expect bureaucracy and layers of management overhead.  They have managed to stay very nimble and agile in their culture, idea reviews and overall environment. The people make the company.  It's amazing to be surrounded by some of the best, brightest, most passionate and most enabled people that I have come across in my 20+ years. Great place to work. Being surrounded by top people in your career challenges you to stay on top of your game day in and day out. Anyone who strives to be on the cutting edge should go here. Learning Microsoft Exchange skills was challenging but rewarding. The more i learned made me realize how much more this product can do for a company and employees. Microsoft is an amazing company to work for.  I learned more in 2 years than I had in 10 years at previous companies.  It's a very competitive environment and they only hire people who can keep up with a very fast pace. This was an amazing position, unfortunately I ran up against Microsoft 18 month rule for Vendor personnel. I enjoyed all facets of this position and the team I worked with was incredible. You kew what was expected with managment. Work was hard but everone got along time to enjoy your breaks. a very professtional place to work. breaks were standard Culture is fluid and there are opportunities for growth. Unusually heavy emphasis on personal network and personal promotion. Excellent opportunity for diverse relationships. Management was very good. The work culture was awesome. They had a very collaborative and friendly environment, where more than competition, there was teamwork. It was an awesome experience working for this brand.I had a great District Manager, flexible schedule and I had a route that was convenient for me. They also had a lot of perks for their employees! Worked as a student for Senior Design. Did not work directly with Microsoft but for a consulting company, Avanade, that worked with Microsoft. That being said, I did enjoy my meetings with my team members and Sponsor meeting where my team and I would meet with representatives from Avanade to discuss progress. I do not wish to fill this in. I would like to move on and the system will not allow this without having something written in this space. So, here it is. Managed expectations and provided master project planning to ensure all agreed-on deliverables are met cost effectively and according to project timeline commitment Lots of learning opportunities for people who are so inclined.  Growth opportunities can be extremely competitive.   World-class resources for some teams. Working on some famous games at Microsoft was fun and rewarding.  The teams were cohesive and hired the best artists and programmers.  I'd do it again in a heartbeat. Analog studio has a lot of great ideas, but has trouble committing to one powerful idea and following it though to fruition.  There are people there who are talented at what they do, but they're not actually working in that position; they're doing another job; one which they're not so good at.  They are then shuffled around to other groups.  Then there are the slackers who are shuffled around and not fired.  It's disheartening. Great compensationFlexibleFamily work life balance awareoutstanding trainingCustomer focusedGreat benefitsGreat ManagementChallengingValue driven My interiew did not included the fact that I was expected to work the retail floor and make sales,  I had a immature manager who was more focus on having her butt kissed than performance.  For me it was not a job recommended for a mature person. Not as fun as I initially thought it would be, but it was nice to get to know some co-workers during the experience. Testing the Xbox One before it was released was very exciting, even if I ended up testing a game I didn't care much for. Most of my job involved searching for tedious flaws and other things that would make the game difficult to play, and even if it gets tiring or monotonous, I still enjoy it over other work activities in my lifetime. Unfortunately, everyone contracted here tends to have an 'every man for himself' mentality, so even after the games we tested were released, most, if not, all co-workers failed to keep in touch with me, which is disappointing, because I like making friends in the workplace. No internal advancement opportunities, lack of management assistance, poor financial and health benefits, not transparent about financial growth, held to compliance with vendor clients with little support. great people collaborative, pay could get you by if you are a younger person. Not a lifelong job but it will pay some bills. It was fast paced but fun and you dont have cutthroat managers. Learned a lot at this job and looking forward to seeing how the place grows. It was a good atmosphere with bright people and engaging talks etc. Would recommend. Retail is difficult. At my former location the management staff was not willing to work with you on changing your schedule. The team fell apart and they brought on too many negative managers. The employees complained a lot about the work but did nothing to improve their circumstances. Theres room for advancement if you know where to look. The benefits were amazing. Microsoft is a strong well-developed tech company. As a long time company it is impressive how much the culture has been changing over the years. Overall, you can do interesting work, have a lot of responsibility and a good work life balance. However, work opportunities for my role are few and far between even as long time employees. Probably shouldn't rely on my review. I did not have a positive experience working int the Advertising and Online division.  Tools sucked, onboarding and training sucked and the whole division was a loser for MSFT. This company offers a warm work culture and has a very smart work force. I would recommend this company based on the fact that they offer a lot of continuous training. Not my favorite company to work for. In four plus years of working there we lost two contracts and my last job was outsourced overseas. I then took advantage of the chance to go back to college to get a degree. Typically, work will begin at 6:00 am, and run until midnight, mostly in meetings with world-wide partners. All Engineering work is done in India, and Project Management being done in Redmond, so the disconnect is pretty wide. The best place to work. I learned many things and will take it forward everywhere I work. The work place is quiet and uplifting. The job was very easy. I did extensive calendar work for the Sr. Director and  3 additional direct reports; procurement of office supplies and equipment; travel logistics; tracking budget to a limited extent; assisting with relationships with college students that visit at Microsoft and do school projects. The team is very dedicated to building relationships between Microsoft and the universities nationwide.  They have been extremely successful in the year and a half this department was assimilated by the president.  Making the universities aware of potential assets of working closely with different departments in Microsoft for the classes they teach.  Example: use of virtual reality headsets in real world scenarios; the awareness of accessibility in school and workplaces; and cybersecurity.This has been very rewarding in the aspect of learning more of cultural differences and how perspectives can and are changed. You will be working with a lot of very smart and talented developers, but remember they are VERY detail oriented - small mistakes count for a lot!  Be detail oriented. Was packed with very determined and reliable people who worked very well together in an atmosphere of cooperation.  Management of the group at a high level provided very little stability and a constant sense of worry. Each day can bring a new adventure and it is all about attitude and collaboration to get it done. Microsoft really values the growth mindset and encourages each employee to own what they do and complete it with the best interest of the customer in mind. Great company to work for in terms of benefits and work/life balance. On the retail side, advancement into corporate is very difficult, and the atmosphere is chaotic - makes job duties more difficult. Cutting edge technologies, constant innovation, high pressure environment. Opportunity to learn from the best across the world. Need to be on your toes all the time. Microsoft retail stores are great places to work, the staff's are very friendly, and it is a team environment through each market...I would recommend this company to anyone who has the ability to work everyday, different shifts, but the rewards are numerous! Contracting is both positive and complicated. You will have a difficult time transitioning between a contracting role into a full time role with all the red tape required to surpass. Challenging work environment.Very good learning opportunities.Work on latest technology stack before releasing into market.Encourage new ideas to implement, and explore. Projects fast paced and productive with ample guidance from management level. Team members communicate well and work effectively together using all tools available. There is T-Mobile, AT&T and a cleaners for FTE employees, with plenty of places to eat on and off campus. It was easy to commute from North Lake Union area to the campus via bus or car. Leaders were only incentivized to create their own kingdoms (the larger the staff; the more likely they will keep their job).  There is a certain 'Microsoft Speak' you have to learn to move into senior and executive management... agree with everything your boss says...or you are gone! It was a laid back team. Not much learning due to the nature of the work and my role.There was good team spirit and good support from the management. Learned a lot at this job and looking forward to seeing how the place grows. It was a good atmosphere with bright people and engaging talks etc. Would recommend. Microsoft is a dream place to work as an engineer. The downside is that the Information Security departments are managed by non-technical project managers, whos primary goal is 'status projects'. I saw some amazing people leave because they did not prioritize a project that got their manager in front of an executive, and instead focused on improving the security of the corporation. The benefits, work/life balance, and people (outside of management) were amazing. Overall good place to work. Management people are goodWork culture is very organizedGetting access and badge process is too long My Team was good all are help each other.Nice Lab environmentFree snacks and drinks Microsoft is a great place to work especially if you have just left college.  Although admins are treated well they are not given the same compensation as other employees and there is not a lot of opportunity to advance past an admin role.  I would recommend it as a great place to work though . Great place to learn and work with new things, but advancement is/ can be difficult.  Expected to be able to know what has to happen, and idea's are not always followed. market driver and innovative company providing challenges similar to all very large corporations but also the benefit of extremely large resources. brand power is significant The title says it all.  I'm slightly biased, as ever since I was a little kid all I ever wanted to do when I 'grew up' was work for Microsoft.  Having done it, it was everything I dreamed it would be.  Fun, innovative, passionate, and aspiring company.  The best! Microsoft is a good company to work for, Get to travel if you are open for it, great place to start if you are looking to get into technology and learning about computers, hardware and software. Great culture and fun company to work for. learned a lot in regards to coaching and developing a team.  Management was awesome to work with.  Cant say enough about the benefits, this company surpassed other companies I had previously work for. Workplace was friendly. At all locations that I worked throughout NJ and FL, everyone was inviting. Competition to move up the ladder was difficult and at all locations management had favorites that would rank up the ladder within three months. After working at Microsoft for three years, I wanted to advance to corporate as an Evangelist, and had the opportunity to interview at the flagship store prior to opening. Nonetheless, benefits were fair. I had a very successful and rewarding 18 year career at Microsoft.  I left the company because I was transferred back to Seattle and I choose to remain in sunny Las Vegas.  I highly recommend working at Microsoft. Microsoft can be great. It can be awful. If you are passive it will chew you up. If you seize the day it can be very rewarding till you reach a certain level. There like most companies politics play a large part of advancement. It's a work hard environment and you will be rewarded with interesting work and smart colleagues.  It's a very exciting time at Microsoft and leadership has a great plan. Working with fantastic peer developers, which was the most important part of my technical experience, Outlook for Android was delivered well before Windows Mobile, it was not released until two years after we finished it, bittersweet A typical work day begins with a stand-up meeting in the morning. After that engineers begin their day, coding their feature.Microsoft is a great place to work at. Only the work-life balance is not so good. An typical day at work would start at 7 am with prepping lunch and next day breakfast. The things I learned during my employment with Microsoft was increasing my knife cutting skills and making different recipes The hardest part of the job was making enough food for the day Microsoft store was a great job for me.  I was in college and just looking for something that was not stressful and fun.   Also had great benefits and discount. Worked onsite at Microsoft's Bellevue office selling Dynamics CRM online and Microsoft Azure. I assisted Microsoft Account Managers in demand generation with Dynamics and beginning to end sales for Azure. Very Productive and workPlace culture, Its in organized manner with most updated new technologies.I have learned a lot from this project and most enjoyable part of the job. A typical day will always be a surprise. That was fun at first but after a while, you get tired of the inconsistency. I have learned a lot about Microsoft. Its a great company however, if you are working at this location , Arlington, VA you are going to be miserable. The management is definitely unqualified. They babysit instead of manage. The culture is really relaxed, and that's the problem you can really doing anything you want and sometimes there is some unfairness to the rules and that is shown ASAP. The hardest part of this job is conducting Virtual Reality demos for customers. The best part is when they actually get food its great! You will probably gain 15-20 pounds because they ate always feeding you. But you will lose it all in a month or so because if you care about doing you job correctly, you will get stressed out and lose pounds. People are smart and down to earth. Work hard and play hard. I had my best 3 years there. Most managers are motivating, has a good understanding of what I do and gives good support. Learned a lot at this job and looking forward to seeing how the place grows. It was a good atmosphere with bright people and engaging talks etc. Would recommend. My job was only scheduled to be 10 hours per week.  However, they still expected me to work 40 hrs per week.  That wasn't possible as a single parent. Every day is different on a retail level. The culture is admirable. Something new is learned on a daily basis. Management varies at each store, but overall, is solid. The hardest part of the job is work-life balance. It's retail, so the stores are usually open 362 days out of the year. Benefits are incredible. Perhaps specific to some teams in the company as I've heard that there are other teams who enjoy working in their space. For those that I work in, the people managers were terrible. Can you imagine having 1:1s with your manager who has his back turned to you and doing email? I was able to use my skills and experiences at Microsoft.Working there was very fulfilling.Typical work days were always full of unexpected challenges and opportunities.The culture at Microsoft is one of collaboration and commitment.The most enjoyable part of the job was that I was able to use all my skills everyday.Each day was unique. Time management was the best weapon against stress and the key to maintaining a healthy Work/Life Balance. I was pushed hard to meet deadlines and have candidates have clear direction on upcoming interviews. I landed at Microsoft as a result of an acquisition. Started on a transitional contract with all benefits of a full time employee. I left when my contract expired, though I was offered a position in the company at the end of my contract. The only reason not to accept is that I had already accepted another one. Worked here off and on as a vendor performing network and cloud security roles.  Management was decent, and the involvement with the day-to-day was pretty thorough.  It would make more sense for the company to hire more FTEs for all the cloud security positions, seeing that there is much proprietary information being shared (as a requirement of the role). Strong teamwork environment. Local management was stifling. I was hired to consult with clients and help them adopt company products.However, the focus was changed to helping client actually install and maintain the products. The change of focus wasn't in alignment with my vision and therefore I left my position. Microsoft is a strong well-developed tech company. As a long time company it is impressive how much the culture has been changing over the years. Overall, you can do interesting work, have a lot of responsibility and a good work life balance. However, managerial opportunities are few and far between even as long time employees Challenging place to work. very dynamic work environment. Its fun place to work when you can deliver on time else very stressful to meet the project deadlines. Great company, stayed there for twenty years.  Solid, reliable, and cares about its employees.  Microsoft is really dozens of smaller companies under the larger umbrella, cross group work can be rewarding and challenging. It was a great place and environment to work at. They were very flexible. While working let you enjoy as well, makes you want to work for them for a long term If you like being stabbed in the back by your colleagues, out of control managers and cut throat annual reviews then this is the place for you. Benefits are good and the campus is nice. when I first started this job a loved it the employees where great, the overtime was always there. the bad part about the jobs is that its always understaffed so u will be work 12 hours days frequently and 16 hour day right after doing a 12 hour day Our team was tasked with maintaining 10-12 SCOM instances for several mission-critical teams doing cutting-edge development.For the most part, our work with FTE's was seamless and we were able to produce results that generally pleased everyone.OSG has since changed its name to Windows Device Group.With 12,000 systems being monitored there was always a risk of missing something but everyone on all sides worked well to avoid those issues. stressful, cutthroat environment,  Not team oriented and did collaborate honestly, no trust, teams didn't support teams,  poor leadership at the team level.  execs appointed team leaders and did get involved this was a good place to work, friendly team and very collaborative. I worked on a Mac which was a plus. I had great feedback from my team and management. Microsoft was one of the best work experiences I've had in a long time. Very relaxed and casual. If you need a structured work environment you may struggle a bit. I was only a student at the Microsoft software and systems academy.  Program is designed for military transitioning into civilian life trying to build a career in information technology.  Would  recommend this program to anyone thinking about leaving the military. I have written previously about Microsoft jobs so I don't want to repeat myself here. The nice things were the landscaping and cafeterias, the exposure to other people who knew more than I did about everything, but there was not much chance for advancement and no training. I basically enjoyed every day, but I wish I could have found a job that lead to more advanced skill use. Learned a lot at this job and looking forward to seeing how the place grows. It was a good atmosphere with bright people and engaging talks etc. Would recommend. Contractors are not made to feel part of the team and are micro managed. Alcohol/ beer encouraged in meetings and non drinkers are looked down upon- Great customers and very nice campus. I was shocked at the infighting, selfishness, and indifference to cultivating great teams or collaborative results. The organizational accountabilities and management were focused solely on their own narrow deliverables, not the broader corporate or customer goals or outcomes. My manager for the last two years was singularly focused on his personal advancement, regularly disparaging other teams and people. A truly toxic culture. Great team, great experience. Bad team, bad experience. Just like any job. It's a large company so you are required to be a specialist, not a generalist. No need to say much I think. Overall, Microsoft is a nice place to work and by working there, it can realize your potential and have great impact to the technology that people and company are using everyday. I enjoy working at Microsoft. I feel like it is a place where you can grow and gain so many new skill for career development.  It is a fast paced stressful environment but the benefits really outweigh what you have to put into it. A fun place to work especially if you love XBox. Customer obsession is a must, so be prepared to dazzle them upon engagement. Greeting is number one, and a smile is a great thing. I'm still not convinced that the 18/6 months on/off contracts are the way to go.  Much prefer the managed projects contracts, for obvious reasons.  And I get more work done working remotely, as I have proven in my past two contracts at MSFT.  It's not for everyone, but it seems to work well for me. 10+ years of fun, lots of changes, awesome people all around. The hardest part was to have to leave as I was a contractor and there is a 18 months maximum rule. Be mindful that this is a large corporation and no one cares about you. If someone can pitch your idea as theirs, they will. If someone has not put you as their top priority then forget about getting their attention. There is a severe lack of empathy. Great company, great leadership.  Fantastic strategic direction for such a large company.  Most employees buy in to the overall direction, and the teamwork and collaboration is excellent. Microsoft is a company that wants to create an environment that allows employees to do their best work. The want employees to find deep meaning in their work. Contract position, contacted MSN advertisers about past due invoices. Email was the primary contact method, placed phone calls as well. High volume of open invoices, primary task was to resolve billing issues and customer satisfaction issues. It was satisfying to resolve customer issues, bring DSO down and shrink the uncollectibles number. Our department did not have contact with the rest of Microsoft, or of Microsoft's Finance department. I met with professors and students in the STEM departments and talked to them about campaigns Microsoft was running. I planned certain events throughout the entire campus giving away various items for chatting with me. Atos works  as a contractor for Microsoft that treats the contract company somewhat badly. Microsoft likes to lead by fear and intimidation at least that's how the Data center Microsoft management was to the employees of our company. . During my time as a contractor, I gained a valuable set of new skills. Although I do not come from a tech/IT background, I learned a lot, and felt that I brought a strong skill-set to the table. Coming from a very fast-paced & competitive background, I enjoyed the more laid-back environment at Microsoft. Every so often, I was able to use my foreign language skills, which I enjoyed. My experience was initially one of privileged to work for such a large well known company. Over the years I came to understand how competitive my position was and that started to wear on me a bit. It did not seem ok to just want to excel at your current position. I felt you had to want to move up or out. Many opportunities to work on different products; career advancement is not that easy...overall a great company foe so many reasons, I has the opportunity to make a difference and build several products from scratch, a true life-changing experience. Working at Microsoft means you are working with the best. Everyday you go into work ready to improve the lives of millions of people, so the pressure can be intense. You will sit in meetings or one-on-ones with people with some of the highest aptitude in their field. This is intimidating at first, especially when they turn up the intensity; however if you are confident in your skills and knowledge and willing to work together with them, they will recognize you equal and help you succeed. Having worked at Microsoft for quite some time I've seen many reorgs and attempts at cultural change, most of which IMHO have been to a large extent unsuccessful due to bad management, those who have retired on the job etc. However since Satya has taken over there is a palpable renewed energy at Microsoft over the past couple of years and the culture is definitely shifting visibly in the right direction at all levels of the company and I'm more optimistic in the senior leadership than I have been in years. i had a contract job so it was a little different. as a contractor you always felt like a second class citizen. the full timers were cliquey. and in UR there was verrry slight chance for any contractors to convert to full time Learned a lot at this job and looking forward to seeing how the place grows. It was a good atmosphere with bright people and engaging talks etc. Would recommend. After many years of losing market share and struggling to be at the front end of innovation and the fact that there's 90,000 employees, don't think MSFT is necessarily going to be attractive on your resume to more agile and smaller companies. best part of the culture is the attitude of going after the defined strategy aggressively  with budget and resources.  great facilities and benefits with reasonable job security During the early 2000s, I consulted for Microsoft as they rolled out their Envisioning Labs globally.  It was a great experience.  There are now many centers throughout the world. If you are in a good team, your experience will be great. If you are in a bad team, it will be bad big time. The bad teams are where management makes very frequent changes in its mission, or structure and causes team reorgs that affect the morale of the team members. Always found challenge and new opportunities each day. Team communication is excellent. Supporting staffs are very nice and cordial. Office is very relaxing and nice. Good temp job online, my assignment was a temp situation. But I did take some direction directly from Microsoft and it was very professional. The work was basically customer service for xbox Although I was only working there to save up money for college and a 2-year service trip I thoroughly enjoyed the people I worked with in the atmosphere that Microsoft had. Although it was stressful and hard work at times it was always a fun atmosphere. Good work environment, good work life balance, ability to work from home. Fast paced but reasonable, welcoming culture. Innovative and learned a lot, strengthened communication skills. All-in-all, Microsoft is an amazing company to work for. The store I worked at was a new store, so volume was pretty unsteady. Once the new store hype was over, the typical day was pretty slow. Luckily, there is more than enough to keep you busy with learning new information and sometimes, even playing video games with customers. Management is wonderful. Communication is completely open, and everyone I met within the company treats each other like family. I learned more than I can tell you in a paragraph working here. The culture is just open. If you're a quiet person, you won't be after working here for a little while. The hardest part of the job was trying to stay busy all the time, and achieving sales goals in a low volume store. The most enjoyable part of the job was literally everything else. If you have the opportunity to work here, DO IT. You get to learn a lot of new technologies if you are assigned good projects. People are generally helpful. Great work will be rewarded. Fun environment. I enjoyed working there, the management was great, but the location was in Fargo, ND, too cold for me.But the rest was great, good co-worker, great benefit. it was a temp job, I was their to restore information the computer system dumped and as a good will gesture to help the business owner it was an interesting job Work culture is really good, no micro management . working with professionals is a great learning experience. taking a break and play ping pong or some other indoor activity is a great refreshment at Microsoft. It was great working on Microsoft. I would like to work for Microsoft again in the future, Company is growing with lot of innovative products and having very smart people working in the company gives everyone lot of potential to grow as well as explore and fulfill dreams. This is probably true in any large corporate environment, but it was definitely my experience with Microsoft that my satisfaction with the job correlated directly with who my manager was.  After several years of contented service, my experience was tainted by ending up with a manager that didn't want me and leveraged Microsoft's forced attrition policies to ultimately displace me.  You will be a better fit than I was if you enjoy playing the career game and focusing on your reviews more than anything else. Let me begin by explaining that our team was in a contract with Microsoft, therefore we were not engineers and this sort of thing is typical in the tech industry. Our normal day-to-day was in social media support. We were expected to reach 60+ tweets or Facebook posts a day to help customers with their Windows OS experience as well as finding solutions to their problems after they had installed the new Windows operating system. We were given an email every day if something had changed and we were no longer allowed to engage certain customers, or how we were supposed to respond if a situation was updated. For example, if they were aware of a particular issue, we had a set template to use to respond to worried customers. However, communication was absolutely horrible. Often, I and the other team leads would constantly be under fire for our team 'engaging' certain customers when we weren't supposed to. That was never communicated to our staff. Training was up to us as leads and they only briefing we were given is how to coach over grammatical errors and customer service. Yet we were supposed to be technical support before passing it off to Tier 2 support if we could not help. This is where it fell apart. Upper management couldn't be bothered but was quick to place blame when our team didn't meet their standards. Our jobs were constantly threatened. It was a toxic work environment to say the least. I made it my duty to dedicate myself to training our teams on basic computer knowledge, and how the OS works. The advice that we were taught to repeat, I discovered, wasn't something  anyone on our team understood. So I worked from the ground up making podcasts, once a week presentations, and daily tests to get my team on track. In the end, we all lost our jobs to a team in Manilla because of funding for tech support. But as I said, this is a typical thing in the tech field. Great place to work and gain invaluable experience. There is a place for everyone if you are willing to find it. Take advantage of the internal programs and services and the many opportunities to meet a wide variety of people. The work environment was always different, always moving, but the manager wasn't as polite, or caring, or understanding when it came to employees and the parking was HORRIBLE! Good management and teamlot of learning involved in the work.Good amount of time given for self study and self learning.Lot of new technologies to be experimented. A typical work day was getting in at 7:30AM and leaving at 5PM. I learned a lot about the engineering and design process for the Surface products. I learned how important device lab tours are to the groups whom were fortunate to get to tour the Surface Lab Areas. Hardest part of the job is getting devices to executives quickly and accurately. I enjoyed the fast paced environment. Learned a lot at this job and looking forward to seeing how the place grows. It was a good atmosphere with bright people and engaging talks etc. Would recommend. I joined this team to work as a Test Engineer on the new Microsoft Edge web browser.  From there I expanded into testing with the HoloLens and Mixed Reality Portal.  I really loved working with new technologies and watching them mature into a solid product. Work does NOT go unappreciated.Complimentary breakfast and coffee.WONDERFUL team.Solid schedule, easy to maintain work/life balance.Great pay.Remote options. I enjoyed my time at Microsoft.  I would recommend working there if you can get in.  Great people to work with very different in approach and thought.  This is a place you have to experience. It was a fast paced project and we were working on VSO, so we were planing ahead on what we are going to do, it was a sweet challenge of keeping the pace and meeting the deadlines. Great place to learn, to be challenged every day. Never stop working on new topics. Highly professional team mates. Good place to know different countries and cultures. Most of the roles on the Microsoft account at Randstad Sourceright allow for full time work from home after 6 months in office in Renton, WA.  The work life balance however is not ideal.  They have a no overtime policy but all the roles require you to work over to complete the base job.  I've seen high turnover for this alone.  Most of my coworkers have admitted to working for free. My work was never dull.  There were very high expectations on performance, so I worked hard to keep myself in good standing.  I was doing contract work, so the drawback of that arrangement is that you can never count on any contract will last its promised duration.  Conditions can change and your services may no longer be needed.  It's important to have a good relationship with your manager. You are there to enable  him/her to focus on and look good.  Culture is good,  as long as you are honest,  Forthcoming when you may have made a mistake,  and instill confidence that whatever problem comes up, you will own it!  There are extremely smart people at Microsoft, so UTILIZE it.  Be willing to admit ignorance and be open to learning every day!  Best part of the job is encountering a problem and then Finding a solution and resolving it.. there is no better feeling!  Also I must say that one VERY nice feature about Microsoft is that it has a very efficient and strongly stable infrastructure.  There a policies and 'best practices'  that encourage this... and unlike some other organizations I have worked at,  the IT environment, as a rule is not a chaotic mess.  This In my opinion is among the best features about working there. I was a student for the Microsoft Software and Systems Academy, we learned skills from scripting SQL queries to developing applications using MVC in the cloud with Azure. I worked for Microsoft as a software tester (contractor) for 4 years. I've been enjoying everyday life while working there. At the end my job has been outsourced. Collaborating with teams like OPS, CSS, Field-IT, and Engineering to discuss and analyze various upstream, downstream systems, functional requirements. As a contractor, I had the opportunity to use a wide variety of tools and applications. Also, because of the nature of the job, contractors don't get trained as they are not going to be on the role for too long. This situation made me push myself and expand my comfort zone. I was able to turn around a be productive in a very short time. It prepares you for challenging roles. Reinventing your career at MSFT is a huge benefit - lots of opportunities to advance and work your way up the chain in different groups and orgs.  Dynamic, fun culture - if you produce, a really fun place to work. There is a lot of room to grow. You need to keep moving and not stay in your comfort zone. Many teams could use your skills. The culture sometimes could be conservative. Employee culture is fantastic, amazing company that really values the growth of the employee. Microsoft is extremely innovative and forward thinkers in all spaces not just software. I was a contractor at Microsoft and besides the heavy leaving you out to dry 6 months on cool-down. I think its a great company to work for with a thriving environment and great secure facilities and very professional employees. Perhaps my most enjoyable, productive, and transformational contract engagement ever. Working in a managed service helped avoid the dreaded 180-day furlough. It's the only way to go if you want to work as a contractor at Microsoft. The service delivery manager is an excellent supervisor and team leader. Managed fast-paced project across multiple departments.  Drove team to accomplish all required tasks leading to a successful program and satisfied customer.  Excellent communicator, coach, and team player makes navigating a complex work environment look easy. It was a great team to work with. The team members are very open to feedback. Any new idea is always heard to .Very encouraging to think out of the box. Your MSFT experience depends on the group you work with. Mine was dysfunctional, under staffed, and lacked management/direction. Staying there would have slowed my career down due to the lack of value it was adding so I left. There are multiple options and so much to do. It depends on your potential. The culture is very open. The working hours depend on the manager, but they can be adjusted. Vacations, they give me 5 weeks and if I need more I just ask for more. That is an awesome place to work. Learned a lot at this job and looking forward to seeing how the place grows. It was a good atmosphere with bright people and engaging talks etc. Would recommend. CompuCom has been a good contracting company to work for, during the last couple decades. They have been good at finding a good fit for positions and connecting with management and contractor. The culture at Microsoft is second-best. These people are bright and hard working but they settle for less than stellar and that is why Microsoft software no longer shines, or leads. Loved the people and the environment was a pleasure to work at.  The work to life balance there changes with the wind, but if you know what to expect, there is no real surprises. Playing catch up with peers and starting to show some innovation. Azure is a pain to manage and run. O365 is still the cash cow. Companies within a company. Hard work and quick pace expected. Smart people undergoing a big corporate change with new CEO. Up to big things globally still a great opportunity to work for this company. Volt is a terrible company. They lie to you about pay and benefits. They ignore you until its time to renew your contract. They are utterly despicable and you should avoid them like the plague. Working with a team of motivated individuals is the absolute best because of how much work the team will be able to get done in a matter of hours. The pay was the best part about it. Microsoft allowed me the flexibility to learn many new things. SQL, automation, C# programming, database management, setup of machines, setup of builds to be tested. I felt the culture was a little cut throat, I observed lots of finger pointing. But this was on a team by team basis. Many teams were very good to work on. Hardest part of the job were the long hours, sometimes 80 hours a week.I loved seeing my idea become part of the products were were working on, seeing my ideas influence and change the course of development. Starts off fun, caring company but those in charge change that very quickly. The higher you rise, the more of a typical corporate job it becomes. Boring, very political, etc. They respected work/life balance because I was a contractor. My project seemed in chaos because they were working towards overly optimistic goals. Management at the upper levels seemed unconnected to what was happening on the ground. Overall great company to work for, management style varies depending on the team, but usually very competitive. Growth opportunities vary as well, one has to look constantly for next step. Microsoft is a great company to work for. The benefits and pay exceeded my expectations for a part-time employee. It is also a great work environment, all the employees are friendly and are looking to grow with one another. I highly recommend working for a Microsoft store. There are a lot of talented and diverse people working at Microsoft.All projects that I was working on were super interesting, challenging and innovative. Provide proactive, reactive, case management and cloud support to customersHelp customer to maintain Healthy IT infrastructure, High availability and cost reductionPart of what I Learned:Customer managementbusiness value DeliveryTeam work,CollaborationServices SalesManagement:Portfolio management Service and business managementStrategic relationship managementFinancial ManagementCost ManagementThe hardest part of the job:High pressure and deal forecasting that must land at committed timeThe most enjoyable part of the job:Reward for hardworking and profit sharing As a retail representative, you tend to get the customers at both end of the spectrum of love and hate. Customers would come in wanting to learn more about the products, both hardware and software, and others would want to come in complaining about it. It was a good introduction to the company because you are actually doing more than just selling the product. Each store has a community development specialist and business specialist to make sure that Microsoft is helping others as well as expanding their footprint to local businesses. -There's an XBox in all stores that they encourage you to be playing or activate any chance you get. -You will learn more about the IT side of things because everyone will have questions. -You'll be evaluated on sales and returns as well as how you interact with customers.-Free drinks at all times. -Management is sometimes in the back doing something. -If you're lucky, you'll get a learning specialist who will really help you grow and not just bark orders at you. -You are often the only one on the floor because there are not enough staff, but they can't hire.-Lunches were often provided on Saturdays and holidays as employee appreciation.At the end of the day, though, it's still a retail position for most people so you can imagine the hours needed to work. Interesting work.  Really great people to work with in my division.  At first as a contractor, I was interested in joining full-time.  However, over time my manager turned out to be really terrible and turned me off on working there permanently. Good firm. While I was there for consulting 4 years ago, the corp culture in the consulting organization was not really what I am looking for, and spending too much time on the road was not a fun for me who has two young sons at home. Benefits package is excellent, the main campus is beautiful and has some really nice perks. Cafeterias are good, walking trails, even some shopping if you go to the Commons. The work environment depends very much on which group you're in. Some are miserable, some are awesome, and there's a chance for everything in-between.In most groups, people like their co-workers and managers, it's as you go up the org chart that things become all about the shareholders and to heck with employees.Overall, I think that the managers are good and care a great deal about the people who report to them. But beware of the professional climbers - if you can't help their climb, they'll ignore you, or even walk over you. I worked at MSFT for almost 13 years.  One thing about MSFT is that you move roles a lot and change managers even more. Change is part of the culture.  And so are the opportunities.  I was able to move into very fun, challenging roles.  I do not remember a boring day there. Company very much value diversity.  You could be your authentic self at work.  The training received was relevant and thought their management training superior to what I received at other companies Learned a lot at this job and looking forward to seeing how the place grows. It was a good atmosphere with bright people and engaging talks etc. Would recommend. Everything you are going through in life is preparing you for what you have asked for. The hardest parts of the job teach you to see endless opportunities for improvement. At Microsoft, I learned how to recognize them and make a positive impact by fixing inefficiencies and creating business value. At Microsoft, the most important thing is the group you are working for.  A typical day is largely driven by your daily responsibilities and is often driven by your meeting calendar as Microsoft is a heavy meeting and email culture.There are always opportunities to try to step outside of your daily responsibilities and have a greater impact whether it is long term improvements to your job, improving the overall team environment or things that will have a company wide impact. There is a ton of work to do and very poor documentation/training on how to do it. Most of the people are great though. A few bad apples can cause problems and there seems to be a lack of vision on what to do. Microsoft has always had the perception of being arrogant and difficult to work with. This is part of the culture. The new CEO was in the process of introducing a cultural change to Microsoft. I worked at Microsoft for almost a year and it was an eye opening experience. The stress level was high and they often times asked you to work through holidays. Highly competitive type A driven company culture.  Especially as one ascends through the ranks.  Must be very self directed and able to bring your A game to the table at all times Very good company if you are not looking for start-up atmosphere. Since it's out there for so long you know what to expect and not much is changing. Good work-life balance I choose not to provide a review of my experience at Microsoft. I have rated the company accordingly and choose not to provide additional information. I am not going to give information on Microsoft.  I worked there 4.5 years and left.  I would say the fact that I left says something.  I will leave it up to you to figure it out. Great place, made a lot of connections and learned alot. However, some Microsoft employees treated us contractors like 2nd class employees due to Contractor status. Having an 'Orange Badge' is almost like a handicap around certain persons that feel over entitled. I did complete a full workload more consistently than my peers that were fully vested Microsoft Employees. Working with my team and manager to solve high priority customer issues was a typical day at work. I greatly improved my interpersonal skills as I was a liaison between engineering, support, sales engineering and the customers. It was a very constructive, team-oriented environment. Depends on the department. MS Expects a lot of their employees, especially the contract workers. Overall individuals are great - collectively the company needs some work. Enjoyable and Competitive Environment Work culture is wonderful and the team is much collaborative when i was working there, Overall it is a destination. Microsoft is the ideal place for people who have passion for their work and the desire to make an impact—in their careers, in the community and on the world. Microsoft is a unique company; and not just within the tech industry. Here, smart people thrive on their own terms and push their intelligence to its limit. The variety of job opportunities and career advancement at Microsoft is incredible and empowers you to constantly challenge yourself and chart your own course. Overall management was flexible due to commute windows and additional time due to working with international business partners.  Worked with several teams and each team is different along with each manager.  Had the pleasure of working with great team members and managers. Microsoft hires most of the support staff as contractors.  It is not only unfortunate for the support staff, it is unfortunate for the dedicated contractors who have to leave after a specified amount of time with no opportunity for permanency.  Additionally, supporting the Sales team in Irvine is rated one of my top work experiences.  They all were so very professional and smart!  I enjoyed supporting the team immensely. I also learned new technology and state of the art 'Best Business Practices'. Great office.   State of the art everything including meeting organizing -- you can book a conference room right at the door entrance with the touch screen provided. Microsoft employees were dedicated to service and product knowledge.  My experience was such that I recognized the advanced level of expertise in employees and that my previous experience and knowledge were more Apple related that I required additional support.  Staff was great and management was committed to making the culture open and inclusive. I worked on a busy project connected to the private sector.  I supported a team of executives and project managers.  The workplace culture was relaxed but the work was intense. The people at work are great, easy going and hard working individuals. Unfortunately, the company is adapting to a changing industry by displacing employees and not offering much of an opportunity for advancement.They clean house, regularly. Learned a lot at this job and looking forward to seeing how the place grows. It was a good atmosphere with bright people and engaging talks etc. Would recommend. Microsoft has been one of the better companies I’ve ever worked for. The hours where good and pay was great also being part of the Xbox team was pretty fun, but there is always a problem within every company and Microsoft’s was the work environment. Let me explain, your co-workers are great people who will toss you under the buss or stab you in the back if it means advancing or avoiding trouble and the managers all seem to have their favorite person. If you can stand a cutthroat corporate environment then you should have no trouble at Microsoft. Microsoft is a good company.  The people are the best.  the products are good, but management needs to understand, people are not computers.  you can't micromanage people like computer programs, tweeking them, and discarding them as defective parts. I work in a lab, not very comfortable, the tools are adequate, going thru multiple security doors to take a break is a bit much. I have no visibility as to workload, it just shows up. It is hard to meet any friends or social events. FTE's and temps are treated very differently and have very different roles. I am working for Microsoft as vendor and this is a good company to learn the new technologies and advance your career in the company and good management. Generally good place to work with smart people and master new technologies. The multiple divisions within the company offer chances to increase exposure to different products and engineering expertise.  Competitive wages, but perks fall short compared to other tech companies.Very heavy politics with ongoing reorganizations to align with the latest fiefdom jockeying.  Work/life balance can be very lacking, particularly if you want to beat your peers to a good review and bonus.Company culture changed.  In the past an individual engineer had a much bigger voice in making products great.  While not completely absent, company culture now leans more toward just doing what one is told to do. Even with all of the changes that they have gone through over the years, Microsoft remains a very attractive workplace with a competitive environment. If you want to be as close to the bleeding edge of technology, this is one of the few places that you will be able to do so at. Fast-paced work environment with great team collaboration and work/life balance. I learned to multi task, to prioritize and re-prioritize as required based on daily business needs. I enjoyed the role I had in the position as well as the team and management. I found them respectful and relaxed as long as the work was done. I learned a lot about the unique culture of Microsoft and a lot about some internal software used to track study data. The hardest thing about the job is that they are often slow to set up access so you can spend a day or more just sitting there and the most enjoyable is, as always the work and the people. I had 3 managers and worked in multiple product development teams, the worst being the ASD team. Managers were the worst I've had compared to other companies I worked before joining Microsoft: they're indifferent and arrogant about their work, they only care to meet budget and resource limits and make a good impression to their VPs. They know little about design and research, nothing about engineering and don't care to collaborate, only to pass down directions from their higher-ups. Incompetent managers are promoted without even knowing how engineers collaborate with design and research. o Work for six years running. The growth, innovation, and Aloha spirit of Salesforce are driven by our incredible employees who thrive on delivering success for our customers while also finding time to give back through our 1/1/1 model, which leverages 1% of our time, equity, and product to improve communities around the world. Salesforce is a team sport, and we play to win. Join us! I enjoyed my work there but budget cuts really slowed things down to a grinding halt. The culture is friendly and encouraging. Great coworkers. Nice atmosphere Commission based I hate that if u can't sale something u don't make anything. The job was good but the sale was tough. I was doing cold calls for the first couple weeks and it was just hard. You may have to move around the company in order to get a promotion.The stack ranking rating system is unfair to good workers.  Depending on which group you are in there can be lots of internal office politics. I worked with MS for almost 8 years.  I really enjoyed it and advanced my skills greatly.  MS gave me the opportunity to see the world and manage large budgets. Organizational changes have caused some disturbances with this group but this should get sorted out soon and once it does the team should be back to optimal performance. great team to work with.  all seem to get along well.   the team is conected by skype and meeting weekly to go over status.   they do require alot of record keeping for a sourcer. The surface team that I was placed on was accepting and very willing to teach.  I never felt that I was out of place.   My manager and team members were all very excited to work with me, and I was able to pick up very quickly.  I would definitely recommend anyone who has the opportunity to pick up work, to do it!! No life work balance to speak of. If you like that type of environment, then Microsoft is for you. Also, you might ship many of the products that you work on at times You will have an opportunity to work on different product - if you want to change a team. Good work-life balance, Job security. A lot of opportunities to grow. Microsoft is a tale of two cities. If you are an FTE (the Client) you are entitled to untold benefits, protection, and authority. If you are a 3rd Party (Supplier) the story is quite different. As the latter, you can expect to be isolated and under informed at best, or held accountable for deliverables without and authority or resourcing to carry them out at worst. Learned a lot at this job and looking forward to seeing how the place grows. It was a good atmosphere with bright people and engaging talks etc. Would recommend. Working for Microsoft was a great learning environment.  I learn a lot about different operating systems. This job was my first introduction to SMS/SCCM. Work/life balance was one of the harder things to attain.  Good collaboration between close teams but when it comes to working across silos (such as support and product groups) there is still a lack of interest in really maintaining that close relationship. Working for Microsoft was hands down the best experience of my life. The culture, the people, the perks. i could go on and on. If o coukd do it all again, i would/will definately work for them again. Great place to work! I enjoyed the structure, the people and company culture. Seeing first hand how collaboration and empathy can positively impact all involved was life changing for me. Some lucky people have secured positions here; positions they are not qualified to hold.  They exhibit a lack of imagination and creativity which unfortunately affects the projects which are pursued and the quality of those efforts. Microsoft speaks for it's self is one of the greatest company to work for .very friendly employee perfect environment. everything is very organized,no problems at all.i highly recommend for anyone willing to work in peacefully.no stress no issue or problem .it is just perfect Bean counters run Microsoft HR and management.  The company has no commitment to dedicated employees who devote their lives to an ideal Microsoft no longer supports nor lives up to anymore. The only drawback to my time at MSFT is that it's coming to a close as my contract comes to an end. From the challenging subject matter to excellent collaboration among coworkers - my team provided a great working environment. While this company didn't pay much, it was great to be around so many people that loved technology.  Always looking to make things better for the next person and finding better ways to accomplish things. Solid management and going in a good direction IMO. Tough that the contractors have to move on every 18 months though.  I would have stayed longer if I could have There are a lot of great people, but there are bureaucratic silos.  So it is very challenging to improve the processes and make a difference.  In general the work day is pretty even keeled, but when things go wrong the environment get manic. Good company with lots of opportunity to move around.  Some really good leaders but poor middle management and the old review process meant lots of good people pushed out for the wrong reasons. The environment is very laid back. you can wear what you want, break when you want, come in late and leave early, work from home whenever; as long as you doing your job.However, being in support at Microsoft means having to collaborate with other teams which can get frustrating at times. There is a lot of red tape to get through. Often times, I will work harder just getting other teams to work with me than actually working on the support case. You wear many hats and if you have kids dont even worry about it. There will be a hassle in trying get work life balance. Lots of issues with management. and HR is a joke. Microsoft is a great place to work.  People are exceptional and collaborate well with each other.  All of the messaging comping down from corporate is exciting. However, it seems to get lost at the field level. Good place to work with good benefits cover. I have learned a lots when I worked 5 years there unfortunately the plan in Wilsonville was closed. Good team work, good people worked there. Had a good experience with this agency largely because of the competency of the recruiter I worked with.  Had a couple of mix-ups with my paycheck due to errors on their end but they were corrected. loved my co-workers they were pretty cool people with all so different backgrounds.  I did not however like the way we were managed.  I felt like I was under a microscope all the time and it froze me up it did not allow me to be my authentic self and for that I had to look elsewhere Production of the recruiter for Microsoft was great.Did not want to leave.Comettative.No time off to care for sick mother.Had to leave.Would like to be re.hired. Travel and location requirements did not coincide with my family requirements. Otherwise an amazing company to work for. Company has a lot of great people. Learned a lot at this job and looking forward to seeing how the place grows. It was a good atmosphere with bright people and engaging talks etc. Would recommend. Its good retail, still need a basic understanding of computers but that is taught to you during training. Everything else is common sense and just asking questions versus assuming. Best job ever. Great team and collaboration . I enjoyed working with others and the overall collaboration between all of the departments . Management is sincere and resourceful without micro management Amazing culture, cool technology, great people!  Fun, fast paced environment, working with people who are passionate and driven.  Expect to work long hours. Probably the most valuable thing about working at Microsoft is exposure to some of the smartest and most highly qualified people I've ever encountered. In general they were incredibly generous with their time, mentorship and teaching. Flexibility in working on campus and from home helped tremendously in having work/life balance. Innovative and competitive environment. Changes constantly to support constant re-engineering and improvements. no real internal collaboration, only competition among team members.  'boys club' environment.  women hit a glass ceiling quickly.  pay and promotions unequal. Experiences at MSFT will vary depending on team and manager.  I recommend trying to contact people within the team you are moving to and try and get feel for the groups dynamics. installing new OS on laptopsLeaned about power managementknowledgeable  managerseasy going with managers and co-workerstight deadlinesrelease of new products As with any large company, job and career satisfaction depend largely on where you land. There are many opportunities to learn about a variety of topics and develop a lot of career skills. Unfortunately, it is very competitive and can be hard to set boundaries between work and life. Microsoft is less focused on customers and more focused on making money. I want to be part of a company that puts customers first and does not discard customer priorities. I loved the people I worked with at Microsoft. The management didn't care about us. They just wanted the numbers to be better and better. The office was nice and the grounds were always nice. Microsoft is a great place to work.  the culture is very collaborative and fast paced.  No day is typical, which makes it exciting.  Executive management is great.  The people and customers are the best part of the job.  Long hours are the hardest part of the job Great company, great product, great peopleLoved working in a deep technical team like C++Enjoyed being a SDET and a technical program managerEnjoyed learning brand-new C++ features and new windows features/updates and their integration! I have been working as a contractor and its a very good place where vendors are given opportunities.Ability to work from home. Flexible schedules.Great team members. Great work place with amazing co-workers and leaders. Always fun coming to work to get the job done and achieve our goals for the day. Good work days. Microsoft is a fun place to work for while delivering products which are used by a large customer base. The diversity of roles and products provides you an opportunity to have a challenging long term career. Microsoft is still on the cutting edge of many technologies. From a tech standpoint it is an exciting place to work.  It is fast-paced with outrageous growth potential. For employees that are looking for a secure work environment, where hard work is appreciated, Microsoft is NOT for you.  Microsoft has no problem recruiting individuals, relocating them, and then letting them go. If you believe big companies have no heart, it is definitely true at Microsoft. I was hired as a consultant to assist Microsoft in a Procurement Management outsourcing Project.    I learned how to be a contractor delivering services to a client who had aggressive schedule and time demands.  Culture was very supportive and hard working.  It was truly a matrixed organization that worked collaboratively to obtained a desired goal.  the Procurement Management team was my client and I worked closely with them to ensure we were aligned on project goals and objectives.  Hardest part of the job was being an outsider trying to virtually understand the group culture and dynamics.The most rewarding part of the job was setting up my consulting practice and becoming an provided supplier by Microsoft.   Negotiating and finalizing a contract to provide services for my project needs for Microsoft.   Working with a global matrixed organization to drive all the project needs and ensure timely compliance by all parties involved. Worked here in a contract role. Great company, as many already know. It's just really hard (near impossible unless you know or you're best friends with the higher ups) to convert from contractor to FTE. Great place to work, great people and culture.  Could be stressful but that was to be expected during certain deliverables. Fast paced, but wonderful benefits and work/life balance. Learned a lot at this job and looking forward to seeing how the place grows. It was a good atmosphere with bright people and engaging talks etc. Would recommend. it all started when I knew I could help out the Kinect team with my background in animation. It was a long fun journey as I grew from a labeler to a QA to Lead QA, to more rewarding job duties. I got to meet and work with a great team. Microsoft has it's ups and downs, but overall, it was a fantastic place to be, surrounded by fantastic and highly intelligent people, doing some very awesome things. this company doesn't respond what employee ask or need. Hourly working requirement is very strict and it makes employees feel being used. It's typical vendor company for Microsoft One of the few places anywhere that a person who wants to stay technical and still be promoted and receive raises.  If it were not for the nearly 100% travel, I would still be there. You work hard, you play hard, the pay is good, but there is no loyalty from anyone above or with HR. I wish there was an easier way to move from team to team. I think this is the biggest issue currently, poor middle management with no idea where the company is going. You are constantly reminded that you are not a Microsoft employee.  You are definitely treated like a second class citizen even though you are doing a tremendous amount of work Worked here several times as a contractor.  When working on non-gaming related projects, work was generally great.  Awesome co-workers, very responsive team members, etc.  Balance work load, learned alot about hardware dev/testing and really enjoyed myself.For me, it's been the opposite when dealing with Xbox related stuff.  Constant micromanaging, very strict management, and can't even take a dump without it going against me.  I hope I never have to work as a test associate for microsoft ever again.  Plus the pay is never very great either.  Not even a liveable wage.Gaming or non-gaming, there's better money to be made elsewhere. I love Microsoft, and have given 10 years to the company. The last few positions have been great leadership and teammates. The downside is this 18/6 month vendor rule. This is the 2nd time I've had to endure it, and I can't wait 6 months. This time, my break started the day before Thanksgiving. There were openings in the team and I was referred by an FTE but nothing happened. I guess that's the only pitfall. I'm excited about new opportunities for other tech companies. Provided work/life balance while also being competitive with benefits and pay. Management was very dependent on the person - some managers were great while others not so great. Be prepared to play the politics game internally if you want to get ahead. Management is typically hands off and you have a lot of freedom in setting your workload and goals.  Keeping your skill sets current is a problem with the amount of work you typically get assigned. Best work culture you can get in the industry, great co workers and projects are challenging in a good way. Job security could be an issue as overall budget for projects change every financial period. +) Positive working environment: awesome co-workers, experienced and friendly people; understanding team-leads and managers who would reward any work you did above-and-beyond; helpful support staff regarding insurance, deposits and payments, and day-to-day operations.(+) Unique work: Experis prepared and delivered me to a large client with professionally high standards; formal introductions were made between CEO is implementing a positive change in approach to dealing with 3rd parties and other platforms but company is taking vocal effort to hire only minorities and folks out of college while at the same time stating importance of diversity - which is impossible when you look to eliminate groups completely from the hiring decisions. With my time being their under contract I hated that it had to end. The environment was great as well as the people. The commute for lunch was a non factor due to the cafeteria on campus. Not much more to add to the summary.  When it works for you, it's awesome, when it doesn't it's not all that fun.  They don't lock you into a position, so you can always move to something else. My day consisted of delivering files to agents, refilling the files when they were ready, sending letters to customers, scanned, uploaded and e-mailed documents There is not a typical day at Microsoft; always moving, producing and moving. I enjoyed the people, the culture and the opportunity. The only frustrating thing is the benefits (as a consultant) are not very competitive. Working here was one of the worst experiences in my career. The only positive thing i took away from this was my coworkers were friendly and tried to help me advance within the company. The management  is old and outdated and dont like anyone trying to change things for the better. Be prepared to work hard, though you will get reward very well. The key to survival is to always move so no target is on your back. Do what is called the low hanging fruit. You will be measured on when you enter your time, submit reports, quarterly training, etc. This is all used to stack rank you, thus create poor performers. They figure that 10% of staff each year are poor performers, so they create false means to manage you out. Microsoft it's an excellent company to work for: you can great salary, excellent benefits, good work-life balance. I can not find a company in this market that will provide a package that can beat Microsoft. Learned a lot at this job and looking forward to seeing how the place grows. It was a good atmosphere with bright people and engaging talks etc. Would recommend. I have been holding several roles as Microsoft vendor and my conclusion is this: you can deliver the results they ask for, you can put as many hours and keep everyone happy, but you are just a resource and will be treated as such meaning they will cut your contract with no advanced notice, provide no recommendations and there is not way you can appeal their decision as you are not an FTE.Because of it I am looking now to work somewhere else. Needed to go for it, instead of quitting on the USA. Our factory was producing the highest quality rated Microsoft product and they just folded it up and headed to China... Excellent benefits. Work life balance is terrible. Some roles require just showing up while others are physically and mentally taxing. Know what you're signing up for. One of the best companies i have Ever worked for.  The value shown to you by the management team and the higher up is incredible.  They really want you to succeed at the company. I have worked at Microsoft for over 3 years as a vendor and loved everyday of my job. The culture is fast paced and competitive, but very collaborative and quite educational. It is my dream to be an FTE here someday. Microsoft is one of the few companies in the world where you can work with some of the smartest, most diverse people on the planet in an environment that is impactful to everyone in the world.  Your influence on the world around you is only limited to your own imagination, ability to defend your reasoning, perseverance, and influence.  It is a super tough place to work due to the competitive nature and talent of its employee base, but so rewarding for those with the drive to push through and influence the peers and leadership around you. My job is find. The people I work with, the work I do, the place I work at, etc etc are find. Stressful at time but find. The problem is the contractor I work through for the company. The contractor are clueless to this kind of work. They try to run a tech job like a customer service by outsourcing most the jobs off campus. The outsource worker are poorly trained and have no on site support leaving the on site worker doing majorly of the work load with less employee. I do more work then 3 outsource worker combined. Stay outside of few orgs like CSS and MSIT and there is some good roles. Bad managers who are non-technical suck. Be prepared to deal with incompetent TAMs, PFE and then some seriously smart people. I enjoyed my time there. The management is the best management I have ever came in contact with during my career history. I was and still am very honored to have been a part of such an amazing team. If you're looking to be a part of something big, to help drive innovation and work with smart people - Microsoft's the place! I've especially enjoyed my 5 years on the DX ISV GTM team where I've helped impact the business and revenue for Azure and SQL. Microsoft provides an excellent environment to be able to enjoy your work and get involved in a number of diverse areas of the business.It is, however, extremely protracted to get ahead and develop your career. I got the chance to work with all types of people every day. I learned how to manage large scale events from construction build up, event management and construction tear down. The travel was great and the team members I worked with were awesome. Great job for those that need excellent pay and benefits. The group you work in and your manager really dictate what kind of an experience you will have here. Overall, great company. Just be aware of the team in which you are working. Great place for a contract position, I imagine it is a great place for an FTE role as well. Would like to find an FTE role within Microsoft. I have had a great experience with my MSFT manager and the team is very smart and great at what they do. I would not discourage anyone from going to work for Microsoft. Interesting work, great company and benefits. The quality of management varies greatly from office to office, but worth consideration. Unlimited career advancement, great place to work, excellent benefits, exciting technology, interesting challenges, continuous growth, brand recognition This is a very good company to work for. The manager will try his best to work with you as long as you come in and do your job. Benefits are awesome and if you're in school they offer to help with that. Great company to work and best company in the software.Please work for Microsoft and it will be a great working experience and it will be great company. Work life balance supported. Team mates awesome. Wonderful CEO. Great environment to learn and work and also socialize. Awesome place to retire. Would recommend anytime to anyone. Always on, direction of company and daily job challenging and changing all the time.   Focus on the wrong things, everything is driven off of Azure, everything. Learned a lot at this job and looking forward to seeing how the place grows. It was a good atmosphere with bright people and engaging talks etc. Would recommend. Microsoft is a very heterogeneous organization. Some teams are great, some are not. It depends very much in which group you work. In general, Microsoft is still very Microsoft centric vs. customer-centric. There are a lot of 'talkers' vs. 'doers'. Politics is still very present and it trumps results. It's an intense place to work, however, there are great things going on related to the transformation of the culture and dramatic changes to the business. It's a great place to work and a terrific learning environment. I had worked for the company for almost 9 years.  Over that time I saw many changes that were not 'worker friendly'.  Unfortunately, it is a reality of todays workforce.  As competition ramped up, benefits are cut and expectations and stress gets higher.  Micro managing the business from several layers of management began to take over the job and it became harder to accomplish what needed to be done.  More recently, restructuring and layoffs have made job security part of the additional concerns.  As with any job, the job can only be as good as your direct manager.  With the restructuring, the company has new and in some cases unqualified managers in role. It's more important that the manager meet PC criteria than putting the best candidate in place.  This is probably not unique to Microsoft, but it was a great place to work at one time.  I wouldn't say that today. Job culture was great. It attracted a high level of applicants resulting in an amazing staff which worked together well and formed a very cohesive team. The company cared for it's employees through many extracurricular activities and a very robust benefits program for employees. Professional and supportive work environment.  Currently going through many changes as the vision of Satya and new management is realized which has destabilized the environment.  I believe they will come out stronger in the end. Great place to get your foot in the door.Opportunity to move into corporate.Changing culture that thrives on sales and great customer service. Community engagement is high in retail. The hardest part of the job was not being able to have access to your email at all times.  It was an hourly role and Microsoft has a strict policy of working off the clock.  This role should have been a salaried role.  When you are planning events, you need to have access to those details in case there are questions when you are schedule off. Overall, I thought that my internship was a good experience getting myself through work life. It was a roller coaster at times going from fast paced to snails pace. The manager made it very uncomfortable for all the employees to work for him. Many employees quite all at the same time and had private calls to the the manager's direct report. Long days, supportive team.   Tons of email. Good training.  Brilliant people who appreciate hard work.  Mostly good managers but a few were awful. Especially the last one who was later fired. Went to Microsoft for the technology which remains the primary reason to go there.  Too many high ego, non-collaborative managers to help grow the business.  Poor sales culture focused on cronyism and a distinct lack of customer focus. The people, the environment, the work, the management, the ability to be successful, the incredibly genuine family feel of that place, etc. It's all gold. Such a shame it had to end. Cuthroat and unfair management, poor management ,,,,they constantly look for ways to replace you with cheaper Microsoft employees from India, partners or contractors I actually work for Xerox Corporation who is contracted by Microsoft, however I am and have been received as a full time employee. 7day/24 hour access to facility. all of our coworkers help each other. The supervisor is very bad. High knowledge of the subject High security and protection Low salary and complex work. Daily basis , I do Battery cycling  and collecting data and plot , analyze, create report test results to manager.It's great plae to work and very friendly environment and help each other. Skype is a fast paced team and I had an opportunity to work with new features for Skype across multiple devices. Was a good experience working with the devs and the team. Loved everything about it. Only downside is contract. The pay is good, the people are great, and the work is challenging and enjoyable. Would come back to work here FT. I had a 10 year stint as a contractor for Microsoft and learned so much about team collaboration. I worked with fantastic engineering teams as I moved into different projects. As long as the commute to Redmond from the Greater Puget Sound doesn't bother you, it's a great place to work. Fast paced environment with very demanding stakeholders & deadlines.  Work life balance very difficult.  Bi-annual review cycle where employees are required to write your own review. Learned a lot at this job and looking forward to seeing how the place grows. It was a good atmosphere with bright people and engaging talks etc. Would recommend. Relaxed environment, pay is good, management is lacking, break room was nice, people who work there are nice, good benefits, nice discounts, tuition reimbursement, stock help, health/dental benefits were really good Pressure to make your number, no matter what! Poor management. Lot's of backstabbing, Racial diversity non existent. Complaining to management about unfair treatment only gets you into trouble. primary day consists of many conference calls everyday to discuss all pertinent projects, culture everyone is their own team member, hardest part is traveling all the time. most enjoyable time is flexibility in hours and location of work. The company was a great place to work. The environment was friendly and professional. The facility was always clean. The supervisor were always friendly and understanding. Working as a research assistant for a new project at Microsoft. The team has 10+ members, and the management team handles the project well.The overall work schedule is closely monitored, but have flexibility as to accomplishing the weekly goal. The best job I ever had. Very laid back. No micro managing. Everyone easy to get along with. Managers were all approachable. Employees were well compensated for their work. My contract is going to be end by February 2018. I love my job. I learn a lot from Microsoft as Lab Technician and Reliability Technician. Best place to work. I would only recommend people who are slightly interested in the tech field to get this job. Other than that I would steer clear away from this job. The turnover rate is horrendously high because of the lack of management and hours they provide. People are nice but this job doesn't get many bills paid off. If you're here for more of the experience and not for the money (not like they really give you that many hours to begin with) then this is the right job for you. Life at Microsoft is incredibly fast paced and there is certainly an expectation to perform. As support, you are surrounded with a vast amount of other, talented individuals. Short term contract workPay is comparable to other contracts.Benefits negligible and expensive.Very nice people to work with.Recruiters are very happy to work with you. Totally depends on the team.  Some are fantastic, exciting and rewarding, while others are tasked with responsibilities that are greater than they can handle. the company has undergone a real cultural shift and mindset change as it transforming into services company. With advancement into Machine learning, we see great future for this company It is a good company to work with, however your manager or skip manager has all power in your annual review, bonus and career advancement. CEO is driving a better company culture but it is still quite different by departments. Would recommend working for Insight.  I have no idea what I should say here other than this was a good company to work for.  I enjoyed the manamanement team. I learned so much from my colleagues and the businesses I supported. I was constantly challenged to think outside the box and felt supported by management. Having spent a fair amount of the last decade on campus, I have experienced the decline of campus culture somewhat. The global push for accountability has relieved many vendors of their positions and put heavier workloads on MS FTEs. Microsoft at the time was a very challenging, quick paced, nimble environment. During my tenure, I experienced nine reorganizations within six years. Each management team had a different view of how my team should operate. It was the incredibly long hours over many years that led to my departure. I felt well paid and respected. The WIM's (Windows Informational Meetings) were parties that tended to be too loud and made it hard to concentrate on getting work done.Free dinners were nice on nights that we had to work late anyway. Position I held at Microsoft was contracted through Volt Workforce Solutions and Compcon Tech. Working Contract you are not eligible for the same benefits as a Microsoft employee. Overall the pay was great and the environment was very relaxed. Received the right amount of training to effectively do my job and after contracts ends you have an opportunity to work in a different department allowing for more training. Great job overall. The most enjoyable part of this job was meeting new people.  Scheduling events and getting guest ready. I learned how to work in a fast pass environment. Learned a lot at this job and looking forward to seeing how the place grows. It was a good atmosphere with bright people and engaging talks etc. Would recommend. Nice place to work. Often had to work many more that 8 hours daily and manager was often doing personal things. Given jobs that were to be for the manager . Microsoft was a really great place to work at. They had a beautiful campus, good food at the cafeterias. It depends on the team you get on but my team had a really great group of people and everyone was very respectful of each other. My career in Microsoft started when I was young and I started to begin  part of the Microsoft Student Partners program, where I learned a lot about Microsoft culture and technology at first hand.Microsoft is a great company to work, you have flexible schedule, amenities and people truly smart and enthusiastic that is always available to help you grow. Greeted guests and employees from around the world.Analyzed data to determine answers to questions from staff as well as members of the public.Perform administrative support tasks, such as organization of daily records and files, data entry, scheduling of appointments and maintenance of appointment calendars.Assisted the MVC manager with promotional projects ranging from designing new exhibit brochures to social media presence.Organized meetings, tours and events for the Center.The liaison for vendors such as meeting/event organizers, caterers, janitorial staff, building security as well as our internal PR department and VIP speakers. I have worked at Microsoft on and off for four years. I have had the pleasure to work on a variety of exciting new projects, under managers who truly care about their employees and products. It can be hard to transition from contractor to full time, but that would really by my only gripe about working for Microsoft. They strive to have a very open, inclusive environment. I feel the company has come a long way sine the age where engineers ruled the software world. Satya has done an excellent job in turning Microsoft into an innovative and vibrant company again. The work environment is attractive with the right mix of amenities to support productivity. Great solutions, constantly changing, always learning, political ( maybe not worse than others, but definitely need to stay aware). complex to get things accomplished. Overall great experience and learned much that will benfit my career. 公司环境很好且轻松 工作氛围好。 提供很多休闲设备和福利。 主管很人性化  给员工足够的时间安排自己的下班活动。 working at Microsoft by far was the most collaborative environment that I've ever been part of in my 25yrs in the work force.  It was refreshing to see that a company of this size fostered such an environment. Great place to experience technology development at its best. You will be busy and expectations are high. Great people to meet and learn from. This company is always evolving. If you work for corporate great! I would not work on the retail level ever again. Management needs more training and corporate needs to do a better job of checking on their retail employees. Contractors could be alerted before of being fired, if budget is not available. Other than that its an okay company to work for. Always look for other oppertunities. Go beyond the limits of your on-premises datacenter using the scalable, reliable infrastructure that powers the Microsoft Cloud. Transform your business and reduce maintenance costs with an energy-efficient infrastructure spanning more than 100 highly secure facilities worldwide, linked by one of the largest networks on ...review Microsoft Cloud Data Center.. is the best place to work. Microsoft is a great company with an excellent CEO.   Middle management is extremely poor.  My experience was managers tend to like mediocre workers as direct report and hired intelligent workers to do the core work.  I found managers to be very insecure. As a consultant, I amused to working at customer site and working alone.  I enjoyed the freedom most of the time.  Most of the workplace culture that I have to adopt are the customer's. It was a nice time, no issues at all.  Between the nice offices and the rather affordable, excellent meals offered at the Microsoft cafe, I'd definitely try to find another job there again, for sure. I am  on my second tour of duty at Microsoft.  I was there in the 90's when Bill Gates was still CEO, and I came back in 2010 when Steve B was still here and Satya has since taken over.  It is still a great place to work with respect to learning about, and implementing, new technology.  They also provide many opportunities to get involved in side-projects to expand your exposure to new technology.  There is also AMPLE opportunity to get career and technical mentoring there. They still have the **BEST** employee benefits compared to anywhere in the US.  I would still recommend MSFT to college graduates looking for initial technical skill development so they can  move on to something else.  Compensation has never been stellar at MSFT - but its good enough.  Work/Life balance has improved greatly since the 90's.However, I would no longer recommend it as a place to climb the ladder or get job advancement.  MSFT has taken more to hiring people from the outside, and preserving their middle-management 'in-crowd' by continually providing lateral transfers to that group in order to maintain the careers of the anointed few.  They have also implemented regional hiring practices to the detriment of many.  Thus, even though you may do great promotion-worthy work in Redmond, WA, you will not get the job if the company decides that the job has to be filled in Las Colinas, TX!    Sadly their culture of late has gone off the deep end injecting west-coast political-correctness into the work place. They are on board with all of the 'sanctuary' politics of the day. The SLT is very self-righteous  about it and has taken a 'take-it-or-leave-it' attitude about it, no matter how much it offends people.   I am often left scratching my head about what any of this has to do with 'the business' and shipping quality technology.  Injecting politics into the workplace has never been a good idea and it will eventually drive quality people away from the company IMHO.Additionally, they are all about the new 'growth mind set' - which is perfectly fine in and of itself.  Sadly, they have implemented that as a performance evaluation tool as opposed to a cultural goal.  Unfortunately, its been my experience that no one in management has a consistent or informed idea about how that is defined nor can they provide any specifics on what it looks like in practice.  I strongly doubt that the vast majority of MSFT mangers have even read Carol Dweck's fine book Growth Mindset.  Ask 1000 managers and you will get 1000 different answers. Best place I have ever worked.  Learned so much during my 11+ years of employment.  Great managers, great co-workers, excellent benefits, awesome training resources available to everyone.  Good work -life balance. I had the chance to work with the engineers and product managers behind Artificial Intelligence and machine learning using APIs.  It was my 1st time working under a contract.  My direct team (Cognitive services) were very busy, however I never felt I was intruding on their time and they always had the answers to my questions.  Working with a global team had its hardships, however I did a good job with keeping my team on the same page with feedback and suggestions for the service. Busy, fast paced, new challengesMulti-tasking, negotiation skills, everything Admin, strong team building, management and coordinating complicated logistics, planning and documentation of processes Learned a lot at this job and looking forward to seeing how the place grows. It was a good atmosphere with bright people and engaging talks etc. Would recommend. As a former employee of Microsoft, I can honestly say that this company truly cares about its employees. There are many different elements of the culture which embody their belief of how important their customers, and employees, are. It is a retail position so you should already know what you are getting yourself into. But this place will give you a chance to grow with in the company and quickly Microsoft was a great company to work for. If you love technology, Microsoft is the place for you. Microsoft benefits were great and people love to collaborate to ensure the success of the company. i learned lot of c# dot net ,learned communication skills hardest part is communicating leader ship skills improved work place culture management is good i enjoyed most job Excellent collaborative workplace providing all possible opportunities in advancement and setting high expectations in a very competitive environment. Challenging with the amount of quota given increasing each year until it becomes impossible to attain.  No additional career path for Account Executives. If you are lucky enough to find another path out of sales, then your job level, salary, age and gender will come into play. Loved my career so far at Microsoft, great place to learn, grow, and work with smart individuals. Microsoft has great benefits and good local and world-wide ethics. As a product marketing manager for a new product, I am leading a team of marketing and sales professionals across the company to plan for feature releases, pr, content, exec presentations and reports.I love managing the v-team, creating the all-up project plan, working with people around the globe, writing marketing content, leading field communications efforts, and being a part of a team to launch an exciting new collaboration platform.The management is wonderful in this org and I am enjoying the role. Unfortunately it is only a contract which will end in March 2018. I currently work as a contractor for Microsoft and have for roughly 9 years. Although the vendor model has changed over the years I have worked, I still value the ability to move around more freely than I would have had I been hired as an employee. Microsoft was a highly competitive work environment filled with extremely bright and gifted people.  It was obsessed with innovation, rapid growth and expansion.  It was an awesome roller coaster ride that required an enormous amount of commitment and passion to survive. Beware managers who ask you to do something that does not jive with what the employee handbook states. Also, one should know that once in one program, despite being told otherwise, you are trapped in that program with no recourse but to quit/resign. There is no such thing as a pay raise and hasn't been for 2 years. Room for advancement is limited to the favorites of management. Working at Microsoft was fun - when I worked in the field sales offices in other parts of the country. It was in the early days of Windows and Microsoft Office. Once I moved to work in Redmond, however, the pace quickened and it was often hard to keep up. While I was there MS used the stack ranking system for one's yearly review. This practice led to many unscrupolus demeaning of another group by managers just to make their group look better. I am very happy to hear MS has completely dumped this system and is now focused on the individual's contributions. This is an excellent company. Their product and vision are second to none. Fiscally smart, co-workers very reliable. Great environment and the product is top-notch, it was an honor to work here. Has been such a pleasure to work at Microsoft, great culture, environment, and personal growth! Working there will improve your skills and soft skills as well as your as a person. Its a very good place for working,with a very pleasent environment. and team which i worked with are good at knowledge sharing,which helped me a lot to improve myself. Un ambiente super comodo para trabajar y con entretenimiento para los recesos. Microsoft is a company that revolutionalizes the technology industry across the globe. To get to work in a company of this size is definitely a priviledge and it comes with added responsibility! The new CEO has made strides to improve the company and execute competitive advantage across the board.  Employee development has improved over the years, but has some ways to go. Was a great place to work. Team members knew their roles and executed flawlessly. Everyone was will and able to do their jobs. Hours were flexible, management allowed the freedom to get the job done. Learned a lot at this job and looking forward to seeing how the place grows. It was a good atmosphere with bright people and engaging talks etc. Would recommend. I started at Microsoft in the mid 1980's, when it was a 600 person company.  The following 10 years were exciting.  You knew you were part of something destined for greatness.By the mid 1990s, it was obvious that top management did not get the Internet.  That cost them a position as a dominant player. I returned to Microsoft after being gone for several years and it was a completely different company and environment post-Steve Balmer. The energy is palpable and seems to be a new buzz about development. However what is felt in the engineering and other business groups, is severely lacking within the Talent Acquisition organization. They are years behind and seem to still be stuck in the highly politicized arena and the lack of progress and 'out of the box' thinking is almost non-existent. They have over-engineered the process in many ways, and their idea of 'revolutionary' recruiting practices are simply things that great recruiters have already been doing for years. It's nothing new, it's lackluster at best and extremely frustrating. It's still a 'good old boy' environment and the lack of true diversity in leadership is blatantly obvious. Don't get me wrong, Microsoft Corporation is a great company overall but some portions of the company are 'drones' and afraid to make change. There's quarterly surveys that are give to 'try and improve' the company but nothing ever changes.CSS (Customer Support Solutions) has upper management that tells everyone the company is 'Customer focused' but their 100% metric focused and want you to hit every goal without failure or else. And if you're in any mixed management meetings where you can express your concerns to the upper management, they nod but avoid answering any specifics.Work-Life Balance is tricky. Some teams allow for decent balance where others are over worked and then the management gets 'confused' on why their team is burnt out. Working at Microsoft you will encounter top notch management and high energy coworkers. Simply put when you work at Microsoft YOU HAVE FUN! Overall the environment is great and the energy they put into you is a direct correlation to the effort you put out. Highly recommend working here. I truly enjoyed my time at Microsoft. The people and company culture are great. I learned a lot about marketing and planning events. I had the opportunity to work with a great team of marketing professionals. Been a long time ago, but while I was there it was a very fast paced and very informative career. Many outstanding people, knowledgeable, kind, forthright, energetic and so much more. Few things were handled at a comfortable pace. For some people this can be more fun, but for others it can be overwhelming. The other negative is the risk of errors and problems stemming from the inability to apply adequate time to ferreting out issues. Great place to work. Excellent team and excellent benefits. Lot of opportunity to do something new.The team I worked with transitioned me through various roles as I wanted to learn more. I got to associate with some of the leadership which was also great. Microsoft pays well and has excellent benefits.  The culture is toxic and cut throat, with virtually no collaboration.  There is also a forced distribution that a mandatory 5% of all employees have to receive an 'Underperformed' performance rating, even of they are a top performer.  It's all political.  It's not what you know, it's who you know. Environment is changing to do what I say and forget your experience.  Growth is there for business and careers.  Very smart and hard working coworkers.  Great team spirit. Teamwork and culture were spectacular. The overall mindset of the company was that of successful growth along with satisfied clients. The gap was continually bridged with long term engagements/relationships in mind. Data systems analyst - MSN Data Center Technical Services Team responded directly to complete SOC/MSN help tickets.  Typical duties involved break fixes, investigated basic network configurations and local system network configurations. Everyone knows Microsoft is a fantastic company to work for. Good benefits, good pay, good overall work environment.  I would recommend Microsoft as a great place to work. Culture reflected using language like customer obsessed, growth mindset, and we win as a team.  Manage on duty stayed in the back of house and left others to deal with customers.  Growth mindset was used to bully others into following whatever half-baked notion floated in manager's head that day.  Never disagree or will end up as the whipping boy and eventually terminated. My experience with the company is simple, if there is an open job it will always go to the managers friends. Even if they know nothing about the job at hand they would rather train a friend over giving it to a deserving employee who is more knowledgeable and educated. Good place to work at. I had a cool manager and team members. It is a good experience, Lots of POC's to work on.  Everybody is trying to win points with their managers. The part of Microsoft I was working with was very disorganized. Managment was incredibly overworked and hard to get in contact with, but the team culture was pretty nice. Long days, complicated matrix environment. High priced! I worked for Microsoft for 4 years.  Difficult to put a solution in from of customers, because of the overhead of reviews. Microsoft was a great place to work, and to build excellent software when Bill Gates owned the majority of the company. Customer focus and employee satisfaction were both very important. Now, short term profits and managing up (to get your bonus) are the two most important things at Microsoft. Great company but it is in transition which has influenced the culture.  I am PROUD to be a Microsoft employee but there are cultural 'blind spots' that go unaddressed. I have been able to work with Microsoft for most of my life in and out of the educational setting.  I am able to apply this knowledge to the work place. Learned a lot at this job and looking forward to seeing how the place grows. It was a good atmosphere with bright people and engaging talks etc. Would recommend. Excellent job environment But the workplace culture din't include the contract staff in the meetings and don't make them feel part of the teamAlso no job security. good place to work, very nice and brilliant people.work load is ok, not hard to hand. manager very nice. I enjoyed most part of the work. Thank you!!! Microsoft unter Satya Nadella ist im Wandel begriffen, was aber nicht bedeutet, dass so etwas wie Jobsicherheit existieren würde. I loved working on the Microsoft Retail Contract at Unisys. I enjoyed what I did as a Major Incident Manager. It could be nice and slow one minute then a mad house the next. A decent place for a job, but probably not a career. Shaky job security and limited upward mobility make it a sub-optimal arena for long term growth, but a pleasant work atmosphere, comfortable workspace, and interesting projects make it an overall positive experience for short term work. I would happily work here again if I just needed a job, and wasn't looking for something bigger. An intellectually stimulating and challenging workplace, and a great innovative company. Product groups enjoy wide latitude in managing their own product and development processes. A professional and competitive place to work. There is a lot of pressure to stay ahead of the pack to ensure you are at the top end of the scale year in and year out. As in any consultancy, Microsoft touted work/life balance, but travel was supposed to be 75%. In reality, you only spent Friday as work from home.This constitutes 100% travel in reality. Though large companies had a tendency to have a lot of bureaucracy to overcome, the talent pool is very high.  Working with good people creates a good work environment which reduces the frustration of pushing through the bureaucracy to influence change. working with cross functional teams from Design, to Manufacturing teams. Diverse culture and great innovation culture. the most enjoyable to work in wide product portfolio of products  especially the elite products. Great learning opportunities are provided. Definitely a great culture when you are a part of the team. Fast paced with amazing products and equally great customers! i am looking for a team to that works together; however there is not  i in time ,ill will be given the responsibility to complete many tasks independently. The ability to complete projects on time, and strong attention to detail are critical to achieving success with us. Please note this is not an assembly line, but instead a chance to work independently on projects that may take 1 hour, or 1 week to complete.other then that i would love to work for you y'all;,... Great work environment with minimum supervision. Learn to use and manage different kind of tools.Weekly team huddles. Management are very flexible and understanding.Can be challenging at times when deadlines are due.Great and healthy office atmosphere. Microsoft is a constantly changing and growing company. Many Direct Managers are not able to keep up with the changes, so you are expected to be successful with minimal to no guidance or support. Successful employees quickly adapt and thrive in an agile company that changes direction constantly.  If you like an environment that will challenge you and offers the opportunity for constant learning and growing then, this is the place for you. 'Work life balance' corporate buzz word not true.  Managers had no boundaries in calling for needs/questions that could easily be answered in an email.  Taking your vacation was a waste of using your PTO.  They will call you on vacation and 10 pm at night.  I am not the CEO or at that pay grade. This role required a huge amount of patience, because I was dealing with people who often were in distress because of issues with their computer.  I worked in Tier 2 support, when meant I would get clients from the initial support line where the engineer could not solve the issue.  My responsibility was to find someone (an software engineer) that could fix the issue. Amazing place to work.  Besides being a great educator, we assisted many clients to success.  I performend many different roles at Microsoft, including Tier 2 support Duty Management, MSN Ad Operations, and Program Management. Support staff and management are very supportive and accommodating to work with. Working environment is great, account manager actively work with company to find suitable positions for you. Although I loved the technology, career progression, movement to other roles and other groups, internal interviewing, was all absolutely awful. Hated the compeititve culture and favoritism, They screwed up! Depending on what team you're on and who your manager is, your day/week/year might look very different. The online advertising side of the company is very young whereas the cloud/productivity side of the company is more seasoned. Learned a lot at this job and looking forward to seeing how the place grows. It was a good atmosphere with bright people and engaging talks etc. Would recommend. Great company but like IBM no guarantee that you will have a job. The are constantly laying off people, in fact they just hired 350 people but only half will make it more than 6 months. Great place to work. The company focuses more on their people which is great. However, there is no company development plan for retail employees. Its typically who can 'woe' the right people. Great culture for employees and management.  Collaboration, innovation and open to ideas.  Diversity at its best with all colleagues accepted and encouraged. Overall, Microsoft is a great company, as long as you have a very clear personal goal, and understand what it takes for career advancement.  Those who know exactly what they want to do, do well, but those who are unclear of their goals, struggle. Loved the education and vast opportunities.  So much to learn as you grow with the company.  Communication and group meetings are frequent.  All necessary tools are provided to do your job. Great sense of teamwork, Co-workers shared what they knew the ability to work in groups and tackle problems from many angles. most of the days was breakfix with time set aside for learning new skills. Productive work place with good work life balance. Good benefits and compensation. Good environment to work with stayfit perks. Good insurance and other benefits. Microsoft is the best company I have had the pleasure of working with, and I say with because this company makes you feel important. They want to hear your ideas and they include you in the changes made. You are a part of a tight team that feels more like a family. I have learned so much about how to sell, how to treat each customer, how to work closely with other stores when it comes to transferring products. You get out of Microsoft, what you put into it. PlanITROI, Inc. is a fast-growing, highly innovative IT Asset Disposition & Returns Management company focusing on value recovery to; enterprises, resellers, retailers and OEMs. The company focuses on IT & CE assets of relatively high value in the supply chain.  I do not have an opinion that I would like to add to this question.  While I have only worked a Microsoft for 1.5 years I do not feel I have enough time working there to give an opinion. I enjoyed working with so many intelligent people at Microsoft.  the work was challenging and I felt fulfilled.  the company does encourage you to work hard and for the right reasons.   Microsoft gave large bonuses based on performance so I was able to earn around 40 to 50% of my salary in bonuses for many of the years I worked there.  I was asked to work on a product that was quite complex and had many issues at the time for a period of about 3 years.  I was working close to 80 hrs per week which along with traveling became to much.  They will work you as hard as you let them.  But if you get in the right position working with the right technology, It is hard to beat Microsoft as an employer. Very much felt like this was a firm in transition as it grapples with systems built to deliver boxed software and translated that to the cloud. Quite a bit of empire building here, but still opportunities to do good work. While a good place to start and get experience, most people get tired of mismanagement and poor leadership after about 2 years. Higher up leadership does not understand the function or tasks of lower level employees and makes decisions that cause confusion and delay of process implementation. it was the most work ever did but the culture the people and how well Microsoft takes care of their employees is more than I've seen for many other companies. Team oriented, yes there is a ping pong table and pool table at work.  Co-worker are encouraged to share information and are very supportive. The level of customer service we provide to our customers is exemplary.  Overall a great place to work and grow, I am done with contract work and I am looking only at FTE positions.  I enjoyed my time at Microsoft, it was fun and challenging.  My advice to anyone looking for a position at Microsoft is, only accept an FTE position. Some groups do not treat contract employees well. I worked remotely for Microsoft, visiting the office and my team several times a year. I greatly appreciated the flexibility they afforded me.My only small complaint would be that they only offer a high deductible health care plan outside of Washington state. Great opportunity. Working from home is the best. No commute just wake up and start my work day. Work is challenging highly technical and rewarding. Great team environment, even though you don't see your team members and managers, the sense of comradery is equal to face to face interactions. I worked for Microsoft for many years.  I was excited initially and then it became very poltical.  Each team I moved to hoping for something different ended up no better than one I was leaving.  At the end, I lost all desire to work and took a less paying job outside that I would enjoy. Good culture, good work-life balance, interesting projects, good pay. Most reviews about working at Microsoft are negative, but the experience has been great for me. I have the pleasure of working with some incredibly talented individuals on complex and challenging problems, have learned a lot, and have made a good deal of money doing it. Learned a lot at this job and looking forward to seeing how the place grows. It was a good atmosphere with bright people and engaging talks etc. Would recommend. Working at Bing for me was an extremely competitive, challenging environment.  I did however enjoy the process of learning & implementing incredibly detailed software toolchains & comfortably sank into most hours at my workstation without issue.  Office politics were tough & quite opaque, thus being laid off was something I got over relatively quickly. I enjoy working here, things are on a very relaxed pace. Everyone is very helpful and want the same end goal. Both my managers had a great relationship with me that wanted the best end result for me. The staff was always supportive and assisted whenever required.  The pay was always on time and there was an abundance of training classes available.  There were classes available on a multitude of currently required skills, during multiple hours that would fit any schedule. People are very productive and strong collaborative.  The head quarter is in Redmond which has the beautiful landscaping.  Employees got good perk such as free pop drinks, coffee, milk, parking, shuttle service between building, etc. Compared to many retail jobs out on the market, Microsoft is one of the best. For part time sales associates (product advisors) you get stock options, health insurance, vision and dental insurance. The benefits make you feel like you actually work for Microsoft, as they include you in all the perks corporate employees get. The team I worked on was super disorganized, had changing objectives dictated from above, and wasn't really allowed to determine its own destiny.There are parts of Microsoft that people really like working at, but the team I worked on was a mess. Microsoft is the best company I have had the privilege to work for.  They foster innovation, individualism, growth-mindset and inclusiveness.  I am lucky to say that I have fun every day, while at work. I started out with a manager that I loved. I ended up with one who couldn't give ice away to a dying man in the desert. Poor leader, poor sales manager. Same as I wrote in previous review. Great people, cool scope of work. One of the best places I´ve wroked in. The only poor was the salary. I still have great relationship with management there. Overall, Microsoft is a great place to work. However, as a vendor under a contracting agency within University Recruiting, it is not a good experience. Microsoft is a good place to work.  People here treat the others .I like to work here again and again.I miss the work environment here, although sometimes you have to spend more time and energy than regular day.But I understand it because business need.I was happy to be at Microsoft. Strong benefits package.The company is undergoing a transformation, which is an exciting time compared to prior CEO's leadership. Much of your overall job satisfaction will come down to which team you join and the quality of your direct manager. Politics runs high, especially in more senior positions. Good flexibility in how you get your work done in most cases, but expect to work until it is done.  Change is constant so you need to embrace it.  Excellent benefits. Great place to work for new and seasoned professionals with high career aspirations. I would recommend it to anyone with dedication and drive to achieve high goals. When we were shipping Windows XP we worked 20+ hour weeks regularly. It didn't phase us. We were passionate about the product we were creating and the work we were doing. As long as you are in it for the long haul that's all that matters. If you are hoping to have a job that is simply 9 - 5 this isn't the place for you. Even as a contract employee who will be let go at the end of the ship cycle, for that bit of time you were part of something amazing. Microsoft cannot be viewed as a single company. Some areas are well run with thoughtful leaders. Other areas, not so much. In less than four years my org has seen massive turnover and changing business models that never deliver clear organizational direction. Financial management is an afterthought and in some cases seem to be deliberately constructed to obfuscate organizational spending. Co-workers in other orgs within the company fare much better. It all depends on the leadership in place. Definitely do your homework on the specific organization you are considering before accepting any offers. Ask about turnover and learn what you can of the current team. Better to ask hard questions up front. Great job comes with a lot of good benefits also very friendly co worker....all about team work. Also there is plenty of room to grow within this company Job satisfaction will be based on your manager.  Some good, some bad.   A lot of FTEs in role who hand over their entire job to contractors who don't get MSFT benefits but it makes you wonder what their job is and what they're getting paid for. Especially when you begin your work day before them, and continue to work after they log off for the day. All of the below mentioned points vary by the team you work with. Here are some of mine:1. Average day is fast paced and agile2. Lots to learn - easy to stagnate3. Great work place culture - independent, self-directed Every few years they claim to change the review system but it's always stack-ranking based on who likes who. There are occasional purges of ICs but middle managers are untouchable, no matter how incompetent. Learned a lot at this job and looking forward to seeing how the place grows. It was a good atmosphere with bright people and engaging talks etc. Would recommend. I worked as a contract tech writer in the AI+R Division for 18 months. It was a great experience overall with interesting projects and very smart and ambitious coworkers who were genuinely committed to providing excellent service to their internal customers. Many subcultures make up MSFT and they are not always compatible. Overall, company is doing well, but don't believe the favorable press about culture changes, it's very competitive internally and that's not always healthy. He said unemployment was high, farmers were helpless, education was expensive and medical costs were soaring because the government had not set up new hospitals, corruption was very high and a handful of industrialists and corporates could take away land, water and other resources while the BJP government in the State remained a mute spectator. Microsoft is an amazing company, and it is often a shock to people coming in that they are suddenly working with people just as smart and motivated as they are (if not more so). It is an intense environment, and one where you will never sit on your laurels. It is a great place to work, but definitely not for the faint of heart. They will work you hard, but they will reward you accordingly. It is an ok company to work for. The benefits could be better and the communication needs work.  There is barely any communication unless you reach out to them. Long unappreciated work hours. Many people with a not my job mentality. Self promoting success achievers vs team win thought process. A ranking and rating system that discards great talent when there is no one left to target and someone has to go. The culture at Microsoft is favorable if you are female or an immigrant, otherwise beware. It's an ideological echo chamber. Lots of potential opportunity to move within the company, but their loss of status in the tech world is playing out within the ranks with paranoia and protectionism. It has become stale and difficult to navigate. As mentioned, they pay an inordinate amount of attention to a supposed inclusive culture, but the company is increasingly run by HR. Beyond the propaganda, this is still a hard place to work.  The old stack rank system is gone, but the new system is just as arbitrary and rigid.  As a manager, I often struggled to understand how my employees' final rewards were determined.  There is a revolving door of executives, so strategy changes at least once a year, and often contradicts the previous plan.Pay and benefits are solid, but the price is fear of the quarterly lay-offs and being torpedoed in your annual review.  Despite the stories that failure is a learning opportunity, it is not really tolerated and one mistake can be fatal. Microsoft is a great company for sales professionals and techies. Very progressive and transformative. The company is going through a growth period, so things are ambiguous, but I'm confident it will change within a year or two. Either in corporate or in the stores, Microsoft Retail is a joke. Apple literally pays you for what you're worth and you deal with exponentially less. You have little job opportunities to move upwards. Unless you know the right people at the right time, you're stuck in a dead end job that pays so far beyond market value that you can barely afford to pay rent. If you are a fast worker and work hard then you will thrive in this environment. The people at MS are helpful and there is no typical day. The culture is ever changing An opportunity to work with the best of the best.  A chance to impact the creation of the next product MSFT puts out.  Unfortunately the desire to get customers on their cloud (Azure) is blinding management to the value of relationships with customers.  Sales for people who shouldn't be required to sell is a poison pill for a trust relationship with customers. It beats the other companies in the area that I've worked for. The work is fun, challenging, and can be consuming. The people are professional, courteous, and respectful of others. career advancement atleast on the sales side is not much.Benefits are best in the industryWork life balance is great and you get to work with some of the smartest people in the field. The production slowed way down as they cut the work force drastically and cut hours. With in weeks we slowed down from making 1600 a day to 40 a day. Made for very slow days and even canceled work days due to over production. Fun place to work where you can bring products to market that people use in their day-to-day lives. Great discounts of Microsoft software. Management encourages you to use their tools daily and advocate for them to your social peers. Productive and fun working place. Very diverse, welcoming and friendly. Non-Micro managing culture. The hardest part of the job can sometimes be working with users who are needy and difficult. At such a big company the experience will vary drastically. I ended up in a role without many career options outside of IT so I have to really work outside of already busy working hours to drive my career and build skills to do what I want to do.Everyone is at least smarter than average and generally open minded and tolerant but it's still a boys club in many ways.Lots of opportunity if you're willing to work hard and persist Of all my previous employers of 17yrs ..Microsoft is The BEST company that I have ever worked for ... They truly care about their employees. I love the diversity , the culture , the people ...EVERYTHING!! The SQL Security team I worked with were very skilled and highly intelligent. Very quick-paced work and meetings. Had a lot of fun and would recommend to anyone. Learned a lot at this job and looking forward to seeing how the place grows. It was a good atmosphere with bright people and engaging talks etc. Would recommend. i loved my time at microsoft i mainly left because i didnt get offered a full time position after 3 years so other than that awesome company to work for Millennials can fail to make quota 2 years and still survive RIFs.  The current leadership is reducing COGS by dropping a RIF on high performers (120%+ to goals) particularly if they are over 40 years old.  Doubling your six figure salary with revenue based incentives is good in the short term until management decides to cut costs.  I am just waiting for the next RIF to see where my career goes.If you know that there is no such thing as job security even if you crush quota you will be prepared for your next gig. I am. Internal movement and career development need serious attention. I have been told more than once that I am 'Top Talent' and received above average Rewards the past two years in a row. Yet my management does nothing to 'retain' or 'develop' me as part of their charter. I am currently in my third stretch assignment (of which I drove), and so far they have not been beneficial in terms of setting me up for a possible transfer. I have attempted to explore seven internal positions, but most have already had an internal candidate identified before the position even opened, and others felt that my current experience did not exactly align (never mind my previous experience or potential). Management needs to step up and sponsor/advocate for their top talent. Continuing to put them on dead-end work that creates burnout is not career development -- it is a career killer. Help open doors, find growth opportunities, and show your investment in us. Fun filled job.Challenging workGreat learning opportunities.Good Work-life balance.Opportunity to work with latest technologies with different people and culture. I think everyone has some understanding that this is a tough place ot work, they continue to cut corners where employee benefits are concerned.  Personally I was set for failure by my boss, so I my advise is enter at your own risk A more matured and structured technology firmMany people work long hoursTakes time to get to know the firm's structure and connections within the firm There are a lot of brilliant and motivated people at Microsoft that are great to work with. Working within or across teams to design, implement features and resolve issues is fun and motivating. From a pure development standpoint it can be a developers dream.Don't get side tracked from developer tasks if you want a good performance review. Even though bugs are a standard part of the development process, if you spend time fixing bugs to make systems robust it will result in features being placed on the back burner. The end result is it will impacted performance reviews.I have seen numerous instances where developers ignore bugs assigned to them but deliver a feature getting higher evaluations regardless of the quality of their work. Very rewarding and ability to learn consistently. New technologies almost weekly, never the same thing made the job interesting and enjoyable. Good times! All good here. Great work culture, good mix of benefits. Employees are valued and so is their hard work.Looking forward to an amazing time. Great diversity ! Unfortunately, my store had been closed down and not everyone had a guaranteed spot at the other store. It wasn't the best experience during this time. Our store was great, I enjoyed it there. The other store isn't so great. I wouldn't send anyone to work there.The work days are easy if you have worked in a fast pace place before, or retail. If not, the holidays will scare you, they get crazy.Culture is good overall, but the other store doesn't follow the culture that Microsoft has set up. I've been there for my internship and found it as a very decent and nice place to work and research. Actually, I learn a lot during my internship at Microsoft and people tried to do their best in supporting you. Great company where I grew up, but like most giant corporations, they keep the workforce young through the review process and ultimately layoffs.HR is a public relations and marketing firm. The people and management were very knowledgeable and willing to teach and explain things, even though I was a contractor.  The pace was fairly laid back but very focused. Microsoft treats their employees with respect and dignity.  The benefits were amazing.  Strategy was focusing in on improvements all the time.  Trying to always do better.  In a corporation of this size, the management always still tried to make individuals feel required and relevant.  Enjoyed working daily on projects that were tough, and with people from all over the world. Several instances of inappropriate and offensive humor. Constant backpedaling on talks of career advancement. No respect or sense of listening to concerns from Business Support leadership. They ask too much for little reward. I was a consultant on the services side.e It's super dependent on the manager you get - I had a wonderful time there and wish I wouldn't have left. But my wife wanted me to be home more often. Of course, if you have a personal connection with someone you trust who works at a company, you might wonder whether you still need to look at employee reviews. The answer may be personal and depending on the relationship you have with this contact, but at the same time, it can't hurt to get a sense of what others say. If for no other reason than to assess morale and the overall feeling of others you'll be working with, it's helpful to get a sense of what other people are saying. Great company to work for, great support from employer, great follow up, great benefit, great environment, they really invest themselves in the futute of each employee. Work life balance could be achieved there. Co-workers are very friendly and smart. excellent company culture. Campus environment is terrific. You can have multiple choices of eating in different restaurants on Campus. Great culture, solid work/life balance, endless opportunities for advancement. MSFT has huge resources for employee development and training. Benefits are most generous, to include paid maternity and paternity leave, 3 weeks vacation, 2 weeks sick, decent health insurance, legal support, health expense allowance. Learned a lot at this job and looking forward to seeing how the place grows. It was a good atmosphere with bright people and engaging talks etc. Would recommend. not good company to work for nothing else management is not focused and do not know what is happening around them. I have seen a lot of unqualified employees. company is losing talent Worked in loud, hot server rooms.  No training or advancement.  Bullying and intimidation was rampant.  Abusive workplace environment.  Avoid at all costs. I had a life changing experience through the research internship in Microsoft. The working environment motivates every single individuals to want to work more and more. learn new things everyday and you challenge yourselfWork from home option Meeting and connecting with a lot of peopleGood salaryEvents and socializing Microsoft is a great company, with a lousy work culture.  Unfortunately, customer focus is an afterthought, and petty office politics ruin the experience of working one of the greatest companies in the world. If you get to work here, make sure you keep your manager close as he will make or break your career. Complaining and arguing are not well received, and if you do, you will be labeled and ostracized. The worst part is witnessing how people get ahead even though they clearly lack the maturity and experience.  You just make sure you have enough verbiage to support the slightest pencil push in your evaluation.Other than that, the benefits are great. This role allowed me to conduct my projects on a schedule that I was somewhat in control over. Although meeting deadlines was critical there was minimal micromanagement throughout the process. This gave me great flexibility to manage work/life balance as I needed to. You will work extremely hard based on the verbal promises of 'taking you to the next level'. In reality, they want you to exhaust your skills set at the same pay, lead others on how to do better but not promote you. Your 'big chance' never comes, no matter how many stellar annual reviews and conversations you have with management. Extremely helpful people with good 'group cohesion' and communication. Fast paced and interesting, with role having a significant impact on product release. Learned a great deal about mass production manufacturing and the value of applying systematic approaches and attention to detail at all times. Immediate and skip level managers were not always great. UX is still not a 100% equal discipline with other disciplines. People are generally happy there. Microsoft is a great company to work for! Lots of intelligent, driven people, listening to customers, crafting products and driving into the future. Highly recommend. Your co-workers were good about working as a teamThe client was your first priority to find solutions to the problems.I learned the usage of many software products.The most enjoyable part of the job was learning updated tools to help you solve the problem. Contract gigs are not for everyone. I showed up early, did my job, and gave the bosses a reason to keep me around. The others who take it more lightly get let go during ramp downs. A typical at Microsoft is filled with excitement ! Starting with the morning meeting to the end of the night meeting.  The cultural is a family . WE believe in each other and we support each other.  The management at Microsoft are wonderful. Everyone is very understanding and there is an open door policy. The most enjoyable part of my day is helping customers. If you like being on your feet for 10 hours in a datacenter, then this is the place!  Awesome place to start gaining skills due to the volume of servers and maintenance they all require. Need to be a team player to make it here. Awesome perks like snacks and coffee. Break room was nice and clean. Management was cool as well. Solid benefits/salary are a given at Microsoft. Your role, quality of your manager, and team collaboration can be very hit or miss. In my case, they were a miss.Be sure to carefully vet your team/position/manager as best possible before accepting an offer. I had zero indication of the issues that have now surfaced, but fully regret not digging deeper once I had an offer in hand. Great company with great benefits. Grew up at this company and would work there again if it was the right position and the right manager. Great commute. During the day I would work with 15-20 different customer either by phone or e-mail, looking for updates or providing steps in order to resolve their issues.Each days is a learning experience in which you are given the option to expand your skill-set. It is retail, what can I say?  As a top performer and sales lead, there are college kids that are compensated at a higher pay rate than myself. How is this even possible? Retail associates are treated as if they are bottom level associates.  I like the company overall and appreciate the time that I have been employed, but I am too skilled for a retail environment and feel like I am wasting my time in a Microsoft retail store. Going through many changes but always interesting and keeps you on your toes.  Ability to move around the company is encouraged.  Upskilling and staying fresh on technology is key to success. If your enlistment is ending soon and you'd be interested in moving into a high paying, in-demand tech job, then you should definitely take the time to learn about the MSSA program. Learned a lot at this job and looking forward to seeing how the place grows. It was a good atmosphere with bright people and engaging talks etc. Would recommend. This was a great job initially with plenty of opportunity. However, the continuous movement of people between teams caused the direction of my project to change with little clarity on what was expected. Lack of opportunity was a key factor for my decision to leave. Not going to add any more details on this company. It varies from one engineer to another, but my overall feelings are too subjective to be of value to anyone reading this. Strong CEO Strategy and Direction.Solid product portfolio and customer focusEncourages learning and development and provides many opportunities to learn. Working for Microsoft has been very rewarding!  I work for one of the leading software/hardware companies in the world!Most days are very relaxed and even when you are busy it isn't overwhelming! A nice change from other careers that I have had, but I want to move up and it is incredibly difficult to move up within the company. I've been with Microsoft for over 15 years as a contractor, so I guess there is that.  I haven't ventured out to other companies yet.  Part of the problem is that I've become so locked into the .NET stack that other tech companies don't want to touch me as I don't have Open Source experience.  This was a mistake on my part not to venture outside of MS to get so solid experience with Linux, MySQL / Oracle, etc, and Java of course and JS.  Now I'm desperately trying to move outside of MS technology. Microsoft offers me all supports I need to accomplish my jobs.My manager is excellent.  Everybody is friendly and offers support.Microsoft offers me a challenging tasks to do and I accomplish them all. This PG is having to many re-orgs. Many times leadership rolls are being given out without merit. Overall the company is a great company to work for with lots of opportunities. The company aspires to transform without losing its identity...shifting business direction and its strategy from software, adding hardware (and sometimes reducing), now onto ML/AI.  All while building a culture of growth mindset and driving for inclusion with a one Microsoft philosophy As a resource company, one should remember that the person who's working for you is also a client.  There were times when the recruiter did not reach out. Depending on the day an employee is either scheduled to be on the sales floor providing technical support to customers, or working on machines in the technical room.A day of providing technical support on the sales floor involves checking e-mail about current issues that customers may be experiencing.  When a customer needs assistance, we provide a fifteen minute consultation on the device in question.  If the repair will take more then fifteen minutes we check the machine into our tech room for work.  The customer is given an ETA on when the machine will be done based on the scope of work.A typical day in the tech room starts by checking an email recap from the team.  The recap then starts the day by letting me know what computers take priority on our currently checked in machines.  The goal is to work together as a team to finish the scope of work required for the checked in machine by its due date.  Although most of the work completed is free of charge, it is also our responsibility to gain approval from the customer for services or hardware that would have a charge.  This way the customer is well aware of what they are paying for at pickup and is satisfied with our service. Employees were highly motivated and friendly, created a positive work environment. Location was convenient and scenery was great to look at, with restaurants and stores close by. Best IT desk I've worked. They went managed services and moved to Bangalore, otherwise we'd all have stayed employed. With over a 90% first call resolution rate we took good care of the Microsoft employees. One of the best places to work for with great work life balance. Work with the smartest people in the field, on the toughest customers, driving impact on a scale never before in my realm of possibilities. It is extremely challenging, and rewarding work Great place for all experience level programmers. You will be given time to learn all sorts of software as per the requirement. All people in the team are very friendly and helpful. I recommend this job to those who want to learn while working in their own projects. Being a brand ambassador for an Xbox event was really fun and engaging. I had a great time helping attendees gain access tot he event. The most enjoyable part of the job was being able to watch part of the E3 show. fast paced environmentTransformation in the businessremote work and flex work is positiveThe culture is diverse which is a plusThe most enjoyable part of the job is partnering with customers Micromanagement and stress can be high, but if you get the right boss this won't be a problem.  It's a crapshoot.  If you like the management, you'll love Microsoft.  If you don't then you won't.  Beverages are free.  Lunches are good.  Benefits are amazing. Cut throat completion and long working hours. needs to work for day and night due to multinational locations . Excessive travelling. Pay package and other facilities are good but no work life balance. Productive and fun workplace, people are very helpful, people are very friendly. The working environment was great at the site. If I had the chance will work at Microsoft Corporation again. One of the best places I have ever had the pleasure to work at. Amazing work/life balance and top class benefits. You would count yourself lucky to be employed by them. "
                },
"encodingType":"UTF8"
}
