{
"document":{
"type":"PLAIN_TEXT",
"language": "EN",
"content":"Is a very serious work area,you always have to be doing something even when there's no customers at least organizing the charms or trades or cleaning the mirrors. Personally, I did not have an enjoyable experience working with this company. Our management team was not professional and during the duration of my employment we had extensive managerial changes. This was my second job and that was clear from the start before I was hired and I had stated I had limited hours. Over time my manager, both previous and new, pressured me for more hours and eventually it led me to me leaving. A typical day at work would include being notified of my goal for the day, assisting customers with what they need and exploring their options by simply adding on jewelry that would go hand in hand with what they were looking for. They wrote you up for a call out even if you have a reason and you have to call out 48 hours before you can’t eat in the store you u need to take it out the schedule is done late all the time on Sunday you will get your Monday schedule at night Pandora is a great company, however, they are fairly strict employers. I am provided a flexible schedule and I have made great friends. The environment has little breaks and stress management is required. The most enjoyable part of my job was building the different braclets everyday. I started to gain a steady set of customers because they loved my degins. I usually expect a mid level jewlery store would be more nasty, but the environment that i have was pretty chill. I got to expose fashion, style, mindset, and language of many types of people. there rude and management is very unprofessional and they only want to you to work on weekends and there permit stays work during the week . There unfair to there new employees / seasonal It was a great learning experience and had very helpful development tools for each individual. They provide a chance to any whiling to learn and has good implementation, can work well under pressure and can communicate accordingly. Fantastic company with a superior corporate culture which is undergoing robust growth that provides ample opportunities for personal as well as professional advancement. Pandora is an international Danish jewelry manufacturer and retailer and it is known for customizable charm bracelets, designer rings, and necklaces. It became my collection because i like the style and design. Clean modern work environment.  Team driven store with sales goals and ever changing product keeps the job interesting. Always a new sales event which helps to motivate employees. Very flexible with hours. Pay is not the best but discount accommodates for it. You get to set your own sale goal for the day as long as it is higher than company policy which is very manageable. it’s claim and collective working at pandora, everyone gets a long with everyone.it’s not hard making the customer happy and helping them make their decisions on what they want or what they want to give as a gift learning to make connections with customers and satisfying their needs. each customer has a personal connection with pandora, which requires associates to be accommodating and patience. As a sales lead I am responsible for leading the team into make effective sales. As well as doing operational tasks such as counting registers, end of day reports, and training modules. Pandora is a great place to work. It requires customer interactions including but not limited to: sales, returns, overall customer satisfactions, etc.... It also requires employees to be independent under little to no supervision as well as proactive when doing general projects. Pandora has been my favorite place to work at so far. The company itself is amazing and I have a great interest for it. As someone who hasn’t had experience in sales or jewelry, I found myself a jewelry lover and enthusiast. I loved designing bracelets and collections for the store’s displays and of course our customers. It is stressful knowing there’s a monthly budget you have to make, while also making sure to beat your previous year’s goals, but to also make sure the whole store makes it’s budget. It’s a difficulty to get used to but the feeling of success is very rewarding. Personal drama and feuds can make it difficult to remain focused, like I would imagine at any job, but without a connected team it’s hard to be as successful. I would like to continue to strive with the skills I’ve developed in a more civil environment. Got bonuses for selling the store's products as well as great discounts. Got thousands of dollars worth of jewelry and was able to buy gifts for my family and friends. You really have to compete for hours and must be very serious about selling. Meaning if you aren’t really great at sales, you will not be worked. If you just want a job to get through school, like me, I don’t recommend. They only care about your sales, your numbers, and if you’re following the conversation guidelines. You are also required to push the Pandora Preferred Card and you will get in trouble if you don’t get people to sign up for one. Sometimes the hours are great and others I would go weeks without so much as one shift. On another note, the women I worked with and for were absolutely amazing! I actually hated to leave Pandora because my coworkers had become a second family. Most days are not busy, usually busy during sales or holidays. The most enjoyable is to able to help a customer find the perfect gift that they are looking for and they are happy with the purchase. I enjoy working at Pandora. It is ideal for a creative person that is social and loves people. A lot of fun and amazingly unheard of employee discount. The people I work with are amazing. My manager is very motivating and works with schedule. Is a very serious work area,you always have to be doing something even when there's no customers at least organizing the charms or trades or cleaning the mirrors. had a great work/life balance. employees were great co-workers. product was fun to sell. pay could be better but you get great commission based on your sales for the month. I highly recommend Pandora to girls looking to grow and gain experience as well as build onto their personal goals. The benefits are also a pro of being employed here. Highly competitive environment. Self-motivated/eager personalities likely to succeed. Work/life balance typically leads to short tenures with the organization. Pandora is a very open and welcoming store to work in. They are vigilant with the employee reviews and are always happy to be given constructive criticism. I would be there longer than I should of been,I was doing a job I was not hired for, for example I was doing sales but I was hired for visual. I also was not properly trained. Pandora made sure that we had all the knowledge about their products. I was very sad leaving Pandora, because it was such a wonderful place to work. The managers were incredible and my coworkers were amazing! Great perks and benefitsOT/hourly pay option for some departments because of busy/holiday seasonsNot much room for growthManagement inconsistent at times Even though selling jewelry can sometimes be stressful, my time at Pandora was overall really great! I was taught many valuable lessons not only in sales, but in management and life in general. While there is a lot of work, both up front with the customer and behind the scenes, it is a great place to work if you are motivated. Just a cute little job. Great for a first job. Highly recommend to people who are not looking for growth in a company but wants to have a decent side job. management need work but besides that everyday at work was so fun. all my co workers were great people and I loved to be around them. also we would have small competitions like who could sell the most in a day. When i first started their it was a very friendly and fun atmosphere. We all supported each other and really had fun. Over the past yrs though, management has gotten really cutthroat, making you work mandatory overtime almost every weekend. If you work here, you basically can’t have a life outside of work. I would say it’s a good job if you’re starting out, but don’t plan to stay long bc you won’t move up anywhere. Each day that you arrives had to see the goal of that day to know how it could be fulfilled, if the goal of the last day was fulfilled. The managers were interested in knowing how they could help you in order to do a better job. Depending on which location you're in, they're all different. This particular location was a little bit nicer than our closer competition in Menlo, but neither stores owners offered any kind of incentive for the sales teams. because of this we were constantly going through employees. the management in the store were always nice though. I was recruited by my old manager from Body Central to work at Pandora. As employees at pandora you usually start off as a greeter, one who greets the customers while they walk in. Then you go to be a cashier and then get trained to become a sales associate. I as  I said was recruited by a old manager so she gave the store manager a good word for me. When I got interviewed and tested on my sales thankfully i preformed strong for them to put me as sales right off the bat. I worked there for 3 years (in two different locations). I ended up giving my two weeks notice due to me getting married and moving to California. I loved working there and was so grateful to have streghthen my work ethic thru that company. it was actually at Jareds the Galleria of Jewelry in Boynton Beach, I was assigned the pandora section. it was great during the holidays, lots of fun to help people make these bracelets for family and friends and they become even more fun when you get to see the bracelets come together. workers were nice, break room very small, managers were nasty. they let you wear their jewelry to promote sales for the day. it was a seasonal job extra cash for the holiday season. I have been learning a lot about myself when it comes to customer service.  The environment is quite interesting when it comes to the customers and what they come into the store shopping for. I hated this job and will never work there ever. the company did not care for its employes, i would rather work at claires. i suffered greatly and i am donewith this job. Minimum wage paying job with very small commission bonus. Slow traffic, so you have a lot of wasted time. Mindless job, if you can talk you can work here. I enjoyed working at Pandora Jewelry. They are structured and show where you stand daily to see how close you are to making commission. How much you make in commission depends on you so not only are you encouraged to work as a team to make numbers, but there is also individual drive to keep selling more and establishing  long term connections with customers. Management lets you share your ideas in meetings that happen twice a month to help improve the store. And the hours are not only flexible (if you are balancing another job or school), but they are also standard shifts with a set closing time. Coming from food industry, I greatly appreciated the atmosphere. It's laid back, but challenging enough so day-to-day tasks don't become boring. I love getting to know the regular customers who come in looking for more charms to add to their bracelets. I also love the creativity I can get to exhibit in helping customers create new styles. I also like meeting the travelers from out of town. They appreciate being listened to. New customers everyday come with new challenges and more chances to test your selling skills. Management is great overall and each store manager has the opportunity to run the store how they wish. This is both good and bad depending on the manager. Raise opportunities are always there as well as promotional opportunities. Is a very serious work area,you always have to be doing something even when there's no customers at least organizing the charms or trades or cleaning the mirrors. I hated working here, they treated me so unfairly because I wasn't a salesperson. When I asked to advance they turned me down and my last day they said they didnt need me anymore and they would contact me next season (never happened) Great place i love the selling aspect but i had to leave due to lack of management , they didnt let me chamge my availability so i can take a manager postion at another store When working here, I was not treated with respect by the district manager. She was very rude to not only me but to all the other sales associates. She saw us as the bottom because we were “just the associates”. She consistently would put people down and make them feel bad about themselves. Pandora as a company is pretty decent. You get great discounts on the merchandise and if you love pandora jewelry, you will probably like this job despite the lack of respect. I wish the store would spend more on the inventory for this store. I only worked here for six months, due to the district manager being so rude to the associates and for working more hours than agreed to. Most of the associates quit because of this issue. The hardest part of the job is all those long hours on your feet, and being under paid for the amount of work they ask you to do.The atmosphere is uninviting, the customers are usually not treated with respect. I learned patience from this job. Everyone complains about being underpaid and over worked. Huge company growth of which I was part of when privately held then Company went publicly traded and managers were let go. Lots of turnover due this fact. Massive layoffs over several years. It was nice to be there, but now that I've graduated college, I'm looking to get started in my field. Only downfall were some of the rude customers that would come in. One of the harder companies I worked for. Rules are a lot more strict and not much room for anything outside of what they want. Management can be strict as well because they have very clear goals they have to meet and instructions they have to follow. Not bad working here at all but definitely not as fun and not as much room to discover what methods work for you as an associate. Pretty much everything is written out as instructions to follow. Upper management is a mess and there is a lot of nepotism. Store managers do not know how to run a store nor even know the products in the store. The DM is rude and will find a reason to fire anyone she does not like. Due to people quitting constantly, extra roles are put on to people without proper training nor compensation. The company is a franchise so there is no HR department and issues are pushed under the rug. When conflicts arise there is no confidentiality and private business is aired throughout the company. Associates, supervisors, and owners are typically great people to work with but the management is so poor it ultimately ends with being burned out quickly and leaving. terrible job i work in times square and the management is extremely bad. thwy have no benefits being a franchise the managers believe that they are above everyone and treat employees terrible they say extremely bad things to employees and have terrible attitudes Pandora has given me the opportunity to expand my people skills as well as to teach product knowledge which is so important in retail these days.  The workplace culture is that as long as you are giving your best possible care to the customer the rest will fall into place.    The most enjoyable part of the job is learning about new products on a daily basis and interacting with clients. A typical day is working one-on-one with customers. Making a connection and getting to know what the person on the other side of the counter would like. Jewelry is a way for people to express themselves and I learned that it is very important to listen to what the customer is saying that way they can feel confidant with their purchase. Jewelry can also be a way to remember someone so its also important to be respectful to everyone's choices. Pandora Jewelry is a really good company. during my time working for them I learn a lot of visual merchandising, jewelry products and it increments my development dealing with customers.Its a great opportunity to learn and grow as a sales associate. Pandora is affordable luxury . I have was able to work with fine jewelry and learn to run a business through mu partnerships with the franchise owners . It’s amazing to have  seen a brand grow extensively internationally. I enjoy working there. It’s part time only and hours are based on performance. The people I work with are great. Everyone does there best to work as a team to meet goals but in the end, you still have to make sure you’re looking out for you! Love making up different looks for bracelets and rings. Probable the best part What to say the job was ok the ppl were ok every one has a different experience at each job it was the not the best but not the worst it's nice location this was a good job but the jobs was not easy to do and the procedures change every few months and it is all about selling more expensive pieces of jewelry not how it used to be. the jewelry represented a special moment in the peoples lives not just an expensive piece of jewelry. Super stressful place to work when you have a management team that lack on communication, and professionalism. The store didn't even have an HR department. Enjoyed the people and the customers it was a good first job learned a lot about the corporate world which is a good experience poor managemt but I still enjoyed it I love working here. They help me out when I need it for school and knowing that I do have a life outside of work. However some small problems with upper management but other than that this is a fun relaxed environment with awesome co workers If you like retail, this is a good place to work. The hours are flexible and workers are as well. There were also great discounts for employees. The jewelry was also beautiful. Is a very serious work area,you always have to be doing something even when there's no customers at least organizing the charms or trades or cleaning the mirrors. If you’re a people person this is the job for you. Not only do you work closely with customers but you also get to know your coworkers really well. Good pay, driven team, and if you work hard, it’s very easy to move up in the ranks. The managers are great about working with your schedule and it’s a fun place! Love working here! Pandora at Santa Rosa plaza has the best coworkers ever! It’s a big family, we all respect and help each other. The environment is great starting with the best manager ever. She is so nice, understanding and helpful. I improved my skills because of her, she is always helping and giving us advice to improve our job. Coworkers are nice and helpful. I would work with this team forever! They teach you so well and do their best to give the best service to costumers. I’ve work in retail for almost 6 years and this is the first time I loved my job. The company is also very good and organized. Great company values. Excellent environment to work in and great opportunity for growth. Very family orientated which made work and home balance great. Excellent company to learn about customer service, how to work under pressure, problem solving and analytical skills. The only con was that the management was too strict. I was lucky to have a college job where I genuinely enjoyed spending time with the friends I had made there. In season it was very quick paced and would slow down during the summer when all the snow birds went home, but then we usually spent the time deep cleaning every inch of the store and whatnot. IT leaders are horrible, and care nothing about employees. Many layoffs, and money management is horrible. The company suffers from executives flying around the world business class, when not needed. Also, any leader there for more than 5 years can do no wrong, even when they have personal bias towards employees. Phillip Kennedy in particular. Being at Pandora taught me a lot about dealing with various types of people on a more personal level. When interacting with customers, it was the associate duty to make sure that they immediately felt comfortable as soon as they entered the store, and with that, you have different ones may want to speak or may not want to speak, depending on their mood prior to entering the store, the way they view employees, or any other extra factor. It was a very personal, yet fun environment because as employees, we developed our own relationships with each other, which made work more interesting. Of course it's a jewelry store, so the most enjoyable part about it was experiencing all types of styles of jewelry and seeing the customers' reactions to all of the various ways to customize it to their liking. My manager and assistant manager was absolutely the best management duo I've ever had, and I wish that any other job/career I have, that those present supervisors/managers are as even HALF as exceptional as mhy prior. Place is very very competitive. Most of the time you have to fight for sales. There is a very high goal that you have to reach sometimes they work together as a team but it depends on the store. I have chased my dream for over 20 years, there are some days I feel like I still am. However while working for Pandora I was allowed to grow, to see what I was capable of. Pandora was an amazing job! The product, clients and and sales team were all so great! They take pride in product knowledge and the newest trends and really care how their customers relate to the products! Profitable company is a challenging retail environment.  Culture has been shifting from small company to global corporation for the past few years.  Continuing changes among global and executive management. I worked here throughout college and really enjoyed it. I came from the restaurant industry so this felt a little more like and adult job or a job I could grow with. It was a great family away from mine back home. Lots of favouritism and horrible customer service. No opportunities to grow. Employees will disrespect ANYONE to make their sales. Management is rude and disrespectful as well. As a member of management, a typical day at Pandora involves tracking and setting metric goals to drive business and reach sales goals. Depending on the shift scheduled, the role requires leading and participating in customer service, opening the store, balancing funds, recording and analyzing data, training staff, enforcing policies and procedures, managing inventory, reacting to customer concerns, troubleshooting, maintaining visual standards, and cleaning and closing the store. I've learned a lot about jewelry and its impact in the business market, personalized client shopping experiences, and cultivating knowledge for customers and staff. Workplace culture is very friendly and fun, but prioritizes professionalism at all times. The hardest part of the job is finding enough time in between job duties to learn and coach new behaviors and policies, but that is only because of a recent retooling of the standards in order to adapt to a changing market and establish a unified brand. A typical day at Pandora would be getting yelled at about you sales (even if your one of the top sellers). Managers leaving for a 3 hour break to go get their hair done and not giving you a higher position because your fully qualified but 'too young'. I love working for Pandora , it’s a growing company for sure it’s very high speed when we have promotion or if we’re during the season.  it’s very flexible if your student they do give us the hours that’s need. again it’s a growing company. The typical work would be we are busy attending customers pretty smooth. To be more multicast and alert for customers. Just watching what's going  and how we treat customers. I don't think we have a hard part of a job. When it's time to leave work to go rest and regroup for the next day. Started as sales associate back in 2016, have grown to assistant manager and about to manage my own store and I have not even hit the age 21 yet. Management is great, DM is extremely supportive and our team is a family. I worked for pandora for almost 8 months I was doing good and favored at the beginning. I would work very hard and even worked on my off days. I was basically cheated out of a position and treated very rudely after. I loved working at Pandora, but the only problem was I wasn't making nearly enough money for the bills I had to pay. I worked so hard with many long hours to not get any raise or even begin to talk about moving up in the company. Seeing people move us was VERY RARE. But it is fun getting to create with all of the different products and make something unique to the customer every time. Is a very serious work area,you always have to be doing something even when there's no customers at least organizing the charms or trades or cleaning the mirrors. Enjoyed working with customers, and making sales.Hours were great.  Management was nice.  Coworkers were nice.Jewelry sold easily.  Store very nice. Great culture with amazing perks and lots of face time with all different departments. Overall very collaborative work environment with openminded employees. *Lay new people off approximately every six months despite heavy workload*Remaining people were just expected to pick up the work from laid off colleagues*No support from management*When hired - HR makes it clear that overtime (even though not compensated) will be 'expected because PANDORA is just that kind of company.' It is not an 'occasional' type of thing. *They do not promote from within.*no workplace balance. *Holidays are basically nonexistent. If there is work to be done, you'll still be expected to work over the holiday*Global office is non responsive despite the fact that they require being a part of the approval process for everything.*incredibly short staffed due to previous layoffs and there is essentially a mass exodus. They believe that the benefits outweigh all of the cons.They offer tickets to a suite at Capital One Arena and M&T Bank Stadium but it's incredibly hard to get them as the executives frequently take the tickets. There is a gym in the building but it's very difficult to use as it's very small and gets overcrowdedWould not recommend anyone work here. very friendly environment, typical day includes lots of inventory and sales. Hardest part of the job would be putting away inventory, you have to put it away one by one. Also the checkout process is a little hard at first but fast and easy once you get the hang of it. During my time here I have made relationships that will stay with me forever. I have learned a lot from my managers and co-workers that will help me succeed in the future as well. When I first started working here I was nervous that I was going to be shy and struggle when it came to the selling aspect but with reassurance, I was able to quickly get the hang of it and now love the job and the people I work with. This authorized retailer never gave us the chance to grow as associates or in the company. They chose to hire from outside and promote from outside. Awful pay and awful at helping people when they need it. Friendly staff and great learning environment but owners abuse of unnecessary rules. No sitting through a double shift while standing in flats and you must constantly without stop be doing something for the store. Doesn’t sound like to much but it gets to you. It’s little rules like that that pandora deserves 4 stars Great place.Great environment Young people Great pay for entering Good managementGreat part time hoursEasy location Fast paced Learning Experience It was about tea building and helping each other succeed . Sales was very important to the whole store, we all had to do our part so the store could be successful. It was a good . I was a college student who stated availability and was not hired accordingly.  The manager did things beneficial to herself. Some employees were accommodated but not all. I really did enjoy working for Pandora, and I love the quality of the jewelry. However each business is different as Pandora is a franchise and each business is run slightly differently in regards to compensation. Sales Lead/Assistant Manager - Responsible for opening/closing the store, coaching sales associates, selling products, assisting with scheduling, and in charge of marketing.promo changes Pandora was nice but I terminated my employment due to a personal situation I was going through. my lack of explanation about this led to a huge misunderstanding/miscommunication between the main manager and i. The location that I work at has a great manager who commitment for all employees to be at their best is amazing!! It has been more organized and communication has made a difference in how the store is run. I can not speak for other Pandora locations, however I enjoy working at Pandora of GSP. Excellent job for anyone looking for a part time job to supplement their income. They are very understanding and also value their employees very much. I was with Pandora for two years as a sales lead. Working there was great until new management was brought in. We were originally a franchise, but then switched to corporate. I was paid very little for what my position asked of me. Our incentive programs diminished as soon as our store turned to corporate. Just like any other retail job, the hours were long and late. I would not recommend this job to anyone who is in school or has other things to attend to. They want you available at all times, not worth what you are paid. Management is poor. There is favoritism and people get away with being lazy. The pay is low and you don’t get many hours. The discount is good but that is basically it. Pandora was probably one of my favorite places of employment while in college. I have worked retail for several years before working with Pandora, but it was the first retail job I had involving jewelry. Not only did I obtain a lot of knowledge and skills that I can apply in other areas of employment but I gained many friendships through associates and customers. The jewelry was not like any other product I've worn. It tells a story, whatever story it is you want to tell while also making women feel confident and elegant. I mostly enjoyed listening to the reasons why customers were shopping and help pick out pieces of jewelry that represents what they were wanting to display. Pandora is great for a high schooler working their first job. The training is great, but there is are no benefits (unless you're full time; which is only assistant mangers and mangers). It's also very competitive and there is a lot of favoritism. A typical day at work?Enjoyable because of the customers.What I learned?A different perceptive on sales with jewelry.  Management?No comment.Workplace Culture?Much life between the sales associates. Hardest Part?Black Friday. Enjoyable?Getting paid. Is a very serious work area,you always have to be doing something even when there's no customers at least organizing the charms or trades or cleaning the mirrors. The people within the company itself are quite pleasant to deal with. That being said, there is very little room for advancement throughout the corporation and pay raises come once a year and are minimal at best.Benefits are only for full-time employees but the benefits are excellent. Full time is NOT consider 40 hours, but 32+ which - if you are hired in under the impression of 40 - is quite a pay decrease. Those eight hours add up. Working here has been very challenging. The pay and amount of hours given a week is not enough for the cost of living. While working here little opportunity is given for growth. Pandora is an amazing place if you are willing to work hard in sales, interact and provide exceptional customer service learn the brand and grow. If you are up for a challenge this is the plaplaces for you. A typical day entailed restocking charms checking inventory; it also entailed opening each register to make sure the money was all accounted for. We'd also set a daily goal for ourselves with the manger to meet. Working with the guest to build a life story bracelet created an amazing experience not only for the customer but myself as well.Adding to a customer's existing bracelet as they had life events provided much joy. The only good thing about working in Pandora was is the discount other than that no hours, long days standing on feet, working with incompetent managers and employees. ...Up by 2:00 am to catch a flight or a train, my assigned accounts were in different states. ...There's no job security ...There's good management structure...not knowing what's next....working with my assigned account The people are really what got me through, it can be stressful at times and tiring being on your feet all day, but very rewarding to see a customers happy face when they leave with the jewelry you recommended. There are many ways to prove yourself as a competent sales person at this job. The management staff is friendly and clear and concise about dress code, job requirements, etc.Sales are difficult during off times but during promotions and holidays; this product is an easy sell.The best part of the job is how technologically advanced the company is with processing sales and easing the stress of shopping for customers. I learned that at least the location I worked for gave you a half an hour plus a 15 min break if you work over 8 hours versus a 45 and a 15. Besides that company is chill, its not stressful, and its actually pretty fun Always opportunities to learn and grow, staff is young and fun to be around and genuinely become great friends. Keep up with the brand and items and you should be fine. The store manager makes this store environment similar to the worst thing you can imagine. The store manager has and does constantly bully her employees. She tells us we are not pretty enough to sell. She tells us we are horrible retail employees. She does not respect any of us. It was a decent working environment with good pay. Scheduling was not flexible for an hourly job, and varied too much. Otherwise, management and job itself was great. Good people in the store to work with, bad upper management. The rules and guidelines are too much to follow for a part time temporary mall job. Pay is unfair throughout employees. We had a wonderful managers who was scared away by the company and we are now run by rude, inconsiderate and under educated managers from other stores Working at pandora was honestly a roller coaster, the job had its highs and lows. One positive thing I can say is you get good customer service and retail experience there. The working environment at Pandora is fast-paced, fun and can be sometimes stressful depending on the time of the year. The work day includes attending to clients along with cleaning, putting away and creating jewelry displays. Although you receive a great discount it is a rather stressful environment with low pay. Be sure to have thick skin. Also, its short staffed, huge turn over! Wonderful store manager though! I learned how to work as a team, and how to handle a sales-driven job. Was able to manage how to work in high paced, stressful situations where independency is key. Depending on the day, Pandora can be very slow or fast-paced. Involves a lot of customer service. Pay is low and hours are only as flexible as your availability provides. Definitely can help you with people skills if that's something you're looking to improve. "
                },
"encodingType":"UTF8"
}
