{
"document":{
"type":"PLAIN_TEXT",
"language": "EN",
"content":"It was a fun internship. The people are really friendly, the office is really nice, and the benefits are pretty on par with other companies on their level. The Ogden Office is a great place to learn, for entry-level employees, but as far as earning potential in the SLC area, is quite poor. The reward is in knowledge not in compensation. The hardest part of the job was looking for businesses to speak with. It was very challenging and probably the most challenging jobs but it was the most rewarding. Like the team. Dislike the management who doesn't know anything. Brand new equipment t to use which is a plus.Most teammates act way too spoiled meaning they act like they are better than this place. Leaving a mess at their station and bathroom allowing someone else to pick up after them. good culture and people, bad management as its a growing company and having hard time scaling the management correctly. very smart people are hired and the work is interesting Best job I've had so far. Loved my team, management, etc. Company culture had some of the typical silicon valley pitfalls, but many benefits to compensate. Given task to complete to help fellow workers to achieve their goals at hand.  I learned different skills in different positions.  Workplace environment was very relaxed but collaborative at all times. Relaxed, Fun and space for creativity are three things I had while my time on Pinterest. Weekly summary and meetings were not just to find out where exactly you and your team did but to improvise and grow your potential. Love the company, the product, the people, but poor management.Management never gave me updates on how to improve, never praised to increased morale, and definitely discriminated. I am disappointed I experienced this while working at this great company. I really liked the startup culture and the kind of work ethics they followed!The best part was the work life balance that they offered there.It was an enriching and evolving experience to work for them both professionally and personally! I love to work at a place that everyone is happy.. good vybz work place that people respect each other.. i need to grow .. i love to work at a place i can see my future be happy "
                },
"encodingType":"UTF8"
}
