{
"document":{
"type":"PLAIN_TEXT",
"language": "EN",
"content":"Salesforce, Inc. is an excellent place to work.  Like most, the quality of your day to day work life and delivery expectations are made or broken based on your direct manager.  I have the best manager I have ever had in my career.  In general the culture is high achieving, and makes do with less in the field than in HQ.  I successfully lead a large distributed team, and they are easily the best team I have ever worked with in my career. The only downside is the lack of real meaningful career advancement opportunities for managers outside of San Francisco. If you are not *in* the Headquarters club of managers you have little to no shot at meaningful career advancement. - Best working culture - Learned new/latest technologies- Learn and learn sessions- Team meetings were super fun- Freedom to take own decisions The team was in turmoil but the management was very supportive. A lot of politics going on in HR but great benefits and interesting job. The CEO is amazing in giving back to the community Hm, where to begin? I have been at Salesforce for about two years and it has been the best professional experience to-date. Salesforce is packed with incredibly talented individuals who strive to do good work. The culture of Ohana is what makes this place really awesome. You're treated fairly and people are there support you. I also love the fact that there are unlimited opportunities to learn new things. Whether you want to become Salesforce certified, explore new roles or connect with others outside of your immediate team, it is all there for you as long as you take the initiative. I give this place 5/5 stars simply because it stands up to its reputation as The Best Place to Work For. very friendly staff ,keep the environment exciting when the sale floor is slow, will work with your schedule. The placement in the Walmart stores are genius selling phones , phone plan for less is very smart and reasonable for people how can not afford the more expensive phones but can get all the technology. I never worked for SalesForce, I used Salesforce when I was representing Schutt Sports as a time management assistant. Schutt Sports had all of their sales reps use it to help make notes on meetings, set up appointments. Salesforce has an interesting created culture that takes some time to adjust to.  It can be super high-stress at times but that balances to a certain bit with opportunities.  It's a great place to learn. I do love working at Salesforce. The company culture is great and the company has amazing products. Someone told me when I interviewed that there are 2 cultures here: 1 of the company, and 1 of the sales organization. That turned out to be very true. The sales culture is that of Oracle and is very white male with no diversity in my management chain. The overall company culture is better. Salesforce is too metric driven.  We find that instead of focusing on giving our customers complete service we have to rush to meet numbers.  This also stifles learning. I'm very happy to have at worked at Salesforce for as long as I have - over 3 years now.  However the company and culture has changed and unless you're under 28 or new to sales, and trying to get some experience at a splashy resume name - stay away. As with many companies that grow so quickly, the culture has been diluted and employees take a back seat to profit and sales. The company will need to be mindful of retaining managers that are ruthless in the treatment of their employees. Very good company to work for and they had very good employees. A lot good of products and some great customer. I was hoping to retire from this company. Compared to smaller places that I worked for in LA salesforce is a breath of fresh air. The compensation, benefits and work-life balance plus the caliber of people who work at this place is hard to find. The code is written nicely and has comments and is as clean as it could be given the infrastructure and size of the systems that the software needs to be able to handle. Awesome place to be at. A lot going on and you feel like you're in the center of it all. Place you're literally in the center of it all. I would wish there were more free food though =/ It has a great company culture and great work environment. Definitely a place where you can move up the ladder and grow internally within the company as well. Every company likes to claim they have a greta work environment but here at Salesforce its the real deal, You can literally meet anyone at any given moment, walking down the hall and introducing yourself.  From the past experiences of my colleagues this would't happen anywhere else, you'd either get a awkward hello or get brushed off. I gained good experience and good work skills but the ending was a negative experience that could be avoided.  Gained valuable skills and experience and provided a desire to do more within the ecosystem. Working at Salesforce, you see the future of IT and industry in general. The workculture has become corporate, with time, but this does not take away from the 'fresh IT world' burgeoning from San Francisco. Demand is strong, IT collaboration must be powerful during mergers, and your teams must feel satiated and not burnt out. I utilized the Salesforce platform while working for the charter organization KIPP. During my time at KIPP, Salesforce was a daily part of the vocation in relation to data tracking, and upkeep of pertinent student information. Incredibly demanding yet equally rewarding company to work for, fun culture with plenty of opportunity for grown within the company. Working remotely can be challenging to connect with HQ Salesforce is a great company to start your career. Very positive environment and a lot of growth. Great training are and management super supportive. Even tho I was a contractor I enjoyed my time at SalesForce. Everyone was very helpful if I had a question I could ask anyone and it they did not know the answer they would direct me to some one that did. The hardest part of my job was it was  repetitious other than that it was a great place to work Salesforce, Inc. is an excellent place to work.  Like most, the quality of your day to day work life and delivery expectations are made or broken based on your direct manager.  I have the best manager I have ever had in my career.  In general the culture is high achieving, and makes do with less in the field than in HQ.  I successfully lead a large distributed team, and they are easily the best team I have ever worked with in my career. The only downside is the lack of real meaningful career advancement opportunities for managers outside of San Francisco. If you are not *in* the Headquarters club of managers you have little to no shot at meaningful career advancement. Good place to get advanced knowledge at salesforce. Always encourages employees to come forward with there own ideas. Gives freedom to think out of box . Fun, loving place to work a typical is working with peers and keeping very busy at the desk. Tons of team coordination. The day flies by and it seems like I never get anything completed. •	Analyzing, organizing and entering data through SAP to maintain transactional accounts within Axalta.o	Maintaining the Outlook databases for Maaco and CarMaxo	E-filing and organizing billing orders and emailso	Communicating with suppliers as well as retail stores. o	Enter high volume of data (within deadlines)•	Answer  calls for which I am responsible for helping customers•	SalesForce.com utilization The first 4 years of Salesforce was amazing. Then, the focus was on revenue and utilization and not helping customers. Making my last 2 years not as enjoyable. Lunch & Learns happen once or twice a week for interns to learn from executives at the company. Interns can take part in volunteer time off, which is paid volunteer time that you can choose to take part in with other employees on your team. Fantastic company to work for but probably stay away from sales if you're iffy about it. Management only cares about numbers (it's just sales though, not salesforce in particular).Great snacks (wish it was free meals but hey, cant have everything!)The BEST cultureGreat leadershipTons of room for advancement Daily items that need addressed; alot of ad hoc things to do-anything from reports from salesforce db to assisting other daily business needs. help with event planning Salesforce probably has the best work/life balance you could find in the industry. However, depends on your department / senior management, your advancement could be jeopardized by favoritism, unfortunately. Working in salesforce as a software developer was the most satisfying job opportunity. The work environment is excellent and quite. You can work in a relaxed manner having ample opportunity for development and research. People working here are put to different platforms so that they can get exposure of different type of work. Salesforce is a great company with a titan of a name on your resume. Great people and a good culture help overshadow the fact that account executives are vastly underpaid compared to 99.9% of other companies. The skills you learn as a sales person are invaluable, just be prepared to work 10-14 hour days in order to make any kind of money. I worked at Marketing Dimensions.  Liked the people that I worked with. I was hired after staying home with my children for 12 years.  Great start into the work force My time at Salesforce was brief, but very pleasant. Though the work was hard, the environment was wonderful, they really make sure they take care of their employees. Salesforce is an exciting place to work that provides great exposure to cutting edge technology. There are incredible things happening in the company focused around artificial intelligence and automation. Maintain Salesforce user, profile, role.Create Reports and dashboard.Maintain Data integration process.Create new objects, Apex class, test scripts, validation rulesCreate workflow, approval process, email notification Come with experience if you'd like to advance in your career here. Do not expect anyone to hold your hand and teach you the ropes or you'll be disappointed. Your experience can differ based on the team you're on and who your manager is. Sometimes if you're lucky  this could actually turn to be a benefit rather than a negative. I recommend that you interview the people and really ask questions to gauge if the culture is a right fit for you. Ohana, this means extended family in Hawaii. After being at Salesforce for the past two years, this is anything but a 'family' environment. This company is as cutthroat as any other software company. Salesforce used the latest technologies allowed autonomy and used SCRUM for building small teams to reach it's incremental goals of delivering software via it's pipeline Learnt new inhouse scrum techniques useful for further job. Hardest part was too much attrition at all levels and difficult to keep up.  Good food etc High Performance Environment with fuzzy metrics and kpis. Results driven, must meet numbers at any cost even at the risk of burnout. Many great perks and benefits. No clear career pathing. People are both great and terrible depending on role/dept. Loved every minute of my experience working as a contractor. Its my dream job and career. Excellent resources for learning platform and growing career path. Way To Go SFDC and SFDC99!!! Salesforce, Inc. is an excellent place to work.  Like most, the quality of your day to day work life and delivery expectations are made or broken based on your direct manager.  I have the best manager I have ever had in my career.  In general the culture is high achieving, and makes do with less in the field than in HQ.  I successfully lead a large distributed team, and they are easily the best team I have ever worked with in my career. The only downside is the lack of real meaningful career advancement opportunities for managers outside of San Francisco. If you are not *in* the Headquarters club of managers you have little to no shot at meaningful career advancement. Good place to work. I learned a lot and got to work with a strong team in our San Francisco office. They care about culture, work life balance, good benefits. Salesforce culture is unique in that it fosters collaboration in a transparent, community setting.  The company truly believes in  'living our values'. No work/life balance. Get guilt tripped or fired if you use your PTO. High annual projected salary, but barely ever paid commissions. Maybe a different department would be a different experience. Surrounded by great people who really support you and want to help you accomplish your goals, fulfilling and rewarding work, positive work environment, freedom and flexibility to innovate and take risks. Salesforce offers a very collaborative environment for sales professionals. Everyone is willing to help you close a deal. I would highly recommend Salesfoce as a company to expand your cloud technology selling skill set. In Hawaiian culture, “Ohana” means family; it's the tie that binds people together. Our Ohana is built on four core values that inspire us to work together every day toward improving the world. Great company all around! Great work life balance, bright people, great benefits. I cant speak highly enough of the company. A pleasure and best off the CEO is a great human being. Beautiful downtown Bellevue office. Salesforce touts itself as one of the best companies to work for, there are many employee perks. Fitness monthly benefit, good health insurance, most teams have bonuses (but watch out, sometimes its incredibly hard to meet your bonus), gym in building, free company swag, reimbursements for things like BOSE headphones, etc. Teams are a bit disconnected, largely because there are a large amount of remote workers across the country. Hardest part of the job was having a new manager every 2-4 months and never meeting that manager in person. Expect to use online chat a lot (google hangouts) and almost never log off.  There are many extra bureaucratic hoops you will be expected to jump through, many online trainings to complete. There is a lot of red tape and bs. The culture is the hawaiian 'ohana' which means family, but it can be a little much. Look up Ohana Salesforce songs on Youtube to understand. The cons are that there are limited career progression options, especially in the Bellevue Hub. There is a lot of 'throwing people under the bus'. Hard to trust people, even though Salesforce says their #1 value is trust. really fun place to work with really nice people, a great 'get things done' environment . There was a really nice cohesive feeling in the office and the team in general felt like we were all friends As an Executive leader I had to put in a ton of hours and it affected. Put in over 80 hours per week for the first 2 years. Did get a lot of recognition for work completed. Awful. Felt like high school. Cut throat environment, manager would belittle peers in front of you, so you know they did the same about you when you weren't around. You're only allowed to log 40 hours a week but work closer to 60. Volunteer opportunities are 'voluntary' but you get criticized if you don't do them. I was a contractor while the Sales Compensation Manager went on maternity leave.  I was schedule to stay for 6 months but was extended to 12 months.  It was a good place to work. Salesforce is a fantastic place for top-notch professionals who want to be on a winning team. The company focuses on trust, security, and providing customers with the best service in the industry. The benefits and perks are great and the people are even better (amazing, bright, friendly, and forward-thinking.) Corporate culture fosters a team building atmosphere where everyone is willing to help you. Salesforce is definitely #DreamJobCentral. Salesforce is a rated as one of the best companies to work for because of the great work life balance, great benefits, and wonderful Volunteer program. Salesforce is a fantastic place to work right out of college, but it's not geared towards professional business people. Age discrimantion is the norm and the culture is more like a frat house than a corporation. The company is always hiring due to the massive amount of turn over. As an intern, you had access to some of the best talent in the industry. The company is dedicated to its employees and there are plenty of opportunities to grow. They treat their employees extremely well. Always celebrating fun events, always supporting charities and volunteering, always felxible with parents and amazing benefits When I started working there, I was completely unprepared for the 'friendly-ness' of the work environment.  The coworkers were really nice, and the facilities were chock-full of comforts and amenities.  They really seem to be placing an emphasis on keeping the employees happy to be there.  Too bad it was a temporary position. Amazing company to work for .It's a fast paced organization with chance to grow within organization. Been with Salesforce for 2 years and never found a reason to work for other companies Not a bad place to work if you really like sales productivity software, which most people would find rather bland. Well-crafted and well-planned PR/marketing (see:Dreamforce) makes the company and its product seem like it's saving the world, when Salesforce is really profit and numbers-driven company and also works with many companies that are not exactly in the 'saving the world' camp. The company is huge, and there's a lot of self-congratulatory marketing and PR being pushed down from on high all the time. Lots of companies also acquired without their people being fully on-board with the product and way of working. Salesforce, Inc. is an excellent place to work.  Like most, the quality of your day to day work life and delivery expectations are made or broken based on your direct manager.  I have the best manager I have ever had in my career.  In general the culture is high achieving, and makes do with less in the field than in HQ.  I successfully lead a large distributed team, and they are easily the best team I have ever worked with in my career. The only downside is the lack of real meaningful career advancement opportunities for managers outside of San Francisco. If you are not *in* the Headquarters club of managers you have little to no shot at meaningful career advancement. Great experience!  Company is great at promoted the product to customers.  Made great money but paid a price.  Very stressful with monthly quota.  Know what you are getting in to. Quick paced and results-expected but very collaborative, open, supportive environment to work.  Benefits and culture support work-life balance where you can get behind and believe in the company you work for. Long hours, toxic culture in CSG, no advancement. Good teams to work with for the most part, but don't expect management to support your advancement goals. Only concerned about themselves. I do not choose to comment on my employment at this time. Salesforce is my current employer and I am currently open to new opportunities in the bay area. I enjoyed the job and the environment. I learned a lot of things and was able to teach what I had learned. I did the configuration of sales force software, based on the customers needs. This requires high customer service skills, such as listening, comprehension, ability to solve problems to make the customer happy. My favorite thing about working at Salesforce was the way they gave back via volunteering. Salesforce has a foundation with a list of great organizations you can volunteer. They made it so easy they even pay you to take the time to give back if your doing it doing work hours! Amazing I say! Great experience, you really learn a lot. Some teams have better culture that others, just like everywhere. My co-workers were mostly great people always ready to help, communicate, collaborate. BUT when it comes to managements it is exactly the opposite - everything is done behind the closed doors, no transparency, decisions are made based on personal preferences, not on results or analysis. in a word - people who scheme and pretend to be always busy always advance and grow. Those who actually work and deliver results (hence don't have time or desire to scheme) - oh well. Go past the Salesforce image of a great culture and collaborative environments with lots of feedback, and there's still the work, which comes fast and furious. Salesforce is not for those who cannot function in a whirlwind, always on the go environment, but those who work thrive under pressure will love the opportunities and challenges that come your way every day. Also, a company that truly walks the walk and talks the talk when it comes to diversity, equal rights, equal pay, and total inclusion. Once they began implementing mandatory 'unconscious bias training' was when I knew that Salesforce was no longer the company I signed up for. There have been many outright bans on items in the office. It is now a completely corporate atmosphere instead of the 'bro culture' I once loved. great place to work and a lot of room for improvement.  Learned a great deal and all workers were willing to provide help when needed.  I would recommend this company. Despite all the hype about Salesforce, there can be a large disparity of responsibility. Some teams had time to spend doing volunteer work during the work day and playing pool or ping pong in the lounge. I didn't have those luxuries. So a positive experience is dependent on the team. Also, if your management team is located in a different city, then you are at greater risk for a negative work experience. Working in Salesforce's Commerce Cloud Support team, there were a severe number of Management-related issues that were addressed by numerous employees and had no resolution or further discussion engaged by the Management team.Job and clients are nice to work with, but the work became stale once faith in leadership was lost and the direction of all employees in the department was geared towards attrition. Work environment is great. Good training for new employees. Management helps when needed.Company Employee environment is call 'Ohna', and they believe in it.Pay is good. There is not separation in departments, everything is done as a company and not department. A day in the life of a Salesforce intern was pretty simple. They expected us to come in on time and work on our projects for the summer and collaborate with our team. The culture was very good, a lot of fun and very supportive. The hardest part of the job was feeling like you were doing work that actually made an impact. But the best part was the work life in general, very balanced and you feel like they really value you. Fast-paced environment, flexible schedule, great benefits like VTO (volunteer time off), WFH (work from home) and a fun and welcoming culture. There's a reason Salesforce continues to be voted a top employer time and time again. Great company, exceptional culture and great people around. Lot of fun and work life balance is top notch. Compensation part can be better but overall really nice company to work Salesforce is the world’s #1 Customer Relationship Management (CRM) platform. It's cloud-based applications for sales, service, marketing, and more. It offered a dynamic and exciting workplace culture. A typical day included a pretty steady flow of work. Minimum down time but enough time to be productive task wise. The workplace culture placed an emphasis on work/ life balance. Overall it is a great place to work. Great people, and benefits. Really poor management, and spending. Poor alignment of talent with work. You won't be heard unless you have been there 5 years or are a Sr. VP. Management was good at setting goals for the group, and decides what work needs to be done to meet those goals. Management was good at dividing the work into manageable activities, and selecting people to accomplish the tasks that need to be done. Salesforce, Inc. is an excellent place to work.  Like most, the quality of your day to day work life and delivery expectations are made or broken based on your direct manager.  I have the best manager I have ever had in my career.  In general the culture is high achieving, and makes do with less in the field than in HQ.  I successfully lead a large distributed team, and they are easily the best team I have ever worked with in my career. The only downside is the lack of real meaningful career advancement opportunities for managers outside of San Francisco. If you are not *in* the Headquarters club of managers you have little to no shot at meaningful career advancement. I've never worked at Salesforce. For some reason I cannot submit my resume on this site until I rate Salesforce - which I've never worked. for. However I have talked to many that have - a great company indeed. I started working as data entry,very friendly and supportable colleagues helped me to enhance my knowledge for salesforce.comworkplace culture is very nice Great Culture. Great Platform. Great Customer. Great Outcomes. It is a pressure cooker, but, if you have used a pressure cooker, sometimes it is the only way to cook ;-) I'm honored to serve as a board member of the salesforce partner advisory board. Salesforce is clearly at the forefront of bringing technology to the retail space in a way that no technology has to date. Being a member of their board and having access to learn more about their perspective on the industry has been a pleasure while representing the needs of their growing partner network. Worked at the New York office, it lives up to the hype of being the Forbes Top places to work. A great mix of fast paced, challenging projects and smart people along with a cool, fun culture. You are allowed to have a voice and an opinion regardless of title or rank and despite the crazy work schedule, the 'fun' vibe balances things out. Met some of the smartest people working here. Company is on the rise and would recommend to anyone willing to work hard and have fun at the same time!PS: Ohana is real. Best Company to work for. Had a great experience working there as an intern. Great manager. Work-life balance is also very good. The company is very flexible and everybody at it is great. I loved working here! It is by far the best company I have worked for. I would say if you have the chance to even take a temp opportunity here, I would take it! I was doing my own sales as a consultant for small business' in my area.  I did phone, and internet sales for the companies at a rate determined on the work required. The tech-startup culture is long gone at Salesforce. Still has great benefits and pay, but the top down 'follow these rules and don't ask questions' feeling is quickly creeping up. The best part of working here is the availability to work a flexible schedule.  They try to create a work/life balance when possible.  I have improved upon my customer service skills. The work place culture is amazing. Everyday work starts with a challenge. It was  the perfect place as an Intern to start my career Learned many things and would recommend salesforce as a definite place to work. Should be able to:Manage users, data, and securityMaintain and customize Sales Cloud and Service Cloud applicationsBuild reports, dashboards, and workflows Support department is run like a Sales department with cut throat culture and obscene, unrealistic metrics to obtain.  Focus is not on helping the customer , but rather jumping through a number of hoops to obtain the metrics necessary for management to see on their Dashboards.  Work/Life balance gets a lot of lip service, but everyone knows is a joke.  Stress and overtime are a constant. I've enjoyed every minute of learning and working at Salesforce. The opportunities for networking and support for career growth is at the core value of its brand. Typical work day goes by pretty quick.Lots of opportunitiescan be stressful but managers well well with everyone to make sure everyone is comfortable.Lots of great amenities and great culture with the people. Some ppl make it, some ppl don't. Some territories catch fire, some stay cold. Some managers are much less militaristic, some are more. Doesn't matter what the issue may be there is someone underneath you working themselves to the bone for a shot at your spot. Targets are high and difficult to deliver on. Not for the faint-hearted. Typical day at work was pretty busy most of the time but i was always smiling and do it with my best, great place to work but i had to move, it was a great company. Not sure why this program thinks I worked here, because I didn't so I am just typing to fill the character quota and move this thing on to the next step. The person who was supposed to train me was uncooperative and didn't want to share or train me properly. I had zero assistance from management and there was days I had nothing to do and was left to twiddle my thumbs while I tried assisting other departments as best I could. Great company and culture but my direct colleague/supervisor was impossible to work with. I felt I wasn't needed at all and wondered why I was hired. It was unfortunate but again, the company and culture was great. Doing this as a side job where I get to work from home, and choose my own hours. I have weekly meetings with my supervisor to get updates with my current project Salesforce, Inc. is an excellent place to work.  Like most, the quality of your day to day work life and delivery expectations are made or broken based on your direct manager.  I have the best manager I have ever had in my career.  In general the culture is high achieving, and makes do with less in the field than in HQ.  I successfully lead a large distributed team, and they are easily the best team I have ever worked with in my career. The only downside is the lack of real meaningful career advancement opportunities for managers outside of San Francisco. If you are not *in* the Headquarters club of managers you have little to no shot at meaningful career advancement. This job could keep you up at nights depending on which department you are working in. Overall the company compensates you great but has found very stressful methods to keep employee on their toes. Easy day to day activity, Non- Profit. The most enjoyable part of the organization are the people. Management can use some work. No sense of Culture. I have learn new skills from employees. Please note that my time at Salesforce was a contractor. In many ways it was one of the best jobs I've ever had, but it definitely wasn't perfect. I don't regret one moment there, though I wish some things would have gone differently. Salesforce is an exceptionally relaxed and fun place to work. My team was a close-knit group of friends that often did fun activities together, and at the same time delivering a great product. Thing 5 was not my favorite place to work, 15 year old start up that couldn't get their ideas and vision together, management style was fear and intimidation Its good and more fun  to work with salesforce ,This Cloud CRM has a bright future and good opportunity'sMy company is one of the best place to work with,good working environment. I had deadlines like any other job but I didn't feel stress when trying to get them done on time. The projects and tasks that were assigned were things I had fun doing. Management was petty, condescending, arrogant, and childish. Insinuations were made regarding females and their role in the IT work place and quite frankly, I regret every second I spent there. Great people and a variety of teams to work with. Management needs leadership help. Lots of workers changing teams due to seniority with no experience. Team does not take new perspectives and feedbacks into consideration. Excellent place to work. Encourage volunteering. Excellent training. Encourages career advancement. Impressive work environment. Innovative development platform. Nice feeling to not be micromanaged, but their is politics within the company. Very fast paced, always something to do or someone to help. Days go by fast and rarely bored. Loved working in that office, with startup environment, great teams to work alongside and connect with. Learned something new everyday and overall a great learning experience. Great benefits/ salary, workplace culture and work environment. Supports career growth and cross company collaboration. Free snacks and many salesforce discounts. Loved working at Salesforce.  Worked there for 6 years and saw amazing growth.  Internal competition across product lines and teams becomes too much.  Unfortunately concerned more about grown then doing the correct thing for customers and employees. company with strong culture. rewarding and fun company to work for. lots of perks (games, parties, swag, stocks, time off, benefits, snacks, etc...) would recommend Salesforce is a great company to work for.  However, the commute to SF can be very draining very quickly, I wish they had an office further south.  Additionally, depending upon the group, the hours can be long and interrupt-driven. Exciting place to work.  Single focus on the Customer.  Innovative and fast paced, with intelligent and motivated people to help swarm around deals.  Great workplace culture. Very people orientated and a nice place to work. I learnt how to deal with customers in a more constructive way. The management was helpful and worked well. Workplace culture in Cyient Inc was great I have been with this company since 2 years. All the employees irrespective of religion, region are treated equally and working over here was always fun. Salesforce gave me a great opportunity to build my network and learn how to work in a professional environment at a quick paste, everything is changing Salesforce, Inc. is an excellent place to work.  Like most, the quality of your day to day work life and delivery expectations are made or broken based on your direct manager.  I have the best manager I have ever had in my career.  In general the culture is high achieving, and makes do with less in the field than in HQ.  I successfully lead a large distributed team, and they are easily the best team I have ever worked with in my career. The only downside is the lack of real meaningful career advancement opportunities for managers outside of San Francisco. If you are not *in* the Headquarters club of managers you have little to no shot at meaningful career advancement. Salesforce is a good place to work. And trust me, they tell everyone about it. The problem however is:- Outside hires get treated differently than long time employees. - SF does NOT like to be told there are better ways to do things. - People just bounce around from other roles into new roles with no experience, then act like they know it all since they've been around forever. - Because so many employees are lifers, outside points of view are non existent.- Every project is the biggest priority and must be done in 1/4 the time that most companies do it- SF makes huge bones about their culture, but because of the constant rush to hurry up, you end up having no life. Great place to work overall. Great leadership and support. One of the most diverse places to work in the world. Great culture and encouragement at the workplace. You can feel left out when you're a contractor and is seems like people really don't know the rules on how to treat a contractor.  They don't include you in meeting that seem to be important for the role I was in and it made it difficult to understand what was going on. This is such a great place to be I don't even know what to say! There are no cons, simply all pros to working here. I hope the best for this company in the future! My personal executive was an inspiration to me and others in the org.  The hours were very long and work life balance not respected.  High turnover, the global hours were grueling.  Lack of advancement. Compensation is above other companies, individual contributors are often responsible for all the work, but do not get the credit. Leadership and management needs to do better with communication. As a high school student I thought it would be hard to work in such an outstanding company. Everyone is joyful and it's overall a trustworthy company. If you want to innovate, don't go here. Start your own company and get bought. Some real basic stuff at Salesforce suffers from NIH syndrome, and the royalty of development gets credit for inventing fire and water. Seriously, when it comes to basic engineering tools, SFDC would rather buy hydrogen and oxygen, and make water themselves than open a faucet. Also, developers will steal credit and your lunch. On the positive, you will make a ton of money and most people are really nice. Fast ever changing environment, lots of travel. best trade show schedule. Very exciting lace to work. So much technology to learn you are always being trained. The company culture is awesome and people are very comfortable to work with in my group. Company let me have a work life balance. I worked with lots of talented folks around me. Absolutely the Best company I have worked for and I worked for a company for many years and thought it was the best company I had worked for but AvidXchange far surpassed the best years at the former company I worked for. AvidXchange values their employees and values their employees inputs and new ideas. They invest in the employees. They continuously offer and give training on professional development, and for your … Great Atmosphere you never clock watch and rarely do days drag on. It is a young fun environment. You can make a lot of money if you are willing to work for it. Would recommend to anyone Excellent platform to develop your skills and enhance your knowledge.Place where there is a work balance.Excellent team culture which gives a great balance. Good working environment. Good benefits and technical challenges.Equality in the work place. Good central location and philanthropy. Approved of the good work the CEO carried. out If you are at the top of your game, and looking to work alongside a peer group that motivates you to be better every day, Salesforce is for you. If you are looking to be challenged and grow professionally, and  If you desire to feel valued and recognized for your contributions, Salesforce is for you. I decided to leave salesforce.com when my wife and was offered a teaching job overseas. My manager along with his manager worked hard to find a remote position for me in China but were unable to do so. Great company. 10/10 would go back Great company to work for I would highly recommend it. I have only had the best experiences being there. The culture of the company is phenomenal. Apply The culture was awesome. The territories were really chopped up that made it hard to really blow it out. They offer excellent process. The holiday parties were off the charts! nice and good of working •	Designed, developed and deployed custom Salesforce applications software using APEX Classes, Controller Classes, Batch APEX and APEX Triggers for various functional needs in the application During a typical work week, one of my biggest tasks is checking in on my staff and assessing their progress on various projects. I like to meet first thing on Monday to discuss our priorities for the week, then meet again in the middle of the week to check progress, and meet once at the end of the week to discuss goal setting for the next week Salesforce, Inc. is an excellent place to work.  Like most, the quality of your day to day work life and delivery expectations are made or broken based on your direct manager.  I have the best manager I have ever had in my career.  In general the culture is high achieving, and makes do with less in the field than in HQ.  I successfully lead a large distributed team, and they are easily the best team I have ever worked with in my career. The only downside is the lack of real meaningful career advancement opportunities for managers outside of San Francisco. If you are not *in* the Headquarters club of managers you have little to no shot at meaningful career advancement. I would Image 6 Mac laptops within a day for new hires. Worked with other techs to make sure that all tickets have been updated within 24hours. I learned alot about the casper Imaging system for Macintosh computers and also Imaging Linux on HP Desktop computers. Daily work is not tough; Very strong scrum team(generally director level scrum master and product manager). Compensation is good and transparent for engineers. Cross team communication is not very easy. Learned a lot about SaaS computing.  Great training, lots of parties, and you got to run you territory as if you were CEO. There were a lot of politics in management.  Learned a lot about sales process. Payed a lot, but didn't learn terribly much and didn't get much performance feedback until right before I left.Never got much work, which is good and bad (pretty normal for internships) Salesforce is awesome as a company. Did not enjoy working under my manager. It's a shame how one manager can make working in an awesome company, an unsatisfying experience. Salesforce is a fast-paced culture with many moving parts.  It requires someone with the drive to make our products as successful as possible for our customers.  I've learned a lot about integrating enterprise software solutions at Salesforce. My time here was very short, only two weeks actually. I got this job through family, and was working to help during the busy holidays and converting into the new year. SFDC was a wonderful company to work for.  Great people, good pay and benefits, always a challenge.  The company was also very philanthropic with lots of opportunities to give back Fast paced organization that is a leader in all markets.  Marketshare is growing, and SF seems to be the standard for CRM now, with more solutions to offer. Salesforce has a great platform and company workflows to allow the team to be very productive.  Great planning (V2MOM) and outstanding solutions from sales and service to marketing. This was a great place to work and learn. The people are very knowledgeable and are excited to work everyday. I learn a ton about customer service and all of the components that go along with it. amazing companygreat culturegreat peopleamazing productshave never seen a company that cares that much about customers and customers' success Fantastic place to work where everyone is excited, everyday, to come into work. Work subject matter is interesting and upper management strives to keep you engaged and rewards hard work. Great opportunity to learn something new everyday.  The company offers great benefits and the access to self guided learning if you can find the time.  The work is complex and you are encouraged to be creative Very nice work -life balance. Nice people to work with. Cool offices. People are fun. Very fun culture..... This is fun! Nothing bad to say. Typical work day - make 80 -100 callsLearned how to work/build a book of businessWork place culture is okay but could be better. Hardest part of the job is being in the cube all day. Amazing on boarding process and great technical training. Your territory which changes every February can either make or break you. Over I was very happy with my time at Salesforce. SFDC is a company that has energy and good culture. The company treats employees well with competitive salary and perks and prides itself with the 1/1/1 charity model, which I think is pretty outstanding. I was able to work with Salesforce and some administrative and developer privileges to do some work for a online banking company. Hardest part of job = no mentoring, no training.Enjoyable part of job = social activities, emphasis on volunteer workSome co-workers were difficult to work withMultinational company = time difference and many late nights and early morning calls. Salesforce, Inc. is an excellent place to work.  Like most, the quality of your day to day work life and delivery expectations are made or broken based on your direct manager.  I have the best manager I have ever had in my career.  In general the culture is high achieving, and makes do with less in the field than in HQ.  I successfully lead a large distributed team, and they are easily the best team I have ever worked with in my career. The only downside is the lack of real meaningful career advancement opportunities for managers outside of San Francisco. If you are not *in* the Headquarters club of managers you have little to no shot at meaningful career advancement. From the perks to the people, Salesforce is an amazing work environment. Everyone is not only extremely smart and creative but also very friendly and helpful. The CEO is also very inspiring and supports causes that I also care about, such as equal rights and pay. the company is really amazing but on the management level it was a bit chaotic as the company was growing so fast and was lacking the process and clarity on manager roles and boundaries I use SFDC at least half the day.  It is a great tool with contact Management. It makes sales easier to keep up with.  I like being able to import other applications in as well. Salesforce is an awesome company to work for. Although I am contracted I fell in love with the Ohana family. The environment is fun but still everyone comes in ready to work and meet their goals. I would definitely want to grow with this company. -enjoyed taking on leadership and management position. -learned new work ethnic skills -great team members -met amazing new people and learned how they started their work to now. Excellent Sr. management has propelled Salesforce into an industry leader. Company provides generous benefits; opportunities for advancement. Much expected of an individual. Good balance of work and home life. A typical day at work is a mastering experience. I've learned to be very detailed work and look at things more analytically. In most cases management is very empowering. Co workers are very outgoing and friendly. Everyone has a teamwork attitude. The feeling you receive when entering Salesforce environment is a one big happy Ohana (Family). Amazing industry with great growth potential. Hardest part of the job is management and changing dynamics of roles. Company culture is sometimes not what it seems. Salesforce company culture, benefits, work/life balance and flexibility are pretty good.  There are certain areas within Salesforce that are much better than others (R&D/product side of the house, HR, etc) seem to be run very well, care about their employees and have great career development in place.  IT, has the same benefits, but lacks both the career growth/development opportunities, and positive management.  I'd suggest if you are considering Salesforce and are technical go to R&D and steer clear of IT.  Otherwise, loved the culture and environment. Have good experience everyday.Learned new subjects.Has a great management.Good friends to find.New things to learn all the time. Amazing peopleAmazing projectGood cultureFun and WorkHardest part : nonemost fun part : always new things, people have visionlot of internal growth opportunities The company will take care of its employees and it's fostered a very positive work culture, perhaps the best I've been part of. Great platform. I have worked on it less than a year ( a few months) .Great to create your own canvas apps. I l love it. Planing to be a certified developer. Great place to work.  However, in my role as Senior Solutions Manager, I needed to be on the road to client locations around 90% of the time. Excellent product , nice work culture, wonderful people. Love my job but company moving to a different product and replacing Salesforce Every day is a tiring but rewarding day when I was with salesforce. The whole salesforce team collaborates well and interact with everybody. Which made the management a pat on its back People are self-driven and always willing to help. Great company to work for and lots of trainings to learn from.Company's Ohana is great. Work on Salesforce database. Tasks depend on the specific project you are working on. flexible on arrival time, as long as you put in your hours and get the job done. Full cycle recruiter that has worked in many different environments.Good Co-workersFilling jobs both perm and tempFinding candidates Salesforce is an amazing opportunity to learn about the world of information technology in the cloud. There is an incredible steep learning curve and bombardment of information however the longer you stay the more you start to grasp significance and advantages of each vertical. Salesforce is one of the best companies to experience and they have upward mobility for anyone willing to work for it. Salesforce, Inc. is an excellent place to work.  Like most, the quality of your day to day work life and delivery expectations are made or broken based on your direct manager.  I have the best manager I have ever had in my career.  In general the culture is high achieving, and makes do with less in the field than in HQ.  I successfully lead a large distributed team, and they are easily the best team I have ever worked with in my career. The only downside is the lack of real meaningful career advancement opportunities for managers outside of San Francisco. If you are not *in* the Headquarters club of managers you have little to no shot at meaningful career advancement. Great company with really good intentions. However, they want/need to expand exponentially and that leads to a little confusion. Lots of resources (maybe too much) and some overlap which can lead to confusion. I felt that it was almost becoming a production line and this left little room for creativity and also to 'find your fit' from a personality perspective. Great company to work for. Great learning experience with trainings and company culture.Lots of room for growth and ability to move within the company. Employees are treated very well. Work hard and play hard attitude. They follow there 1/1/1 philosophy. The employees are well diverse. Everyone is nice and kind. A typical work day at Salesforce consist of emails, meetings, written communications, and networking. In my role, I learned about leadership such as event coordinating, volunteer coordinating, public speaking, and being resourceful. The work culture is very diverse by age, cultural background, and education level. The most enjoyable part about Salesforce is that it's a company that's an advocate on volunteering and philantrophy. They encourage employees to give back to their community or a nonprofit organization. I've never heard of that concept until I worked for Salesforce. It is a great place with very smart people. There are many opportunities in this huge and still growing company. Great 1:1:1 model and success platform. I implemented 5 Documentations to Sales and Marketing Executives  to understand Renewals Business Processes. I managed 7 projects on a tight deadline. Exceeded the pipeline expectations. I am a certified administrator. I have access to administrate customers and users profiles. This is a great team and company! Team is very easy to work with and there are plenty of interesting and engaging projects to work on! Great work culture, snacks and drinks provided, great office buildings.management was disengaged due to being located in Ireland for follow the sun support purposes. He didn't communicate well with our US half of the team, focus and training happened in Ireland where most of the staff for our operations sat.great company over all! Salesforce is a good place to work. Fun, smart and energetic co-workers. Long hours and they expect you to get results. Lots of sales enablement training. Lots of travel with no reward. No partners to deliver solutions and no sales engineers to drive deals. Product set was not managed well and customers fell through the cracks. Management was non-existent. Co-workers just going through the motions. Hardest part of the job was convincing people on the value of the platform. Most enjoyable part of the job was working close to home. I think Salesforce is a great company for what it stands for in cloud commuting.  Only constructive feedback that may turn people away is that the contractors are not treated equally as their full time employees. Great opportunity to learn the field of marketing and promotions. Great chance to explore consumer demand and promotional brand marketing. great culture, good poeple to work with and nice work / life balance. pay is ok but great benefits. not much spendings on IT operations. Salesforce.com Inc is a strong advocate for healthy living for the members as well as its employees. Salesforce.com Inc holds exercises, yoga sessions open for members and workers. The cafeteria is also monitored to ensure they sell healthy items for its patrons. Salesforce.com Inc is also a huge advocate for the environment. It has campaigns and teams to help members and workers to be more 'GREEN' and environmental friendly and proactive. Salesforce.com Inc is living it's mission and vision statement. This is one of the best companies to work for. They treat they're people well. The co-workers are great. The most enjoyable part is the clients they find for you. Salesforce is a great place to work, with overall great people and culture.  I was able to learn and develop many sales related skills while working with talented colleagues and managers.  I would recommend Salesforce to anyone who likes tech sales. Young and energetic company with good product, very involved with social activities and helping the community.  Great location in San Francisco. Assigned to start one month, lasted several more. I loved the enironment, co-workers and the work was paced and taken care of. I took this position with the hopes of having a better defined career path. A typical day in Platinum support revolved around fixing client issues. Training for using the tools in Platinum support was not well defined and left some of the new hires flailing when it came to supporting client needs. I was there for over a year and still did not feel like I know what was going on. They are a great company to work for and their products are the best in the market.  Be prepared to work hard and long as they are all focused on being successful Salesforce, Inc. is an excellent place to work.  Like most, the quality of your day to day work life and delivery expectations are made or broken based on your direct manager.  I have the best manager I have ever had in my career.  In general the culture is high achieving, and makes do with less in the field than in HQ.  I successfully lead a large distributed team, and they are easily the best team I have ever worked with in my career. The only downside is the lack of real meaningful career advancement opportunities for managers outside of San Francisco. If you are not *in* the Headquarters club of managers you have little to no shot at meaningful career advancement. Overall, co-workers at Salesforce are great. There is a friendly and welcoming environment. Work tends to be very specialized. Salesforce is an excellent company.  The are both employee and customer focused.  My job was to build a value selling team that could work with the largest and most complex sales opportunities.  I was very successful in this role.  I built a multi-tiered value selling capability that supported both small and large opportunities.  We leveraged an offshore capability in Ireland.  My final assignment was to develop the APAC market.  This was the last global team to establish. it is very  good day to have an knowledge at work for which we have learned a lot. we have a very good time with the other workers. Good Work Environment with some quality folks. I like the location and work ethic in this company. The most enjoyable  part of this job is to work from 8-5PM, so I can manage to go home early instead of staying until 6PM. Contrary to popular believe working here feels like nothing special.  In IT, the management seems detached, roles are often unclear (at least in my experience) and business partners are hard charging.   I have found it hard to feel inspired or wowed.  On the plus side, Dreamforce is impressive and fun.  Benefits are good. Extremely quick paced and innovative place to work!  Management is very helpful and truly want you to get better everyday. Extremely challenging project with strict timeline and heavy work pressure.I worked as functional lead. My responsibilities in this project was as below ( but not limited to)1)  Client Management.2) Technically drive the solution.3)  Requirement Management. 4) Onshore-Offshore Delivery. 5) Risk/Issue Management. This is a wonderful company to work with. There are lots of options and technical resources through which you can learn. People are friendly and helpful. Great place to work. Salesforce tries continuously to provide a great work environment for employees and creates a fun and engaging culture. The company is also committed to providing employees six days a year to volunteer in our communities and around the globe which makes it a very fulfilling job all around. Great company with focus on safety, quality, delivery & cost as well as team member engagement.dedicated management & team membersgreat investment in new facilities and technologies Everyone there was very nice and welcoming. The environment was amazing. I loved the freedom and opportunity. There is a lot of room for promotion. Wrok life balance is a plus and the location is amazing. My team was very involved and helped integrate me into the Salesforce community.  Salary is very competitive and well worth it for the location and standard of living.  Very open feel.  Great company. Salesforce is a great place to work.  We have an open desk layout, and it's easy to work with other people here.  I'm not sure about all teams, but my team had a lot of fun together during lunch and outings.  The company is doing really well and you'll get many interesting technical challenges to solve here. Great place to work in an ever expanding environment. Salesforce is a pioneer in the cloud industry and they take pride in being in that position. Super fun company to work with. Many advancement opportunities. People are very open minded and willing to change for a better experience. Processed inbound leads and qualified business for sales opportunities. Generated sales pipeline for Account Executives. A strong focus there on the key product management disciplines, including 'Pragmatic Marketing' market analysis and 'voice of customer' elicitation and validation work.  I also admired the focus and mastery of agile development to get key innovations to market faster. I learned a lot by being a Salesforce employee. There was no such a thing as typical day at work, which, I believe is great! Management sometimes would over micro manage, especially newly appointed ones! The hardest part of the job was the lack of resources when help was necessary to move faster with waterfall projects! I worked for a startup that sold health insurance online.  Eventually the company shut down.  I did Salesforce admin along with other database work. Very good company to work for. I really much enjoyed the experience having learned so much and developed myself as a SFDC professional. Salesforce, Inc. is an excellent place to work.  Like most, the quality of your day to day work life and delivery expectations are made or broken based on your direct manager.  I have the best manager I have ever had in my career.  In general the culture is high achieving, and makes do with less in the field than in HQ.  I successfully lead a large distributed team, and they are easily the best team I have ever worked with in my career. The only downside is the lack of real meaningful career advancement opportunities for managers outside of San Francisco. If you are not *in* the Headquarters club of managers you have little to no shot at meaningful career advancement. Good,fun people to work for. A very fun job culture to be around. good benefits,higher than normal pay,Fun awsome people to work around. MAKING 60-100 CALLS PER DAYcalling prospective customersLead generation and going to trade shows and promoting the product Great company to work for.  Rapid growth and very entrepreneurial culture.  Plenty of learning and training opportunities. Nice place to work for the culture but not for growth and development.  Management selected favorites and promoted them. The culture of this company is fun and exciting. There is always a lot to do and learn. You always have people around you that will help you grow. I loved the company and was excited to be apart of the salesforce culture.  When my manager retired I wasn't left with many options for an internal transition because the company is so HQ centric. It's sad to be leaving my team and my friends I've made over the last year. Productive, fast paced and fun place to work with highly skilled people.  I've worked with Salesforce for over six years and enjoyed every minute of it.  It is extremely fast paced so your shelf life in the company is short but sweet. Some really smart people working here and the work-life balance has been really goodGreat product/technology/platform Highly demanding and on schedule hard deadline. Sometimes it might be stressful but its worthy being a part of great company Salesforce. Fun place to work with lots of activities and free lunches. As a product owner for the production scrum team, responsible for a project's success. Leading the development effort by conveying vision to the team, outlining work in the Product Backlog, and prioritizing it based on business value. As agile PO, responsible for creation and management of the product backlog, priortizing during the sprint planning meeting. Writing user stories, planning and estimation, presenting the scrum status in program review meeting, identifying risks and mitigation plan, working closely with key stakeholders throughout the organization. It was great to work at Salesforce, the people there were great. The environment was quite laid back and loose. Even though everyone had fun, the work was always done on time and in an efficient manner. Esri is an international supplier of Geographic Information System software, web GIS and geodatabase management applications. The company is headquartered in Redlands, California. I just answered calls & emails for this company, it was fun & the pay was decent, the hours I worked were great & I had ample opportunity to gain overtime regularly. The hardest part of this job was learning the ins & outs of the constantly changing software. We had new releases for new features twice a year. The customers would call with the issue before I would usually get an email about the current bug. Still, even with the challenge it was fun, I enjoyed the competitiveness with my coworkers to see who could figure out the bugs/problems solutions the quickest & I felt like I was constantly learning. I enjoyed gaining knowledge in computers, software & culture around the world through my customers. The lounge with TVs, video games & an awesome cafeteria were nice perks as well! Great product and some great people. The culture is cut throat.  Management changes frequently providing it hard to get consistency.  Very quick to go to market on new features, often before the staff understand what this means and how to explain it to customers.  There are some very smart people with great ideas.  The innovativeness is great.  I would recommend reviewing and perfecting the products you have on the shelf before releasing something new. This is one of the company where we can learn many productive things. Environment was very friendly and supportive. Good company to work with. Very good connectivity to BART station. Friendly atmosphere. Great place to work with excellent people and work/life balance. * lots of challenging db lifecycle issues * scaling* performance tuning Positive atmospherePositive coworkersNot letting us use the stairs even if you work on the 2nd floor sucks. Excellent place to work with. Worked individually and improved my skills in many technologies. Salesforce, Inc. is an excellent place to work.  Like most, the quality of your day to day work life and delivery expectations are made or broken based on your direct manager.  I have the best manager I have ever had in my career.  In general the culture is high achieving, and makes do with less in the field than in HQ.  I successfully lead a large distributed team, and they are easily the best team I have ever worked with in my career. The only downside is the lack of real meaningful career advancement opportunities for managers outside of San Francisco. If you are not *in* the Headquarters club of managers you have little to no shot at meaningful career advancement. I loved working for Salesforce ATL by far it has been the best company that I've worked for. Very good company and cultureLearned a great deal on sales methodology Great perks. Worked Monday through Friday 40+ hours a week training new / former hires, creating 10+ excel spreadsheets daily, set up meeting with teams, receive and review 100+ emails daily with international requesters. Also manually entering raw data into two Salesforce platforms (Budgetingforce and Coupa) to manage EMEA, APAC and Japan purchase request / purchase orders and/or budget spend for the four quarters.I've learned about paying attention to detail (emails, data entry, and reports), understanding the meaning of a task or project, being a clear communicator (verbal / written), prioritizing work / time management and stay motivated.The Marketing Operations team was a great support in my success. Answered all of my questions, provided me feedback weekly, so I can improve on my weaknesses, allowed me to have a voice and freedom to manage a project.The most enjoyable part of my job that I was able to connect with different departments and people through my time at Salesforce. It helped me view ideas, opinions and decisions differently. Definitely a place to work.  The culture flare and environment is very open and accommodating to any position within the company. I thrive on knowing that I will be busy from the second I begin to the day's end. I love the fact that the day literally flies by. Salesforce is a wonderful company to work for, and the people brought on are top in the industry. A great product and a great company to work for!  My colleagues are top notch software professionals that are passionate about their work. a typical day at work is manageable, Co workers are good helpful FLC Recruiting for Technical roles, see resume for futher details. The CEO has established a great culture around philanthropy, innovation, Great co-workers, fun environment. Fast pace work evnironment requiring overtime and long commute. This place is a great place to work, but expectations are high and, and coworkers are among the best and brightest in the world. A typical day at work for me at Salesforce.com was very fun yet busy all the time. While I was at Salesforce.com I gained a lot of knowledge from fellow colleagues. The hardest part of the job as an event specialist was making sure assigned projects were precise with no mistakes in which I have that mastered. The most enjoyable part of the job was being able to see colleagues everyday. was ok place to work.  Management kind of disorganized.Overall was okay. A typical day at work feels like being chained to a desk. Management has little to no attachment to employees.The hardest part of the job was producing tangible business improvements and deliverables that were shot down by middle management.Upper management has no idea that lower levels have a hard time. Provide support and training to multiple applications and programs. These applications utilized by a medium to large user community serving multiple business functions. There is so much to learn at Salesforce it can sometimes be overwhelming, but that's just one of the many facets that make my company a great place to work.  There are so many paths for advancement and the skills you learn at Salesforce can be applied to many different industries outside of Salesforce.  Since I am new at the company it is difficult for me to come up with a typical work day, but I will update this text at a later time. We work from home and once in a while we also go to office or client side Positive and energetic organization. Many opportunities for internal advancement. Salesforce is an incredible company with an amazing  culture. They are not only the most innovative company I have worked for, but they genuinely believe in work/life balance. I was happy to see much of what I learned in ERP class, and through books was true. Salesforce, Inc. is an excellent place to work.  Like most, the quality of your day to day work life and delivery expectations are made or broken based on your direct manager.  I have the best manager I have ever had in my career.  In general the culture is high achieving, and makes do with less in the field than in HQ.  I successfully lead a large distributed team, and they are easily the best team I have ever worked with in my career. The only downside is the lack of real meaningful career advancement opportunities for managers outside of San Francisco. If you are not *in* the Headquarters club of managers you have little to no shot at meaningful career advancement. Attend scheduled client calls to discuss the implementation of Salesforce to compliment their current business processes. Complete data assessments of client data and present results back to client. Salesforce is a great place to work. They truly value their employees and continuously work to make it a more enjoyable work place. There are a lot of perks such as fitness reimbursement, commuter discounts, company iPhone, laptop and iPad,volunteer time off, floating holidays, etc.A typical day at work for me involves meetings with various teams. It all depends on the project I'm working on at the time. Overall, I'd say its a very collaborative culture here.Obviously at Salesforce, I've learned to use the app quite well. I've also broadened my knowledge of technology and learned about trends in the industry.My co-workers are great. It's a very casual culture here. Everyone asks how your weekend was, happy hours occur regularly, team dinners about once or twice a quarter. Overall everyone is pretty pleasant to work with.The hardest part of the job is probably the typical struggles that go with working for a large company. Things need to move quickly, but obstacles can make that difficult. My department is relatively new though, so I'm sure the kinks will get worked out as we work together longer. I love to work at SFDC and it is an enjoyable workplace and having lots of fun. My time at Salesforce was much appreciated. I was working for Buddy Media (a startup) which was bought by Salesforce. Salesforce seemed to maintain some of the same culture of the startup along with solid benefits. Salesforce encouraged self starters to excel and those who needed help got help. fast paced, competitive culture. Great exposure to entire P&L. The Salesforce cloud is the leader in on-demand customer relationship management. The system offers a broad suite of CRM applications for small, mid-market, and enterprise organizations, with a focus on sales and support. I learn new skills regarding accounting. This was a temp job. Nothing but great things to say about Salesforce.com!!!  Very intense and high velocity work environment.  People work day and night (rarely weekends).  Fast pace.  Innovative and constantly looking to reinvent and think outside of the box. Salesforce.com has an amazing work environment. There is always someone there to assist in the event help is needed. Management is obscure in that there are 2-3 supervisorial roles for any single position. Everyone has a great attitude about the company and is always trying to further each other's careers, not just their own. Good company, a bit scattered as far as management, but overall would work there again. - Accept assigned tasks, create custom queries to pull requested information, develop applications and scripts to aid in producing results, perform Quality Assurance for Fellow team mates, participate in process improvement initiatives. - Learned to used new tools such as Data Leaver, Informatica, and the Saleforce.com Cloud based applications. - Good Management: strong leadership and vision casting in the midst of constant change. - Hardest part: Dealing with change that resulted from multiple acquisitions - Most Enjoyable: Problem solving and working with others. I have had the fortune to work at Salesforce.com from 2008 to present.  Great company, leadership with a strong vision, values, methods and measures aligned annually and revisited within the year to ensure the company and its team members are working towards common goals and initiatives.  The culture is very collaborative with an sense of entitlement to contribute, to influence outcomes in a positive way.  I highly recommend any and all to pursue their dream job at Salesforce.com. Each day is a fun and collaborative experience.  I often times work with different groups and leverage my reporting background to help improve broken processes.  My co-workers are very social, mobile and open to challenges and helping one another.  The hardest part of my job is balancing my work/life balance.  Salesforce.com is a fast paced company on the rise with new business and acquisitions.  The best part of my job is also the same as the hardest part of my job. A typical work day consisted of playing hard and working hard.I took away back end experience and corporate environment.I had strong leadership and greta guidance in my journey through the company . My co-workers were the best part exchanges ideas and solutions. working remotely form he rest of the company can be hard when you build such strong relationships with colleagues who may live in a different location and time zone. I enjoy by far the customer service I would provide everyday to the internal users. A great place to start off learning Salesforce.com.The worst part of the job was the lack of advancement opportunities. It was managed by a family that treated us like family. Business came first in everyone's mind but concern for others outside of 9-5 was definitely #2. It was a sad day when new law was passed that caused my position and entire section of company to be laid off. Fun environment. Salesforce invests in it's employees and makes them feel valued.  Amazing company and culture, I would not turn a single person away from this amazing company . . . . But stay away from the Spokane office. There is no advancement opportunities and the managers only promote the favorites based off after work activities or personal friends. Hard work will only get you so far with this office.  Great name to have on your resume if you can stick out the lack of work life balance aspect of the organization. You work 12-14 hours days over and over again, they are a very top heavy and micro manage everything you do.I cannot really list any positives of this organization, other than the name on my resume. Great company to work for although they are disorganized. I am two months into my new comp plan and have not even seen it yet! Salesforce, Inc. is an excellent place to work.  Like most, the quality of your day to day work life and delivery expectations are made or broken based on your direct manager.  I have the best manager I have ever had in my career.  In general the culture is high achieving, and makes do with less in the field than in HQ.  I successfully lead a large distributed team, and they are easily the best team I have ever worked with in my career. The only downside is the lack of real meaningful career advancement opportunities for managers outside of San Francisco. If you are not *in* the Headquarters club of managers you have little to no shot at meaningful career advancement. Very strong and kept you busy. I worked in Collections, great people with lots of talent. Salesforce is a fast paced company with an extremely positive work environment. Great place to work and learn. You even get paid to volunteer. Free lunch, snacks. A typical work day is process invoices, coding, matching the invoice to the PO and if not then we need to ask for an approval from the department manager before we can process the invoice for payment. Management is great. As long as you get your work done, management will not say anything to you. The hardest part of the job is getting invoices approved. The most enjoyable part of the job is coworker, friends you meet, it is a good environment. Salesforce.com has the best employee atmosphere I have worked for. There is a lot of work at times, but that is equaled out by the company of culture of allowing employees the time they need to deal with the life and work at the same time.Management is always working to reward the departments for hard work and striving and to get more productivity during the heaviest work loads on month and quarter end days. I attended my Salesforce.com Administrator class in Atlanta which was being offered through Salesforce.comThe instructor went over the material thoroughly and I really learned a lot. Some co-workers nice & some not so niceWhere I first learned usage of MS Office Programssemi-pleasant work atmosphere I enjoyed working with a diversity of people. The interaction with customers overall was very exciting. Providing requested information regarding company cloud services, up coming Expos,setting up equipment etc. Trouble shoot Salesforce.com issues for many large companies.• Attended DreamForce '08 San Francisco• Data Migration between Salesforce servers• Extensive Salesforce.com Admin. training• Installation of Salesforce components to client servers• Creation of reports and dashboards• Quality control and maintenance of all Salesforce.com components• Administration of user profiles• Integration of Outlook, Office, and Lotus Notes into Salesforce.com• Able to create complex workflows and time triggers• Extensive knowledge of user permission settings and security controls• Opportunity and campaign management• Product and price book management• Ability to create forecasts• Ability to create training documentation, and specifications• Data Loader, Import Wizard, Excel Connector Excellent benefits, Culture and Value. Management is very supportive Maturing market. Shifting direction. Trying to change too fast for too big a company I worked for Salesforce as a contract employee for a month. I worked on the Salesforce software as a Data Entry analyst working on there R12 software. We had 8 analysts work on the project where we were transfering data from the old software into the new R12 program that Salesforce had created. It was a great experience and was a terrific company to work for and hope to some day return back and grow with a wonderful company like Salesforce. Salesforce.com offers a very competitive internship program, and one that I would return to. It pays competitively, they house tech interns, and the culture is not only fun and social but also very welcoming. As an intern, I never felt inferior. Exciting global position managing the design and construction of worldwide office facilities. amazing culture, great money, growing companyGreat and expanding portfolio of technologies High growth means plenty of opportunities for advancement Good PTO - 3 weeks to start Great Employee Stock Purchase Plan Work/Life balance respected I had to leave due to family reasons, buth this has been without doubt the best company I have worked. When they say that you find your dream job at SFDC, they are not lying. Incredible benefits, amazing corporate culture. Top Managers. A true Silicon Valley titan! Salesforce.com is a very fast-paced environment, and a leader in cloud computing. Salesforce, Inc. is an excellent place to work.  Like most, the quality of your day to day work life and delivery expectations are made or broken based on your direct manager.  I have the best manager I have ever had in my career.  In general the culture is high achieving, and makes do with less in the field than in HQ.  I successfully lead a large distributed team, and they are easily the best team I have ever worked with in my career. The only downside is the lack of real meaningful career advancement opportunities for managers outside of San Francisco. If you are not *in* the Headquarters club of managers you have little to no shot at meaningful career advancement. - Best working culture - Learned new/latest technologies- Learn and learn sessions- Team meetings were super fun- Freedom to take own decisions The team was in turmoil but the management was very supportive. A lot of politics going on in HR but great benefits and interesting job. The CEO is amazing in giving back to the community Hm, where to begin? I have been at Salesforce for about two years and it has been the best professional experience to-date. Salesforce is packed with incredibly talented individuals who strive to do good work. The culture of Ohana is what makes this place really awesome. You're treated fairly and people are there support you. I also love the fact that there are unlimited opportunities to learn new things. Whether you want to become Salesforce certified, explore new roles or connect with others outside of your immediate team, it is all there for you as long as you take the initiative. I give this place 5/5 stars simply because it stands up to its reputation as The Best Place to Work For. very friendly staff ,keep the environment exciting when the sale floor is slow, will work with your schedule. The placement in the Walmart stores are genius selling phones , phone plan for less is very smart and reasonable for people how can not afford the more expensive phones but can get all the technology. I never worked for SalesForce, I used Salesforce when I was representing Schutt Sports as a time management assistant. Schutt Sports had all of their sales reps use it to help make notes on meetings, set up appointments. Salesforce has an interesting created culture that takes some time to adjust to.  It can be super high-stress at times but that balances to a certain bit with opportunities.  It's a great place to learn. I do love working at Salesforce. The company culture is great and the company has amazing products. Someone told me when I interviewed that there are 2 cultures here: 1 of the company, and 1 of the sales organization. That turned out to be very true. The sales culture is that of Oracle and is very white male with no diversity in my management chain. The overall company culture is better. Salesforce is too metric driven.  We find that instead of focusing on giving our customers complete service we have to rush to meet numbers.  This also stifles learning. I'm very happy to have at worked at Salesforce for as long as I have - over 3 years now.  However the company and culture has changed and unless you're under 28 or new to sales, and trying to get some experience at a splashy resume name - stay away. As with many companies that grow so quickly, the culture has been diluted and employees take a back seat to profit and sales. The company will need to be mindful of retaining managers that are ruthless in the treatment of their employees. Very good company to work for and they had very good employees. A lot good of products and some great customer. I was hoping to retire from this company. Compared to smaller places that I worked for in LA salesforce is a breath of fresh air. The compensation, benefits and work-life balance plus the caliber of people who work at this place is hard to find. The code is written nicely and has comments and is as clean as it could be given the infrastructure and size of the systems that the software needs to be able to handle. Awesome place to be at. A lot going on and you feel like you're in the center of it all. Place you're literally in the center of it all. I would wish there were more free food though =/ It has a great company culture and great work environment. Definitely a place where you can move up the ladder and grow internally within the company as well. Every company likes to claim they have a greta work environment but here at Salesforce its the real deal, You can literally meet anyone at any given moment, walking down the hall and introducing yourself.  From the past experiences of my colleagues this would't happen anywhere else, you'd either get a awkward hello or get brushed off. I gained good experience and good work skills but the ending was a negative experience that could be avoided.  Gained valuable skills and experience and provided a desire to do more within the ecosystem. Working at Salesforce, you see the future of IT and industry in general. The workculture has become corporate, with time, but this does not take away from the 'fresh IT world' burgeoning from San Francisco. Demand is strong, IT collaboration must be powerful during mergers, and your teams must feel satiated and not burnt out. I utilized the Salesforce platform while working for the charter organization KIPP. During my time at KIPP, Salesforce was a daily part of the vocation in relation to data tracking, and upkeep of pertinent student information. Incredibly demanding yet equally rewarding company to work for, fun culture with plenty of opportunity for grown within the company. Working remotely can be challenging to connect with HQ Salesforce is a great company to start your career. Very positive environment and a lot of growth. Great training are and management super supportive. Even tho I was a contractor I enjoyed my time at SalesForce. Everyone was very helpful if I had a question I could ask anyone and it they did not know the answer they would direct me to some one that did. The hardest part of my job was it was  repetitious other than that it was a great place to work Salesforce, Inc. is an excellent place to work.  Like most, the quality of your day to day work life and delivery expectations are made or broken based on your direct manager.  I have the best manager I have ever had in my career.  In general the culture is high achieving, and makes do with less in the field than in HQ.  I successfully lead a large distributed team, and they are easily the best team I have ever worked with in my career. The only downside is the lack of real meaningful career advancement opportunities for managers outside of San Francisco. If you are not *in* the Headquarters club of managers you have little to no shot at meaningful career advancement. - Best working culture - Learned new/latest technologies- Learn and learn sessions- Team meetings were super fun- Freedom to take own decisions The team was in turmoil but the management was very supportive. A lot of politics going on in HR but great benefits and interesting job. The CEO is amazing in giving back to the community Hm, where to begin? I have been at Salesforce for about two years and it has been the best professional experience to-date. Salesforce is packed with incredibly talented individuals who strive to do good work. The culture of Ohana is what makes this place really awesome. You're treated fairly and people are there support you. I also love the fact that there are unlimited opportunities to learn new things. Whether you want to become Salesforce certified, explore new roles or connect with others outside of your immediate team, it is all there for you as long as you take the initiative. I give this place 5/5 stars simply because it stands up to its reputation as The Best Place to Work For. very friendly staff ,keep the environment exciting when the sale floor is slow, will work with your schedule. The placement in the Walmart stores are genius selling phones , phone plan for less is very smart and reasonable for people how can not afford the more expensive phones but can get all the technology. I never worked for SalesForce, I used Salesforce when I was representing Schutt Sports as a time management assistant. Schutt Sports had all of their sales reps use it to help make notes on meetings, set up appointments. Salesforce has an interesting created culture that takes some time to adjust to.  It can be super high-stress at times but that balances to a certain bit with opportunities.  It's a great place to learn. I do love working at Salesforce. The company culture is great and the company has amazing products. Someone told me when I interviewed that there are 2 cultures here: 1 of the company, and 1 of the sales organization. That turned out to be very true. The sales culture is that of Oracle and is very white male with no diversity in my management chain. The overall company culture is better. Salesforce is too metric driven.  We find that instead of focusing on giving our customers complete service we have to rush to meet numbers.  This also stifles learning. I'm very happy to have at worked at Salesforce for as long as I have - over 3 years now.  However the company and culture has changed and unless you're under 28 or new to sales, and trying to get some experience at a splashy resume name - stay away. As with many companies that grow so quickly, the culture has been diluted and employees take a back seat to profit and sales. The company will need to be mindful of retaining managers that are ruthless in the treatment of their employees. Very good company to work for and they had very good employees. A lot good of products and some great customer. I was hoping to retire from this company. Compared to smaller places that I worked for in LA salesforce is a breath of fresh air. The compensation, benefits and work-life balance plus the caliber of people who work at this place is hard to find. The code is written nicely and has comments and is as clean as it could be given the infrastructure and size of the systems that the software needs to be able to handle. Awesome place to be at. A lot going on and you feel like you're in the center of it all. Place you're literally in the center of it all. I would wish there were more free food though =/ It has a great company culture and great work environment. Definitely a place where you can move up the ladder and grow internally within the company as well. Every company likes to claim they have a greta work environment but here at Salesforce its the real deal, You can literally meet anyone at any given moment, walking down the hall and introducing yourself.  From the past experiences of my colleagues this would't happen anywhere else, you'd either get a awkward hello or get brushed off. I gained good experience and good work skills but the ending was a negative experience that could be avoided.  Gained valuable skills and experience and provided a desire to do more within the ecosystem. Working at Salesforce, you see the future of IT and industry in general. The workculture has become corporate, with time, but this does not take away from the 'fresh IT world' burgeoning from San Francisco. Demand is strong, IT collaboration must be powerful during mergers, and your teams must feel satiated and not burnt out. I utilized the Salesforce platform while working for the charter organization KIPP. During my time at KIPP, Salesforce was a daily part of the vocation in relation to data tracking, and upkeep of pertinent student information. Incredibly demanding yet equally rewarding company to work for, fun culture with plenty of opportunity for grown within the company. Working remotely can be challenging to connect with HQ Salesforce is a great company to start your career. Very positive environment and a lot of growth. Great training are and management super supportive. Even tho I was a contractor I enjoyed my time at SalesForce. Everyone was very helpful if I had a question I could ask anyone and it they did not know the answer they would direct me to some one that did. The hardest part of my job was it was  repetitious other than that it was a great place to work Salesforce, Inc. is an excellent place to work.  Like most, the quality of your day to day work life and delivery expectations are made or broken based on your direct manager.  I have the best manager I have ever had in my career.  In general the culture is high achieving, and makes do with less in the field than in HQ.  I successfully lead a large distributed team, and they are easily the best team I have ever worked with in my career. The only downside is the lack of real meaningful career advancement opportunities for managers outside of San Francisco. If you are not *in* the Headquarters club of managers you have little to no shot at meaningful career advancement. - Best working culture - Learned new/latest technologies- Learn and learn sessions- Team meetings were super fun- Freedom to take own decisions The team was in turmoil but the management was very supportive. A lot of politics going on in HR but great benefits and interesting job. The CEO is amazing in giving back to the community Hm, where to begin? I have been at Salesforce for about two years and it has been the best professional experience to-date. Salesforce is packed with incredibly talented individuals who strive to do good work. The culture of Ohana is what makes this place really awesome. You're treated fairly and people are there support you. I also love the fact that there are unlimited opportunities to learn new things. Whether you want to become Salesforce certified, explore new roles or connect with others outside of your immediate team, it is all there for you as long as you take the initiative. I give this place 5/5 stars simply because it stands up to its reputation as The Best Place to Work For. very friendly staff ,keep the environment exciting when the sale floor is slow, will work with your schedule. The placement in the Walmart stores are genius selling phones , phone plan for less is very smart and reasonable for people how can not afford the more expensive phones but can get all the technology. I never worked for SalesForce, I used Salesforce when I was representing Schutt Sports as a time management assistant. Schutt Sports had all of their sales reps use it to help make notes on meetings, set up appointments. Salesforce has an interesting created culture that takes some time to adjust to.  It can be super high-stress at times but that balances to a certain bit with opportunities.  It's a great place to learn. I do love working at Salesforce. The company culture is great and the company has amazing products. Someone told me when I interviewed that there are 2 cultures here: 1 of the company, and 1 of the sales organization. That turned out to be very true. The sales culture is that of Oracle and is very white male with no diversity in my management chain. The overall company culture is better. Salesforce is too metric driven.  We find that instead of focusing on giving our customers complete service we have to rush to meet numbers.  This also stifles learning. I'm very happy to have at worked at Salesforce for as long as I have - over 3 years now.  However the company and culture has changed and unless you're under 28 or new to sales, and trying to get some experience at a splashy resume name - stay away. As with many companies that grow so quickly, the culture has been diluted and employees take a back seat to profit and sales. The company will need to be mindful of retaining managers that are ruthless in the treatment of their employees. Very good company to work for and they had very good employees. A lot good of products and some great customer. I was hoping to retire from this company. Compared to smaller places that I worked for in LA salesforce is a breath of fresh air. The compensation, benefits and work-life balance plus the caliber of people who work at this place is hard to find. The code is written nicely and has comments and is as clean as it could be given the infrastructure and size of the systems that the software needs to be able to handle. Awesome place to be at. A lot going on and you feel like you're in the center of it all. Place you're literally in the center of it all. I would wish there were more free food though =/ It has a great company culture and great work environment. Definitely a place where you can move up the ladder and grow internally within the company as well. Every company likes to claim they have a greta work environment but here at Salesforce its the real deal, You can literally meet anyone at any given moment, walking down the hall and introducing yourself.  From the past experiences of my colleagues this would't happen anywhere else, you'd either get a awkward hello or get brushed off. I gained good experience and good work skills but the ending was a negative experience that could be avoided.  Gained valuable skills and experience and provided a desire to do more within the ecosystem. Working at Salesforce, you see the future of IT and industry in general. The workculture has become corporate, with time, but this does not take away from the 'fresh IT world' burgeoning from San Francisco. Demand is strong, IT collaboration must be powerful during mergers, and your teams must feel satiated and not burnt out. I utilized the Salesforce platform while working for the charter organization KIPP. During my time at KIPP, Salesforce was a daily part of the vocation in relation to data tracking, and upkeep of pertinent student information. Incredibly demanding yet equally rewarding company to work for, fun culture with plenty of opportunity for grown within the company. Working remotely can be challenging to connect with HQ Salesforce is a great company to start your career. Very positive environment and a lot of growth. Great training are and management super supportive. Even tho I was a contractor I enjoyed my time at SalesForce. Everyone was very helpful if I had a question I could ask anyone and it they did not know the answer they would direct me to some one that did. The hardest part of my job was it was  repetitious other than that it was a great place to work Salesforce, Inc. is an excellent place to work.  Like most, the quality of your day to day work life and delivery expectations are made or broken based on your direct manager.  I have the best manager I have ever had in my career.  In general the culture is high achieving, and makes do with less in the field than in HQ.  I successfully lead a large distributed team, and they are easily the best team I have ever worked with in my career. The only downside is the lack of real meaningful career advancement opportunities for managers outside of San Francisco. If you are not *in* the Headquarters club of managers you have little to no shot at meaningful career advancement. - Best working culture - Learned new/latest technologies- Learn and learn sessions- Team meetings were super fun- Freedom to take own decisions The team was in turmoil but the management was very supportive. A lot of politics going on in HR but great benefits and interesting job. The CEO is amazing in giving back to the community Hm, where to begin? I have been at Salesforce for about two years and it has been the best professional experience to-date. Salesforce is packed with incredibly talented individuals who strive to do good work. The culture of Ohana is what makes this place really awesome. You're treated fairly and people are there support you. I also love the fact that there are unlimited opportunities to learn new things. Whether you want to become Salesforce certified, explore new roles or connect with others outside of your immediate team, it is all there for you as long as you take the initiative. I give this place 5/5 stars simply because it stands up to its reputation as The Best Place to Work For. very friendly staff ,keep the environment exciting when the sale floor is slow, will work with your schedule. The placement in the Walmart stores are genius selling phones , phone plan for less is very smart and reasonable for people how can not afford the more expensive phones but can get all the technology. I never worked for SalesForce, I used Salesforce when I was representing Schutt Sports as a time management assistant. Schutt Sports had all of their sales reps use it to help make notes on meetings, set up appointments. Salesforce has an interesting created culture that takes some time to adjust to.  It can be super high-stress at times but that balances to a certain bit with opportunities.  It's a great place to learn. I do love working at Salesforce. The company culture is great and the company has amazing products. Someone told me when I interviewed that there are 2 cultures here: 1 of the company, and 1 of the sales organization. That turned out to be very true. The sales culture is that of Oracle and is very white male with no diversity in my management chain. The overall company culture is better. Salesforce is too metric driven.  We find that instead of focusing on giving our customers complete service we have to rush to meet numbers.  This also stifles learning. I'm very happy to have at worked at Salesforce for as long as I have - over 3 years now.  However the company and culture has changed and unless you're under 28 or new to sales, and trying to get some experience at a splashy resume name - stay away. As with many companies that grow so quickly, the culture has been diluted and employees take a back seat to profit and sales. The company will need to be mindful of retaining managers that are ruthless in the treatment of their employees. Very good company to work for and they had very good employees. A lot good of products and some great customer. I was hoping to retire from this company. Compared to smaller places that I worked for in LA salesforce is a breath of fresh air. The compensation, benefits and work-life balance plus the caliber of people who work at this place is hard to find. The code is written nicely and has comments and is as clean as it could be given the infrastructure and size of the systems that the software needs to be able to handle. Awesome place to be at. A lot going on and you feel like you're in the center of it all. Place you're literally in the center of it all. I would wish there were more free food though =/ It has a great company culture and great work environment. Definitely a place where you can move up the ladder and grow internally within the company as well. Every company likes to claim they have a greta work environment but here at Salesforce its the real deal, You can literally meet anyone at any given moment, walking down the hall and introducing yourself.  From the past experiences of my colleagues this would't happen anywhere else, you'd either get a awkward hello or get brushed off. I gained good experience and good work skills but the ending was a negative experience that could be avoided.  Gained valuable skills and experience and provided a desire to do more within the ecosystem. Working at Salesforce, you see the future of IT and industry in general. The workculture has become corporate, with time, but this does not take away from the 'fresh IT world' burgeoning from San Francisco. Demand is strong, IT collaboration must be powerful during mergers, and your teams must feel satiated and not burnt out. I utilized the Salesforce platform while working for the charter organization KIPP. During my time at KIPP, Salesforce was a daily part of the vocation in relation to data tracking, and upkeep of pertinent student information. Incredibly demanding yet equally rewarding company to work for, fun culture with plenty of opportunity for grown within the company. Working remotely can be challenging to connect with HQ Salesforce is a great company to start your career. Very positive environment and a lot of growth. Great training are and management super supportive. Even tho I was a contractor I enjoyed my time at SalesForce. Everyone was very helpful if I had a question I could ask anyone and it they did not know the answer they would direct me to some one that did. The hardest part of my job was it was  repetitious other than that it was a great place to work Salesforce, Inc. is an excellent place to work.  Like most, the quality of your day to day work life and delivery expectations are made or broken based on your direct manager.  I have the best manager I have ever had in my career.  In general the culture is high achieving, and makes do with less in the field than in HQ.  I successfully lead a large distributed team, and they are easily the best team I have ever worked with in my career. The only downside is the lack of real meaningful career advancement opportunities for managers outside of San Francisco. If you are not *in* the Headquarters club of managers you have little to no shot at meaningful career advancement. - Best working culture - Learned new/latest technologies- Learn and learn sessions- Team meetings were super fun- Freedom to take own decisions The team was in turmoil but the management was very supportive. A lot of politics going on in HR but great benefits and interesting job. The CEO is amazing in giving back to the community Hm, where to begin? I have been at Salesforce for about two years and it has been the best professional experience to-date. Salesforce is packed with incredibly talented individuals who strive to do good work. The culture of Ohana is what makes this place really awesome. You're treated fairly and people are there support you. I also love the fact that there are unlimited opportunities to learn new things. Whether you want to become Salesforce certified, explore new roles or connect with others outside of your immediate team, it is all there for you as long as you take the initiative. I give this place 5/5 stars simply because it stands up to its reputation as The Best Place to Work For. very friendly staff ,keep the environment exciting when the sale floor is slow, will work with your schedule. The placement in the Walmart stores are genius selling phones , phone plan for less is very smart and reasonable for people how can not afford the more expensive phones but can get all the technology. I never worked for SalesForce, I used Salesforce when I was representing Schutt Sports as a time management assistant. Schutt Sports had all of their sales reps use it to help make notes on meetings, set up appointments. Salesforce has an interesting created culture that takes some time to adjust to.  It can be super high-stress at times but that balances to a certain bit with opportunities.  It's a great place to learn. I do love working at Salesforce. The company culture is great and the company has amazing products. Someone told me when I interviewed that there are 2 cultures here: 1 of the company, and 1 of the sales organization. That turned out to be very true. The sales culture is that of Oracle and is very white male with no diversity in my management chain. The overall company culture is better. Salesforce is too metric driven.  We find that instead of focusing on giving our customers complete service we have to rush to meet numbers.  This also stifles learning. I'm very happy to have at worked at Salesforce for as long as I have - over 3 years now.  However the company and culture has changed and unless you're under 28 or new to sales, and trying to get some experience at a splashy resume name - stay away. As with many companies that grow so quickly, the culture has been diluted and employees take a back seat to profit and sales. The company will need to be mindful of retaining managers that are ruthless in the treatment of their employees. Very good company to work for and they had very good employees. A lot good of products and some great customer. I was hoping to retire from this company. Compared to smaller places that I worked for in LA salesforce is a breath of fresh air. The compensation, benefits and work-life balance plus the caliber of people who work at this place is hard to find. The code is written nicely and has comments and is as clean as it could be given the infrastructure and size of the systems that the software needs to be able to handle. Awesome place to be at. A lot going on and you feel like you're in the center of it all. Place you're literally in the center of it all. I would wish there were more free food though =/ It has a great company culture and great work environment. Definitely a place where you can move up the ladder and grow internally within the company as well. Every company likes to claim they have a greta work environment but here at Salesforce its the real deal, You can literally meet anyone at any given moment, walking down the hall and introducing yourself.  From the past experiences of my colleagues this would't happen anywhere else, you'd either get a awkward hello or get brushed off. I gained good experience and good work skills but the ending was a negative experience that could be avoided.  Gained valuable skills and experience and provided a desire to do more within the ecosystem. Working at Salesforce, you see the future of IT and industry in general. The workculture has become corporate, with time, but this does not take away from the 'fresh IT world' burgeoning from San Francisco. Demand is strong, IT collaboration must be powerful during mergers, and your teams must feel satiated and not burnt out. I utilized the Salesforce platform while working for the charter organization KIPP. During my time at KIPP, Salesforce was a daily part of the vocation in relation to data tracking, and upkeep of pertinent student information. Incredibly demanding yet equally rewarding company to work for, fun culture with plenty of opportunity for grown within the company. Working remotely can be challenging to connect with HQ Salesforce is a great company to start your career. Very positive environment and a lot of growth. Great training are and management super supportive. Even tho I was a contractor I enjoyed my time at SalesForce. Everyone was very helpful if I had a question I could ask anyone and it they did not know the answer they would direct me to some one that did. The hardest part of my job was it was  repetitious other than that it was a great place to work Salesforce, Inc. is an excellent place to work.  Like most, the quality of your day to day work life and delivery expectations are made or broken based on your direct manager.  I have the best manager I have ever had in my career.  In general the culture is high achieving, and makes do with less in the field than in HQ.  I successfully lead a large distributed team, and they are easily the best team I have ever worked with in my career. The only downside is the lack of real meaningful career advancement opportunities for managers outside of San Francisco. If you are not *in* the Headquarters club of managers you have little to no shot at meaningful career advancement. - Best working culture - Learned new/latest technologies- Learn and learn sessions- Team meetings were super fun- Freedom to take own decisions The team was in turmoil but the management was very supportive. A lot of politics going on in HR but great benefits and interesting job. The CEO is amazing in giving back to the community Hm, where to begin? I have been at Salesforce for about two years and it has been the best professional experience to-date. Salesforce is packed with incredibly talented individuals who strive to do good work. The culture of Ohana is what makes this place really awesome. You're treated fairly and people are there support you. I also love the fact that there are unlimited opportunities to learn new things. Whether you want to become Salesforce certified, explore new roles or connect with others outside of your immediate team, it is all there for you as long as you take the initiative. I give this place 5/5 stars simply because it stands up to its reputation as The Best Place to Work For. very friendly staff ,keep the environment exciting when the sale floor is slow, will work with your schedule. The placement in the Walmart stores are genius selling phones , phone plan for less is very smart and reasonable for people how can not afford the more expensive phones but can get all the technology. I never worked for SalesForce, I used Salesforce when I was representing Schutt Sports as a time management assistant. Schutt Sports had all of their sales reps use it to help make notes on meetings, set up appointments. Salesforce has an interesting created culture that takes some time to adjust to.  It can be super high-stress at times but that balances to a certain bit with opportunities.  It's a great place to learn. I do love working at Salesforce. The company culture is great and the company has amazing products. Someone told me when I interviewed that there are 2 cultures here: 1 of the company, and 1 of the sales organization. That turned out to be very true. The sales culture is that of Oracle and is very white male with no diversity in my management chain. The overall company culture is better. Salesforce is too metric driven.  We find that instead of focusing on giving our customers complete service we have to rush to meet numbers.  This also stifles learning. I'm very happy to have at worked at Salesforce for as long as I have - over 3 years now.  However the company and culture has changed and unless you're under 28 or new to sales, and trying to get some experience at a splashy resume name - stay away. As with many companies that grow so quickly, the culture has been diluted and employees take a back seat to profit and sales. The company will need to be mindful of retaining managers that are ruthless in the treatment of their employees. Very good company to work for and they had very good employees. A lot good of products and some great customer. I was hoping to retire from this company. Compared to smaller places that I worked for in LA salesforce is a breath of fresh air. The compensation, benefits and work-life balance plus the caliber of people who work at this place is hard to find. The code is written nicely and has comments and is as clean as it could be given the infrastructure and size of the systems that the software needs to be able to handle. Awesome place to be at. A lot going on and you feel like you're in the center of it all. Place you're literally in the center of it all. I would wish there were more free food though =/ It has a great company culture and great work environment. Definitely a place where you can move up the ladder and grow internally within the company as well. Every company likes to claim they have a greta work environment but here at Salesforce its the real deal, You can literally meet anyone at any given moment, walking down the hall and introducing yourself.  From the past experiences of my colleagues this would't happen anywhere else, you'd either get a awkward hello or get brushed off. I gained good experience and good work skills but the ending was a negative experience that could be avoided.  Gained valuable skills and experience and provided a desire to do more within the ecosystem. Working at Salesforce, you see the future of IT and industry in general. The workculture has become corporate, with time, but this does not take away from the 'fresh IT world' burgeoning from San Francisco. Demand is strong, IT collaboration must be powerful during mergers, and your teams must feel satiated and not burnt out. I utilized the Salesforce platform while working for the charter organization KIPP. During my time at KIPP, Salesforce was a daily part of the vocation in relation to data tracking, and upkeep of pertinent student information. Incredibly demanding yet equally rewarding company to work for, fun culture with plenty of opportunity for grown within the company. Working remotely can be challenging to connect with HQ Salesforce is a great company to start your career. Very positive environment and a lot of growth. Great training are and management super supportive. Even tho I was a contractor I enjoyed my time at SalesForce. Everyone was very helpful if I had a question I could ask anyone and it they did not know the answer they would direct me to some one that did. The hardest part of my job was it was  repetitious other than that it was a great place to work Salesforce, Inc. is an excellent place to work.  Like most, the quality of your day to day work life and delivery expectations are made or broken based on your direct manager.  I have the best manager I have ever had in my career.  In general the culture is high achieving, and makes do with less in the field than in HQ.  I successfully lead a large distributed team, and they are easily the best team I have ever worked with in my career. The only downside is the lack of real meaningful career advancement opportunities for managers outside of San Francisco. If you are not *in* the Headquarters club of managers you have little to no shot at meaningful career advancement. - Best working culture - Learned new/latest technologies- Learn and learn sessions- Team meetings were super fun- Freedom to take own decisions The team was in turmoil but the management was very supportive. A lot of politics going on in HR but great benefits and interesting job. The CEO is amazing in giving back to the community Hm, where to begin? I have been at Salesforce for about two years and it has been the best professional experience to-date. Salesforce is packed with incredibly talented individuals who strive to do good work. The culture of Ohana is what makes this place really awesome. You're treated fairly and people are there support you. I also love the fact that there are unlimited opportunities to learn new things. Whether you want to become Salesforce certified, explore new roles or connect with others outside of your immediate team, it is all there for you as long as you take the initiative. I give this place 5/5 stars simply because it stands up to its reputation as The Best Place to Work For. very friendly staff ,keep the environment exciting when the sale floor is slow, will work with your schedule. The placement in the Walmart stores are genius selling phones , phone plan for less is very smart and reasonable for people how can not afford the more expensive phones but can get all the technology. I never worked for SalesForce, I used Salesforce when I was representing Schutt Sports as a time management assistant. Schutt Sports had all of their sales reps use it to help make notes on meetings, set up appointments. Salesforce has an interesting created culture that takes some time to adjust to.  It can be super high-stress at times but that balances to a certain bit with opportunities.  It's a great place to learn. I do love working at Salesforce. The company culture is great and the company has amazing products. Someone told me when I interviewed that there are 2 cultures here: 1 of the company, and 1 of the sales organization. That turned out to be very true. The sales culture is that of Oracle and is very white male with no diversity in my management chain. The overall company culture is better. Salesforce is too metric driven.  We find that instead of focusing on giving our customers complete service we have to rush to meet numbers.  This also stifles learning. I'm very happy to have at worked at Salesforce for as long as I have - over 3 years now.  However the company and culture has changed and unless you're under 28 or new to sales, and trying to get some experience at a splashy resume name - stay away. As with many companies that grow so quickly, the culture has been diluted and employees take a back seat to profit and sales. The company will need to be mindful of retaining managers that are ruthless in the treatment of their employees. Very good company to work for and they had very good employees. A lot good of products and some great customer. I was hoping to retire from this company. Compared to smaller places that I worked for in LA salesforce is a breath of fresh air. The compensation, benefits and work-life balance plus the caliber of people who work at this place is hard to find. The code is written nicely and has comments and is as clean as it could be given the infrastructure and size of the systems that the software needs to be able to handle. Awesome place to be at. A lot going on and you feel like you're in the center of it all. Place you're literally in the center of it all. I would wish there were more free food though =/ It has a great company culture and great work environment. Definitely a place where you can move up the ladder and grow internally within the company as well. Every company likes to claim they have a greta work environment but here at Salesforce its the real deal, You can literally meet anyone at any given moment, walking down the hall and introducing yourself.  From the past experiences of my colleagues this would't happen anywhere else, you'd either get a awkward hello or get brushed off. I gained good experience and good work skills but the ending was a negative experience that could be avoided.  Gained valuable skills and experience and provided a desire to do more within the ecosystem. Working at Salesforce, you see the future of IT and industry in general. The workculture has become corporate, with time, but this does not take away from the 'fresh IT world' burgeoning from San Francisco. Demand is strong, IT collaboration must be powerful during mergers, and your teams must feel satiated and not burnt out. I utilized the Salesforce platform while working for the charter organization KIPP. During my time at KIPP, Salesforce was a daily part of the vocation in relation to data tracking, and upkeep of pertinent student information. Incredibly demanding yet equally rewarding company to work for, fun culture with plenty of opportunity for grown within the company. Working remotely can be challenging to connect with HQ Salesforce is a great company to start your career. Very positive environment and a lot of growth. Great training are and management super supportive. Even tho I was a contractor I enjoyed my time at SalesForce. Everyone was very helpful if I had a question I could ask anyone and it they did not know the answer they would direct me to some one that did. The hardest part of my job was it was  repetitious other than that it was a great place to work "
                },
"encodingType":"UTF8"
}
