{
"document":{
"type":"PLAIN_TEXT",
"language": "EN",
"content":"Awesome smart coworkers - driven, passionate and knowledgeableGood benefits - phone, fitness, 401k, discounted hotels etc.Low insurance premiumsFree food - Breakfast and Lunch.Lot of mini-kitchens with healthy snacks, drinks and Beer and wine.Encouragement to innovate and do things right. Lot of hackweeks, parties and celebrations great application, great way to stay in touch on the latest developing news and thoughts from those you follow - real time sharing of ideas i highly recommend using. Twitter was by far the best company I have ever worked for! From the people to the culture within the company, and having the ability to change the social space - it was a remarkable experience! The culture at Twitter is very competitive and cut-throat. I loved everyone I met, but I'd never met so many unhappy and stressed out people in my life. I think the CEO doesn't care about his users or the people who work at Twitter. Everyone I know who left is very happy about it. Intense political maneuvering, not a meritocracy at all, hard work undervalued, upper management and HR eschew supposed company values of transparency and honesty, lack of transparency results in lack of candid conversations, no room for critical thinking or constructive feedback The best part of working at this company was the perks and also working with a reliable team who are determined to get the job done. I also enjoyed the free meals that were provided and snacks and coffee. Most of the staff at different departments are friendly and communicative. The whole flooring design was spacious and well cleaned. Great product and team but leadership struggled to define what twitter was while I was there. As such, the company wasn't as productive as it could be and it often felt like the consumer and business orgs weren't aligned. Twitter has been able to maintain their start-up culture and perks, and did a great job promoting health and wellness with their employees. Their on-site gym was a great facility that got people interacting outside their respective teams. HR were very selective with their contracting with coaches who would manage and run the fitness program, but the engagement was always positive. Overall, great workplace for both employees and contract workers. - Company culture is very open and supportive - My manager was very supportive and willing to teach - Breakfast, lunch and dinner provided with many micro kitchens Twitter was a great place to hone my IT skills. It provided a great working environment for the most part and gave me my first taste of working in Enterprise Tech. With the high level of turnover, middle management spent more time trying to fight for status and swell their personal kingdoms, than they did fixing the product issues.A culture of millennials. Attrition was extremely high. Nice place to work. overall, good culture. co-workers are easy to work with and the management is easy to reach.   overall it is a good place to work. It was a pretty laid back environment with great advancement opportunities. The workplace culture was very different than your traditional work place. Twitter is a great place for any company or local business to advertise upcoming events and exhibitions in a straightforward, simple manner. Making a post is fast and easy to plan in advance. Read this review 5 years from now. You'll understand the reason why it is now bankrupt and the company is defaulting failing. Horrible management unfair work conditions terrible work-life balance I wouldn't recommend this to anyone i really liked working at Twitter. They have a cafeteria full of free food. they are conveniently located in Downtown SF where you can easily access the flagship location. A lot of great people here passionate about the platform and its role in the world.  The challenge is how best to convey that to customers.  The Google & Facebook duopoly is real.  Twitter wants to consider themselves in that same realm, but our clients are more likely to categorize us  in the 'nice to have' bucket including Amazon, Pinterest and Snap. it does seem to be getting better, albeit slowly but the people responsible for making day to day decisions don't always seem to make informed decisions. management seems to be more behind the curve and reactionary than able to plot out strategies and plan properly. Twitter has great benefits but low pay. Great people to work with and the culture is unbeatable. I would stay at Twitter longer but their salaries are not comparable to the marketplace. Enjoyed my time at Twitter although I was working in a Contract role.My day usually started at 7:30 and ended at 4:30. It was a steady busy job which required a lot of contact via e-mail. There was a lot of interfacing with the Account Manager, Order Management and Customer Support. The culture at Twitter was very friendly and the management staff took amazing care of the employees. It gave the employees a fast paced and challenging environment Awesome smart coworkers - driven, passionate and knowledgeableGood benefits - phone, fitness, 401k, discounted hotels etc.Low insurance premiumsFree food - Breakfast and Lunch.Lot of mini-kitchens with healthy snacks, drinks and Beer and wine.Encouragement to innovate and do things right. Lot of hackweeks, parties and celebrations Good work enviorment but the advancement is not what it should be. I am not getting paid the rate i should be so that is the reason why i would not recommend twitter. Middle management is absolutely horrible. Constant departures from leadership. No growth opportunity. Only nice thing was supportive coworkers and perks such as free lunches + perks. A typical day at work included signing in and watching over computer surveillance and also walking the perimeter of the building. I enjoyed my job here and the people I worked with. It's a hardworking and fast-paced environment. If your not ready to work in a fast-paced environment this is not the job for you. The Management is awesome and very professional. From the culture to the food, everyting about Twitter is a great fit. I liked my day to day and the people I met. It is definitely a insightful lookinto the tech industry just being around the environment. Cool, trendy company with all the extravagant SV startup perks and vibe.  Engineers run the show, though, and no adult supervision means the inmates run the asylum. Best place to work never had a job that I loved as much. Great Managers as well. Looking to use what I've leavened here and use it in the world. They treat you like family. Learned different systems. The most enjoyable part of the job were working with different people. Management wasn't there, since everyone were busy. Management doesn't spend as much time with you as you would like. Culture is great, smart people. A bit chaotic like a startup but in transition.Good benefits.Competitive salaries.Since the company stock is not doing so well there are a lot of  older employees who are discouraged. Benefits are excellent.Job security is not good.Review process severely lacking - very hard to get promotion and not allowed to move to a higher position in a different team. Typical day of work consists of working on your task list.I learned a lot more about computer systems, social media, and advertising.Management was great and easy to speak to and approachable.Co workers are great and helpful.Hardest thing is my commute.Most enjoyable is the culture. Being in the heart of the city, almost accessible to anything that you desire. Working at Twitter is a great place to be at. Free food, events, and other perks. It makes it easier to get the job done. Twitter can be a fun place to work, but it is a very cliquey. It takes forever to be promoted and the salaries for the same exact job vary immensely. Tons of wasted time sitting in meetings. Terrific place to work with great food, and positive culture.  Location is perfect and people are very nice.  I would recommend this company to anyone. Fun place to work but alot of people are leaving. Great food, great people. Great projects. Im not sure about promoting people and the engineers are very nice.  good training. I absolutely love working for Twitter. It is an open minded tech culture that allows you to be who you are as long as you do the work given to you. Twitter invites celebrities and politicians to the site which is very motivating to come to work. Every Thursday the whole company has a meeting to discuss the future of Twitter or upcoming events. Most importantly the best thing about working for Twitter is all the free buffet of food. Great work environment with supportive management. Company wants employees to succeed and build a career. As the compnay grows the amount of processes and red tape also grew, but that is expected with a company of this size. The best part about working at Twitter was the people and food. Working on site for Twitter INC, is an amazing experience with all the  resources of the state of the art facility. The people you get to encounter and work with everyday is amazing. Also its a great place to learn and grow your skills in whatever department your work in. I landed this Job via contract I'm still currently employed here as a third party employee not full term. The management for the company I'm contracted though is great and i really have no complaints thus far. Great work environment with supportive management. Company wants employees to succeed and build a career. As the compnay grows the amount of processes and red tape also grew, but that is expected with a company of this size. The best part about working at Twitter was the people and food. Twitter was a good place to learn. I liked my co-workers. One of the best teams I have had.I did not like how much politics there were between directors and many manager. It was the worst place for this I have ever worked. Awesome smart coworkers - driven, passionate and knowledgeableGood benefits - phone, fitness, 401k, discounted hotels etc.Low insurance premiumsFree food - Breakfast and Lunch.Lot of mini-kitchens with healthy snacks, drinks and Beer and wine.Encouragement to innovate and do things right. Lot of hackweeks, parties and celebrations Twitter is a fun and innovating company to work at. The people are smart and always looking to help one another. Each division of the company looks to help others and it moves at a very fast pace. This is a great organization making a large impact around the globe. Management needs to take cues from individual contributors to help them in career growth. Often times, the loudest and most social IC's get priority over employees who quantifiably do an incredible job. Productive and fun workplace with ping pong table and unlimited snacks.  In this position, I became extremely detail-oriented and learned to liase with a number of teams - from legal, to finance, to sales and ad ops.  The hardest part of the job is that I am pretty much always on call, as there can be campaigns that need to go live after hours that I am required to approve. I would go back there anytime. Co workers are great, very qualified. There are a ton of perks and free things. I loved the role, it was very cool to meet fortune 500 companies Great team environment, where collaboration and being a part of the bigger picture was ingrained into the culture. I highly recommend being a part of the organization. A typical day at work will included meetings related to your deadline, continuation on improvements, deadlines, errors and future roll out of the Company's direction. I learned from my peers and management is a deadline is a deadline and there's no exemptions. Continue to scale and meet demanding deadlines. The hardest part of my job is that it's demanding and not enough resources to scale with the growth of the company. You really need to know how to manage your time and be very effective, proactive and efficient in order to successful. I enjoyed being around driven peers and how seasoned everyone was. The calibration and the quality of work that was produced. Awesome place to work. Has a phenomenal company culture centered around a work hard-play hard environment. It's a fun place to work at. If you are working in Android or iOS most of the time you will be blocked by review comments of Seniors, if you are lucky and your seniors are approachable then good, otherwise you end up sending multiple patches to resolve reviews, and its stressful and unnecessary rework.I think twitter need to work on building collaborative environment. But managment was poor and it was difficult being a contractor there. Awesome smart coworkers - driven, passionate and knowledgeableGood benefits - phone, fitness, 401k, discounted hotels etc.Low insurance premiumsFree food - Breakfast and Lunch.Lot of mini-kitchens with healthy snacks, drinks and Beer and wine.Encouragement to innovate and do things right. Lot of hackweeks, parties and celebrations great application, great way to stay in touch on the latest developing news and thoughts from those you follow - real time sharing of ideas i highly recommend using. Twitter was by far the best company I have ever worked for! From the people to the culture within the company, and having the ability to change the social space - it was a remarkable experience! The culture at Twitter is very competitive and cut-throat. I loved everyone I met, but I'd never met so many unhappy and stressed out people in my life. I think the CEO doesn't care about his users or the people who work at Twitter. Everyone I know who left is very happy about it. Intense political maneuvering, not a meritocracy at all, hard work undervalued, upper management and HR eschew supposed company values of transparency and honesty, lack of transparency results in lack of candid conversations, no room for critical thinking or constructive feedback The best part of working at this company was the perks and also working with a reliable team who are determined to get the job done. I also enjoyed the free meals that were provided and snacks and coffee. Most of the staff at different departments are friendly and communicative. The whole flooring design was spacious and well cleaned. Great product and team but leadership struggled to define what twitter was while I was there. As such, the company wasn't as productive as it could be and it often felt like the consumer and business orgs weren't aligned. Twitter has been able to maintain their start-up culture and perks, and did a great job promoting health and wellness with their employees. Their on-site gym was a great facility that got people interacting outside their respective teams. HR were very selective with their contracting with coaches who would manage and run the fitness program, but the engagement was always positive. Overall, great workplace for both employees and contract workers. - Company culture is very open and supportive - My manager was very supportive and willing to teach - Breakfast, lunch and dinner provided with many micro kitchens Twitter was a great place to hone my IT skills. It provided a great working environment for the most part and gave me my first taste of working in Enterprise Tech. With the high level of turnover, middle management spent more time trying to fight for status and swell their personal kingdoms, than they did fixing the product issues.A culture of millennials. Attrition was extremely high. Nice place to work. overall, good culture. co-workers are easy to work with and the management is easy to reach.   overall it is a good place to work. It was a pretty laid back environment with great advancement opportunities. The workplace culture was very different than your traditional work place. Twitter is a great place for any company or local business to advertise upcoming events and exhibitions in a straightforward, simple manner. Making a post is fast and easy to plan in advance. Read this review 5 years from now. You'll understand the reason why it is now bankrupt and the company is defaulting failing. Horrible management unfair work conditions terrible work-life balance I wouldn't recommend this to anyone i really liked working at Twitter. They have a cafeteria full of free food. they are conveniently located in Downtown SF where you can easily access the flagship location. A lot of great people here passionate about the platform and its role in the world.  The challenge is how best to convey that to customers.  The Google & Facebook duopoly is real.  Twitter wants to consider themselves in that same realm, but our clients are more likely to categorize us  in the 'nice to have' bucket including Amazon, Pinterest and Snap. it does seem to be getting better, albeit slowly but the people responsible for making day to day decisions don't always seem to make informed decisions. management seems to be more behind the curve and reactionary than able to plot out strategies and plan properly. Twitter has great benefits but low pay. Great people to work with and the culture is unbeatable. I would stay at Twitter longer but their salaries are not comparable to the marketplace. Enjoyed my time at Twitter although I was working in a Contract role.My day usually started at 7:30 and ended at 4:30. It was a steady busy job which required a lot of contact via e-mail. There was a lot of interfacing with the Account Manager, Order Management and Customer Support. The culture at Twitter was very friendly and the management staff took amazing care of the employees. It gave the employees a fast paced and challenging environment "
                },
"encodingType":"UTF8"
}
