{
"document":{
"type":"PLAIN_TEXT",
"language": "EN",
"content":"Yahoo was a great company to work for - we were always having fun but working hard too. The benefits were great and there was always an opportunity for career growth. A typical day at Yahoo! would be to address client email inquiries, schedule or attend client calls &  research growth opportunities. Management was constantly changing due to our changes in CEOs over the years but the managers I worked under were mentors and peers. The hardest part of the job was the ratio of clients/agencies per person. We were given large books of business with promises of getting additional headcount that took months before there was reprieve. The most enjoyable things at Yahoo! were your colleagues and the positive company culture. Yahoo is a great place to work. The work environment was respectful and positive. I learned a lot during my time there and felt like the work we did there was important and made an impact. Interesting work, dynamic environment. Only downside was they they didn't put any effort into training management, therefore there was no leadership consistency Great culture with plenty of opportunity for advancement. High stressful sales environment. Excellent benefits. Would recommend employment to friends and family. I learned a lot about how the professionals work, and how to manage customers, also manage filing and data entry. However, I dont feel like there is a lot more to learn in the company. Very transparent company with room to grow and lots of great learning experiences. The typical day involves sitting in front of a computer and going to meetings, the collaboration cross-site is unlike anything I've ever experienced.I worked on projects such as product support launches (UK daily fantasy sports), fixing system issues and collaborated globally on Yahoo Mail improvements and new features. The Yahoo brands are a little more focused now over a year into life as part of the Oath family. People are driven, the culture is very positive and progressive, and I think they're really poised to do great things. I have and will continue to recommend it as an amazing place to work. Performers are rewarded, and promotion often comes from within. The scale and reach of the brands remain impressive, there are truly few like it. Many people forget that. Sometimes the size of the company made it hard to affect real change and things could move really slowly, but current leadership is committed to changing that part of the equation. Yahoo is a great tech company to work for because it doesn't take itself too seriously. It likely depends on what manager you have but I was lucky enough to get the best manager there was who truly cared about me, my career, and what I was interested in. Enjoyable place to work, lots of changes with the new executive staff.  They were very focused on being sure that everyone understood the goals of the company. This company has now operates under Verizon as OATH.Yahoo was a great company, very laid back, remote ability and flexibility. Love Love this place.Give OATH a try. talks a lot about their transformation and helping employees be their best. I'm pleased to see that they are really making an effort. From their focus on work/life balance and compensation, to their brand new workspaces - i couldn't be happier working here. I liked working at Yahoo, but clearly it's in advanced decline. Not much else to say, despite the 150-character minimum. Good people for the most part. Happy that our business unit Yahoo SmallBusiness works just like my previous startup. At times, I am the architect, designing new component functionalities , or I'd find myself deciding on front-end scheme, or be designing backend APIs . Be it designing interfaces or interfacing with customers , screening  candidates, or defining product roadmaps, there is always a sense of freedom to call the shots and do more, that is what I like about my work here. Answered calls from customers w/ merchant accounts, sometimes from those expecting advanced coding assistance, set up new accounts, processing billing info The culture and the people at Yahoo drove the success of the workforce. Being a part of the customer care team was the best part of the job. Connecting with users daily and helping to resolve their issues was always our focus. Yahoo was a wonderful place to work full of people who bled purple (as they liked to say).  Sadly the culture was dramatically impacted when Verizon took over and merged Yahoo and AOL into Oath. Amazing work culture! Had a great team. People are helpful. No company politics. Things are transparent. Learn new technologies, great managers in the site. Yahoo is at the forefront of lot of technologies especially related to big data and online and mobile advertising systems. fantastic engineering army. I learnt a lot over the 7 years I spent at Yahoo.Great people, projects, intern mobility. So many projects for a designer to work on, from mobile to desktop Review tickets in job queue and prioritize as necessary.As a desktop support technician I learned using Web based applications for internal business. I never saw much management in my area.Great workplace culture.The hardest part of the job was learning all the web based systems and all the plugins needed to make them work.The most enjoyable was good people,  a fun place to work and still be productive. Yahoo was a great company to work for - we were always having fun but working hard too. The benefits were great and there was always an opportunity for career growth. I actually loved  working  there. I wish they had stayed there for us , but  barely even  gave us notice when they left.They should have  gave us more time and opportunity. Worked long back, not sure about the current state, i think its sold to verizon now. It was a great American company, i was part of this when it was declining, had developed work processes, and elaborate employee work benefits. The company has a feeling of defeat throughout .. defeated by Google.  It's a terribly boring place to work.  The management is often absent and/or hostile in their interactions. Great team chemistry and a positive culture created a family style environment. This allowed for more challenges and thirst for knowledge. As a team, we succeeded together, and failed together. I really enjoyed progressing individual's careers and building great relations with everyone there. Strong teams get to work on a lot of interesting problems at Yahoo and if you can find one with a great or even good management chain, you'll be in heaven. Most disappointing to me was the lack of strong leaders in management at all levels. Yahoo was a fun and energizing culture to work.  I only spent 25% of my time onsite.  It had all the amenities you would want, great food, awesome fitness center, large outdoor spaces, fun events etc Too bad the company could not return to growth. Collaborative and fun workplace due to team being hand picked. Work life balance came with time and earned trust. Managers are hateful , little pay , too much hours of hard work and no benefits , that's job literally sucks , I wouldn't recommend it to anyone , managers take everything personal. A typical day involved checking tickets and completing the tasks that came up.  I learned to use some scripts in dos and the wonders of remote software.  The management was nice and as long as you respected them they respected you.  The people were organized and when we had large projects we worked together.  The hard part was getting access passwords to help to admins, I couldn't do all the requests that came in.  I enjoyed the quiet when there wasn't mass pages and the steady work request we had coming in. It was a fun place to work but they focused too much on the fun. My dept. was too worried about perceptions and there always seemed to be some fun event going on. I always wondered when the engineers actually did any work. This is a nice place to work in where it has a nice gym and that there has lots of tech talks that employees can learn a lot.However, the managements has been keeping change too much. Fun environment to work in, but can be highly stressful at times, especially around the holidays. The employees were very friendly and kept a positive attitude. It's good to work here.You can improve yourself by gaining lot of experience.Apart from work I also enjoyed the workplace culture.Everyone is so cooperative. Yahoo is a good place to work at with good intelligent people who have a good grasp on technology. All teams deal with large scale and volume that is parallel to other major companies in the same space. I worked at Yahoo as a Software Engineer Intern II for more than 8 months.I got a chance to work on latest opensource technologies and it got deployed to production.The culture at work is awesome. I worked 4 x 10 hour shifts for 7 years.  Every day I would come in and work with friends.  There were drinks and snacks in the fridge. There was always work to be done, but the time seems to fly by.  I learned how to use Red Hat and FreeBSD, and how to configure switches and routers.  My direct manager was awesome, he was a very task orientated person so, you better have your tickets worked on and updated.  But, if there was a major issue, he would have your back no questions asked.  The thing I miss most about working for Yahoo, is working with some of the smartest and most influential people in the industry. I have never worked at Yahoo. This is a weird  computer glitch that I can't undo. I would like to smash my computer now and run screaming out this room because I cannot stop this stupid problem, Culture, work, and competition everything is really great at Yahoo. Seniors support really well and encourage to do new stuff which helps every starter to grow, Strategy changes often, which effects teams directly. No job is safe;  everyone is on the edge of getting laid off at any point in time because of strategy changing on a whim. Benefits are good. Some of the perks are still good at yahoo! like Free Lunch.Management is not very bothered about career growth of employeesFrequent layoffs drain good talent Yahoo was a great company to work for - we were always having fun but working hard too. The benefits were great and there was always an opportunity for career growth. Excellent environment, can move around within the company to find roles that best suite you, campus is really nice and the cafeteria is excellent. I highly recommend Yahoo. Quarterly written reviews and goal summarizing would barely be completed when the next cycle had to start. Being a people manager at Yahoo was very challenging. Constant change and could never finish anything before minds were changed. Layoff was a blessing. Great place to work and grow.  I was able to manage and support 25 plus employees’ careers through training, coaching and professional development plans. Going on 4 moths here as a contractor.  They really treat you like one of their own!  Since my team is small, I get a lot of input.Free food every day, gym, and you are valued here. nice IT departmentlearned a great dealvery poor managementtemporary employees will not lastYahoo's corporate culture is all very paleWould not recommend it is a great place to work but ive been here a year and has already gone through 2 rounds of layoffs. job security doesnt seem important however, since yahoo merged with verizon it seems they are making lots of changes. Above title says it all.  What more does a person need if your basic needs to provide for your family are taken care of.  To much emphasis is placed on what can the company do for me and not enough on what you can do for the company. Buena compañía para trabajar, no tanto el ambiente. Great culture, very professional staff wonderful flexibility the best part of this job is the culture, the food and the snacks they have for free and they are willing to make you feel like a family Yahoo is a very open minded company and it has huge resources to learn and grow in the technical field. Also this is a dun place to work at including free foods and so many perks. It was a long process waiting for Yahoo to be sold.  And the reality of going through the merger has been tumultuous. It would have been beneficial to have hired  a 3rd party to combine the AOL and Yahoo Brands based on profitability. Everything's good but the company did not increase salary for 2 years. Usually start working at around 10am and can leave at around 5pm. Also, free food is a plus. I had a great experience at Yahoo as I l managed a team of sales folks across the country to provide the rights solutions to our clients in an ever changing digital environment. We acquired many companies during my tenure there and had to pivot quickly to incorporate this within our offerings to our clients! The day starts well with a heavy breakfast at Yahoo's Cafeteria, followed by typical 15-minute stand up meetings with the team. After that, you start doing abit of work and its lunch! After lunch, you go back to work and grab a smoothie around 3-4pm and the day pretty much ends from there :DAs an intern, you will get a lot of opportunities to learn about other technologies which your colleagues are working on, even if you do not require them in your projects. Working hours are fairly flexible too and many yahoos do work from home from time to time, so I guess its a great destination if you have kids! By far the best place I ever worked for! Best culture, still a big name in the tech industry. Projects are global and with Peta byte scale. The coworkers are friendly and helpful. There are a lot of smart people and a good environment.I like working here, but I would like more possibilities for career growth. Also, I am a parent and dividing the time between family and work is challenging and time consuming (commute/dropping kids at school) etc.You end up in the evening completely exhausted, after spending hours in traffic. I wish they would offer the possibility to WFH in some occasions. This would allow to save commuting time that could be used to do additional work. Yahoo! is a web services provider, wholly owned by Verizon Communications through Oath Inc.[7][8] and headquartered in Sunnyvale, California. The original The work culture at Yahoo was amazing. Colleagues worked closely without fear of being blind-sided, thus amazing things were being accomplished. Great work balance and benefits. Great place to work! Free catered breakfast and lunch is wonderful, as well as the people I work with on a daily basis!  Would highly recommend this company! Best ever experience working at Yahoo as an Intern.Learned what is it to be working for a Product Company. Proud of my work as my work impacted millions of users each day.Most enjoyable part of the Job was working in the Trending Now team, have enjoyed each and everyday meetings, to code jams etc. Yahoo was a great company to work for - we were always having fun but working hard too. The benefits were great and there was always an opportunity for career growth. My time at Yahoo coincided with the run-up to the Verizon acquistion.  Because of this, my organization's effort were much more focused on a short-term revenue push vs long-term strategic planning. Put your running shoes on! It was a great place to work - we were a big family.  We spent alot of time together, both in the office and during offsites in town and out of town.  Management was wonderful, always willing to let you take the ball and run with it.  No micromanagers.  The culture was very start-up.  Not corporate at all.  The hardest part of the job was trying to read everyone's minds. I didn't always know what the right thing to do was, and didn't find out until after the fact. But I learned through trial and error.  The most enjoyable part of my job was making people happy. The environment is great.  A fully staffed cafeteria that is free to all employees is a great perk.  I work there as a freelancer.  No job security. Few Staff employees, You're working with a lot of smart people who are collaborative and solution minded.  There's a good mix of work/life balance, along with great benefits and opportunities for advancement. Very friendly IT team that is amazingly well integrated.I was there foe 1 year contract. Major work was 11i support and R12 upgrade.  Both were successful.Started R12 upgrade with 11s of CEMLIs and resolved all of these, and the the go-live was very smooth !! I really liked working at Yahoo.  I left because there was absolutely no chance to advance. Also, Yahoo went through a rash of new CEO's and the company felt 'unstable.'  The benefits were good.  The pay was a little on the low side compared to other datacenters in the area. I worked at Yahoo for 12 years. The people are amazing and the benefits are top notch. There are a few issues with departments not working together (sales/engineering) but I hope this gets streamlined with the acquisition by Verizon. Company acquired.  My contract position was relocated by the company acquiring Yahoo to another state. As a contractor I totally understand.Contributed and learned alot. Everyone is friendly. Great place to work, for committed employees! Put in the time and see the results. Learned a lot about the corporate world, and how things run in silicon valley. The is no typical day at Yahoo. The work is intellectually challenging and you get to great with world class engineers. The marketplace and partnership management functions were very challenging - juggling the demands of Google and Microsoft were the highlight of a long career. at Yahoo. Awesome boss, great social culture (gym, food, social events), ranges from slow to fast paced - good balance, got to work with so many different teams - legal, engineering, designers Great offices, intelligent co-workers. Infrastructure to work with. With an good manager at the helm one should be able to learn considerable amount tech stuff in a year's time. Good company to work for , however job security is an issue. Company going through the down sizing , so they PIP program and will not lay you off , in order to save the severance package. A great silicon valley culture full of benefits and perks. Competitive salaries and excellent job/life balance with very inclusive policies. It was a pleasure working for them. Great Culture and great people. A place you really want to go everyday. Very helpful team and great leadership that listens to all levels and believes in you. Good place to workGood place to learn new technologies and share the knowledgeFlexible hours Good salary/ benefitsGood teamFree FoodFree gym/ yearly 5K run/walk In the short period I was at Yahoo, I learned a lot. The culture was challenging and the leadership was constantly changing...yet, I learned a great deal from the adversity. good place to work 'Good place to work short term to learn'StarStarStarStarStar	Current Employee - Anonymous EmployeeRecommendsNegative OutlookApproves of CEOI have been working at Yahoo full-timeProsGood technology, smart co-workers, good perksConsManagement is a mess, no long term plan I write the FC Barcelona Blog for Yahoo Americas and Spain in spanish.I write a weekly blog. I have freedom to choose the subject of my blog, that's because i worked already for many years as a full time employee for Yahoo! Very good place to learn and have fun with ping pong. I mean seriously, I liked the work culture at Yahoo and employees are treated really well. Lot of good Engineers who are talented and provide innovative ideas, truly motivated, lots of fun with games and flexible work timings. Except for Job security with recent changes - its really good place to work for. ! Yahoo was a great company to work for - we were always having fun but working hard too. The benefits were great and there was always an opportunity for career growth. Yahoo is a great place to work, great people, great environment.  This is true, however if you are a full time employee.  Contractors who worked there do not have full benefits or access that others do. Yahoo, is a fun loving place where the peers that you work with becomes friends for life. The cross collaboration between orgs is fantastic and free lunches do not hurt. Nice diverse working environmentFantastic free food and some fun eventsExciting company to work for. I look forward in arriving at work  between 7AM and 7:30AM every morning and contributing where I can.   When a company looks out for its employees like this then as an employee all you just want to do a  fantastic job for them. I worked originally at hotjobs and it was acquired by yahoo.  The culture was very different because hotjobs was based out of nyc and yahoo silicon valley.  It was a warm and welcoming atmosphere but it took a while to assimilate the two companies post acquisition. Great people , Great teams and a willingness to go the extra mile to help your fellow colleagues.   A tremendous amount of changes at the top of the org. that had to be worked through. Great place to work and learn. Great people, who are genuinely interested in the progression of your character. Not a lot of growth as company is slowly doing worse and worse. loved working at Y!  would love an opportunity to work with the teams I met there and given the chance I would do it in a heartbeat.  the environment was collaborative and fun. It's a fun place to work and awesome benefits including free food. Enjoyed working with talented people and work environment is competitive and fast paced. I loved working at Yahoo! which provides a well balanced worklife, the culture, working environment, learning scope etc. Every week, an events will be organized for the employers also the cultural activities makes me more excited.Work culture will be super cool here! As with most tech jobs, there's a constant need to stand out from the rest. This typically involves looking for projects to work on that will help improve the company's bottom line. The culture and environment are great, though, as well as the people working there. The perks and benefits are the best I've ever had. Yahoo had an amazing culture and was a great place to work for.   At time middle management would make head scratching decisions that would both demoralize the workforce and make no sense. studios department is essentially a small company that has the backing of a fortune 500 company. best part of the company is the people that you work with, but career development and growth is very limited. Soon Yahoo as an independent company will be no more. It was an awesome run but like all things great, they eventually come to an end.It's a great culture w/ plenty of perks. It will be interesting to see what the immediate future holds for OATH post-acquisition. nice place to work where you can learn a lot and keep balance. it's encouraged to do something new. pressure is fine. focus on delivery. open environment. nice communication. Although we maintain and provide exceptional service to our client, we provide and initiate goals and direction. 100% success rate with no thefts and burglaries. However, employee / vendor tailgating is a constant vigilance we provide at our three building structures. Incidents reported and solutions provided upon thorough investigations. Was responsible for development and maintenance of  the legacy version of one of the property of Yahoo Sports!Learnt how to maintain the high traffic website of Yahoo and fixing the security issuesWorked with highly talented persons is the most enjoyable part of the job Really like Yahoo. It's a great place to work for. Definitely learned a lot while here. Top leaderships have made poor decisions here and there, but middle management is just awesome! Great experience in a fast pace environment, great co workers, and great variety of cultures that they hire make work life fun. This is a work hard play hard type of company which is what I prefer. Employees join general work hard . Senior management team is too weak to right the ship. The CEO has great intention to bring the company to the next level but her staff are too weak to implement her vision. The people were great to work with.  The work place was casual and teams great team players.  Benefits were good.  Management at the time was nice and willing to work with you on your concerns. Yahoo was a great company to work for - we were always having fun but working hard too. The benefits were great and there was always an opportunity for career growth. A great company to work and at the same time a fun place, where we participated in different activities of learning and community service.I have learned to work individually as well as in a team. As a News & Front Page Editor, I am in charged of breaking news coverage and news updates. In addition, I work with internal and external editors to commission and shape timely, exciting content. The company also treat employee very importantly. The food here is very good. You can have breakfast, lunch, and dinner here, and the quality of food is so nice, including Chinese food, Indian food. Yahoo's culture is all about fun, irreverence, and constantly trying to be on the cutting edge of the latest technologies and programs. I think working at Yahoo has really helped my career because it has presented me with a variety of job opportunities where I could really challenge myself and grow my skill set. The people are really friendly and helpful and they work extremely hard to deliver the best quality products. I gain lots of experience working in this company. It has a good culture and team work. The management seems to change more often due to company overall performance. But overall, it is a good experience. Hardest part of job: The instability and directional changes Best part: the people A typical day: no typical days!Learned: A great learning place Culture: Too old school for me; but they put in a great deal of effort to make you happy Work closely with CMO and key decision makers of fortune 500 companies to identify solutions to their marketing needs while utilizing a wealth of resouces. * I learned complete agile environment * It is really fun environment for the people who wanted to show their skills and the management is very encouraging and very sportive* I really miss it. Working for Yahoo Studios has given me the ability to work with all of Yahoo's verticals including News, Sports, Finance, Style, Beauty, TV, and Movies. Being the assistant editor for all of these verticals I have acclimated with working with various media, workflows, and looks. With that comes the pressure to work with all of them in a professional and concise manner, and at times simultaneously. However the coworkers at Yahoo Studios make this pressure worth the effort. Very strict on security for customers. Your attitude and punctuation should be on point. Work alone all shift. Need to be able to listen carefully with all different accents calling. Great company to work. Exposure to good technologies.The people were very friendly and nice to me, I didnt feel left out at all.great culturegreat perkssmart, friendly people Help customers find the products that meet their needs and sell customers as many products as possible. Maintains facilities by planning space allocations, layouts, and floor moves; arranging for and supervising building maintenance.Responsibilities included screening calls; managing calendars; making travel, meeting and event arrangements; preparing reports and financial data; training and supervising other support staff; and customer relations. Yahoo was once a great place to work. However, industry turmoil and competition forced changes. Despite public perception, Yahoo has outstanding products for both consumers and advertisers, however, they simply will not spend the money to promote themselves through advertising or PR. Lack of audience has been the death of some otherwise outstanding products and services. They invested so much in start-ups for the technology but ignored both B2C and B2B PR problems that could easily have been solved by contracting an outside firm. Incredibly broad digital media offering with scale and data resources that enabled unique client conversations and programs. Being one of the pioneers of the web, it still has that charm in it. The quality of work and work-life balance is extremely good. Good, solid technical work and tools to do it.Management good overall but my manager had blindspots.Most coworkers good to work with but my team in effect provided limited useful training. Yes, this group does have a ping pong table. It is a team with many smart people that know what they are doing. They are willing to experiment with new technologies like React. Nice coworkers and culture. Good technologies are widely used here. Good work life balance. Lack of a vision of promising future products from the senior levels. Yahoo Music was a fun, fast-paced work environment with smart, dedicated people who worked well together. The company had several partnerships that allowed staff to collaborate on projects with other major entertainment and digital companies. Over all it is a good company very friendly and nice staff. Im just looking for advancement with in the company, to excel to the next level and its not up for option. We would always get spliffs and extra ways to earn money. I did not feel secure all the way because of the business. The job did not have benefits which is a plus to have a better future for myself and my kids. Loved working here while I was in California. Once the position was transferred to Oregon, it went all down hill. Management decided to make new rules and treat they're employees like children. Yahoo was a great company to work for - we were always having fun but working hard too. The benefits were great and there was always an opportunity for career growth. Each day could be different than the last at Yahoo.  One day you are in sports production and the next you could be on a plane to DC intv. the president.  You're able to learn other positions.  Management is extremely fair and treat you like family.  Co-workers are the best in the industry.  Everyone gets along.  Hardest part of the job is not knowing if you'll have it in 6 months.  Most enjoyable part is all the perks of a full studio and connection to all the major events.  News, Tech, Sports or what ever. Lot of talented people and lot of fun loving environment.One of the early pioneer for open source community. Lot of new innovation and passion in the environment They try and pretend they are different, but it's just like working in any other call center environment.  It's all about how short your calls are, how many you take, and how well you can stick to a script.  The benefits are great, if you have to be stuck doing call center work. State of the art facilityco-workers are very helpfulteam environmentability to continue/further your careernegative: job was very redundant (not enough stimulation) A typical day included news gathering, writing, editing, building site, working with freelance staff, collaborating with other departments, working with content partners. The most enjoyable part about the job was working with great people and getting to interview highly respected music stars. Started off as a dream job but slowly (over the course of 3 years) turned south with layoffs and incompetent middle management who seemed less concerned with core Yahoo goals and beliefs. dealing with invoices and budget issues plus handling vendors and contracts, people attitude at Yahoo that I worked with on issues. lots of companies to deal with because Yahoo purchase 28 companies in one year with no process in place. Full of high energy and amazing team members. Fast paced environment. My managers were great. I still keep in touch with them. I've worked at Yahoo for my entire professional career.  I've seen the company grow from a fun start-up to a full fledged company.  Yahoo has worked to be a leader in the industry; however, there were many years where Yahoo did not provide a clear strategy externally.  This same lack of focus was evident internally as well, which impacted overall morale.The people at Yahoo are amazing, and the atmosphere is one of collaboration and involvement.  Yahoo does a great job in ensuring inclusiveness of all people, and the overall awareness of social issues and the world is encouraging. I get a media pass at San Diego Charger games and report over live radio what is and has happened in the game. I have learned how be a more productive speaker and getting to the exact key points of what is going in the game as I only have 1 minute to describe everything. getting everything summarized in a minute is the hardest part. Good Place to Work, great culture, waning market share.Focus on collaboration and team environment.Lots of perks, such as beer, offsites, games, etc.A little tense right now due to business conditions and the macro environment. Yahoo! has it all, great people great technology and projects to work on. The benefits are also awesome and they have a good work life balance. The free food is excellent, lots of choices, healthy and tasty. Yahoo! is a great company to work for.Great benefits and perks, the culture is awesome, and there's always lots to do.I would recommend this company to everyone! The staff is great. Always busy in the office, never a dull moment and always gaining knowledge in the field of production. Fun events and projects are always at hand moving forward in cultures. Amazing place to work if you don't mind a lottery style management system. The coworkers and work place was amazing, at least when I worked there, but hey lay offs and cut backs can diminish a place. I felt challenged on the job and successes were meaningful as you helped to turn businesses successful.Changing metrics turned it from an interesting place to work into a grindhouse.Metrics changed months after I was hired.The highest paid 'non-essential' staff was let go. Help to support Yahoo customers via chat and email support only. We were doing phone support but that has been downsized. I worked as a contractor at Yahoo, and only for the amopunt of time that Yahoo limits for contractors. Because of my technical background I also got involved in creating pages for mobile search.Yahoo interviewed me for full-time employment because of my high productivity/output, it did not go through, however, because of the proximity in time to the lay-off in 2016 for which the people interviewing had no knowledge was going to happen. Work/Life balance leans much more on the Work side. Nearly everyone you work with is passionate about what they do and are supportive of each other. The people are what make the environment enjoyable. Typical day: Constant flow of requests for various design either pre-sales or post-sales that SHOULD have a one week turn around due date but have to be done in a day. Two at the most. A typical workload would be about 5 projects at the same time. Dealing with sales and tech AND the big client.management: All the designers are managers. Always begin a project with a kick off call; including the necessary team from other properties and verticals. From beginning til deliverable or launch date.hardest part: short deadlines or if the client isn't being fast in their responses and excess number of changes.enjoyable part: getting it done without a hitch When I joined the company, there were great people, a ton of industry leading technology, and a sense of camaraderie as we tried to turn around an industry icon.Unfortunately, Yahoo never figured out its 'one thing'.  The one constant at the company was no product was ever finished.  Yahoo had a 'ship and forget' mentality, and across all of the CEOs I worked for that never changed.Despite all of this, I really enjoyed my experience there.  It was a fantastic training ground for learning how to execute in challenging and dysfunctional environments.  Those product leaders who could work well with others, fight without ego, and drive towards a common goal were able to deliver despite everything else going on.Few other places offer the scale, impact and global reach of the products we worked on.  However, the past year has shown a significant, and fatal, decline in leadership, culture, and opportunity. Yahoo was a great company to work for - we were always having fun but working hard too. The benefits were great and there was always an opportunity for career growth. Workplace with lot of opportunities to work on systems of large scale spanning several key areas. I had a chance to work with several intellectuals at this organization Awesome company and place to work at. Fast pace! Enjoy working with different C-Level executives in many of the company's orgs. Amazing balance of work and life. I had the pleasure of getting to know a lot of amazing people in my 10+ years at Yahoo.  The relationships formed there will never end and it was fun to work with individuals who had the same mission as me.  We took our work seriously but we were also able to have serious fun.When the work became more demanding, at times, everyone knew their role and worked as professionals--never appearing entitled or threatening.  I learned how to be a team player and a valued component and was able to teach those important aspects to others down the road.I was proud to work at Yahoo. The state of company is unsteady. Too many org changes too often. No job security. My team is understaffed and overloaded. 7 years at Yahoo, met so many smart people that kept my desire to learn more going. Spent all my time writing software and automating complex processes. Because Yahoo touches on many parts of the industry (display, video, programmatic, search), there is a lot of value in the learnings you get while working here.  They also take good care of employees with good pay, benefits, and work perks (free snacks, lunch).  The only thing to be concerned of is the future of its business as it has officially announced that it is officially exploring a sale of its core business. Vey Nice company to work , very good work culture, management are very supportive, they help you in every area.They are very good for immigrant employee , and has very good team Yahoo is a huge platform that has struggled to find identity. It can't compete with Google as a search engine; it doesn't have social network immediacy of Facebook. I'm here because Yahoo had the idea of becoming a content provider. And indeed its digital magazines, in addition to original news, politics, finance and sports coverage, in my opinion, are, or were, excellent. However, the company failed get the word out that there was such rounded, broad coverage, including health, travel, food, tech... There was little to no promotion on the old or new home page, unfortunately. To me what seemed like a lot of potential for growth has turned into cutbacks in the editorial product. Amazing environment to work in. My manager is superb and very friendly. Unfortunately the company isn't doing so well. Yahoo's first data center built from the ground up had its Grand Opening in December of 2007 and I was a part of this wonderful occasion. It was a very family oriented company to work for but with a lot of management turn-over and growth changes it seemed to have lost focus on the family values. It was a great place to work nun-the-less. I loved the people I worked with and most of us (new and old) became very good friends. Large companies arrive with a wealth of issues as well as benefits. Things are no different in Sunnyvale, where we've had our fair share of challenges. The companesation here is excellent, but right now the company's vision is still being determined. I was excited to have the chance to work for a high profile company such as Yahoo but I found the management to be poor and chaotic at times.....very disappointing , great IT staff. Impressive facility. Directionless, poor leadership, identity-less company. Wonderful people work there, but they seem to clear house of all leadership every two years. No one gets too much of a chance to succeed. The Yahoo Contributor Network did not really pay well, though it was a great place to put stories on it never really brought in the money. It was a steady job. Security is the kind of job that will pay the bills, but has no real future.It was interesting, working behind the scenes at a busy business park. I learned a lot about fire alarm equipment and access issues. Bloated middle management neither understands nor encourages creative team(s) to innovate on a stale product offering •	Extensive experience of 6 years of developing product and information architecture using SDLC by requirement analysis, design, implementation and testing. High tech company, a good environment and great and supportive people to work with, also good place to work and grow .Yahoo is  company that is known world wide, its a company that cares about its employe and customers. .Need more active things to do can be boring and not attentive to work due to sitting behind the desk all day. But decent benefits and management team. Product Analytics at Yahoo gave me the chance to learn about how user behavior is affected by changes to products. Discovering patterns among a broad user base has its challenges and would have loved to learn how to penetrate this space further. Yahoo was a great company to work for - we were always having fun but working hard too. The benefits were great and there was always an opportunity for career growth. Great company, great benefits, culture is very good.  Best company in the WNY area to work for.  Yahoo has the best people, jobs, and culture. The editor's desk made it possible for me to improve my writing skills, which has been invaluable.However, the pay was extremely low unless you got a massive amount of clicks. It's a good company to start the career. Lots of freebies. However, the morale is quite low since the company used to be No.1 in social media. It's feeling like a falling ship. It was fantastic to work for a large company that was employee centric.  The work, benefits, and atmosphere were the best. Great place to work. Many amenities available to employees. They make you as comfortable as they can while expecting you to work hard. The change to Marissa has lifted little of the culture and precedent set for by previous CEOs. The landscape has changed and they are reacting slowly to the market - they take 2 steps back with every new change to the environment.Direct management is great - one of the best managers I have ever worked for in the last 6 years. Unfortunately, the higher ups are comfortable in their positions, so there is no room to move up.It has been great to work in a multinational corporation, but my time is better spent with a company that has a clear future. whatever  yeah bad for  me great for others. If you get stuck labeled as the bad guy you won't get trained on anything or go any where Yahoo has a big name and is a fun place to work at with lots of good , talented people around. Lots of things to learn. Free lunches available. Fun colleagues always considerate and with readiness to help you out, awesome management, flexible time shift due the benefit to work from our homes. Incredible and challenging projects. Many great benefits and perks, but still too big, too corporate, too hard to get things done. CEO is great but middle management layer is pretty bad. Company goals are changed very quickly. Not good and fair for QPR. Higher managers know nothing what their members do everyday. Excellent company to work for. Smart, grounded colleagues, ethical and community-oriented culture. The engineering, Design and Product Management teams are quite stellar. worked in generating leads and sales and had an excellent mentor. learned new technologies and wonderful overall venture I enjoyed working at Yahoo. Great and talented people. There were lots of exciting and challenging projects.Free foods, cell phone was provided and paid, mac laptop. All good. Yahoo Inc. was a great place to learn new skills that I still did not posses, as well it was a good place to learn to work under pressure. Had a very collaborative team and everyone was always willing to help and share ideas among the team. Employees have been laid off after several years, only a few months, or in one case--the entire group was eliminated 2 days before the new hire's start date. Press is calling them 'drip layoffs'.  Poor people managers who have gotten more political and micromanage more as a result of quarterly goals/reviews.  If you're lucky, very lucky you might get a manager who will have your back.  The current executive team is killing the great employee team culture there by pitting everyone against each other. I worked for Yahoo for 18 months and enjoyed my time there. I found that they had a nice laid back approach to work and it was very refreshing. Pay and benefits were all great! I actually really miss working there! Yahoo offers many great benefits to full time employees such as gym memberships, insurance, phones and phone plans and also free food and drinks during our shift. It is a very casual relaxed type of work environment. The down side can be working odd hours, weekends and holidays. We are open 24 hours 7 days a week which can make it difficult to have time for family and outside activities depending on your shift. It is hard to advance unless you consider relocation. The culture is amazing and you won't find a better group to work with. However, there are always changes from upper management and our strategies and vision seems to constantly change. a good place for new grad.studenta lot of new thing and new technology to learngood work life balance and good compensatoin and perks Yahoo was a great company to work for - we were always having fun but working hard too. The benefits were great and there was always an opportunity for career growth. I worked as a contractor in the SEO department for a huge merger they were conducting.  The hours were long and some days it was brutal, but the staff couldn't have been more nice to all of us contractors.  Yahoo opened their arms and office to us like we were one of their own.I would have loved to work their permanently.  It was face paced, never the same and never dull. Yahoo is an interesting company to work for. The work is,well always there, so the people are what make a job amazing and Yahoo is filled with great people. Nice campus with free healthy food. But truly, the people at Yahoo are just wonderful My typical day at Yahoo consists of assisting customers through different properties. I am cross trained in handling email accounts, mail tech, Flickr tech and billing. Working at Yahoo has been a great learning experience. I was able to learn so much about the tech world and how emails are handled from the back end. I was able to gain many work and personal local and global connections throughout the company. I Love Yahoo! Spent almost 10 years there and would spend another 10 if the chance came about again. I don't know what else to say than if you ever get a chance to work there... Take it! Yahoo was great to me over the years and I did enjoy most of my time there. But as of late, under this current executive staff things are out of control. I will not name names, but I do not see a long future for what was such a bright company. There are a lot of great people doing good things at the company. While some departments are strong and getting stronger, other areas seem to lack direction. This may get better as their future becomes more clear. As a Search Editor my typical day would be evaluating linguistic analysis of search queries; assisting in different methods of testing by judging algorithmic results; testing for quality assurance, relevance;In general creating better user experiences one large data set. Good company to work for - really take care of their employees. Good communication company wide - fun culture and work atmosphere. Yahoo provides most versatile experience and challenging projects at your desk. it helps you to think in direction to serve millions. Very good culture, benefits and compensation. need to balance work can get hectic at times. Management is normally good , but some decisions can leave you scratching your head. Daily work performed at and for contract of Yahoo!. Zagwear enjoyed seeing results with little to no direction given to their staff. They also expected little to no questions being asked and tried to keep most of their process as a needs to know basis. Overall they were out to make money and at no cost to them. What I love:Being with extraordinary colleaguesSolving critical business problemsGreat mentorsHardest part: Ambiguity in roleRealignment & Restructuring Working 24/7 wasn't enough.  Their quarterly goals will burn you up and spit you out...and then they'll just hire a fresh person that knows nothing for you to train them so they can take your job. I enjoyed my role here tremendously, but departmental cuts kept whittling down my staff and pretty soon I only had the outsourced team. it was a laid back but busy environment. I enjoyed working with the department I worked for. the employees were very nice and informative if I didn't understand something. I loved the big campus the company was on and the various services they provided. the food court was awesome. Zing was a fun and exciting start up company to work for. The leaders of the company were driven to make it succeed. The location was perfect, lots of places to hike/run and fun hip places to eat. Great place and small with office with so many new people from different locations and talents combined to build a big data pipeline. Although Incident Management can be a very stressful position, this is neutralized by a great team atmosphere.  Co-workers are willing to lend a hand when in need. Most enjoyable part of the job was the people i worked with everyday. The overall work culture, and career advancement assistance. Assisting clients with password recovery with 8 minute handle time. Assisting clients with browser troubleshooting via email within 4 hour turnaround. Yahoo! would be a much better company, if it was real diverse. diversity does not mean only moving people from India.  This over exceeding move now are going to cause problems for the company. diversity should have a fare distribution. Yahoo was a great company to work for - we were always having fun but working hard too. The benefits were great and there was always an opportunity for career growth. crazy awesome place to work I loved the opportunity.  The management is outstanding, everything there made me want to come to work everyday and contribute to my job as best as possible on the daily. Working environment was great. Was given a great opportunity to grow with the company and given many responsibilities with trust in finishing and executing each task. A typical day at work included communicating with CFO and COO on daily tasks that needed to be done for the week. Included inserting sales orders, creating sales proposals and other tasks required of me. I learned that I was able to be able to leave my comfort zone in order to complete tasks in radio that I was not diversified in. The management that was above me helped me out constantly to keep me encouraged to help finished tasks that may have been a larger obstacle than normal due to the lack of knowledge of radio lingo. The hardest part of my job was understanding the different terminology in which radio had compared to other office environments. My co-workers were great to have around keeping me motivated to come to work daily to enjoy being there. The most enjoyable part of the job was just being able to be around the different entities that went into being a sports radio station, from sales, to office administrative work, to radio trafficking. Rewarding yet challenging workI would recommend others to work here Great place to workGreat co-workers to work withThere's lots of scopes to work/innovate Yahoo is a cool place to work with free food and job work / Life balance. There is always room for advancement with plenty of job security. The culture of the campus is multicultural and a great place to learn from other people. Yahoo! had a lot of very talented, interesting people working there when I was there. But many hours of time were wasted as 'fire drills' happened when various departments would have issues with each other.The pay was excellent, the commute rough, my coworkers were great.I appreciated the opportunity to shift to various jobs within the company while I was there. Good company culture and train you well and put you in a position to succeed. I worked for Yahoo for a year, within that year I've seen my department as a revolving door of new people. The team I worked with went through at least 3 major changes in order to better serve the goal they were trying to accomplish and in my opinion they still do not have a working model. My talents, along with some of the talents of my former co-workers were mismanaged in order to better serve the needs of management, from the time I started I was 'guided' into an area of Operations that was not suited to my knowledge and experience. The work/life balance in the team I worked with was barely manageable. The shift was 13 hours long and while you were given a 90 minute break, it didn't make up for the fact that every other week you worked 65 hours. The job itself was repetitive and unrewarding but the benefits were there to have you stay and they tried their best to make sure that you felt appreciated but that sentiment was not always there. with free food all day, gym, phones, and mac laptops it's generous.quality of food decreased during my tenureBUTthey expect you to work 10+ hours a day with virtually no chance to advance.  They eliminated QA so we had to do everything.  They play games like only SEs have root, to eliminating SEs, and then you do all the work.  Managed by asshats for the most part.  They are super smart but still don't get it.  Too many incompetent people.  They did pretty much let me code what I wanted except for some ridiculous 'we don't use python'.  force me to write in shell. sillypeople actually wait in line to get Marissa's autograph.  Imagine chinese and indian families lined up to get her autorgraph.  too funny Would love to work for this company forever, the datacenter is closing down. Manager and colleagues are excellent people. They are team players. Wouldn't ask for more. Great benefits.  High paced environment.  Work from my inbox so there isn't a 'typical' day.  Each quarter we have new goals to focus on that determine the companies priorities for the next 3 months. One of the best companies to work for.They are extremely accommodating .Co-workers are extremely helpful and motivational.They are all about building relationships and firmly believe in that with their actions, I was there for a year. It was fun but no alot of opportunities to grow. reported to the VP of ERM and Internal Auditled operational auditsPerformed risk assessment working with ERM head A typical day is very busy -- my job would require engaging in calendar management, executive scheduling, travel arrangements, helping employees with meeting schedules, conference rooms, expense reports, social events and day-to-day operations.  The hardest part of the job would be to juggle the large amount of work and e-mails.  The most enjoyable part was the people, my executive and my co-workers -- we worked hard and played hard! Fun place to work - very laid back but always busy.  Great team atmosphere and company perks Great executive staff. There's vision for where the company is going. Co-workers were friendly and helpful when needed. The morning snacks were helpful and unlimited drinks and snacks throughout the day helped. I spent some time there. It was fun. I learned  much. Editors were very kind and cooperative. Yahoo was a great company to work for - we were always having fun but working hard too. The benefits were great and there was always an opportunity for career growth. I have worked with some of the nicest and smartest people in the industry at Yahoo. Unfortunately, the company is struggling to engineer a workaround and work/life balance, job security and advancement opportunities all take a backseat. The most enjoyable part of the job was writing popular content.  Writing for the site allowed me to practice my writing skills. Responsible for leading a software engineering team in Cloud services. Network monitoring, tools, automation and integration services provided to multiple groups across Yahoo platforms and infrastructure.-- Network Monitoring: Monitor all network devices via SNMP or API’s , store data in grid-- Splunk: Aggregate logs from network devices in central splunk instance-- DNS: Dns database (LAMP stack), API’s and CLI tools-- OpenStack: Integrating Openstack with systems infrastructure, VM and baremetal provisioning -- IPMI: Enabling IPMI for console and bootbox services on production hosts-- Security Operations: Automating ticket generation for malware alerts generated by FireEye-- System Administration teams: Rename, Re-ip, Reimage production hosts, via web and CLI-- Finance: Audit of all hosts and network gear across all colos worldwide-- Site Ops: Eliminating Tech debt by identifying vulnerable packages across production hosts-- Edge infrastructure: Configuration automation for Proxy and caching services-- Technologies: Java, Python, Html, Css, Pig Great company.  Miss it dearly.  Loved the culture and the clients. I worked here as an intern while studying abroad. It was a great experience. It's a great company to work for that allows for a multitude of areas to development of any interest. A typical day at work involves grabbing a freshly juiced vegetable/fruit drink and an omelet at URLs (Yahoo's onsite cafeteria), reviewing my tasks for the day, digging into email, reviewing the systems for required action/adjudication of pending background checks, taking a coffee break for a free caramel macchiato.  Next, I schedule calls with candidates whose background checks require additional information or further review and responding to requests for information from clients, stakeholders.  Off to URLs for free lunch with my co-workers and boss. Back to the office for meetings and/or more work.  Mid-afternoon I take a walk around the campus, usually a mile or mile and a half, then grab a quick healthy snack from the kitchen on my floor. Then it's back to work until the close of the business day.  I then head out to catch the free shuttle from Sunnyvale to San Francisco, at which time I might finish up work using the shuttle's wifi, listen to music, play games or watch a movie on my Kindle, or take a nice nap before getting home to my family.I love my co-workers, who have become my friends.  The hardest part of the job is getting things accomplished through our procurement system.  The most enjoyable part of my job is making solid, policy-driven decisions for the safety and security of Yahoo employees and the company's assets.  I have learned a lot at Yahoo and have been given the leverage to shape my program and improve process and technology.  Yahoo-ooooo! This is a great place to work. One of the best places to grow your skills. Great experience so far! Research and write articles either from assignment desk or submit anything you deem newsworthy and interesting. Self initiative required. -Yahoo offers great benefits-Co-workers are all great-Some callers get very upset-Enjoy helping people with their needs-Overall great company! Daily duties include racking and installation of server cabinets. Hardware repair on servers. Retirement of old gear and coordinating pickup of retired gear. Our mini-factory on-site allows us to pull gear on an as need basis for properties to get gear in place as soon as possible. It's great to be around of a lot smart and fun people. Everyone has clear goals to achieve each quarter. There is unlimited free food and coffee. Pays pretty well. A great culture for interns. good compensation, free food, flexible schedule, but also fast paced environment. Position was portrayed different than what it really is. Did not know it was a call center. There are no guarantees for advancement and not much room to grow. Great work life balance.  Would be great if they would allow studio producers the opportunity to become staffed. Great company to work for. Innovation is back and the company is moving forward fast. I worked for Yahoo Search FE automation, designing a framework for SYC and SRP pages, preference and advanced search pages. Maintain different intls and different code base with different buckets. A typical day at work was very busy, but it was always interesting and engaging.  Yahoo has taught me about working in a team and how to manage stressful tasks. Very fast paced and friendly environment to work. Got a chance to work on new tool and methodologies. My primary responsibility was mobile marketing which was exciting as well as challenging. Our team got to work on cutting edge cool projects.I learnt alot and met great people while I was there.I would at Yahoo! again! Yahoo was a great company to work for - we were always having fun but working hard too. The benefits were great and there was always an opportunity for career growth. I love my daily job as I am allowed to effectively make decisions that will enhance and improve the processes of my department The workplace is full of challenges that keep you in engaged. I do not work in an office but online. I submit articles as often as possible on the Knicks and Jets.  The hardest part is formulating ideas into something that hasn't already been produced by other journalism platforms.  Also, not having access to quotes unless taking them from somewhere else is difficult. Management is helpful anytime something is needed and answer your inquiries within an acceptable amount of time. I thoroughly enjoy being able to display my opinion on a platform with the potential for it to be read by many. ahead of the curve on digital content revolution produce highly watched original premium content A typical day at work is your behind the desk, checking any issues involving email portals and answering phones from customer who needs assistance. I have learned a a glimpse of what the systems in Yahoo emails, a very complex organization, but it works. I barely see the management, they were in close net group, and was never curious on the progress of employees. The hardest part was that you felt just a number, like you were a robot doing the work and go home. There was never interaction, and group functions, it was all in your cube environment. The most enjoyable part of the job was just being able to have a job at Yahoo!. Working for Yahoo! during this time was such an honor and an experience I will never forget. I didn't stay with Yahoo! because I wanted to get back into my recruiting career. I struggled with that because I did learn a lot about customer service and how Yahoo! cares about their employees. They let them thrive with their own ideas and gave tremendous support to their customers and employee's. Not to mention they had fun recognition parties letting their employee's know that they appreciate and recognize how hard they work. Great people. The company is currently going through a transition. This company makes a great offer, high compensation including free food, cellphone and gym reimbursements etc. The catch is that you are expected to work all hours of the day and give and give until you can't give anything else. There is no work/life balance and the boss's do not care that you have a family. You are required to compete against ALL of your peers which causes a tense and stressful working environment. Shortened cubicles are claimed to 'open up teams to working together' and you still end up sitting next to people who will not work with nor help you on anything. This is truely the worst environment I have ever worked in. I am currently searching for another company to change to in order get my work/life balance that I miss so much. A typical day at work, I would start at 7:30am and work non stop until 5pm. I learned many different ways to coach and interact with sales representatives. Yahoo has a balanced working environment.Typical day in Yahoo is very relaxed and flexible.Current management showed transparency to employees.People working here are very talented and very professional. -Look for topics on site and pick what I want to write about-I learn a lot about the different topics I write-Good-No co-worker-Keeping a topic under a specific number of words-Writing The culture of Yahoo! is amazing, the environment is highly tailored to the geek chic, with colorful interiors, fun and engaging co-workers, annual events, and a focus on the individual. Pay is amazing at Yahoo! Small Business for the work done. That said it is a call center  which means that the work can be non-stop and there are tight metrics to be held to in regards to average length of call, and customer satisfaction. Performance is bonus driven, and bonuses are generous for quality work. A typical day at work involves a lot of research and design scenarios to create an application. Management is light so the onus lies on you to resolve several areas for end products. Work culture is awesome with several perks. Yahoo! is a great place to work with all the amenities.  The people are great, free food, gym, and commuter shuttles. make sure all dishes and utensils are clean properly.also assist in the dinning area wonderful management, great benefits, great pay.loved working here. Working for Yahoo for the past four years has been a wonderful opportunity to develop relationships with Yahoo employees internationally and to refine my technical troubleshooting and communication skills. Yahoo is a great company to work for. The salary is fair, the poeple and management are great as well. With the company not doing so well over the last few years, their seems to be a rotating lay-off. I've seen full departments get laid off. Before accepting a offer here, be sure your contract as a stipulation to protect you form lay-offs. Fantastic team, poor commute but great benefits for full-time employees. Great communication with management. It is a very friendly work atmosphere and everyone is very helpful. I strongly suggest students interning here as they can learn about every detail should pay attention to as a good UX designer. The manager will be very helpful on your development. Yahoo was a great company to work for - we were always having fun but working hard too. The benefits were great and there was always an opportunity for career growth. I was a contractor for yahoo , had a group of 12 techs where i could troubleshoot the client's computer and printer. Overall it is a great place to work at. The culture is exciting and felt unified. The overall leadership has changed considerably. More recognition is needed for the lower level workers. Great company culture and young employees. Overall it was great job to start out in the corporate world. Pioneered relationships between the movie studios and the internet portal, leading the way in creating new editorial and marketing experiences for audiences and advertisers, strategies now copied and considered standard across the internet medium.My purview stretched across all areas including editorial, marketing, sales, pr and video production.As a traditional Silicon Valley tech company burdened by perpetual executive turn over at the highest level, there was reluctance to embrace the inherent sexiness and differentiating business prospects of being a leading destination and partner in the Entertainment space.As a result, however, I did benefit from much autonomy to grow not just the presence of the movie industry online but also to push the boundaries of my own role which kept my experience fresh and exciting. Yahoo is nice to work for.  You get a 'desk'  on your account and you can choose from articles they need or your own.  They are really easy to work for and how much you work is up to you. fun and smart peoplegreat benefitwhen I was there, there were too many changes at management, but now with the new leadership under Marissa, things have improved a lot Yahoo! was a great place to work.  There is lots of transition and turmoil, but the company is focused on growth and moving with speed on product development.  The mission of Yahoo! is to make Yahoo! a place that consumers go on a daily basis for all their informational needs. During the seasonal position I worked, it was busy and exhausting, but was also a calm environment. I learned how to use UPS Worldship to print labels, how to weigh and pack items up, and also how the company runs. Management was well organized and eve helped with what was needed. The co-workers were rather friendly towards me, helping me when I asked. The hardest part of the job would be locating the items scattered about in the freezers. I mainly enjoyed typing on the computer and being responsible for printing the labels.  Loved working at Yahoo!, Inc.  Great culture and group of people to work with.Management is lacking and unsupervised.  Direct Management was quirky and played favorites.  I was on the favorite list but I didn't like how others were being treated.  Working as a Contributor for Yahoo! taught me many things about SEO, sharpened my research and writing skills, and provides a wider platform for my articles than my own blog or a writing for a less-known entity would. The job is entirely internet-based, and as such I have no face-to-face interaction with other contributors though my colleagues who I've contacted through the Contributor Network were always very helpful and more than willing to share tips to improve my writing and increase my page views.It was challenging to stay on top of current events, sift through search engine data to find which current topics were most likely to reach the widest audience, and then producing a well-written article all before the topic became old. However the feedback I received in the form of reader commentary, as well as the knowledge that my writing was good enough to pass a professional editorial process was extremely rewarding.   I loved working at Yahoo!. I had the pleasure of working with smart people who produced strategic, creative work for appreciative in-house clients. Work-life balance was excellent and even with a revolving door of CEOs during my tenure, I was proud to work there. Fun placeAwesome work cultureGreat team membersEfforts appreciated I enjoy working on articles and the research involved. It helps me understand relationships and human behaviors much more since I have to do survey's. When I talk to each person I understanding their life circumstances depend on their choices. great place to work, nice people, From a laptop the company provided very cool you learn alot about their serversand robotic silos,unix script commands. It was just the daily routineof ejecting media from the silos and getting them ready for shipping to offsite ironmountain facility basically building pallots of metal containers of tape media. Writing test cases in Perl for testing functions of a electronic store Flexible working environmentGood peopleInteresting cultureConstant change... They were easy and efficient to work with.They commissioned articles that I had written for other overseas publications Yahoo! works hard to hire cream-of-the-crop-talent only to fire them after 9 months. This is the company's way of avoiding making full time hires (barely skirting California contracting laws). Most positions there are extremely unstable.Also, the company does not care about you. If you're becoming ill from working long hours overnight, they don't care.Your department could be setting records in terms of numbers, but you will be fired to make it look like the company is meeting its financial goals for investors. Good and very professional place to workWork is devided in th eteam properlyManagment is very coolhelpful • Analyzed the Functional Requirements to fully understand the scope of the testing• Involved in Functional Testing, Regression Testing, Sanity Testing and User Acceptance Testing Yahoo was a great company to work for - we were always having fun but working hard too. The benefits were great and there was always an opportunity for career growth. My day at Yahoo! Sports consisted of overseeing of guest content that was going over the air for our flagship Yahoo! Sports Radio 1560. Through out the day I would go out and cover our local teams practices and their games for both the network and locally.I learned how to become a better reporter, produce and how to build close relationships with athletes.I had great co- workers, we all worked as a team!The hardest part of my job was coming up with segments and ideas or being creative with athletes on interviews.The most enjoyable part of working there was being able to cover Super Bowls and traveling. Yahoo was an excellent place to spend some time working. I learned some new stuff there, working with XML, JSON files and integrating the Yahoo services into an app. We also utilized some 3rd party APIs like DarkSky and Alohar for getting user GPS location data.One of the more interesting and exciting things about working at Yahoo is working with a team. All of my previous experience with programming was done by myself. It was great being able to work with other programmers and designers on a project I loved the opportunities that Yahoo Geo cities Sales job gave me to engage with new people and to learn about what they did, how they did it, what they enjoyed, what caused them pain and whether or not I could help them out.Of course, I also loved being paid to satisfy my curiosity! I loved my time at Yahoo! as I was surrounded by very creative and bright people who worked hard and were given the freedom and trust to produce quality material.I've never worked in a culture where the expression 'work hard and play hard' was so accurate to the employee population.I hope Yahoo! is restored to the position it was while I worked there.It was a good company and a positive influence on other work structures in the industry. I enjoyed every single day I spent at Yahoo! The work culture, the premises, the people, work ethics and overall feel being a part of Yahoo! is very comfortable. I work daily as computer operator ihave learn how computer operates and my management was at yahoo company and my co worker was a computer enginer for me the hardest part of the job was in when ensuring the machines to operate the most enjoyable part was in typing keys. Frustrating to work for.Shifts are bid once a quarter (not discussed in interview or training)Quality reviews used for picking order of shifts uses statistically insignificant sample sizes. (One call out of 2,000 has you working Sundays for three months.)Problems communicating with HR for benefits questions. Great people to work with, co-worker is professional;learn mutitask and get things done; The days at Yahoo! are never boring, things change quickly and you need to be ready to roll with the changes. I manage a staff of 16 in three different locations, Sunnyvale, Omaha, and India. Offers unique management challenges to get the staff to work together to gain synergies. Very fun group to work with, very knowledgeable about their job and how changes in their job can affect yours. We continually seem to run short staffed. The team in NYC is great, very supportive and we found the time to get to know each other outside of work. Problem is the company thinks the media capital of the world is Santa Monica leaving the folks in NYC with the mentality that it’s a bureau/satellite office not taking into account that this is the media capital of the world. Communication between the folks on the west coast and east coast is horrible. West coast managers have no concept of the three hour time zone difference and expect the NY folks to be always available even when its dinner time or time for sleep. With all the layoffs, lack of direction in the company as a whole and inept middle managers that openly talk negatively about other employees I would suggest people to go someplace else that respects you, it’s well worth it. There are plenty of other companies in NYC to find that will treat you right. Yahoo! is a great place to work. Lots of energy and a somewhat loose atmosphere with flexible reign (depending on the position). The hardest part of the job is linking to other writers in my area. There are not very many... Good work/life balance.Good overall work environment but, it is not that much fun.Management is not very aggressiveDid not have any opportunities to move around. I was only there for a short time but, I saw that people who had been there a while were basically stuck in that role for a long time. Its all about employee wellness and family interaction. Very laid back and linient with work outfit. Culturally diverse and great dynamic group of professionals. Yahoo was a good company to work for. I thoroughly enjoyed the people I worked with. Awesome Diversity. Great team work. No day is ever the same. Yahoo at Champaign, IL is a great place to work for. I learned a lot about Cloud/Hadoop enviornment in the internet search marketing domain. Extremely friendly, fun loving and great work environment. Enjoyed working there. Colleagues have very good working relationship. Yahoo was a great company to work for - we were always having fun but working hard too. The benefits were great and there was always an opportunity for career growth. Unorganized company that is lacking in strategic direction from the C level executives creating a ripple effect throughout the company This is the best job I have ever ha. Everyone had a specific role that they played and training was very efficient. Even though it was a cubicle job, Yahoo made sure that we took enough break and had all the free coffee we wanted to stay alert lol. My manager was always there to answer any questions and was very organized. My tenure at Yahoo! was awesome, it was rewarding and wonderful, coming from Disney it was such a culture clash it took a while to get used to...but once I did it was like buckle up, and enjoy the ride! The best part of the ride was the ability to take advantage of the autonomy and carve out your own niche to help the team. There was always someone who needed my help. The hardest part was obviously prioritizing and the most enjoyable part was also helping people get their work done, knowing that my purpose was to help others and to make their experience at Yahoo! a good one and to make their day run a little smoother. I write articles for others to enjoy. I like how the website is managed and set up. I often write when I have spare time after my other two jobs. I enjoy the quiet room when I write where it's just me. • Responsible for the facilitation of testing software, using automated test kits• Managed the analysis of team progress related to WBS(Work Breakdown Structure) milestones• Provided detailed documentation of failures and processes• Implemented test plans procedures and development I really enjoyed working for Yahoo! All though I was a contract employee who worked a temporary job, I was treated like a FT employee the whole time. I was given real responsibility and access that a FT employee would have. I learned a lot of new skills, as well as new programs and processes.My only concern is the open agreement of needing to hire contract employees onto a FT basis, but a lack of follow through for a number of people. Good company with good co-workers and team. Life work is balanced and people are friendly, working environment is quite good! Yahoo! has resources because they are a big company which makes it much easier to do excellent work. You have the support and the tools to get what you need done.The issue with Yahoo! is management constantly changes therefore all the hard work you have done previous years is lost and there is no room for advancement.The best part about working at Yahoo! was working with other very smart people who had years of experience in the industry however in recent years they hired too many people with little digital experience which is one of the reasons I think they have not been leading in the industry. Yahoo! has good benefits and work/life balance for employees. They let employees go after 5 years loyal service or make life miserable until the employee quits.They badger employees into overtime and overtime can be endless if they are trying to get the employee to quit.They say they are a YOUNG company.Most of Management is SPOILED. Managers are not professional. They talk openly to other employees about employees they don't like and their personal affairs. People without the need to know often know who is getting fired and why.Not much that is learned will help an individual get another job.They are selling out to outsourcing. Jobs are desperately needed here in the United States.They are cold-blooded to employees with medical difficulties if the employee starts missing any time.They allow co-workers to be cruel to other workers. Very Cliquey.Swearing is allowed. There are some very nice people there but yoked there in a bad economy to pay the rent and keep food on the table.If you don't pay heed to any of this and you do go to work there, 'document' everything with a date for your own good and keep it on your person. Good company, I do enjoy the life there.You can learn more or less depending on the team that you are in. A great place to work with a nice culture, facilities and working environment. A very challenging business environment plagued by confusion about the strategy and continuous turnover of executives I enjoyed working at Yahoo ! The teams are nice with excellent culture. Great compensation/benefits, work/life balance. Everyone was very professional and friendly. The best part of the job is when you were able to fix a customer's Yahoo! Mail account. I sat at a desk most of the day, but when we needed to we could take a walk on the path on the grounds. Managers where very involved with the employee's, and would sit at a desk with us. Typical day at work cosist of checking emails and printing invoices that needed to be scanned into Markview for processing. Check fax machince and daily mail for invoices to be scanned into the system for processing. Sort invoices with PO numbers and non-PO numbers.I learned how to process invoices, and print checks for payment run.My managers were/are like my family. My whole Accounts Payable team are like my family. We worked together very well and worked hard as a team to get month end, quarter end, and year end payments done. Although, sometimes our manager was a little unprofessional at times, we all managed to get along.The hardest part of the job was training the company we were being outsourced by. Knowing I was losing my job and also training them was a bit difficult, but I kept it professional and taught them everything I know, and we all got along really well.The fun part about working with Yahoo, was working with my co workers, our lunches, our dinners, we were all really close and being with them and working together was the best part of my job. Also, the special events Yahoo hosted were fun too! Yahoo! is a search giant, and in order to fuel this giant machine, many Yahoo! team members must work in synch to create the harmony necessary to get the job done. This means that in any given office building there can be 800+ team members. This creates a real microcosm of different types and personalities.If you work in engineering you'll get one vibe, if you work with accounts you will get another. But all in all, everyone is positive and enjoys corporate perks. A typical day would be spending most of the day in production, working email cases (and sometimes phone calls). Another big chunk includes technical writing in drafting new content as well as editing existing content in our knowledgebase. Breaks and lunches are flexible as is scheduling in general. Unlimited internet access and no micro-managing. I'm treated as an adult who can get work done without being told what to do every step of the way. On-site coffee bar/cafeteria, combined with game and relaxation rooms make this place an easy one to get away on breaks/lunches. Yahoo is a fantastic place to work for many reasons. The company has a tech culture (read: ping pong tables, coffee bars, open office environment), excellent compensation/benefits packages and a great focus on work/life balance. We struggle with executive leadership and opportunities to advance within the same office/market.The co-workers are all excellent, as is the learning environment.It is challenging to work in a company that has lost some of its edge that is slow to market in an otherwise quick to move industry. I wake up and see what the news is in either the sports or video games world. If I see anything that I can make an article out of, then I take a few hours to write my article. Once the article is published, I put the link on various social networking websites. I am learning how to write relevant, long-lasting, and interesting articles. I am learning this because those types of articles are they only ones available for up-front pay. The most enjoyable part of the job is that I get to write and see my work published on Yahoo!. The hardest part is my promoting my articles in order to try and get paid through performances. Yahoo goes far and beyond to ensure you have a pleasant working environment Yahoo was a great company to work for - we were always having fun but working hard too. The benefits were great and there was always an opportunity for career growth. Nice place to work, you will learn a lot of things about how advertising work in Online Media and how online media will earn from advertising, search and social Media. Work life balance is awesome and have not faced any hardest day in the job. Operate as the lead point of contact for agencies in the Seattle, San Francisco, Los Angeles, and San Diego markets. Web at scale - addressing the needs of 700M plus users world wide They actually did have a ping pong table. Fun environment however, my supervisor was a hipocrit and a micro-manager I enjoyed everyday working at Yahoo!! Fun place to work at. Full of smart people and love to inovate I enjoyed working for Yahoo from 2007 to 2011. I worked with an excellent group of sales people as well as driven motivational management team. The only reason I left was to find a more creative challenging position in Web Design Sales. Interesting culture, lots of technology, but slow to identify with and respond to the evolving needs and interests of consumers due to lack of innovative leadership and corporate bureaucracy. Effective and productive enviornment for the decommisioning of the Yahoo Data Center This division of Yahoo! has since been purchased by Monster.com. During my tenure, each colleague was brighter than the next. Pure meritocracy. Creativity and innovation were encouraged and expected. Unfortunately there were some bumps in the road, and Yahoo! saw fit to narrow their focus. I joined in 2005 and it had a great energy - but over time it faded, and with each re-org most teams lost interest (and they're best people). Still a recognized name, but doesn't carry the weight it used to carry in Silicon Valley I consider myself very lucky to be working on a really cool project at Yahoo. The people are very smart and work 'smart' rather than hard, which is the right way to do it. Projects are managed well, using the Agile model with reasonable work load for each sprint. The technology is top notch and the work is very interesting. Yahoo was a great company to work for - we were always having fun but working hard too. The benefits were great and there was always an opportunity for career growth. A typical day at Yahoo! would be to address client email inquiries, schedule or attend client calls &  research growth opportunities. Management was constantly changing due to our changes in CEOs over the years but the managers I worked under were mentors and peers. The hardest part of the job was the ratio of clients/agencies per person. We were given large books of business with promises of getting additional headcount that took months before there was reprieve. The most enjoyable things at Yahoo! were your colleagues and the positive company culture. Yahoo is a great place to work. The work environment was respectful and positive. I learned a lot during my time there and felt like the work we did there was important and made an impact. Interesting work, dynamic environment. Only downside was they they didn't put any effort into training management, therefore there was no leadership consistency Great culture with plenty of opportunity for advancement. High stressful sales environment. Excellent benefits. Would recommend employment to friends and family. I learned a lot about how the professionals work, and how to manage customers, also manage filing and data entry. However, I dont feel like there is a lot more to learn in the company. Very transparent company with room to grow and lots of great learning experiences. The typical day involves sitting in front of a computer and going to meetings, the collaboration cross-site is unlike anything I've ever experienced.I worked on projects such as product support launches (UK daily fantasy sports), fixing system issues and collaborated globally on Yahoo Mail improvements and new features. The Yahoo brands are a little more focused now over a year into life as part of the Oath family. People are driven, the culture is very positive and progressive, and I think they're really poised to do great things. I have and will continue to recommend it as an amazing place to work. Performers are rewarded, and promotion often comes from within. The scale and reach of the brands remain impressive, there are truly few like it. Many people forget that. Sometimes the size of the company made it hard to affect real change and things could move really slowly, but current leadership is committed to changing that part of the equation. Yahoo is a great tech company to work for because it doesn't take itself too seriously. It likely depends on what manager you have but I was lucky enough to get the best manager there was who truly cared about me, my career, and what I was interested in. Enjoyable place to work, lots of changes with the new executive staff.  They were very focused on being sure that everyone understood the goals of the company. This company has now operates under Verizon as OATH.Yahoo was a great company, very laid back, remote ability and flexibility. Love Love this place.Give OATH a try. talks a lot about their transformation and helping employees be their best. I'm pleased to see that they are really making an effort. From their focus on work/life balance and compensation, to their brand new workspaces - i couldn't be happier working here. I liked working at Yahoo, but clearly it's in advanced decline. Not much else to say, despite the 150-character minimum. Good people for the most part. Happy that our business unit Yahoo SmallBusiness works just like my previous startup. At times, I am the architect, designing new component functionalities , or I'd find myself deciding on front-end scheme, or be designing backend APIs . Be it designing interfaces or interfacing with customers , screening  candidates, or defining product roadmaps, there is always a sense of freedom to call the shots and do more, that is what I like about my work here. Answered calls from customers w/ merchant accounts, sometimes from those expecting advanced coding assistance, set up new accounts, processing billing info The culture and the people at Yahoo drove the success of the workforce. Being a part of the customer care team was the best part of the job. Connecting with users daily and helping to resolve their issues was always our focus. Yahoo was a wonderful place to work full of people who bled purple (as they liked to say).  Sadly the culture was dramatically impacted when Verizon took over and merged Yahoo and AOL into Oath. Amazing work culture! Had a great team. People are helpful. No company politics. Things are transparent. Learn new technologies, great managers in the site. Yahoo is at the forefront of lot of technologies especially related to big data and online and mobile advertising systems. fantastic engineering army. I learnt a lot over the 7 years I spent at Yahoo.Great people, projects, intern mobility. So many projects for a designer to work on, from mobile to desktop Review tickets in job queue and prioritize as necessary.As a desktop support technician I learned using Web based applications for internal business. I never saw much management in my area.Great workplace culture.The hardest part of the job was learning all the web based systems and all the plugins needed to make them work.The most enjoyable was good people,  a fun place to work and still be productive. Yahoo was a great company to work for - we were always having fun but working hard too. The benefits were great and there was always an opportunity for career growth. A typical day at Yahoo! would be to address client email inquiries, schedule or attend client calls &  research growth opportunities. Management was constantly changing due to our changes in CEOs over the years but the managers I worked under were mentors and peers. The hardest part of the job was the ratio of clients/agencies per person. We were given large books of business with promises of getting additional headcount that took months before there was reprieve. The most enjoyable things at Yahoo! were your colleagues and the positive company culture. Yahoo is a great place to work. The work environment was respectful and positive. I learned a lot during my time there and felt like the work we did there was important and made an impact. Interesting work, dynamic environment. Only downside was they they didn't put any effort into training management, therefore there was no leadership consistency Great culture with plenty of opportunity for advancement. High stressful sales environment. Excellent benefits. Would recommend employment to friends and family. I learned a lot about how the professionals work, and how to manage customers, also manage filing and data entry. However, I dont feel like there is a lot more to learn in the company. Very transparent company with room to grow and lots of great learning experiences. The typical day involves sitting in front of a computer and going to meetings, the collaboration cross-site is unlike anything I've ever experienced.I worked on projects such as product support launches (UK daily fantasy sports), fixing system issues and collaborated globally on Yahoo Mail improvements and new features. The Yahoo brands are a little more focused now over a year into life as part of the Oath family. People are driven, the culture is very positive and progressive, and I think they're really poised to do great things. I have and will continue to recommend it as an amazing place to work. Performers are rewarded, and promotion often comes from within. The scale and reach of the brands remain impressive, there are truly few like it. Many people forget that. Sometimes the size of the company made it hard to affect real change and things could move really slowly, but current leadership is committed to changing that part of the equation. Yahoo is a great tech company to work for because it doesn't take itself too seriously. It likely depends on what manager you have but I was lucky enough to get the best manager there was who truly cared about me, my career, and what I was interested in. Enjoyable place to work, lots of changes with the new executive staff.  They were very focused on being sure that everyone understood the goals of the company. This company has now operates under Verizon as OATH.Yahoo was a great company, very laid back, remote ability and flexibility. Love Love this place.Give OATH a try. talks a lot about their transformation and helping employees be their best. I'm pleased to see that they are really making an effort. From their focus on work/life balance and compensation, to their brand new workspaces - i couldn't be happier working here. I liked working at Yahoo, but clearly it's in advanced decline. Not much else to say, despite the 150-character minimum. Good people for the most part. Happy that our business unit Yahoo SmallBusiness works just like my previous startup. At times, I am the architect, designing new component functionalities , or I'd find myself deciding on front-end scheme, or be designing backend APIs . Be it designing interfaces or interfacing with customers , screening  candidates, or defining product roadmaps, there is always a sense of freedom to call the shots and do more, that is what I like about my work here. Answered calls from customers w/ merchant accounts, sometimes from those expecting advanced coding assistance, set up new accounts, processing billing info The culture and the people at Yahoo drove the success of the workforce. Being a part of the customer care team was the best part of the job. Connecting with users daily and helping to resolve their issues was always our focus. Yahoo was a wonderful place to work full of people who bled purple (as they liked to say).  Sadly the culture was dramatically impacted when Verizon took over and merged Yahoo and AOL into Oath. Amazing work culture! Had a great team. People are helpful. No company politics. Things are transparent. Learn new technologies, great managers in the site. Yahoo is at the forefront of lot of technologies especially related to big data and online and mobile advertising systems. fantastic engineering army. I learnt a lot over the 7 years I spent at Yahoo.Great people, projects, intern mobility. So many projects for a designer to work on, from mobile to desktop Review tickets in job queue and prioritize as necessary.As a desktop support technician I learned using Web based applications for internal business. I never saw much management in my area.Great workplace culture.The hardest part of the job was learning all the web based systems and all the plugins needed to make them work.The most enjoyable was good people,  a fun place to work and still be productive. Yahoo was a great company to work for - we were always having fun but working hard too. The benefits were great and there was always an opportunity for career growth. A typical day at Yahoo! would be to address client email inquiries, schedule or attend client calls &  research growth opportunities. Management was constantly changing due to our changes in CEOs over the years but the managers I worked under were mentors and peers. The hardest part of the job was the ratio of clients/agencies per person. We were given large books of business with promises of getting additional headcount that took months before there was reprieve. The most enjoyable things at Yahoo! were your colleagues and the positive company culture. Yahoo is a great place to work. The work environment was respectful and positive. I learned a lot during my time there and felt like the work we did there was important and made an impact. Interesting work, dynamic environment. Only downside was they they didn't put any effort into training management, therefore there was no leadership consistency Great culture with plenty of opportunity for advancement. High stressful sales environment. Excellent benefits. Would recommend employment to friends and family. I learned a lot about how the professionals work, and how to manage customers, also manage filing and data entry. However, I dont feel like there is a lot more to learn in the company. Very transparent company with room to grow and lots of great learning experiences. The typical day involves sitting in front of a computer and going to meetings, the collaboration cross-site is unlike anything I've ever experienced.I worked on projects such as product support launches (UK daily fantasy sports), fixing system issues and collaborated globally on Yahoo Mail improvements and new features. The Yahoo brands are a little more focused now over a year into life as part of the Oath family. People are driven, the culture is very positive and progressive, and I think they're really poised to do great things. I have and will continue to recommend it as an amazing place to work. Performers are rewarded, and promotion often comes from within. The scale and reach of the brands remain impressive, there are truly few like it. Many people forget that. Sometimes the size of the company made it hard to affect real change and things could move really slowly, but current leadership is committed to changing that part of the equation. Yahoo is a great tech company to work for because it doesn't take itself too seriously. It likely depends on what manager you have but I was lucky enough to get the best manager there was who truly cared about me, my career, and what I was interested in. Enjoyable place to work, lots of changes with the new executive staff.  They were very focused on being sure that everyone understood the goals of the company. This company has now operates under Verizon as OATH.Yahoo was a great company, very laid back, remote ability and flexibility. Love Love this place.Give OATH a try. talks a lot about their transformation and helping employees be their best. I'm pleased to see that they are really making an effort. From their focus on work/life balance and compensation, to their brand new workspaces - i couldn't be happier working here. I liked working at Yahoo, but clearly it's in advanced decline. Not much else to say, despite the 150-character minimum. Good people for the most part. Happy that our business unit Yahoo SmallBusiness works just like my previous startup. At times, I am the architect, designing new component functionalities , or I'd find myself deciding on front-end scheme, or be designing backend APIs . Be it designing interfaces or interfacing with customers , screening  candidates, or defining product roadmaps, there is always a sense of freedom to call the shots and do more, that is what I like about my work here. Answered calls from customers w/ merchant accounts, sometimes from those expecting advanced coding assistance, set up new accounts, processing billing info The culture and the people at Yahoo drove the success of the workforce. Being a part of the customer care team was the best part of the job. Connecting with users daily and helping to resolve their issues was always our focus. Yahoo was a wonderful place to work full of people who bled purple (as they liked to say).  Sadly the culture was dramatically impacted when Verizon took over and merged Yahoo and AOL into Oath. Amazing work culture! Had a great team. People are helpful. No company politics. Things are transparent. Learn new technologies, great managers in the site. Yahoo is at the forefront of lot of technologies especially related to big data and online and mobile advertising systems. fantastic engineering army. I learnt a lot over the 7 years I spent at Yahoo.Great people, projects, intern mobility. So many projects for a designer to work on, from mobile to desktop Review tickets in job queue and prioritize as necessary.As a desktop support technician I learned using Web based applications for internal business. I never saw much management in my area.Great workplace culture.The hardest part of the job was learning all the web based systems and all the plugins needed to make them work.The most enjoyable was good people,  a fun place to work and still be productive. Yahoo was a great company to work for - we were always having fun but working hard too. The benefits were great and there was always an opportunity for career growth. A typical day at Yahoo! would be to address client email inquiries, schedule or attend client calls &  research growth opportunities. Management was constantly changing due to our changes in CEOs over the years but the managers I worked under were mentors and peers. The hardest part of the job was the ratio of clients/agencies per person. We were given large books of business with promises of getting additional headcount that took months before there was reprieve. The most enjoyable things at Yahoo! were your colleagues and the positive company culture. Yahoo is a great place to work. The work environment was respectful and positive. I learned a lot during my time there and felt like the work we did there was important and made an impact. Interesting work, dynamic environment. Only downside was they they didn't put any effort into training management, therefore there was no leadership consistency Great culture with plenty of opportunity for advancement. High stressful sales environment. Excellent benefits. Would recommend employment to friends and family. I learned a lot about how the professionals work, and how to manage customers, also manage filing and data entry. However, I dont feel like there is a lot more to learn in the company. Very transparent company with room to grow and lots of great learning experiences. The typical day involves sitting in front of a computer and going to meetings, the collaboration cross-site is unlike anything I've ever experienced.I worked on projects such as product support launches (UK daily fantasy sports), fixing system issues and collaborated globally on Yahoo Mail improvements and new features. The Yahoo brands are a little more focused now over a year into life as part of the Oath family. People are driven, the culture is very positive and progressive, and I think they're really poised to do great things. I have and will continue to recommend it as an amazing place to work. Performers are rewarded, and promotion often comes from within. The scale and reach of the brands remain impressive, there are truly few like it. Many people forget that. Sometimes the size of the company made it hard to affect real change and things could move really slowly, but current leadership is committed to changing that part of the equation. Yahoo is a great tech company to work for because it doesn't take itself too seriously. It likely depends on what manager you have but I was lucky enough to get the best manager there was who truly cared about me, my career, and what I was interested in. Enjoyable place to work, lots of changes with the new executive staff.  They were very focused on being sure that everyone understood the goals of the company. This company has now operates under Verizon as OATH.Yahoo was a great company, very laid back, remote ability and flexibility. Love Love this place.Give OATH a try. talks a lot about their transformation and helping employees be their best. I'm pleased to see that they are really making an effort. From their focus on work/life balance and compensation, to their brand new workspaces - i couldn't be happier working here. I liked working at Yahoo, but clearly it's in advanced decline. Not much else to say, despite the 150-character minimum. Good people for the most part. Happy that our business unit Yahoo SmallBusiness works just like my previous startup. At times, I am the architect, designing new component functionalities , or I'd find myself deciding on front-end scheme, or be designing backend APIs . Be it designing interfaces or interfacing with customers , screening  candidates, or defining product roadmaps, there is always a sense of freedom to call the shots and do more, that is what I like about my work here. Answered calls from customers w/ merchant accounts, sometimes from those expecting advanced coding assistance, set up new accounts, processing billing info The culture and the people at Yahoo drove the success of the workforce. Being a part of the customer care team was the best part of the job. Connecting with users daily and helping to resolve their issues was always our focus. Yahoo was a wonderful place to work full of people who bled purple (as they liked to say).  Sadly the culture was dramatically impacted when Verizon took over and merged Yahoo and AOL into Oath. Amazing work culture! Had a great team. People are helpful. No company politics. Things are transparent. Learn new technologies, great managers in the site. Yahoo is at the forefront of lot of technologies especially related to big data and online and mobile advertising systems. fantastic engineering army. I learnt a lot over the 7 years I spent at Yahoo.Great people, projects, intern mobility. So many projects for a designer to work on, from mobile to desktop Review tickets in job queue and prioritize as necessary.As a desktop support technician I learned using Web based applications for internal business. I never saw much management in my area.Great workplace culture.The hardest part of the job was learning all the web based systems and all the plugins needed to make them work.The most enjoyable was good people,  a fun place to work and still be productive. Yahoo was a great company to work for - we were always having fun but working hard too. The benefits were great and there was always an opportunity for career growth. A typical day at Yahoo! would be to address client email inquiries, schedule or attend client calls &  research growth opportunities. Management was constantly changing due to our changes in CEOs over the years but the managers I worked under were mentors and peers. The hardest part of the job was the ratio of clients/agencies per person. We were given large books of business with promises of getting additional headcount that took months before there was reprieve. The most enjoyable things at Yahoo! were your colleagues and the positive company culture. Yahoo is a great place to work. The work environment was respectful and positive. I learned a lot during my time there and felt like the work we did there was important and made an impact. Interesting work, dynamic environment. Only downside was they they didn't put any effort into training management, therefore there was no leadership consistency Great culture with plenty of opportunity for advancement. High stressful sales environment. Excellent benefits. Would recommend employment to friends and family. I learned a lot about how the professionals work, and how to manage customers, also manage filing and data entry. However, I dont feel like there is a lot more to learn in the company. Very transparent company with room to grow and lots of great learning experiences. The typical day involves sitting in front of a computer and going to meetings, the collaboration cross-site is unlike anything I've ever experienced.I worked on projects such as product support launches (UK daily fantasy sports), fixing system issues and collaborated globally on Yahoo Mail improvements and new features. The Yahoo brands are a little more focused now over a year into life as part of the Oath family. People are driven, the culture is very positive and progressive, and I think they're really poised to do great things. I have and will continue to recommend it as an amazing place to work. Performers are rewarded, and promotion often comes from within. The scale and reach of the brands remain impressive, there are truly few like it. Many people forget that. Sometimes the size of the company made it hard to affect real change and things could move really slowly, but current leadership is committed to changing that part of the equation. Yahoo is a great tech company to work for because it doesn't take itself too seriously. It likely depends on what manager you have but I was lucky enough to get the best manager there was who truly cared about me, my career, and what I was interested in. Enjoyable place to work, lots of changes with the new executive staff.  They were very focused on being sure that everyone understood the goals of the company. This company has now operates under Verizon as OATH.Yahoo was a great company, very laid back, remote ability and flexibility. Love Love this place.Give OATH a try. talks a lot about their transformation and helping employees be their best. I'm pleased to see that they are really making an effort. From their focus on work/life balance and compensation, to their brand new workspaces - i couldn't be happier working here. I liked working at Yahoo, but clearly it's in advanced decline. Not much else to say, despite the 150-character minimum. Good people for the most part. Happy that our business unit Yahoo SmallBusiness works just like my previous startup. At times, I am the architect, designing new component functionalities , or I'd find myself deciding on front-end scheme, or be designing backend APIs . Be it designing interfaces or interfacing with customers , screening  candidates, or defining product roadmaps, there is always a sense of freedom to call the shots and do more, that is what I like about my work here. Answered calls from customers w/ merchant accounts, sometimes from those expecting advanced coding assistance, set up new accounts, processing billing info The culture and the people at Yahoo drove the success of the workforce. Being a part of the customer care team was the best part of the job. Connecting with users daily and helping to resolve their issues was always our focus. Yahoo was a wonderful place to work full of people who bled purple (as they liked to say).  Sadly the culture was dramatically impacted when Verizon took over and merged Yahoo and AOL into Oath. Amazing work culture! Had a great team. People are helpful. No company politics. Things are transparent. Learn new technologies, great managers in the site. Yahoo is at the forefront of lot of technologies especially related to big data and online and mobile advertising systems. fantastic engineering army. I learnt a lot over the 7 years I spent at Yahoo.Great people, projects, intern mobility. So many projects for a designer to work on, from mobile to desktop Review tickets in job queue and prioritize as necessary.As a desktop support technician I learned using Web based applications for internal business. I never saw much management in my area.Great workplace culture.The hardest part of the job was learning all the web based systems and all the plugins needed to make them work.The most enjoyable was good people,  a fun place to work and still be productive. Yahoo was a great company to work for - we were always having fun but working hard too. The benefits were great and there was always an opportunity for career growth. A typical day at Yahoo! would be to address client email inquiries, schedule or attend client calls &  research growth opportunities. Management was constantly changing due to our changes in CEOs over the years but the managers I worked under were mentors and peers. The hardest part of the job was the ratio of clients/agencies per person. We were given large books of business with promises of getting additional headcount that took months before there was reprieve. The most enjoyable things at Yahoo! were your colleagues and the positive company culture. Yahoo is a great place to work. The work environment was respectful and positive. I learned a lot during my time there and felt like the work we did there was important and made an impact. Interesting work, dynamic environment. Only downside was they they didn't put any effort into training management, therefore there was no leadership consistency Great culture with plenty of opportunity for advancement. High stressful sales environment. Excellent benefits. Would recommend employment to friends and family. I learned a lot about how the professionals work, and how to manage customers, also manage filing and data entry. However, I dont feel like there is a lot more to learn in the company. Very transparent company with room to grow and lots of great learning experiences. The typical day involves sitting in front of a computer and going to meetings, the collaboration cross-site is unlike anything I've ever experienced.I worked on projects such as product support launches (UK daily fantasy sports), fixing system issues and collaborated globally on Yahoo Mail improvements and new features. The Yahoo brands are a little more focused now over a year into life as part of the Oath family. People are driven, the culture is very positive and progressive, and I think they're really poised to do great things. I have and will continue to recommend it as an amazing place to work. Performers are rewarded, and promotion often comes from within. The scale and reach of the brands remain impressive, there are truly few like it. Many people forget that. Sometimes the size of the company made it hard to affect real change and things could move really slowly, but current leadership is committed to changing that part of the equation. Yahoo is a great tech company to work for because it doesn't take itself too seriously. It likely depends on what manager you have but I was lucky enough to get the best manager there was who truly cared about me, my career, and what I was interested in. Enjoyable place to work, lots of changes with the new executive staff.  They were very focused on being sure that everyone understood the goals of the company. This company has now operates under Verizon as OATH.Yahoo was a great company, very laid back, remote ability and flexibility. Love Love this place.Give OATH a try. talks a lot about their transformation and helping employees be their best. I'm pleased to see that they are really making an effort. From their focus on work/life balance and compensation, to their brand new workspaces - i couldn't be happier working here. I liked working at Yahoo, but clearly it's in advanced decline. Not much else to say, despite the 150-character minimum. Good people for the most part. Happy that our business unit Yahoo SmallBusiness works just like my previous startup. At times, I am the architect, designing new component functionalities , or I'd find myself deciding on front-end scheme, or be designing backend APIs . Be it designing interfaces or interfacing with customers , screening  candidates, or defining product roadmaps, there is always a sense of freedom to call the shots and do more, that is what I like about my work here. Answered calls from customers w/ merchant accounts, sometimes from those expecting advanced coding assistance, set up new accounts, processing billing info The culture and the people at Yahoo drove the success of the workforce. Being a part of the customer care team was the best part of the job. Connecting with users daily and helping to resolve their issues was always our focus. Yahoo was a wonderful place to work full of people who bled purple (as they liked to say).  Sadly the culture was dramatically impacted when Verizon took over and merged Yahoo and AOL into Oath. Amazing work culture! Had a great team. People are helpful. No company politics. Things are transparent. Learn new technologies, great managers in the site. Yahoo is at the forefront of lot of technologies especially related to big data and online and mobile advertising systems. fantastic engineering army. I learnt a lot over the 7 years I spent at Yahoo.Great people, projects, intern mobility. So many projects for a designer to work on, from mobile to desktop Review tickets in job queue and prioritize as necessary.As a desktop support technician I learned using Web based applications for internal business. I never saw much management in my area.Great workplace culture.The hardest part of the job was learning all the web based systems and all the plugins needed to make them work.The most enjoyable was good people,  a fun place to work and still be productive. Yahoo was a great company to work for - we were always having fun but working hard too. The benefits were great and there was always an opportunity for career growth. A typical day at Yahoo! would be to address client email inquiries, schedule or attend client calls &  research growth opportunities. Management was constantly changing due to our changes in CEOs over the years but the managers I worked under were mentors and peers. The hardest part of the job was the ratio of clients/agencies per person. We were given large books of business with promises of getting additional headcount that took months before there was reprieve. The most enjoyable things at Yahoo! were your colleagues and the positive company culture. Yahoo is a great place to work. The work environment was respectful and positive. I learned a lot during my time there and felt like the work we did there was important and made an impact. Interesting work, dynamic environment. Only downside was they they didn't put any effort into training management, therefore there was no leadership consistency Great culture with plenty of opportunity for advancement. High stressful sales environment. Excellent benefits. Would recommend employment to friends and family. I learned a lot about how the professionals work, and how to manage customers, also manage filing and data entry. However, I dont feel like there is a lot more to learn in the company. Very transparent company with room to grow and lots of great learning experiences. The typical day involves sitting in front of a computer and going to meetings, the collaboration cross-site is unlike anything I've ever experienced.I worked on projects such as product support launches (UK daily fantasy sports), fixing system issues and collaborated globally on Yahoo Mail improvements and new features. The Yahoo brands are a little more focused now over a year into life as part of the Oath family. People are driven, the culture is very positive and progressive, and I think they're really poised to do great things. I have and will continue to recommend it as an amazing place to work. Performers are rewarded, and promotion often comes from within. The scale and reach of the brands remain impressive, there are truly few like it. Many people forget that. Sometimes the size of the company made it hard to affect real change and things could move really slowly, but current leadership is committed to changing that part of the equation. Yahoo is a great tech company to work for because it doesn't take itself too seriously. It likely depends on what manager you have but I was lucky enough to get the best manager there was who truly cared about me, my career, and what I was interested in. Enjoyable place to work, lots of changes with the new executive staff.  They were very focused on being sure that everyone understood the goals of the company. This company has now operates under Verizon as OATH.Yahoo was a great company, very laid back, remote ability and flexibility. Love Love this place.Give OATH a try. talks a lot about their transformation and helping employees be their best. I'm pleased to see that they are really making an effort. From their focus on work/life balance and compensation, to their brand new workspaces - i couldn't be happier working here. I liked working at Yahoo, but clearly it's in advanced decline. Not much else to say, despite the 150-character minimum. Good people for the most part. Happy that our business unit Yahoo SmallBusiness works just like my previous startup. At times, I am the architect, designing new component functionalities , or I'd find myself deciding on front-end scheme, or be designing backend APIs . Be it designing interfaces or interfacing with customers , screening  candidates, or defining product roadmaps, there is always a sense of freedom to call the shots and do more, that is what I like about my work here. Answered calls from customers w/ merchant accounts, sometimes from those expecting advanced coding assistance, set up new accounts, processing billing info The culture and the people at Yahoo drove the success of the workforce. Being a part of the customer care team was the best part of the job. Connecting with users daily and helping to resolve their issues was always our focus. Yahoo was a wonderful place to work full of people who bled purple (as they liked to say).  Sadly the culture was dramatically impacted when Verizon took over and merged Yahoo and AOL into Oath. Amazing work culture! Had a great team. People are helpful. No company politics. Things are transparent. Learn new technologies, great managers in the site. Yahoo is at the forefront of lot of technologies especially related to big data and online and mobile advertising systems. fantastic engineering army. I learnt a lot over the 7 years I spent at Yahoo.Great people, projects, intern mobility. So many projects for a designer to work on, from mobile to desktop Review tickets in job queue and prioritize as necessary.As a desktop support technician I learned using Web based applications for internal business. I never saw much management in my area.Great workplace culture.The hardest part of the job was learning all the web based systems and all the plugins needed to make them work.The most enjoyable was good people,  a fun place to work and still be productive. Yahoo was a great company to work for - we were always having fun but working hard too. The benefits were great and there was always an opportunity for career growth. A typical day at Yahoo! would be to address client email inquiries, schedule or attend client calls &  research growth opportunities. Management was constantly changing due to our changes in CEOs over the years but the managers I worked under were mentors and peers. The hardest part of the job was the ratio of clients/agencies per person. We were given large books of business with promises of getting additional headcount that took months before there was reprieve. The most enjoyable things at Yahoo! were your colleagues and the positive company culture. Yahoo is a great place to work. The work environment was respectful and positive. I learned a lot during my time there and felt like the work we did there was important and made an impact. Interesting work, dynamic environment. Only downside was they they didn't put any effort into training management, therefore there was no leadership consistency Great culture with plenty of opportunity for advancement. High stressful sales environment. Excellent benefits. Would recommend employment to friends and family. I learned a lot about how the professionals work, and how to manage customers, also manage filing and data entry. However, I dont feel like there is a lot more to learn in the company. Very transparent company with room to grow and lots of great learning experiences. The typical day involves sitting in front of a computer and going to meetings, the collaboration cross-site is unlike anything I've ever experienced.I worked on projects such as product support launches (UK daily fantasy sports), fixing system issues and collaborated globally on Yahoo Mail improvements and new features. The Yahoo brands are a little more focused now over a year into life as part of the Oath family. People are driven, the culture is very positive and progressive, and I think they're really poised to do great things. I have and will continue to recommend it as an amazing place to work. Performers are rewarded, and promotion often comes from within. The scale and reach of the brands remain impressive, there are truly few like it. Many people forget that. Sometimes the size of the company made it hard to affect real change and things could move really slowly, but current leadership is committed to changing that part of the equation. Yahoo is a great tech company to work for because it doesn't take itself too seriously. It likely depends on what manager you have but I was lucky enough to get the best manager there was who truly cared about me, my career, and what I was interested in. Enjoyable place to work, lots of changes with the new executive staff.  They were very focused on being sure that everyone understood the goals of the company. This company has now operates under Verizon as OATH.Yahoo was a great company, very laid back, remote ability and flexibility. Love Love this place.Give OATH a try. talks a lot about their transformation and helping employees be their best. I'm pleased to see that they are really making an effort. From their focus on work/life balance and compensation, to their brand new workspaces - i couldn't be happier working here. I liked working at Yahoo, but clearly it's in advanced decline. Not much else to say, despite the 150-character minimum. Good people for the most part. Happy that our business unit Yahoo SmallBusiness works just like my previous startup. At times, I am the architect, designing new component functionalities , or I'd find myself deciding on front-end scheme, or be designing backend APIs . Be it designing interfaces or interfacing with customers , screening  candidates, or defining product roadmaps, there is always a sense of freedom to call the shots and do more, that is what I like about my work here. Answered calls from customers w/ merchant accounts, sometimes from those expecting advanced coding assistance, set up new accounts, processing billing info The culture and the people at Yahoo drove the success of the workforce. Being a part of the customer care team was the best part of the job. Connecting with users daily and helping to resolve their issues was always our focus. Yahoo was a wonderful place to work full of people who bled purple (as they liked to say).  Sadly the culture was dramatically impacted when Verizon took over and merged Yahoo and AOL into Oath. Amazing work culture! Had a great team. People are helpful. No company politics. Things are transparent. Learn new technologies, great managers in the site. Yahoo is at the forefront of lot of technologies especially related to big data and online and mobile advertising systems. fantastic engineering army. I learnt a lot over the 7 years I spent at Yahoo.Great people, projects, intern mobility. So many projects for a designer to work on, from mobile to desktop Review tickets in job queue and prioritize as necessary.As a desktop support technician I learned using Web based applications for internal business. I never saw much management in my area.Great workplace culture.The hardest part of the job was learning all the web based systems and all the plugins needed to make them work.The most enjoyable was good people,  a fun place to work and still be productive. Yahoo was a great company to work for - we were always having fun but working hard too. The benefits were great and there was always an opportunity for career growth. A typical day at Yahoo! would be to address client email inquiries, schedule or attend client calls &  research growth opportunities. Management was constantly changing due to our changes in CEOs over the years but the managers I worked under were mentors and peers. The hardest part of the job was the ratio of clients/agencies per person. We were given large books of business with promises of getting additional headcount that took months before there was reprieve. The most enjoyable things at Yahoo! were your colleagues and the positive company culture. Yahoo is a great place to work. The work environment was respectful and positive. I learned a lot during my time there and felt like the work we did there was important and made an impact. Interesting work, dynamic environment. Only downside was they they didn't put any effort into training management, therefore there was no leadership consistency Great culture with plenty of opportunity for advancement. High stressful sales environment. Excellent benefits. Would recommend employment to friends and family. I learned a lot about how the professionals work, and how to manage customers, also manage filing and data entry. However, I dont feel like there is a lot more to learn in the company. Very transparent company with room to grow and lots of great learning experiences. The typical day involves sitting in front of a computer and going to meetings, the collaboration cross-site is unlike anything I've ever experienced.I worked on projects such as product support launches (UK daily fantasy sports), fixing system issues and collaborated globally on Yahoo Mail improvements and new features. The Yahoo brands are a little more focused now over a year into life as part of the Oath family. People are driven, the culture is very positive and progressive, and I think they're really poised to do great things. I have and will continue to recommend it as an amazing place to work. Performers are rewarded, and promotion often comes from within. The scale and reach of the brands remain impressive, there are truly few like it. Many people forget that. Sometimes the size of the company made it hard to affect real change and things could move really slowly, but current leadership is committed to changing that part of the equation. Yahoo is a great tech company to work for because it doesn't take itself too seriously. It likely depends on what manager you have but I was lucky enough to get the best manager there was who truly cared about me, my career, and what I was interested in. Enjoyable place to work, lots of changes with the new executive staff.  They were very focused on being sure that everyone understood the goals of the company. This company has now operates under Verizon as OATH.Yahoo was a great company, very laid back, remote ability and flexibility. Love Love this place.Give OATH a try. talks a lot about their transformation and helping employees be their best. I'm pleased to see that they are really making an effort. From their focus on work/life balance and compensation, to their brand new workspaces - i couldn't be happier working here. I liked working at Yahoo, but clearly it's in advanced decline. Not much else to say, despite the 150-character minimum. Good people for the most part. Happy that our business unit Yahoo SmallBusiness works just like my previous startup. At times, I am the architect, designing new component functionalities , or I'd find myself deciding on front-end scheme, or be designing backend APIs . Be it designing interfaces or interfacing with customers , screening  candidates, or defining product roadmaps, there is always a sense of freedom to call the shots and do more, that is what I like about my work here. Answered calls from customers w/ merchant accounts, sometimes from those expecting advanced coding assistance, set up new accounts, processing billing info The culture and the people at Yahoo drove the success of the workforce. Being a part of the customer care team was the best part of the job. Connecting with users daily and helping to resolve their issues was always our focus. Yahoo was a wonderful place to work full of people who bled purple (as they liked to say).  Sadly the culture was dramatically impacted when Verizon took over and merged Yahoo and AOL into Oath. Amazing work culture! Had a great team. People are helpful. No company politics. Things are transparent. Learn new technologies, great managers in the site. Yahoo is at the forefront of lot of technologies especially related to big data and online and mobile advertising systems. fantastic engineering army. I learnt a lot over the 7 years I spent at Yahoo.Great people, projects, intern mobility. So many projects for a designer to work on, from mobile to desktop Review tickets in job queue and prioritize as necessary.As a desktop support technician I learned using Web based applications for internal business. I never saw much management in my area.Great workplace culture.The hardest part of the job was learning all the web based systems and all the plugins needed to make them work.The most enjoyable was good people,  a fun place to work and still be productive. "
                },
"encodingType":"UTF8"
}
